{
    "post_title": "[Megathread] Construction in Rome prior to the Jubilee",
    "post_author": "RomeVacationTips",
    "post_score": 37,
    "post_url": "https://www.reddit.com/r/rome/comments/1gllkz7/megathread_construction_in_rome_prior_to_the/",
    "comments": [
        {
            "author": "Odd-Internet-7372",
            "body": "Great post! I'll arrive Rome on December 18th and these webcams will help me with the anxiety I'm feeling about the construction",
            "score": 7,
            "created_utc": 1730977316.0
        },
        {
            "author": "thesofakillers",
            "body": "For timelines, you can check https://www.romasitrasforma.it/ which shows _all_ the ongoing worksites in the city",
            "score": 5,
            "created_utc": 1730988173.0
        },
        {
            "author": "dawtcalm",
            "body": "The arch of Constantine viewed from the colosseum still looks good though, currently the scaffolding is covering  the south side",
            "score": 4,
            "created_utc": 1730985618.0
        },
        {
            "author": "LeechSeed222",
            "body": "Do we know around when this work will be finished? I booked a trip in Early December before knowing that this was going on and am considering rescheduling",
            "score": 3,
            "created_utc": 1730979281.0
        },
        {
            "author": "Schumack1",
            "body": "Do you know timeliness to complete ? For folks coming in feb/march 2025 - should all be done by then? Great Post.",
            "score": 3,
            "created_utc": 1730980237.0
        },
        {
            "author": "lzcaIIi",
            "body": "Aggiungerei alla lista San Luigi dei Francesi, settimana scorsa ci sono stato ma le parti laterali sono completamente chiuse da impalcature in legno, quindi i dipinti del Caravaggio sono visibili solo in riproduzioni fotografiche (grandi, per carità, ma sempre foto sono)",
            "score": 2,
            "created_utc": 1730980539.0
        },
        {
            "author": "Magdalena_Regina",
            "body": "All Caravaggios works in San Luigi dei Francesi are covered up and Santa Maria della Maddalena is closed. All statues on Ponte S. Angelo from Berninis sculpture programme are covered too. ",
            "score": 2,
            "created_utc": 1731055366.0
        },
        {
            "author": "thaiusmle",
            "body": "Looks like Trevi Fountain walk way is opened now. Any information on need for reservation? Will be in Rome in 2 weeks, can't wait.\n\n[Trevi Fountain Walkway](https://www.euronews.com/2024/11/09/walkway-opened-in-rome-to-keep-tourists-away-from-trevi-fountain)",
            "score": 2,
            "created_utc": 1731175483.0
        },
        {
            "author": "GlcNAcMurNAc",
            "body": "Also covered is the Bernini altar of the chair in the back of St. Peter’s and the Pieta of Michelangelo.",
            "score": 1,
            "created_utc": 1730993683.0
        },
        {
            "author": "Royal_Garage9666",
            "body": "Thanks! Can someone please provide me with a few nice sights that are not under construction? :) ",
            "score": 1,
            "created_utc": 1731014067.0
        },
        {
            "author": "AtlanticPortal",
            "body": "OP 3 and 4 are not totally correct. The works in front of the Coliseum will be finished soon, projected to be done before the end of next year. That's because even if the Venezia station is being built now the tunnels are complete and the only works that need to be done at the Colosseo station are residual cosmetic works but the big structural parts are completed.",
            "score": 1,
            "created_utc": 1731019063.0
        },
        {
            "author": "BOSSBROO",
            "body": "Hi! I am going to Rome on January 10, 2025. Will the construction be finished by then?",
            "score": 1,
            "created_utc": 1731106187.0
        },
        {
            "author": "ElectricSNAFU2",
            "body": "Wrapping up my third week, this week, and having been here every year for the past ten years, I can honestly say, IN MY OPINION (and I don't care how upset this makes anyone) that there is an extraordinary amount of restoration going on all over the city.  Thanks for the list - it hits  the main attractions that many first timers would like to see.  I wont be coming to Rome in 2025 due to the jubliee.\n\nBTW, the wonderful turtle fountain in the Jewish quarter is also being cleaned.  There are a bunch more things that I can't ever recall, but c'est la vie. I didn't keep notes.  We have seen our friends here and had a wonderful time and it's not all gloom and doom if you're coming....  but if you're planning a FIRST trip you might want to take all this into consideration.\n\nCiao.",
            "score": 1,
            "created_utc": 1731250292.0
        },
        {
            "author": "diobrando89",
            "body": "Direi da mettere nel post.",
            "score": 1,
            "created_utc": 1731001715.0
        },
        {
            "author": "RomeVacationTips",
            "body": "Done - but given that there are nearly 1000 listings on that site, I curated the list down to the \"big ones\" that people are freaking out about.",
            "score": 1,
            "created_utc": 1731226842.0
        },
        {
            "author": "RomeVacationTips",
            "body": "Added estimated completion dates from the website here: [https://www.romasitrasforma.it/en/](https://www.romasitrasforma.it/en/)",
            "score": 2,
            "created_utc": 1731226531.0
        },
        {
            "author": "RomeVacationTips",
            "body": "Added estimated completion dates from the website here: [https://www.romasitrasforma.it/en/](https://www.romasitrasforma.it/en/)",
            "score": 1,
            "created_utc": 1731226527.0
        },
        {
            "author": "Odd-Internet-7372",
            "body": ":( is there any report of the Caravaggio's restoration? I added San Luigi dei Francesi to my to do list just to see these artworks since Caravaggio is my favorite painter",
            "score": 1,
            "created_utc": 1731070506.0
        },
        {
            "author": "RomeVacationTips",
            "body": "Can't find any info on the Caravaggios. Not sure if it's just regular cleaning or Jubilee stuff.",
            "score": 1,
            "created_utc": 1731226783.0
        },
        {
            "author": "Extension-War-4844",
            "body": "The Bernini Alter was  restoration was  completed a few days ago for viewing",
            "score": 3,
            "created_utc": 1730996103.0
        },
        {
            "author": "Extension-War-4844",
            "body": "The Pieta is also on display, just not in its niche",
            "score": 3,
            "created_utc": 1730996203.0
        },
        {
            "author": "PatriciaDC",
            "body": "The Bernini Baldachin in St. Peter’s was to have been uncovered on October 27th…the Vatican reported that it was. \n\nDo you know, for a fact, that it is still covered?\n\nThe Vatican News…\n\n”During the Mass for the conclusion of the 16th Ordinary General Assembly of the Synod of Bishops, the Baldacchino above the tomb of St. Peter will be inaugurated after nine months of restoration. From October 27 to December 8, the ancient Chair of St. Peter will be displayed at the foot of the High Altar before being reinstalled in Bernini's bronze throne.\n\nVatican City, Oct 9, 2024 / 14:35 pm\n\nThe Vatican has announced that the completed restorations on the soaring baldacchino over the central altar of St. Peter’s Basilica designed by Gian Lorenzo Bernini will be unveiled on Oct. 27.  \nThe public will be able to see the 400-year-old twisting bronze columns of the large canopy for the first time since the restoration when Pope Francis presides over the closing Mass for the Synod on Synodality on Oct. 27.",
            "score": 1,
            "created_utc": 1730995794.0
        },
        {
            "author": "RomeVacationTips",
            "body": "OK thanks, added estimated completion time from the \"Roma Si Trasforma\" website.",
            "score": 1,
            "created_utc": 1731226586.0
        },
        {
            "author": "RomeVacationTips",
            "body": "Added estimated completion dates from the website here: [https://www.romasitrasforma.it/en/](https://www.romasitrasforma.it/en/)",
            "score": 1,
            "created_utc": 1731226596.0
        },
        {
            "author": "RomeVacationTips",
            "body": "Fatto.",
            "score": 1,
            "created_utc": 1731226796.0
        },
        {
            "author": "GlcNAcMurNAc",
            "body": "I was there on Tuesday, it was all covered up? Did we time our visit badly?",
            "score": 1,
            "created_utc": 1730996672.0
        },
        {
            "author": "GlcNAcMurNAc",
            "body": "I was under the impression that was a copy near the door?",
            "score": 1,
            "created_utc": 1730996643.0
        },
        {
            "author": "GlcNAcMurNAc",
            "body": "We are talking about different things.  Not the bronze canopy, the altar of the chair.",
            "score": 1,
            "created_utc": 1730996751.0
        },
        {
            "author": "GlcNAcMurNAc",
            "body": "I don’t mean the canopy. I mean the altar piece around the window.",
            "score": 1,
            "created_utc": 1730996704.0
        }
    ]
}