{
  "_id" : "dff9e362-4349-4f6c-867d-89df655741f7",
  "community" : "Sofia",
  "username" : "podivljali_vepar",
  "post" : "Is there an organized New Year's Eve in the center of Sofia and is it possible to go to Crni Vrh on January 1 and how?",
  "timestamp" : "2024-12-21T18:07:12Z",
  "numcomment" : 13,
  "reportedpost" : false,
  "comment" : [ {
    "reportedcomment" : false,
    "_id" : "0e78b1b7-6e7b-46be-8e8c-8da12ffd8c16",
    "body" : "Yes, there will be a traditional Dec 31/Jan 1st celebration on Battenberg Square starting around 22:30-23.\n\nIt is possible to go to Cherni Vrah on January 1st by walking. Bus 66 will likely work but you'll ultimately need to walk in cold winter conditions.",
    "username" : "CautiousRice",
    "timestamp" : "2024-12-21T18:07:12Z"
  }, {
    "reportedcomment" : false,
    "_id" : "8328dccf-e8fa-4c74-9201-b5e2a6dd5d52",
    "body" : "Yes, there is main event at Batenberg square, concert with a lot of artists.\nRegarding the mountain- don’t do stupid things, unless you are a professional with a lot of gear… it will be cold , a lot of snow and hard hike",
    "username" : "Big-Traffic3723",
    "timestamp" : "2024-12-21T19:56:09Z"
  }, {
    "reportedcomment" : false,
    "_id" : "81e57ce4-ec74-40a8-96e9-69fadbcff738",
    "body" : "There's usually a big concert at Batenberg Square. Starts around 9:30, there's usually some local bands, fireworks, traditional mass horo at midnight, that kind of stuff. I would not recommend going to Cherni vrah at this time. You can watch the fireworks from some spot in the mountain going there by car.",
    "username" : "laveol",
    "timestamp" : "2024-12-21T18:07:15Z"
  }, {
    "reportedcomment" : false,
    "_id" : "4f1db42a-f93f-4f71-85ad-329f84f65596",
    "body" : "WTF is this spelling? Ever heard of vowels? This is not Serbian",
    "username" : "f45c1574dm1n5",
    "timestamp" : "2024-12-21T22:03:55Z"
  }, {
    "reportedcomment" : false,
    "_id" : "6a50383f-9c26-4d02-b82f-bcf3eb50fb39",
    "body" : "How long to walk? Also, is there other cool mountain spot in Vitosha that you can see and its easly accessible?",
    "username" : "podivljali_vepar",
    "timestamp" : "2024-12-21T18:08:59Z"
  }, {
    "reportedcomment" : false,
    "_id" : "6ae41671-8acf-4632-b67a-512a7d9c6bc9",
    "body" : "I believe OP doesn't realize that Cherni Vruh is not a small hill and a walk in the park.   Going to Cherni Vruh in such weather will look more like this OP:\n\nhttps://preview.redd.it/9u28p8khs98e1.jpeg?width=1536&format=pjpg&auto=webp&s=b8d7cb98a326a3283a46c6b185d929479409d6ac",
    "username" : "dwartbg9",
    "timestamp" : "2024-12-21T21:30:18Z"
  }, {
    "reportedcomment" : false,
    "_id" : "4169c1f0-65b7-4567-82f9-7dc65bc10379",
    "body" : "I assume you’re looking for a place to observe the fireworks over the city from. The most popular destination for this purpose is Kopitoto. I must warn you, though, literally hundreds of people have the same idea every year. The last several hundred meters of the road quickly become blocked by parked cars. So you either have the option of going there early, parking closer to the hotel, taking a good position with a nice view, freezing your butt off for the several hours until midnight, then having to wait for several hours until all the cars blocking yours leave… Or going late, parking somewhere far away, walking up, finding some spot, somewhere, possibly, and then hopefully managing to leave within an hour after midnight. \n\nAlso, good chance the road will be solid ice and quite steep in sections. \n\nThe view from up there is great, but the mountain is close, easy and quick to get to, which means it’s accessible to a whole crowd. So just be prepared for what you’re getting into if you decide to go.",
    "username" : "MidwinterSun",
    "timestamp" : "2024-12-21T19:50:31Z"
  }, {
    "reportedcomment" : false,
    "_id" : "90a92abe-d7cc-4550-b903-fdc25f3529ed",
    "body" : "Bus 66 goes to hotel Moreni, which is located at around 1800m altitude. Cherni Vrah is  at 2290. That's roughly 500 meters up and 1.5h of walking for a person who is well prepared to do the hike, 2.5h for a person in a moderate shape. You need clothing that will protect you from the wind, glasses to protect you from the snow/sun, and a face mask/scarf. The temperature can be as low as -15C with strong winds. \n\nTL;DR - going there is fine with good winter clothing/ski clothing. Jan 1st not great because of holiday schedule for busses. Go there on another day.",
    "username" : "CautiousRice",
    "timestamp" : "2024-12-21T18:20:33Z"
  }, {
    "reportedcomment" : false,
    "_id" : "e9721aef-341d-4ff2-953d-79dd087766a0",
    "body" : "You cannot go to the street concert and then suddenly teleport to Cherni Vruh.   Did I understand correctly and you imagine this is possible?    The hike to the peak takes at least 3 hours and that's in summer during the day.   How do you imagine to hike to the top in such weather, with like 1 meter snow and ice and probably piercing winds?    At night?  Do you have proper equipment,  hiking shoes, headmount flashlight, hiking sticks etc...   \nDo you have the strenght to hike for total of 6-7 hours if not more? \n\nAlso there is no view of the city from Black Peak.   The main viewpoint is at the Kopitoto, which is way more accessible,  as long as you take a rental car or somehow find a taxi willing to get you there (keep in mind, it won't be cheap).   This is the main place where you can see the fireworks from above.   The other place is called \"Kamen del peak\" but you'd need to hike there too, probably it will be much easier than Black Peak but you'd still need to start the hike from earlier, so no way to be able to see the concert at the square too.",
    "username" : "dwartbg9",
    "timestamp" : "2024-12-21T21:26:58Z"
  }, {
    "reportedcomment" : false,
    "_id" : "cb56687e-2e04-4193-9448-bce4e3a17126",
    "body" : "Kamen Vryh is another good spot",
    "username" : "neurotekk",
    "timestamp" : "2024-12-22T07:40:39Z"
  }, {
    "reportedcomment" : false,
    "_id" : "d0c573a0-e0fe-4131-8236-3859cbaa4751",
    "body" : "Can I go to Moreni by car? I cant go another day, i am leaving in 2 january",
    "username" : "podivljali_vepar",
    "timestamp" : "2024-12-21T21:23:23Z"
  }, {
    "reportedcomment" : false,
    "_id" : "f0e8ce56-96a5-4e12-b730-bd8041cd23c1",
    "body" : "I would hike the day after new eve, during day not in night",
    "username" : "podivljali_vepar",
    "timestamp" : "2024-12-21T21:41:55Z"
  }, {
    "reportedcomment" : false,
    "_id" : "d2113bcb-e813-4a96-92c3-c0e4ff4175d4",
    "body" : "You can go but the road is closed from 11 to 14. Make sure to be there no later than 10. Drive safely, the road will have snow, ice, and sand. Be very slow, use 4x4 if possible.",
    "username" : "CautiousRice",
    "timestamp" : "2024-12-21T21:25:47Z"
  } ]
}