{
  "id" : 200299,
  "community_name" : "Oslo",
  "username" : "forteller",
  "post_body" : "Bompengene Fjellinjen tar inn, går tilbake til samfunnet. I år har over 4,1 milliarder kroner finansiert kollektivtrafikken, nye gang- og sykkelveier og flere andre prosjekter. Her får du hele oversikten.",
  "timestamp" : "2024-12-22 00:24:30",
  "num_comment" : 75,
  "reported_post" : false,
  "commenti" : [ {
    "reported_comment" : false,
    "body" : "Og før noen sier at pengene ikke går til bilistene, så det er de andre som bør betale, så må jeg minne om at hver eneste gang noen av disse tiltakene får noen til å velge noe annet enn å kjøre bil, så betyr det:\n\n- Mindre slitasje på veiene som skaper hull og irritasjon – og skattepenger fra veibudsjettet som må gå til lapping framfor andre forbedringer av veiene\n- Én færre bil i veien som kan havne foran deg og være til irritasjon, er det mange nok samtidig som velger noe annet enn bilen unngår du kanskje tom en kø\n- Mindre luftforurensing, som skader deg og dine barn og foreldre\n- Mindre sannsynlighet for at noen kræsjer inn i hverandre med biler, eller kræsjer inn i noen utenfor en bil, som kanskje til og med kan være en du er glad i.\n\nOg så må jeg minne om at ingen velger å kun være bilist 100% av tiden, de aller, aller fleste bruker kollektiv og/eller sykkel innimellom, og alle går eller bruker rullestol innimellom, og vil da ha glede av disse tiltakene direkte.",
    "username" : "forteller",
    "timestamp" : "2024-12-22 00:24:30"
  }, {
    "reported_comment" : false,
    "body" : "Vi trenger å bli kvitt biler. Først å fremst for å slippe å høre sytingen til bilister. For en sutrete gjeng.",
    "username" : "NeitherDependent4747",
    "timestamp" : "2024-12-22 12:27:36"
  }, {
    "reported_comment" : false,
    "body" : "Ta fra de fattige og gi til de rike. Det er folk på Oslo øst (og særlig i Groruddalen) som betaler mest bompenger. De får ikke noe tilbake. Pengene blir brukt på Majorstua og Fornebu.",
    "username" : "Lone_Wanderer_N",
    "timestamp" : "2024-12-22 01:28:55"
  }, {
    "reported_comment" : false,
    "body" : "Hvor mye tok de inn? 4.1 milliarder virker å være hvor mye de ga tilbake. Hadde vært interessant å vite hvor mye penger som blir liggende i Fjellinjen som lønn, konsulenter og andre kostnader.",
    "username" : "erikmar",
    "timestamp" : "2024-12-22 20:59:43"
  }, {
    "reported_comment" : false,
    "body" : "Ja, dere kollektivfolket får takke oss bilister for å finansiere trikken deres. God jul",
    "username" : "Kristoffer1994",
    "timestamp" : "2024-12-22 22:37:12"
  }, {
    "reported_comment" : false,
    "body" : "Bompenger er en svært dyr og urettferdig måte å kreve inn skatt.",
    "username" : "OsteP0P",
    "timestamp" : "2024-12-22 01:39:03"
  }, {
    "reported_comment" : false,
    "body" : "Ikke nok med at bompenger er en avgiftspålegging som i sluttenden treffer veldig feil, uten å være behovsprøvd på noe vis. Pengene de samler inn går for det første med på å dekke en sekk av administrasjonskostnader. De kronene som så er tilovers dyttes inn igjen i ett stort pengesluk av mer administrasjonskostnader, overfylte busser, trikker,t-baner, tog og ett lappeteppe av usammmenhengende sykkelveier og gater så smale at det ikke går an å kjøre biler der.. Infrastruktur og planlegging i Oslo suger, mildt sagt!. Istedet for å ha fokus på å samle inn mest mulig, sså kunne man kanskje sett på hvordan disse pengene brukes? Galskap!",
    "username" : "LordHamsterWheel",
    "timestamp" : "2024-12-22 08:51:25"
  }, {
    "reported_comment" : false,
    "body" : "Det er helt urimelig at disse pengene brukes på sykkelveier. Det kan syklistene betale selv.",
    "username" : "Psychology-Soft",
    "timestamp" : "2024-12-22 06:50:34"
  }, {
    "reported_comment" : false,
    "body" : "Bare hyggelig.\n\n\nIkke glem å bøye dere og takker når dere ser meg kjøre forbi i min gigantiske pickup med så dårlig sikt at jeg meier ned en barnefamilie fordi jeg ikke så dem i gangfeltet. \n\n\nDet er takket være meg at dere kan ta bussen fremfor å måtte gå til jobb i sluddet og snøen.",
    "username" : "Hornpub",
    "timestamp" : "2024-12-22 16:29:05"
  }, {
    "reported_comment" : false,
    "body" : "Er det statistikk på hvor mange som tar kollektivt nå, i forhold til i fjor? Og også da i forhold til vekst av befolkningen,  og muligens antall biler på si ring 3  i år kontra i fjor?",
    "username" : "Fubarin",
    "timestamp" : "2024-12-23 04:56:16"
  }, {
    "reported_comment" : false,
    "body" : "Har du tatt tog? Det er alltid noe med toget. Har du tatt 37 bussen? Jeg unner ingen å ta 37 bussen. Skulle ønske at kollektivt var løsningen, men vi er ekstremt dårlige på det. Eneste som funker sånn ca Tbanen, men den går jo ikke overalt.",
    "username" : "LordHamsterWheel",
    "timestamp" : "2024-12-22 09:00:53"
  }, {
    "reported_comment" : false,
    "body" : "Nyansert og innsiktsfull kommentar",
    "username" : "99999nine",
    "timestamp" : "2024-12-22 21:40:44"
  }, {
    "reported_comment" : false,
    "body" : "Pr bil betaler de mer, men det er også færre som har bil og kjører bil til daglig der.",
    "username" : "kyrsjo",
    "timestamp" : "2024-12-22 10:11:02"
  }, {
    "reported_comment" : false,
    "body" : "Får ikke noe tilbake? Groruddalen har et godt utbygd t-banenett og tre (!) motorveier mot en i vest. Det har blitt investert enormt i infrastruktur i Groruddalen.",
    "username" : "ChelseaHotelTwo",
    "timestamp" : "2024-12-22 11:08:51"
  }, {
    "reported_comment" : false,
    "body" : "Nei, ikke i Oslo, hadde det vært ett sted hvor det er ett behov for bil i dagliglivet ja, men det behovet er egentlig ikke der i Oslo.",
    "username" : "Z_nan",
    "timestamp" : "2024-12-22 01:55:49"
  }, {
    "reported_comment" : false,
    "body" : "Hvorfor er det urettferdig?",
    "username" : "Hagamein",
    "timestamp" : "2024-12-22 18:54:54"
  }, {
    "reported_comment" : false,
    "body" : "Det er helt urimelig at skattepenger brukes på bilveier. Det kan bilistene betale selv.",
    "username" : "dnivi3",
    "timestamp" : "2024-12-22 10:41:08"
  }, {
    "reported_comment" : false,
    "body" : "Seneste rapport viste jo at sykkelveiene i Oslo i praksis har betalt seg selv. For hver krone brukt får man nesten 2kr tilbake i andre besparelser (feks reduserte helsekostnader).\n\nFor bil er regnestykket motsatt. Hver kjørte kilometer fører til klimagasser, slitasje på infrastruktur, dårligere helse, mikroplast i naturen, dødsulykker, dårlig luft for innbyggere i byen som igjen fører til dårligere helse, støyplager.\n\nDet er helt rimelig at de som påfører byen disse enorme ulempene må sponse avbøtende tiltak.",
    "username" : "BilSuger",
    "timestamp" : "2024-12-22 09:18:04"
  }, {
    "reported_comment" : false,
    "body" : "Syklistene kan sykle tilbake der de kom fra.",
    "username" : "phueo",
    "timestamp" : "2024-12-22 08:14:08"
  }, {
    "reported_comment" : false,
    "body" : "Jeg tar regelmessig tog, bane, trikk, buss og sykler og gjør 100 ganger heller det enn å stå i kø hver dag.\n\nHadde ikke de som tok kollektivt gjort nettopp det så hadde det vært så mye kø at veiene var ubrukelige.",
    "username" : "heimebrentvernet",
    "timestamp" : "2024-12-22 09:11:18"
  }, {
    "reported_comment" : false,
    "body" : "Tøys, kollektivtrafikken i Oslo er veldig effektiv. Kan alltid bli bedre, men det definitivt løsningen.",
    "username" : "voldsom_analsex",
    "timestamp" : "2024-12-22 11:28:44"
  }, {
    "reported_comment" : false,
    "body" : "Hva er galt med 37-bussen?",
    "username" : "ansiktsfjes",
    "timestamp" : "2024-12-22 11:21:27"
  }, {
    "reported_comment" : false,
    "body" : "Bussen hadde fungert bedre om privatbilisme var forbudt i byen. Kan ikke se for meg en fremtid hvor privatbilisme er tillatt, det er bare et spørsmål om tid.",
    "username" : "MemoriesOfShrek",
    "timestamp" : "2024-12-22 09:29:21"
  }, {
    "reported_comment" : false,
    "body" : "Du argumenterer jo for å bruke mer penger på å forbedre kollektivtransporten. Det samme som jeg gjør. Vi er på samme side.",
    "username" : "forteller",
    "timestamp" : "2024-12-22 13:06:01"
  }, {
    "reported_comment" : false,
    "body" : "På de nærmere 15 årene jeg har pendlet med tog har det knapt vært problemer med toget mitt. Sjeldent noe småtteri en og annen gang. Hender det er litt forsinkelser på vei hjem, men det skyldes som regel at det er lite kapasitet fra Lysaker og gjennom Oslo-tunellen. Av og til skjærer det seg skikkelig med signalfeil, jordingsfeil eller noe annet generelt større, men det er fortsatt ganske sjeldent.  Påliteligheten er gått litt ned de senere årene, noe som sikkert skyldes aldrende infrastruktur og høy bruk innenfor hva som er mulig kapasitet.",
    "username" : "the_pianist91",
    "timestamp" : "2024-12-22 12:01:13"
  }, {
    "reported_comment" : false,
    "body" : "Har du prøvd kollektivt i andre byer enn Oslo?\n\nEtter 8 år i Trondheim kan jeg hvert fall si at kollektivtilbudet i Oslo er i en helt annen liga.",
    "username" : "SBaL88",
    "timestamp" : "2024-12-22 14:28:13"
  }, {
    "reported_comment" : false,
    "body" : "Klassisk viss-type-person-kommentar, mener du.\n\n\"Disse folka finansierte fellesskapet med 4,1 milliarder ekstra i fjor? Æsj, fysj! Dette er folk vi må bli kvitt!\"\n\nSavner bare et \"ryk og reis\" for å gå full Bergstø.",
    "username" : "parkisringforbutt",
    "timestamp" : "2024-12-23 13:08:31"
  }, {
    "reported_comment" : false,
    "body" : "Fordi det er mye bompenger og folk har dårlig råd. Som betyr at hvis du ikke kan bruke kollektivt og må bruke bil og er fattig så blir du bare mer fattig. Jeg bor der og har god råd, men jeg kommer til å selge og flytte til løkka så kan de fattige jævlene som ikke har råd til å flytte til sentrum få finansiere trikken min.",
    "username" : "Commercial_Shake2691",
    "timestamp" : "2024-12-22 12:03:01"
  }, {
    "reported_comment" : false,
    "body" : "Hvor mye av det har kommet etter at bompengene ble innført?",
    "username" : "BubbleDevere",
    "timestamp" : "2024-12-22 11:33:11"
  }, {
    "reported_comment" : false,
    "body" : "Og det er også en god del i Groruddalen som ender opp med å bo i nærheten av de motorveiene fordi de ikke har råd til annet, og dermed betaler med helsa si når de blir utsatt for svevestøv, avgasser og støy. Å dempe biltrafikken der er bra—og bompenger er med på å dempe biltrafikken.",
    "username" : "syklemil",
    "timestamp" : "2024-12-22 12:35:25"
  }, {
    "reported_comment" : false,
    "body" : "Livet er bra i hybelen din ?",
    "username" : "Last_Tourist1938",
    "timestamp" : "2024-12-22 06:20:09"
  }, {
    "reported_comment" : false,
    "body" : "Ikke i Oslo ? Utfordring : Kom deg fra Oslos nye legevakt til Furuset. Eller fra Vestli til Holmlia. Kjelsås til Abildsø. Og ja.. Ruter appen kan gjerne vise deg at det går kjappere enn hva som er realiteten. Realiteten er at det fort tar 30-40 min mer enn det som er tilfellet med bil. På vinterstid kan du legge til nye 30 min = 1 time ekstra reisevei. Det tar kortere tid fra Bergen til Oslo med fly enn det tar fra Vestli til Holmlia med kollektivt",
    "username" : "B3arAttac",
    "timestamp" : "2024-12-22 08:20:31"
  }, {
    "reported_comment" : false,
    "body" : "Jo, overalt! Det er mer effektivt å hente pengene via skatten.",
    "username" : "OsteP0P",
    "timestamp" : "2024-12-22 10:14:18"
  }, {
    "reported_comment" : false,
    "body" : "Fordi det er en flat skatt som rammer de fattigste mest. Hvorfor må jeg forklare det?",
    "username" : "OsteP0P",
    "timestamp" : "2024-12-22 23:13:09"
  }, {
    "reported_comment" : false,
    "body" : "Flott, hvem skal jeg kontakte for å få igjen bompengene mine? Sykkelforbundet?",
    "username" : "Psychology-Soft",
    "timestamp" : "2024-12-22 10:16:28"
  }, {
    "reported_comment" : false,
    "body" : "Ja, bedre å hjelpe dem der de er.",
    "username" : "kali_tragus",
    "timestamp" : "2024-12-22 09:15:50"
  }, {
    "reported_comment" : false,
    "body" : "Ikke uten sykkelveiene.",
    "username" : "Brekkjern",
    "timestamp" : "2024-12-22 14:32:19"
  }, {
    "reported_comment" : false,
    "body" : "Sier ikke det, bare at det er feil med finansiering via bompenger",
    "username" : "LordHamsterWheel",
    "timestamp" : "2024-12-22 19:43:03"
  }, {
    "reported_comment" : false,
    "body" : "Kødder du med meg? Det er livets galskap satt i system",
    "username" : "LordHamsterWheel",
    "timestamp" : "2024-12-22 19:42:07"
  }, {
    "reported_comment" : false,
    "body" : "Privatbilisme blir forbudt ---> færre folk kjører bil ---> mindre penger til kollektiv ---> kollektiven blir mindre effektiv eller får etterslep på vedlikehold ---> alle blir skattet høyere eller får høyere månedspris på biletten ---> folk går tilbake til bil",
    "username" : "Kristoffer1994",
    "timestamp" : "2024-12-22 22:40:30"
  }, {
    "reported_comment" : false,
    "body" : "Det kan du ha rett i, forskjellen er at det ikke er over bompenger.",
    "username" : "LordHamsterWheel",
    "timestamp" : "2024-12-22 19:39:31"
  }, {
    "reported_comment" : false,
    "body" : "OP sier at det er bra dette tas via bompenger. Jeg mener det er feil.",
    "username" : "LordHamsterWheel",
    "timestamp" : "2024-12-22 19:41:23"
  }, {
    "reported_comment" : false,
    "body" : "Har du prøvd kollektiv i andre land enn Norge?",
    "username" : "LordHamsterWheel",
    "timestamp" : "2024-12-22 19:40:01"
  }, {
    "reported_comment" : false,
    "body" : "Hva har det å si? Bompenger er for å få ned biltrafikken.",
    "username" : "ChelseaHotelTwo",
    "timestamp" : "2024-12-22 14:11:11"
  }, {
    "reported_comment" : false,
    "body" : "Har ikke bodd i hybel i Oslo, og begynner å bli noen tiår siden jeg bodde innenfor ring 3+++ sist.",
    "username" : "Z_nan",
    "timestamp" : "2024-12-22 10:37:32"
  }, {
    "reported_comment" : false,
    "body" : "Det kan det absolutt være. Hva mener du?",
    "username" : "TreKopperTe",
    "timestamp" : "2024-12-22 11:18:04"
  }, {
    "reported_comment" : false,
    "body" : "Ikke for å ta ned biltrafikken. Bompengene er også en [pigouskatt](https://no.wikipedia.org/wiki/Pigouskatt); dette gjelder særlig rushtidsprisingen. Vi har ikke særskatter på alkohol og tobakk for å hente inn penger heller; de pengene kan lett hentes inn via de store skatteordningene. [Å bruke bompenger for å gi et prissignal og å dulte folk ut av bilen funker ypperlig](https://www.youtube.com/watch?v=CX_Krxq5eUI) (selv om rushtidsprisingen i Oslo nok er litt for tannløs til å ha den ønskede effekten).",
    "username" : "syklemil",
    "timestamp" : "2024-12-22 12:32:40"
  }, {
    "reported_comment" : false,
    "body" : "'de fattigste' har ikke råd til bil. Hvem er det du tror du forsvarer?",
    "username" : "Hagamein",
    "timestamp" : "2024-12-22 23:16:48"
  }, {
    "reported_comment" : false,
    "body" : "Hvor dum er du? Forstod du virkelig ikke poenget?",
    "username" : "BilSuger",
    "timestamp" : "2024-12-22 10:24:34"
  }, {
    "reported_comment" : false,
    "body" : "Om du kjører bil i Oslo har du fått det i form av kortere kø, så si takk",
    "username" : "hohygen",
    "timestamp" : "2024-12-22 23:20:28"
  }, {
    "reported_comment" : false,
    "body" : "*Hvorfor* blir det mindre penger til kollektiv og ikke til motorveier osv?",
    "username" : "PresidentZeus",
    "timestamp" : "2024-12-23 00:07:03"
  }, {
    "reported_comment" : false,
    "body" : "Ubestridelig fakta, dette her. Du burde jo vært statsminister!",
    "username" : "MemoriesOfShrek",
    "timestamp" : "2024-12-23 08:23:56"
  }, {
    "reported_comment" : false,
    "body" : "Det er for så vidt greit, men å hevde at alle tog bestandig er forsinket eller ikke går (eller noe annet) er bare tull og viser kun uvitenhet.",
    "username" : "the_pianist91",
    "timestamp" : "2024-12-22 19:57:50"
  }, {
    "reported_comment" : false,
    "body" : "Japp…",
    "username" : "SBaL88",
    "timestamp" : "2024-12-22 19:48:56"
  }, {
    "reported_comment" : false,
    "body" : "Dumt å bygge veier hvis de ikke skal brukes",
    "username" : "djbrucewayne",
    "timestamp" : "2024-12-23 10:18:41"
  }, {
    "reported_comment" : false,
    "body" : "For folk som bor utenfor Oslo, som begynner på jobb klokken 6 om morgenen, så er det umulig å ta kollektivt. Bussen går rett og slett ikke tidlig nok. Sjefen ville neppe godtatt at jeg kom 30-40minutter for sent på jobb hver dag. I tillegg tar kollektivreisen mer enn dobbelt så lang tid. Argumentet ditt er meningsløst.",
    "username" : "OsteP0P",
    "timestamp" : "2024-12-22 23:20:27"
  }, {
    "reported_comment" : false,
    "body" : "Du, helt seriøst, hva er det som er galt med deg?",
    "username" : "OsteP0P",
    "timestamp" : "2024-12-22 23:24:03"
  }, {
    "reported_comment" : false,
    "body" : "Hvis påstanden om at det lønner seg 2 gangeren, så må jeg selvsagt få min del av avkastningen i tillegg.",
    "username" : "Psychology-Soft",
    "timestamp" : "2024-12-22 14:56:09"
  }, {
    "reported_comment" : false,
    "body" : "Hva om de hadde bygd enda ett felt for biler istedenfor?",
    "username" : "Psychology-Soft",
    "timestamp" : "2024-12-23 05:43:11"
  }, {
    "reported_comment" : false,
    "body" : "Guttetur? Autokorrekt?",
    "username" : "Kristoffer1994",
    "timestamp" : "2024-12-23 07:50:42"
  }, {
    "reported_comment" : false,
    "body" : "Hvordan da? Enlighten me\n\n\nHvis det blir mindre biler og dermed mindre bompenger til kollektiv, hvordan skal de ta igjen de pengene med annet enn høyere bilettpriser eller skatter?\n\nDet blir litt som elbilene. Når de kom så fikk de som kjøpte de store økonomiske fordeler i form av gratis parkering, gratis bom, gratis parkering osv. Nå kjører 'alle' elbil og nå må politikerne ta igjen disse pengene ved å innføre bompenger for elbil, innføre betaling for parkering av elbiler osv.",
    "username" : "Kristoffer1994",
    "timestamp" : "2024-12-23 08:38:03"
  }, {
    "reported_comment" : false,
    "body" : "Det er for upålitelig ihvertfall for noen som har møter og en jobb.",
    "username" : "LordHamsterWheel",
    "timestamp" : "2024-12-23 07:08:43"
  }, {
    "reported_comment" : false,
    "body" : "Hvorfor tror du man ønsker trafikken til 0?",
    "username" : "ChelseaHotelTwo",
    "timestamp" : "2024-12-23 13:46:30"
  }, {
    "reported_comment" : false,
    "body" : "Da slipper du trafikk og rushtidsavgift om ikke annet",
    "username" : "shartmaister",
    "timestamp" : "2024-12-23 01:17:46"
  }, {
    "reported_comment" : false,
    "body" : "Ingenting galt å være realistisk ift hva du faktisk har råd til. De som mener de blir truffet hardt av bompenger har ikke råd til å kjøre bil, enklere blir det ikke.",
    "username" : "Hagamein",
    "timestamp" : "2024-12-22 23:28:50"
  }, {
    "reported_comment" : false,
    "body" : "Det får du gjennom reduserte helsekostnader i samfunnet.",
    "username" : "BilSuger",
    "timestamp" : "2024-12-22 15:04:18"
  }, {
    "reported_comment" : false,
    "body" : "Og hvor skulle du gjort av de ekstra bilene i byen?",
    "username" : "hohygen",
    "timestamp" : "2024-12-23 07:33:22"
  }, {
    "reported_comment" : false,
    "body" : "Du tror at når færre kjører bil og flere kjører kollektivt vil det bli mindre penger til kollektivt? Det gir ingen mening.  \nNår flere kjører kollektivt tjener selskapene mer penger. (Flere solgte billetter = mer penger) Fjerner man privatbilene blir det plutselig veldig mye mer kapasitet på veiene og man kan bruke noe av den ekstra inntekten på å f.eks. kjøre flere busser.  \nPå den måten blir kollektivtilbudet styrket både ved antall avganger og punktlighet. I tillegg blir det enklere og tryggere å sykle i byen, og det blir tryggere å ferdes til fots. Det blir også mindre støy og forurensning i byen.",
    "username" : "MemoriesOfShrek",
    "timestamp" : "2024-12-23 11:51:49"
  }, {
    "reported_comment" : false,
    "body" : "Jeg har da klart meg helt fint",
    "username" : "the_pianist91",
    "timestamp" : "2024-12-23 10:25:00"
  }, {
    "reported_comment" : false,
    "body" : "Fordi det er kulere med 1000 droner i lufta som skal frakte varer og pakker til både butikker og hjem til folk",
    "username" : "djbrucewayne",
    "timestamp" : "2024-12-23 14:34:41"
  }, {
    "reported_comment" : false,
    "body" : "Altså, du har misforstått hver bidige del av det jeg skrev, du har ikke prøvd å forstå en døyt av det; inde sequitur, hva er galt med deg?",
    "username" : "OsteP0P",
    "timestamp" : "2024-12-22 23:36:18"
  }, {
    "reported_comment" : false,
    "body" : "Kanskje litt overraskende for enkelte, men det er faktisk en del av bilene som kjører gjennom bomringene som ikke skal til Oslo Sentrum. Hvis man bor på Kolbotn og jobber utenfor Lillestrøm betaler man mye bompenger men fyller ikke opp byen, og sparer fort en time eller to i reisetid hver dag.",
    "username" : "Eldhannas",
    "timestamp" : "2024-12-23 08:17:07"
  }, {
    "reported_comment" : false,
    "body" : "Da må vi lage flere parkeringsplasser. Kanskje sykkelfinansierte p-plasser hadde vært noe?",
    "username" : "Psychology-Soft",
    "timestamp" : "2024-12-23 09:21:20"
  }, {
    "reported_comment" : false,
    "body" : "Og dette er et eksempel på hvorfor det er fint om en har færre biler som skal inn til byen, slik at de som har reelle behov for egen bil kommer frem men vi andre kan begrense bilbruken.",
    "username" : "hohygen",
    "timestamp" : "2024-12-23 08:19:59"
  }, {
    "reported_comment" : false,
    "body" : "Og hvilke hus og nabolag vil du rive for det?\n\nDet er bare å innse at tiden for fri flyt av biler inn i byene er over, og at trivelige byer ikke flyter over av biler.",
    "username" : "hohygen",
    "timestamp" : "2024-12-23 09:26:14"
  } ]
}