{
  "_id" : "6e7b7f5e-c913-4ae8-902b-7e46909a3c02",
  "community" : "Travel",
  "username" : "FinalSun6862",
  "post" : "Want to get global entry but heard it takes a while. Does the TSA precheck kick in faster?",
  "timestamp" : "2024-12-23T12:38:00Z",
  "numcomment" : 30,
  "reportedpost" : false,
  "comment" : [ {
    "reportedcomment" : false,
    "_id" : "bb6641da-b0b1-45a6-9400-27043460ae0a",
    "body" : "The TSA Precheck that comes with Global Entry is not usable until Global Entry is approved and the interview is done.\n\n\nIf you apply for tsa prechrck separately that would get approved faster. But you'd have to pay for both programs. ",
    "username" : "jadeoracle",
    "timestamp" : "2024-12-23T12:38:00Z"
  }, {
    "reportedcomment" : false,
    "_id" : "7ab788a4-69dd-405a-92e8-ebe02e52d215",
    "body" : "For me, the approval came right after the in-person interview. It took two weeks to get the card, but they gave me the known traveler number when I got approval so I could add it to a flight I was taking next week.",
    "username" : "flyingcircusdog",
    "timestamp" : "2024-12-23T12:39:06Z"
  }, {
    "reportedcomment" : false,
    "_id" : "ccaf7407-dbd2-4988-a63c-2b448eee6ac1",
    "body" : "It’s more about getting an in person interview timely. I’m in Ohio and I was approved immediately after my in person. I had to drive two hours for the interview.",
    "username" : "Gypsy_M0th",
    "timestamp" : "2024-12-23T12:38:58Z"
  }, {
    "reportedcomment" : false,
    "_id" : "2b68c50e-f37a-4223-acc2-3604a130c081",
    "body" : "I got conditional approval the next day and was able to get an interview within a week (kept refreshing the page an opening came up). Kids took longer but they got approved while we were abroad and we did the interview on arrival for them, which was actually easier.",
    "username" : "ak658",
    "timestamp" : "2024-12-23T13:55:20Z"
  }, {
    "reportedcomment" : false,
    "_id" : "51996ea4-aa1a-4e50-ab33-1670044f346c",
    "body" : "If you apply for global entry, it comes with precheck, so getting both is not a bad idea. Without concrete plans, I’d go ahead and apply now; it’s like the saying about trees - the best time to plant was years ago; the second best time is today. \n\nMy global entry renewal took 2 weeks in 2021, but that is not normal or standard so I wouldn’t go by that. The time is dependent on how fast you get through the wickets (ie get your interview scheduled) and what all pops up on your background check.\n\nETA: it’s good for 5 years, so even f it doesn’t make it by your next trip, it’ll be there for your second.",
    "username" : "syzygialchaos",
    "timestamp" : "2024-12-23T12:40:14Z"
  }, {
    "reportedcomment" : false,
    "_id" : "13ab87cd-5e80-4920-9d79-afa5963c6e30",
    "body" : "You can use appointmentscanner.com and it will alert you to openings in your preferred location for a fee approx $30 I think you I got my appointment 3 days after the initial approval. Whole process was a couple of weeks.",
    "username" : "Acceptable_Day_3599",
    "timestamp" : "2024-12-23T12:58:58Z"
  }, {
    "reportedcomment" : false,
    "_id" : "6e0088cc-1542-4c14-a0b5-68d596aaabde",
    "body" : "If you just have TSA pre check it makes no difference for crossing the U.S. border.",
    "username" : "nim_opet",
    "timestamp" : "2024-12-23T13:11:24Z"
  }, {
    "reportedcomment" : false,
    "_id" : "0b5f9153-e44f-49ac-b40e-bceed0d78c92",
    "body" : "you get both but you need to complete the entire process. there is no intermediate stage where you have precheck before global entry. it happens at the same time. \n\n\nif you apply for precheck by itself that is usually very fast.",
    "username" : "DrySpace469",
    "timestamp" : "2024-12-23T13:27:07Z"
  }, {
    "reportedcomment" : false,
    "_id" : "c449ef01-1b4e-4af8-a3ee-adde0b3dcf19",
    "body" : "It took me 6 months to get my Global Entry and 1 month for my daughter to get hers, go figure. That said, the real question is how much international travel are you doing? If you are re-entering the US several times a year, it definitely worth it but if most your travel id domestic, just get the TSA Pre.",
    "username" : "FranklinUriahFrisbee",
    "timestamp" : "2024-12-23T13:35:39Z"
  }, {
    "reportedcomment" : false,
    "_id" : "77cec78d-67c9-403f-8326-3f938c69683f",
    "body" : "I applied for my Global Entry in September. It took 3-4 days to get my conditional approval, then I did interview on arrival on my trip back at Dulles in late October.\n\nI had looked for other interview options in the area (Illinois) and while they were available, I wanted to save myself the 3 hours of driving. It was a smart choice as my in person interview took all of 5 minutes.\n\nMy approval was complete about 10-15 minutes after the in person interview and I had my known traveler number for pre-check.",
    "username" : "Antilokhos",
    "timestamp" : "2024-12-23T13:44:44Z"
  }, {
    "reportedcomment" : false,
    "_id" : "5e8a091d-c9df-4eb5-8a9f-f6f8a16077be",
    "body" : "Applied on a Saturday, conditional approval the next Monday. Booked an appointment for that same day (I live 30 min away from the airport). Approved as appointment ended, updated online a couple business days later. Card is already in the mail. Fastest turnaround I have ever seen!",
    "username" : "Minute_Wonder_4840",
    "timestamp" : "2024-12-23T14:10:02Z"
  }, {
    "reportedcomment" : false,
    "_id" : "069fb3b3-36bb-4539-86a2-62664d9ddadf",
    "body" : "I just got mine 2 weeks ago, it took about 24 hours to be conditionally approved when I turned my application in, and then I did enrollment on arrival for a trip I had coming up. I got approved from that in a couple of hours. In total, start to finish it took maybe a month, but if I scheduled an interview it would have probably been 2-3 months before my local airport could have gotten me in. \n\nFrom my own research at the time, I will point out that there is basically no way to know how long your conditional approval will take. Even if you have a clean record, it could be days, it could be months.",
    "username" : "smittynibs",
    "timestamp" : "2024-12-23T14:10:28Z"
  }, {
    "reportedcomment" : false,
    "_id" : "7efff1c0-b637-4828-80ce-824b7389db7c",
    "body" : "I applied in September, waiting for conditional approval and was told a 12-14 month wait. No pre-check until Global Entry goes through",
    "username" : "Servb0t",
    "timestamp" : "2024-12-23T14:11:01Z"
  }, {
    "reportedcomment" : false,
    "_id" : "2acc0026-7e28-4c92-9431-f1eb9d5588b9",
    "body" : "I was only conditionally approved for Global entry, didn’t have any international trip coming up, and it took months to get an appointment, and they were always at inconvenient times (not around my domestic travel) and obviously at the airport. \nLong story short after like 6-8months I just decided to get TSA Precheck, went to a staples, paid $35 and got my fingerprint and picture done and was on my way the week later with my TSA #.\nI think TSA Precheck is better, since even for international trips it gets you through faster that first leg when leaving the US. And I would still be too anxious to not get in early on the international side just in case, but I only travel internationally like 1-2 a year",
    "username" : "forgivemefashion",
    "timestamp" : "2024-12-23T14:13:36Z"
  }, {
    "reportedcomment" : false,
    "_id" : "c2d9b79d-8d0b-4ac2-9997-ce0e6946ee75",
    "body" : "It took awhile for tsa precheck to be available to me, after getting global entry",
    "username" : "everettsuperstar",
    "timestamp" : "2024-12-23T14:26:44Z"
  }, {
    "reportedcomment" : false,
    "_id" : "9562a9c9-796e-49ff-875d-8e9ac48b4bfe",
    "body" : "I think some people are hung up on terminology. GE has multiple steps. After filling out the application, you have to:\n\n1. Wait for and receive conditional approval.\n2. Schedule and attend an interview.\n3. Wait for and receive approval.\n\nSeems people are focused on Steps 2 and 3, but when people speak about a long time to approval, they’re typically referring to long times until *conditional approval* (Step 1). Step 3 is done within hours, and Step 2 can be accelerated if you’re flexible enough, e.g. going to other locations, frequently checking for cancellations, or just doing the interview upon return from an international trip. But Step 1 is completely beyond your control.\n\nAs you can see, many people are approved pretty quickly, within a week, but there are others who have to wait months for conditional approval. And, unfortunately, it’s impossible to predict which batch you’re in.\n\nIf you traveling internationally with some degree of frequency, I’d just apply for GE and wait however long it takes. Perhaps you’ll be lucky and have it done quickly and problem solved. At least it’s a one-time wait.",
    "username" : "tariqabjotu",
    "timestamp" : "2024-12-23T14:27:18Z"
  }, {
    "reportedcomment" : false,
    "_id" : "bf4f7291-57d8-4d20-9a1f-5f1dcc26aba7",
    "body" : "I don't usually understand these questions. If you're gone this long without it, what exactly is the rush?\n\nYou do without for a little longer while it gets processed",
    "username" : "maverick4002",
    "timestamp" : "2024-12-23T14:17:14Z"
  }, {
    "reportedcomment" : false,
    "_id" : "f6ce90cc-b1dd-4f54-b4d3-11ab4f24ad17",
    "body" : "I got mine a few years back and it did take forever but I have a unique name, I am male and I am not Caucasian.  A girl I was working with who has a common European ethnic name applied 3 months later and got hers few months before I got mine.  So I guess it all depends on your race and name and possibly gender, as to how long it takes to get approved.  For me it was over a year. \n\nNo TSAPre before the whole thing is approved.",
    "username" : "Gr8Papaya",
    "timestamp" : "2024-12-23T12:44:57Z"
  }, {
    "reportedcomment" : false,
    "_id" : "71d66eee-111b-4f9c-a0b9-648bbe58a69a",
    "body" : "Is it still like this?",
    "username" : "Otherwise_Lychee_33",
    "timestamp" : "2024-12-23T12:48:06Z"
  }, {
    "reportedcomment" : false,
    "_id" : "8d2b002b-40a2-476d-b06e-7bd675269476",
    "body" : "> It’s more about getting an in person interview timely.\n\nFor many people, conditional approval takes a long time to get. That's the concern when people say it takes a long time to get GE. ",
    "username" : "tariqabjotu",
    "timestamp" : "2024-12-23T12:43:15Z"
  }, {
    "reportedcomment" : false,
    "_id" : "d420ac9d-2512-4fa0-9322-db2328855f2c",
    "body" : "GE includes Precheck, so I don’t see how Precheck can be better, at least in terms of benefits. And Precheck is $78, not $35.",
    "username" : "tariqabjotu",
    "timestamp" : "2024-12-23T14:33:31Z"
  }, {
    "reportedcomment" : false,
    "_id" : "34f3c9f6-ba56-47f9-9305-95c69ea34ead",
    "body" : "That’s not normal.",
    "username" : "tariqabjotu",
    "timestamp" : "2024-12-23T14:28:55Z"
  }, {
    "reportedcomment" : false,
    "_id" : "c6fa29dd-f779-4553-91b8-0ce6db2f546c",
    "body" : "Just answer the question buddy. If you can’t then 🤫",
    "username" : "EinKaiser",
    "timestamp" : "2024-12-23T14:19:42Z"
  }, {
    "reportedcomment" : false,
    "_id" : "bdbefaa3-1d7e-4c33-8f58-128c7be3f8cc",
    "body" : "It doesn't really matter the race or ethnicity or even age. I know a non-white family, one of two kids was approved overnight, the other kid and two parents are still waiting three months later. Otherwise same travel patterns. There's no real rhyme or reason to it.",
    "username" : "toxicbrew",
    "timestamp" : "2024-12-23T12:58:51Z"
  }, {
    "reportedcomment" : false,
    "_id" : "30a9f1f7-31fa-48d4-8d6d-936fa6604e2c",
    "body" : "It seems to be hit or miss. I would give yourself plenty of time for approvals, the in person interview, and getting the card. I applied prior to March 2024 and had a conditional\napproval right away. I got an in person interview end of June 2024 and was approved right away. So I had plenty of time before traveling abroad in August 2024.",
    "username" : "Gypsy_M0th",
    "timestamp" : "2024-12-23T14:05:53Z"
  }, {
    "reportedcomment" : false,
    "_id" : "43f2abb3-d278-4889-bbfd-1c52c8649ce9",
    "body" : "For some people it’s conditional approval. For some people it’s the in person interview. For some people it’s both.",
    "username" : "Gypsy_M0th",
    "timestamp" : "2024-12-23T12:46:41Z"
  }, {
    "reportedcomment" : false,
    "_id" : "c4a904bf-d123-441a-975d-8bb237fd8af8",
    "body" : "Fine. There is no time frame. Some people get approved in a week, some take months.\n\n\nWhat now? Either way, you still need to wait!",
    "username" : "maverick4002",
    "timestamp" : "2024-12-23T14:20:41Z"
  }, {
    "reportedcomment" : false,
    "_id" : "47e8a0c0-f8a3-4770-8a81-498995a59570",
    "body" : "But you said it's \"more about getting an in person interview\", giving the impression that *that* is the cause of the long approval time. I doubt there would be so many complaints or warning if it were, since getting an interview can be controlled. You can go to other locations, do enrollment on-arrival, or just constantly check for cancellations.",
    "username" : "tariqabjotu",
    "timestamp" : "2024-12-23T12:52:09Z"
  }, {
    "reportedcomment" : false,
    "_id" : "dff57b7c-774c-4e98-ada1-36ab07756340",
    "body" : "Yes, and you can’t get the in person interview timely without the conditional approval.",
    "username" : "Gypsy_M0th",
    "timestamp" : "2024-12-23T13:02:00Z"
  }, {
    "reportedcomment" : false,
    "_id" : "b1ffc088-fe39-4182-87ad-492f1aebc5f5",
    "body" : "You are either changing what you’re saying or you’re missing the point. Obviously you can’t schedule an interview until after you’ve received conditional approval, but your repeated statement that the issue is about “getting the in person interview timely” suggests that the issue is the period between conditional approval and an opportunity for an interview, i.e. scheduling an interview. That can take time, sure, but this can be shortened substantially depending on the applicant’s flexibility and eagerness. If that was the only issue, we’d get far fewer people concerned about GE times.\n\nThe concern people have is in regards to the time between application and conditional approval, which is completely out of the applicants’ control, and is what most people mean when they say it takes a long time to be approved. Given your experience of how quickly you received conditional approval, you may not realize how big of an issue that part can be.",
    "username" : "tariqabjotu",
    "timestamp" : "2024-12-23T14:14:51Z"
  } ]
}