{
  "_id" : "fc95f4de-1638-4723-befc-8293f443c2d6",
  "community" : "Cologne",
  "username" : "kundensupport",
  "post" : "Welcome to Cologne. Visiting our city and looking for advice from locals or have a quick question? This is your thread! [FAQ]",
  "timestamp" : "2021-12-17T16:51:53Z",
  "numcomment" : 231,
  "reportedpost" : false,
  "comment" : [ {
    "reportedcomment" : false,
    "_id" : "c6129a67-df0b-4ccb-87c9-2e919fc4cdaa",
    "body" : "u/kundensupport - this is a great effort. Please don't forget about the Champions League winners of 2051 [Viktoria Köln](https://www.viktoria1904.de/).  Currently in the 3. Bundesliga.\n\nIn the museums section I would push the Ludwig because it truly is a world class museum.",
    "username" : "Caladeutschian",
    "timestamp" : "2021-12-17T23:20:23Z"
  }, {
    "reportedcomment" : false,
    "_id" : "cc8046b9-5310-4e26-ae46-b0a3be6e4524",
    "body" : "I’m planning a trip for this weekend (April 22 – April 24, 2022) and heard this is a good time of year to see tulips in bloom. Does anyone know good farms or places to see tulip fields? Maybe even a short train ride from the city center? Thank you all! 😄🌷🌷🌷🌷",
    "username" : "nu11ptr",
    "timestamp" : "2022-04-21T20:01:38Z"
  }, {
    "reportedcomment" : false,
    "_id" : "f9772bc3-832a-485a-97e3-5e0a9cb028bf",
    "body" : "Hello, I'm interested in visiting Cologne during the end of the Carnival, I think its called Crazy Days. Would this be a good year to visit or is it likely that there will be fewer or smaller events due to Covid Restrictions? \n\nIf it is a good year to attend, which days do you think are best to attend and do you need to purchase tickets in advance. \n\nThank you!",
    "username" : "camdencailin",
    "timestamp" : "2022-01-24T17:25:04Z"
  }, {
    "reportedcomment" : false,
    "_id" : "6308495c-59d6-427b-89e2-34c353912dfa",
    "body" : "u/yaroslaw and/or u/Tischlampe - Hi Mods - we never really see you around here but can you make this thread a sticky thread - there is a lot of really good info here which gets asked over and over again.",
    "username" : "Caladeutschian",
    "timestamp" : "2021-12-17T23:15:42Z"
  }, {
    "reportedcomment" : false,
    "_id" : "501436af-9008-407f-94cc-5c4d212ebd28",
    "body" : "Is there a fixed closing hour for bars & restaurant due covid?",
    "username" : "lietaert",
    "timestamp" : "2021-12-17T16:51:53Z"
  }, {
    "reportedcomment" : false,
    "_id" : "871b9089-f542-49ef-b353-98b0afad1614",
    "body" : "Nice one.  Adding a solo travel thread: [https://www.reddit.com/r/cologne/comments/osrwic/cologne\\_solo\\_travel/](https://www.reddit.com/r/cologne/comments/osrwic/cologne_solo_travel/)",
    "username" : "arf_arf1",
    "timestamp" : "2021-12-17T18:41:42Z"
  }, {
    "reportedcomment" : false,
    "_id" : "f064ab46-2001-45af-8d53-a45e1d22b5f7",
    "body" : "Mods? Netter Versuch 😂",
    "username" : "HansReinsch",
    "timestamp" : "2021-12-18T00:40:37Z"
  }, {
    "reportedcomment" : false,
    "_id" : "9448fac4-4874-4353-88bc-6a66003b17f3",
    "body" : "Just heard I’m going on a suprise weekend to Cologne tomorrow. This thread is a true life saver",
    "username" : "dennisut",
    "timestamp" : "2022-04-21T14:53:59Z"
  }, {
    "reportedcomment" : false,
    "_id" : "0d0effd2-874e-45fb-910d-f1beceb45b46",
    "body" : "Greeting all :) I wonder if there are any nice parks or running paths in/around the city center that you would share with me please. Given the heat, I’ll check them out in the early morning or late evening - or anytime ones with lots of leafy trees would be appreciated!",
    "username" : "Apprehensive_Fox_",
    "timestamp" : "2022-07-19T12:40:19Z"
  }, {
    "reportedcomment" : false,
    "_id" : "50418acd-558e-4da0-93ba-957296eb7e13",
    "body" : "Cologne also has a racecourse for horse racing, the Galopp-Rennbahn in Weidenpesch.\nhttps://www.koeln-galopp.de/",
    "username" : "Common_Apple_7442",
    "timestamp" : "2021-12-18T10:43:33Z"
  }, {
    "reportedcomment" : false,
    "_id" : "8bc6f906-ca27-4dc4-9cd6-092e19abc44a",
    "body" : "Bin auf der Suche nach einer 3 Zimmer Wohnung Lindenthal/Sülz, nahe Stadtwald oder Grüngürtel bis 1500€ warm. Vielleicht hat man ja hierüber Glück ;)",
    "username" : "AchtColaAchtBier",
    "timestamp" : "2024-05-23T09:27:33Z"
  }, {
    "reportedcomment" : false,
    "_id" : "9e3d1f37-8471-45bf-aa7e-2458431aa1da",
    "body" : "Hello! I will be visiting Köln with a group of 6/7 friends in just over a month’s time. We’re in our late thirties/early forties and visit a different German city each year to see a football match. Can anyone please recommend a lively beerhall in the city that serves good, local food? We have had some incredible platters in the likes of Düsseldorf for example. Thanks!",
    "username" : "Legal-Plankton-7306",
    "timestamp" : "2024-03-18T21:44:58Z"
  }, {
    "reportedcomment" : false,
    "_id" : "9355027b-9268-47bb-91f6-9abc0cf71755",
    "body" : "I will be visiting Cologne next weekend (March 29th - 31st) which is unfortunately right around Easter and I am afraid that most shops and restaurants will likely be closed. Do you know if cafes/restaurants will be open atleast on one of these dates or should we pack sandwiches 😁?",
    "username" : "Unlikely_Moose6228",
    "timestamp" : "2024-03-24T19:08:27Z"
  }, {
    "reportedcomment" : false,
    "_id" : "af1cb521-f9a6-49ba-9f91-cd81c02920ab",
    "body" : "Hello! What's the easiest way to get to Königswinter/Drachenfels? Wife and I will be staying close to the train station in Cologne, but also are considering a day trip to Bonn.\n\nWould it make more sense to go to Drachenfels from Bonn since it's closer? If so, is there a tram line we can take from there? Thanks!",
    "username" : "None",
    "timestamp" : "2024-03-24T23:26:42Z"
  }, {
    "reportedcomment" : false,
    "_id" : "305ea759-b61f-4b50-a2c4-7722c48a956c",
    "body" : "Hi to all.\n\nAt the start of May I will visit the Cologne city with a friend.\n\nWe are going to stay near the Koln Airport Area, in Porz.\n\nMy question is if there is a gym nearby that offers a daily passage for 2-3 workouts during our staying.\n\nNo powerlifting specific gyms or crossfit. Just regular free weights and machines.\n\nAnd also, what the price could be for each day.\n\nThanks a lot!",
    "username" : "Skid_RAW",
    "timestamp" : "2024-04-06T01:47:47Z"
  }, {
    "reportedcomment" : false,
    "_id" : "b7ae17a5-5822-4b4c-b24c-b36229a6c88c",
    "body" : "Hello what could I see in the area near Carlswerk Victoria & Club Volta ? thanks",
    "username" : "themode75",
    "timestamp" : "2024-04-07T05:44:50Z"
  }, {
    "reportedcomment" : false,
    "_id" : "f0c39ccb-a3c7-4947-8034-cbe06720396b",
    "body" : "Hello!\n\nI would have a question about the public transport: We will be travelling to Köln for a few days later, in the summer, and I'm thinking to get a weekly ticket.\n\nHowever, when I was looking around, I found KVB and VRS.. what's the difference between them? They both have their own phone app, and both of them offers the same Wochenticket for Köln (1b). What is the difference? Or if you buy the ticket in the KVB or VRS app, you get the exact same ticket you can use the exact same way?\n\nIs it a good idea to buy the ticket in the app at all? Or is it better/easier to get it in a paper form (I assume they have some ticket machines at the Central Station and probably at most/any stops)? When we travelled to Amsterdam, I learned that their mobile app had some limitations (you need to take special doors to get on/off because you cannot scan the mobile ticket just wherever you want), so in Amsterdam I ended up buying a regular ticket instead... This is why I'm asking.",
    "username" : "fleetcommand",
    "timestamp" : "2024-04-26T17:36:52Z"
  }, {
    "reportedcomment" : false,
    "_id" : "d9acefac-eb02-4405-a423-b2576214ff3a",
    "body" : "Hi! I'm planning to go to Germany during August. We're arriving through Frankfurt and wanted to buy a Deutschland ticket to be able to move around. Has anyone used this ticket to go from the airport to Köln? I know that S-Bahns and Regional Bahns are included but it's a bit confusing and Google doesn't show all the routes. One of the only ones I found was that you could take a RE2/RE4/RE3 from the regional station at the airport and go to Koblenz (Some suggested switching with an s Bahn) then in Koblenz take a RE5 Bahn to Köln. Is this allowed with the ticket? I know there's ticket to fly but it's more expensive as we would still buy the Deutschland ticket.",
    "username" : "mrperfectlyfine99",
    "timestamp" : "2024-05-16T18:59:43Z"
  }, {
    "reportedcomment" : false,
    "_id" : "cca2680d-fb85-4c9a-8ee7-81770f90b0fb",
    "body" : "Hello all / Hallo liebe Alle,\n\nI am currently tryvelling to Köln for a day only. I am looking for meeting some lovely local people to chat with and enjoy a few good beers. Ideally I'd also love to use this chance to meet some ladies. Can you guys recommend a bar where I can grab one or two drinks where it is easy to get in touch with some local folks?\n\n  \nTo be honest the expectation is to just have a good time and some great conversation. Meeting a nice lady would just be the icing on the cake and really not a priority for me. Thanks! (I did look already into the recommendations above for anyone wondering, however I wanted to get some input from you guys).",
    "username" : "Engineering_Brat",
    "timestamp" : "2024-05-20T05:01:53Z"
  }, {
    "reportedcomment" : false,
    "_id" : "522c1bbe-b5a7-4130-a179-e43df986918c",
    "body" : "Im going to Cologne from brazil in 2 months for working and I want to play football in germany regulary, but i dont know how found is this whitout no friends. Anyone have a tip for this?",
    "username" : "Emotional-Focus4295",
    "timestamp" : "2024-05-20T15:21:58Z"
  }, {
    "reportedcomment" : false,
    "_id" : "30518266-ffa6-4b48-896c-e4fa2323e9af",
    "body" : "Best nightlife Monday and Tuesday ?",
    "username" : "ilovehelen8",
    "timestamp" : "2024-06-17T20:04:44Z"
  }, {
    "reportedcomment" : false,
    "_id" : "3fbbf8b4-8897-438e-96e1-deb195a2deb2",
    "body" : "Where would be the best place for a solo tourist to watch the Germany game tonight?",
    "username" : "sunburn95",
    "timestamp" : "2024-06-29T15:04:12Z"
  }, {
    "reportedcomment" : false,
    "_id" : "5b4872e0-f47f-46e8-b3c3-b8b45691feea",
    "body" : "Just how difficult is it for a student to find housing? 😅 average rent?",
    "username" : "melancholicpanda96",
    "timestamp" : "2024-07-07T17:07:35Z"
  }, {
    "reportedcomment" : false,
    "_id" : "97639c08-5564-48c4-a69e-3d69125d1442",
    "body" : "What are some fun group activities in and around köln? Im visiting köln for 2 days at the end of august with a group of 9 guys, im responsible for booking a activity to do saturday morning/midday.\n\nIve only managed to the find the stuff everyone reccomends (chocolate museum, the dom, a boat ride on the river, ect). But these activities arent really suited to my group. I was hoping for something more active (in the past weve gone karting, axe throwing, shooting, karting, climbing). Im not good at german so i struggle to find stuff on google. I dont mind if its a bit ouside of the city, we have cars.\n\nAny suggestions would be welcome!",
    "username" : "Toetsenbord",
    "timestamp" : "2024-08-09T10:59:18Z"
  }, {
    "reportedcomment" : false,
    "_id" : "031ec729-6ccc-443d-afd0-509d6f55d039",
    "body" : "dm me i need some ❄️",
    "username" : "GOT2BEATS",
    "timestamp" : "2024-08-10T21:02:10Z"
  }, {
    "reportedcomment" : false,
    "_id" : "daa65c2c-ae78-4681-a4f4-20ae03a25688",
    "body" : "Is alcohol-free Kölsch a thing? If so, where would be good to get one?",
    "username" : "tiggytigtigtig",
    "timestamp" : "2024-08-14T09:46:24Z"
  }, {
    "reportedcomment" : false,
    "_id" : "1ac9c8a4-fdd3-4a52-bdd6-ffbaf5b00ecd",
    "body" : "Hi, another question from me.. I've downloaded the KVB app in the hopes of being able to purchase single tickets easily. However, it seems like I can't register a UK address. Is there a way around this? Ideally I'd like to be able to register a bank card on the app so I can just make purchases as needed. Danke!",
    "username" : "tiggytigtigtig",
    "timestamp" : "2024-08-15T08:14:04Z"
  }, {
    "reportedcomment" : false,
    "_id" : "bac19ba2-d6c9-4d9e-8efd-4ddc91351234",
    "body" : "Hello! Looking for the safest area for a young American woman moving to Cologne to live in or near the city? Preferences: pretty, close to arts & cultural activities, quiet at night.",
    "username" : "Fit-Ad-5145",
    "timestamp" : "2024-09-18T05:19:44Z"
  }, {
    "reportedcomment" : false,
    "_id" : "ad2f4c2a-0e4d-454d-bd29-954901028580",
    "body" : "I live in Cologne and I'm interested to know I nice girl honest .I 'm ready for a  relationship.",
    "username" : "No-Art-1158",
    "timestamp" : "2021-12-27T16:19:13Z"
  }, {
    "reportedcomment" : false,
    "_id" : "4050e54c-3cfb-4608-aada-9a1c775acb5b",
    "body" : "Ive wanted to ask about the transportation system for a while. so is there really no option like the Semester pass that you get by being at a University?",
    "username" : "RebelUpwards",
    "timestamp" : "2021-12-17T19:54:41Z"
  }, {
    "reportedcomment" : false,
    "_id" : "18ae6b2a-5068-438d-b8c6-c9942cd28477",
    "body" : "Is there a free parking around the zentrum?\n\nThanks alot in advance",
    "username" : "equinoxDE",
    "timestamp" : "2021-12-18T08:23:10Z"
  }, {
    "reportedcomment" : false,
    "_id" : "34e1c7f8-e83a-4081-b92a-2ab071fc20d7",
    "body" : "Will be in Köln the last week in December until January 2nd. What do locals do for New Years Eve? Or what are our options in Corona Time?",
    "username" : "No_Method_4303",
    "timestamp" : "2021-12-21T11:06:36Z"
  }, {
    "reportedcomment" : false,
    "_id" : "d2d04fba-9426-4013-88b8-3b56ccb0a0b1",
    "body" : "I'm thinking of planning a last min trip to Europe with a stop Köln and Trier in the next 2 weeks. Would it be worth visiting at this current moment?",
    "username" : "TradingToilets4Shoes",
    "timestamp" : "2021-12-21T11:28:13Z"
  }, {
    "reportedcomment" : false,
    "_id" : "94d44206-fb87-4fba-be4b-f7f96bbcf93c",
    "body" : "[deleted]",
    "username" : "None",
    "timestamp" : "2021-12-24T21:57:52Z"
  }, {
    "reportedcomment" : false,
    "_id" : "278f5ce2-d29d-4a5b-8d18-3851fbfad022",
    "body" : "Hello! I am in Cologne right now with my friend and we are looking for a new year, s eve party or event, any recommandations?",
    "username" : "Ambitious-Fox-4042",
    "timestamp" : "2021-12-31T09:46:39Z"
  }, {
    "reportedcomment" : false,
    "_id" : "1564c1a8-d727-4a0a-b8fc-feb66b818d40",
    "body" : "I heard internet access in Köln is excellent compared to most of Germany, especially in fiber rollout, is this true? I'm an IT guy who might move there in the future and a very strong local network infrastructure is really important to me, both for fun and work",
    "username" : "arctictothpast",
    "timestamp" : "2022-01-04T08:01:22Z"
  }, {
    "reportedcomment" : false,
    "_id" : "23a69a26-981a-461d-9bc8-52083ecf6063",
    "body" : "Where can I buy plants from locals? Something like a local plant exchange or something to trade or buy a philodendron cutting or something?",
    "username" : "veggiemon_star",
    "timestamp" : "2022-01-16T03:02:03Z"
  }, {
    "reportedcomment" : false,
    "_id" : "5de4d549-0dce-42ea-be4d-cc7b87f1e7bb",
    "body" : "I'm planning a visit to Cologne on February and I'll be coming from Netherlands by car.  Most likely I would take a hotel somewhere in the city center... therefore I'm going to need a place for park the car. Not necessarily in the city center.\n\nThe Low Emissions Zone seems to require a sticker that I don't have. My car is a 2018 gasoline, can I still arrive to the city center and park on the streets or in a parking?\n\nIf that's absolutely not possible, where can I drop the car so I can enter into the city? In that scenario, what would be the cheapest option?\n\nAppreciated.",
    "username" : "Bloodsucker_",
    "timestamp" : "2022-01-29T22:37:41Z"
  }, {
    "reportedcomment" : false,
    "_id" : "484694af-3c8f-4859-a0b2-7402627ef488",
    "body" : "heyhey - i'm looking to go to a cat cafe in coming weeks, it seems one in Cologne is closed but do you guys know of/recommend any in surrounding cities?",
    "username" : "Lou_Scannon",
    "timestamp" : "2022-02-06T19:56:31Z"
  }, {
    "reportedcomment" : false,
    "_id" : "e629aa73-7375-4909-94e3-d0b34e28b848",
    "body" : "Any Ideas what to do with a two year old? We will go to the zoo and swimming. Like any other two year old he is into excavators and firetrucks. We traveling by car, so anything with about an hour drive is welcome. \n\nIs the zoo maybe big enough for two days?",
    "username" : "Zahnriemen",
    "timestamp" : "2022-02-22T18:58:11Z"
  }, {
    "reportedcomment" : false,
    "_id" : "311eff5e-e51d-44bd-9a34-fe3cf2763e66",
    "body" : "I'm new in Germany and got an ING girocard. I want to see how much cash I have in it after paying my rent but haven't received an ITAN list or something like that. Anyway until I receive it is there some method to seeing how much is in your card? I tried a few ATM machines but they don't have an option to do that.",
    "username" : "1throwaway3091",
    "timestamp" : "2022-03-21T17:00:20Z"
  }, {
    "reportedcomment" : false,
    "_id" : "02fcfcdb-b845-4182-9864-41ba0f2d273b",
    "body" : "We will be traveling to Köln at the end of April, and I was told that everything is closed on Sundays. An internet search only finds results from last year at the latest. Can someone help me to understand what is open on Sundays in Cologne?",
    "username" : "Picnut",
    "timestamp" : "2022-04-12T12:57:12Z"
  }, {
    "reportedcomment" : false,
    "_id" : "1fa1b4ed-ff42-4caf-a69b-592d2bfac7b6",
    "body" : "Hello everybody!\nI have German girlfriend from Cologne and I would like to ask her in her dialect: “I want to drink beer with you”.\nDo you have a certain way to say that or no?\nAlso you can tell me other cool phrases that I can say.",
    "username" : "None",
    "timestamp" : "2022-04-13T21:35:38Z"
  }, {
    "reportedcomment" : false,
    "_id" : "bd1d9323-1577-4fe4-825d-06f201666080",
    "body" : "Hallo! I'm looking for a hotel (anywhere in or near cologne, west of the rhine) with a nice bathtub...which seems hard to find with all these fancy showers! Any recommendations are welcome :) TIA",
    "username" : "veggiemon_star",
    "timestamp" : "2022-04-18T10:18:49Z"
  }, {
    "reportedcomment" : false,
    "_id" : "922e4886-1dda-4611-82eb-ebe70a9e2a93",
    "body" : "Hey Guys! Im looking for a nice park in de city centre where we can play spike ball with a group of 15 people. Would be really nice if there was like a bar/foodtruck next to it where we could buy food/drinks. Or is it allowed to bring your own BBQ in a park?",
    "username" : "TQairstrike",
    "timestamp" : "2022-04-25T14:23:26Z"
  }, {
    "reportedcomment" : false,
    "_id" : "685e136f-f6d6-45e2-9052-1f893193830d",
    "body" : "[deleted]",
    "username" : "None",
    "timestamp" : "2022-05-06T12:43:11Z"
  }, {
    "reportedcomment" : false,
    "_id" : "47e23ef8-98b0-4d8f-b058-bcd408fe1ca7",
    "body" : "I will be in koln for 1,5 hours for a train transfer. Where do I go from hauptbahnhof? I have luggage, so I can't walk far. Just a nice bar, park, or maybe cheap eating place? Any ideas?",
    "username" : "climbingbess",
    "timestamp" : "2022-05-09T15:00:55Z"
  }, {
    "reportedcomment" : false,
    "_id" : "fb7096a5-f87f-4409-8f73-cda1b0a01350",
    "body" : "Is there a fotball pub where I can watch Norwegian games?",
    "username" : "Actual-Past745",
    "timestamp" : "2022-05-16T11:37:49Z"
  }, {
    "reportedcomment" : false,
    "_id" : "e9fb6454-2a61-4a0a-8140-b0dbd2f37940",
    "body" : "Could you recommend any student residence for ERASMUS students? I'm looking for a place with a lot of common rooms and spaces to meet new people. Also a big shared appartment (those for more than 6 or 8 people) could work. Thanks!! :)",
    "username" : "irenedix0n",
    "timestamp" : "2022-06-08T20:43:27Z"
  }, {
    "reportedcomment" : false,
    "_id" : "2418ec3b-4e0e-413f-9581-8f1799adecc6",
    "body" : "Does Paffgen serve other beers than Kölsch? Looking for darker and/or stronger beers",
    "username" : "veggiemon_star",
    "timestamp" : "2022-07-12T15:52:50Z"
  }, {
    "reportedcomment" : false,
    "_id" : "dbbc6915-9cda-4b8f-b00c-70518b153924",
    "body" : "Hey guys !\nMy girlfriend (25) and me (27) are thinking about moving to cologne. We‘re from bavaria, i‘m a beer lover and we are something like hippieesque stoner/psychrock fans. \nSo what do you think? Are there any tips about which quarters would fit for a living? Is there a music scene we shouldnt miss? Is there beautiful nature around for hiking or something like that? Are there places to go for a swim in the rhine? Will the people generally hate bavarians (haha)? Etcetcetc…\n\nAlso i‘m seeking for a r&d job in renewable energies in that area. \nI would be glad for some information or hints by locals! \nThanks guys",
    "username" : "anytoub",
    "timestamp" : "2022-07-24T10:36:27Z"
  }, {
    "reportedcomment" : false,
    "_id" : "4289f66d-f923-42dd-9f1c-3d0c39e8be7b",
    "body" : "Hi there, I was just wondering if anyone knows if there are any private DJ studios available to hire just for a few hours in Cologne?",
    "username" : "Shemf1886",
    "timestamp" : "2022-08-15T18:18:30Z"
  }, {
    "reportedcomment" : false,
    "_id" : "8c21f162-175e-452d-8025-f9be6e7a4291",
    "body" : "[deleted]",
    "username" : "None",
    "timestamp" : "2022-08-25T15:29:03Z"
  }, {
    "reportedcomment" : false,
    "_id" : "59c020c0-68eb-4a96-8b34-11834db5c2fc",
    "body" : "Hello wonderful people of Cologne, \nI will be visiting your city on Saturday by car (no other option available unfortunately) to see a single game of basketball during Eurobasket and fulfill someone’s wish. I just read that some streets will be closed from 10 AM on Saturday due to triathlon happening on Sunday. Any advise from locals where to park in some close proximity to Arena with this street closure in mind?",
    "username" : "Esh2k",
    "timestamp" : "2022-09-01T23:11:31Z"
  }, {
    "reportedcomment" : false,
    "_id" : "c15455c8-ca6e-436b-be27-2b04cc05f6f4",
    "body" : "Hey! I'm trying to find hair salons/locticians that do sisterlocks or microlocs maintenance. Any recommendations or suggestions of how to find stuff locally would be much appreciated. Thanks!",
    "username" : "ander876",
    "timestamp" : "2022-09-11T19:43:37Z"
  }, {
    "reportedcomment" : false,
    "_id" : "5a0f136a-75a8-49eb-a3c6-e2c4d2f26151",
    "body" : "What’s the best party’s for New Years Eve?",
    "username" : "None",
    "timestamp" : "2022-09-23T12:34:59Z"
  }, {
    "reportedcomment" : false,
    "_id" : "85d3c158-cf00-46ae-a977-87c0f42b0c50",
    "body" : "Hello, I'm coming to town in early December from the states. I'll be in town for 3 nights. Just looking to experience your beautiful city. Please recommend several good hotel choices. Thanks",
    "username" : "Settlta",
    "timestamp" : "2022-09-25T22:31:11Z"
  }, {
    "reportedcomment" : false,
    "_id" : "2b174ce6-5f74-4685-a170-e2f04639b8d6",
    "body" : "Where can I find a site that tells me what all the upcoming events are and how to book?",
    "username" : "None",
    "timestamp" : "2022-09-27T12:26:18Z"
  }, {
    "reportedcomment" : false,
    "_id" : "0a30f5e6-8d16-4bdb-bfb9-e4c9d141af58",
    "body" : "Was ist los in Köln/Düsseldorf am Wochenende vom 17 - 19.3.23?\n\nAlle Hotels sind sacketeuer (z.B. A&O Neumarkt 240 Euro/Nacht) und ich finde kein besonderes Event, das da stattfinden würde?",
    "username" : "Fluktuation8",
    "timestamp" : "2022-10-12T14:20:12Z"
  }, {
    "reportedcomment" : false,
    "_id" : "cb18ebd8-15ed-4c9c-ba59-35ad091a1351",
    "body" : "My wife and I will be going to Cologne Dec 22nd-24th to see the Christmas Markets before they close. We are looking for recommended places to stay (hotel or AirBnB). Just wondering what your suggestions would be. Thanks in advance!",
    "username" : "TravelThroughLife",
    "timestamp" : "2022-11-05T23:25:18Z"
  }, {
    "reportedcomment" : false,
    "_id" : "9f2d547e-a61f-4cd4-a42c-86302182cb12",
    "body" : "Hello,   \n\n\nI am visiting Cologne with my friends from Canada from Jan 26 to Feb 5th and was wondering if there are any cool events happening during that time and if you have any suggestions as to where to go and visit? \n\n&#x200B;\n\nThanks a lot!",
    "username" : "Physical_Spare_6722",
    "timestamp" : "2022-11-16T22:28:37Z"
  }, {
    "reportedcomment" : false,
    "_id" : "de44756c-b56a-4e1f-9841-aa18f270621c",
    "body" : "I have some work travel at the end of the month in Cologne, and I am flying into Düsseldorf Airport. What is the best way to get to Cologne (I am staying at Hotel Pullman Cologne). I see I can book a car using Sixt, is that pretty trusted? I also see I can take a train (D-Flughafen Bf) as well. Any insight into what is the \"best way\". I am landing early afternoon on a weekday if that is important as well. Thanks for the help!",
    "username" : "isaac2004",
    "timestamp" : "2022-11-17T21:05:22Z"
  }, {
    "reportedcomment" : false,
    "_id" : "d47d4c0a-4ebf-4acf-883e-f7fa4e11ad48",
    "body" : "Quick question- Visiting from AMS . Is herb/ Mary Jane available?",
    "username" : "cheeseandhoney246",
    "timestamp" : "2022-11-18T12:15:26Z"
  }, {
    "reportedcomment" : false,
    "_id" : "e317e59d-556f-4d09-a96d-005e1ac986d9",
    "body" : "Hello! I am wondering until when the Weinachtsmarkt will be? The official site only lets me look as far as 30.11, but other sources say 23.12, which makes more sense. Can someone tell me which is right?",
    "username" : "FunkierMonk",
    "timestamp" : "2022-11-19T10:03:52Z"
  }, {
    "reportedcomment" : false,
    "_id" : "cd350364-87aa-49ea-9338-00755881fd12",
    "body" : "Hey all! My fiance, a couple friends, and I are in town for the Christmas markets and we were hoping to be able to watch the Netherlands USA football game tonight. Do you have any recommendations on where a good place to watch it would be? \n\n(For some context we are all from the States but are now living in the Netherlands so we have a bit of a vested interest 😂)",
    "username" : "ApprehensiveBase1813",
    "timestamp" : "2022-12-03T08:10:32Z"
  }, {
    "reportedcomment" : false,
    "_id" : "a5fde47e-04c3-46b9-9ac4-575dcda85556",
    "body" : "My girlfriend and I are looking for a nice place to eat on NYE (which is also our anniversary). The kind of place which will maybe cost £100-£150 for us to both have two courses and say 5 drinks each. \n  \nI am not picky with the type of place, I just like good food! My girlfriend is vegetarian and bonus if the place does nice cocktails. Also worth noting she loves Italian food but it doesn’t have to be an Italian.",
    "username" : "bulls9596",
    "timestamp" : "2022-12-04T14:19:32Z"
  }, {
    "reportedcomment" : false,
    "_id" : "72870431-3488-42dd-8c4d-a18bf8e2364b",
    "body" : "Does anyone have any general recommendations of what to do in the city? I am visiting with my girlfriend from Dec 30th - Jan 2nd to celebrate our one year anniversary and NYE.",
    "username" : "bulls9596",
    "timestamp" : "2022-12-04T14:21:31Z"
  }, {
    "reportedcomment" : false,
    "_id" : "3e35d084-bfd3-4ba9-a9fb-daf7bf1fcb20",
    "body" : "Hiya! What P&R’s can I park in and get a tram to the Center without driving into the low emissions zone? I don’t have a sticker and now it’s too late to register and have it delivered on time",
    "username" : "yappyboomerang2",
    "timestamp" : "2022-12-04T16:35:10Z"
  }, {
    "reportedcomment" : false,
    "_id" : "4f56f22e-8459-4c91-abd4-169e73c05cc8",
    "body" : "Hello, I will be arriving in Cologne on December 24th and was looking into Christmas Markets. It seems all of them close on the 23rd, except for \"Winter Magic at the Lake\". If indeed this market is open on the 24th and 25th, has anyone been in previous years? Is it worth a visit?\n\nThanks!",
    "username" : "Rockabillyjonny",
    "timestamp" : "2022-12-04T18:09:59Z"
  }, {
    "reportedcomment" : false,
    "_id" : "306f02e5-cb8f-4e54-b5c7-fff2546b3212",
    "body" : "Help! \n\nIm planning a day trip to Bonn from Cologne, can the SchönerTagTicket NRW be used for all the public transport in Bonn as well as Cologne? \n\nAlso, if I want to go to Düsseldorf, can I buy this same ticket?",
    "username" : "Interesting-Wish-836",
    "timestamp" : "2022-12-16T20:32:21Z"
  }, {
    "reportedcomment" : false,
    "_id" : "01ad180c-08a8-4189-9b34-6bcc13f0606c",
    "body" : "Hello,\n\nI am planning to take my nephew (14) to Cologne with me next year, and I was hoping to get recommendations as to child/teen friendly attractions for him that will keep him excited? I am not sure he will appreciate the incredible nature and food as much as I will! \n\nThank you",
    "username" : "OrangePr1ncess",
    "timestamp" : "2022-12-30T17:55:55Z"
  }, {
    "reportedcomment" : false,
    "_id" : "5d631359-8a90-4fc3-9c72-c8fc5e3d9377",
    "body" : "[deleted]",
    "username" : "None",
    "timestamp" : "2022-12-31T21:08:34Z"
  }, {
    "reportedcomment" : false,
    "_id" : "9e1df0bb-b57e-4756-8253-e7a2dcbbc41c",
    "body" : "Do you need a car to bring stuff over to the Wertstoffhof in Ossendorf? Or is passing by on foot an option?",
    "username" : "cosaya",
    "timestamp" : "2023-01-08T14:45:23Z"
  }, {
    "reportedcomment" : false,
    "_id" : "39637a18-5d96-4650-80e4-7c2c307da0ff",
    "body" : "Hey folks, I have applied for a job that is fully remote but the jobs location is in Cologne.  I wanted to enquire about how easy it is to find a home there?  I previously spent time in Berlin where homes are like gold dust, and wondered if it was a similar scenario in Cologne?\n\nTIA!",
    "username" : "Prize_Passion_8437",
    "timestamp" : "2023-01-14T12:34:45Z"
  }, {
    "reportedcomment" : false,
    "_id" : "b075c458-b570-44ac-a4e0-a2c62ed392bb",
    "body" : "i am going to participate the rose monday and wanna know where is the best cafe or milk tea that i can sit there and drink something and watch the parade, so pls any reccomedations",
    "username" : "diboadam",
    "timestamp" : "2023-01-18T01:56:20Z"
  }, {
    "reportedcomment" : false,
    "_id" : "875df1c6-0646-4631-8408-caacbd96857b",
    "body" : "Visiting next week \n\nMonday - Monday\n\nSeeing a few football matches, \n\nbut what else is must see?\n\nWhere is the best cheap eats/beer that locals would go to?\n\nI know a few kolsch breweries already, but would like to know your favourites.\n\n&#x200B;\n\nWould anyone like to meet up?",
    "username" : "Electronic-Coat1607",
    "timestamp" : "2023-01-19T18:47:35Z"
  }, {
    "reportedcomment" : false,
    "_id" : "42c56ed9-2b46-4548-b769-87107cbee72e",
    "body" : "Any good places to meet people? Single traveller here arriving tomorrow.",
    "username" : "None",
    "timestamp" : "2023-02-04T13:37:30Z"
  }, {
    "reportedcomment" : false,
    "_id" : "fd0fdeac-0d21-48b8-8871-2b7440cd907e",
    "body" : "I would love to see the FC Köln match against Bochum this Friday night. I tried looking at the ticket resale on the club's official website, but no luck.\n\nIs there any other way to get a ticket? Do you think there will be more available on the day of the match?",
    "username" : "vietdng",
    "timestamp" : "2023-03-08T11:30:12Z"
  }, {
    "reportedcomment" : false,
    "_id" : "6860af7c-6502-4745-bda6-84937926f064",
    "body" : "Hello friends. I will be landing in Düsseldorf with a medium sized check in and a carry on bag. My final destination is Cologne and very close to Koln-Hauptbahnhof. While the general guidance is to take the RE train from DUS airport, I wanted to check if it will be a hassle to board the train with 2 bags and make it impractical? I am not sure what to expect hence reaching out to you all for some guidance. \nDo the trains stop for boarding for just few mins? Lot of crowd situation around 12pm Sunday? Or is it just better to Uber from DUS to  Koln central station? \n\nAny guidance will be helpful.",
    "username" : "Tiny-Secret-8756",
    "timestamp" : "2023-04-11T19:45:27Z"
  }, {
    "reportedcomment" : false,
    "_id" : "9973cff1-5b11-4609-bcef-5b3bab05c60b",
    "body" : "Hi, \n\nI'm coming to Koeln for an internship in the summer. I was wondering if some local people maybe have advice on where to look for flats to rent for summer? Maybe some students leave their flats empty and would like to rent them out while they are away? Do you know where should I look into that?\n\nAny help will be greatly appreciated.   \nCheers",
    "username" : "stasiek_j",
    "timestamp" : "2023-04-20T18:51:52Z"
  }, {
    "reportedcomment" : false,
    "_id" : "2a1e4944-b002-4587-b76c-eb2170e140a1",
    "body" : "Hi all, will be in Cologne in July doing general sight-seeing. Any recommended hotels (or areas to look for a hotel)? Also, any recommended restaurants with good vegetarian options?",
    "username" : "ParticularSeamonster",
    "timestamp" : "2023-04-30T21:59:39Z"
  }, {
    "reportedcomment" : false,
    "_id" : "09b11e5d-764e-4676-a593-b951e3afffb6",
    "body" : "My spouse and I have been using our EURail pass getting around Germany and neighboring countries- we’ve come down with terrible sinus infections and are on the way to Cologne now. I read that I can get Sudafed from a London pharmacy, we’ll be there 3 days from now, but was unsuccessful in finding out if Sudafed was available in Germany. Any chance anyone here knows?",
    "username" : "WishIMayWish1Might",
    "timestamp" : "2023-05-05T10:16:31Z"
  }, {
    "reportedcomment" : false,
    "_id" : "bacc4a6b-129a-45e4-a754-c6f3962ec4bc",
    "body" : "Organising a stag do (bachelor party) - which bars/clubs would be most accommodating to that kind of group? Or what area can we party in?",
    "username" : "Skylark20212021",
    "timestamp" : "2023-05-30T22:32:23Z"
  }, {
    "reportedcomment" : false,
    "_id" : "26439b6b-30fd-43fa-819a-fc8af8674409",
    "body" : "Hey friends, had a great time on a recent trip to Koeln and Aachen, but unfortunately left my laptop in the seat pocket of an ICE train bound for Hamburg. Realised immediately after the train departed, told the guy at DB lost and found, but he seemed super uninterested and just told me to use the website and file a report. Did that, and a few days later I haven't heard anything. Anyone lost stuff on a train? You ever get it back? Guessing I'll just have to grit my teeth and buy a new one, but I'm just curious to get local perspective.",
    "username" : "ijustwantedvgacables",
    "timestamp" : "2023-08-02T15:05:59Z"
  }, {
    "reportedcomment" : false,
    "_id" : "30384581-c198-44d5-9241-1f63ca51e594",
    "body" : "Best Techno Clubs and what part of the city are they?",
    "username" : "None",
    "timestamp" : "2023-08-02T22:48:03Z"
  }, {
    "reportedcomment" : false,
    "_id" : "43434f88-204c-45e4-a764-95d56b8950e4",
    "body" : "Hello! My partner and I (gay guys) are visiting Cologne in mid-September. I'm wondering if there are any outdoor Sunday funday type parties like Piknic Electronik, like we have here in Montreal (not necessarily gay). It's always so fun to party outside on a Sunday afternoon, so hoping to find something like that.",
    "username" : "teej1984",
    "timestamp" : "2023-08-24T15:41:34Z"
  }, {
    "reportedcomment" : false,
    "_id" : "ee5d9f5e-c092-4b41-832f-95b21d00b754",
    "body" : "Hey! We are planning to visit Cologne next week, we will have 4 adults, and kids aged 2, 5, 14. Most of us speak German. We are staying nearby-ish but will only have one full day in Cologne.\n\nCurrently our plan is to see Cathedral > Chocolate Museum > Botanical Garden > RheinSeilbahn > Rheinpark. We'll probably use the Bimmelbahn for at least one of those first two legs, if not both. There should also be some time for meandering around the Cathedral/Chocolate Museum area.\n\nWe will probably just wander and pick somewhere to eat that seems child-friendly on the day, but if anyone knows of any specific cafés/restaurants that are child friendly around these areas, that would be really helpful! I find that knowing where we can reliably get simple food is invaluable for helping days out with little ones go smoothly. I have noted the locations of McDonalds etc in case things get really dire, but would rather avoid that honestly.\n\nAlso - public toilet locations/recommendations? Presumably there are some in the museum but I'm unsure about everywhere else.",
    "username" : "caffeine_lights",
    "timestamp" : "2023-08-28T08:15:23Z"
  }, {
    "reportedcomment" : false,
    "_id" : "772ea314-1e45-42b5-8e01-46dd9a0ec952",
    "body" : "I've booked to come in June next year (hoping to be able to attend one of the euro championship games). I'll be staying near the Ludwig Museum. Is that a good location?\n\nIf I am unable to get tickets to any of the games, where would be a good place to watch them? Do Germany have 'fan parks' like I've experienced in other countries. Basically open spaces with the matches projected onto large screens.",
    "username" : "willemorley",
    "timestamp" : "2023-08-29T12:41:34Z"
  }, {
    "reportedcomment" : false,
    "_id" : "c735a42c-ae82-41a8-8a3d-15245fdd4e89",
    "body" : "Hello everyone. There's a good chance I'll end up working in Koln soon.\n\nSo I'll need a place to live. How should I look on the internet? Just to get a notion, because I will probably get a short rent or airbnb before looking for something more definitive.\n\n&#x200B;\n\nThank you.",
    "username" : "teZtinglotus",
    "timestamp" : "2023-09-04T15:13:07Z"
  }, {
    "reportedcomment" : false,
    "_id" : "a6138cd0-ef1e-4ad6-a0e9-82c0ff05067e",
    "body" : "Hello! I am flying in late at night to Cologne airport and there's not much point staying in a hostel. Could anyone tell me what the airport is like to sleep over in? Are there 24/7 cafes? Wifi? Charging ports?",
    "username" : "celtya",
    "timestamp" : "2023-09-04T18:17:14Z"
  }, {
    "reportedcomment" : false,
    "_id" : "eec36e31-d053-4579-997b-1d35fecafc68",
    "body" : "I plan on staying in Cologne for 3 days. Doing 1 day in Cologne and other 2 days around Cologne in a big family (6 ppl) setting.\n\n\n1. What will be my best method of transportaion? Train tickets seem really expensive and we are thinking about renting a car.\n\n2. Can I use this 24StundenTicket to do travel to Bonn including schloss drachenburg? I see various RB, REs take me there\n\n3. Any other pass (other than 49 euro) i should be taki g advantage of?\n\nThank you!",
    "username" : "PhoenixSS6",
    "timestamp" : "2023-09-09T05:14:43Z"
  }, {
    "reportedcomment" : false,
    "_id" : "882bc69a-027c-4473-b131-0deebb346dea",
    "body" : "I'm planning to head to Phantasialand soon, but since all my transport options cause me to arrive fairly late, I decided to add one additional day in the beginning where I stay in the city center of Cologne. I'm just puzzling what type of transport tickets are best for me, since I need to go from the airport to the center on the first day, and from the center to Brühl on the second day. Would a 24stunden cityplusticket 2b cover both trips?",
    "username" : "aXetrov",
    "timestamp" : "2023-09-24T06:52:12Z"
  }, {
    "reportedcomment" : false,
    "_id" : "e5246fd7-4a0c-476c-9ca9-ff133828d654",
    "body" : "Hi there - I'll be visiting Cologne for a couple of days next week and am looking for recommendations for bootcamp style gyms (HIIT / Barry's / etc.) where I can drop in for the day. \n\nI'm staying at the Ruby Ella Hotel (just west of city center) but don't mind taking transit or walking a bit. If possible, it'd be nice if the class was also in English and I could simply book online with an orientation / introduction. Thanks in advance for recommendations!",
    "username" : "evanhaldrich",
    "timestamp" : "2023-10-25T20:20:05Z"
  }, {
    "reportedcomment" : false,
    "_id" : "695e3434-0d01-4f3d-a096-13052f4f3c38",
    "body" : "We are planning to visit the Christmas market with our 1 year old in december (first weekend of December). How should we dress our son? Do we need a stroller foot sack that looks like a puffer jacket or is snow pants and think stroller foot sack enough?",
    "username" : "pindangga",
    "timestamp" : "2023-11-20T07:40:57Z"
  }, {
    "reportedcomment" : false,
    "_id" : "6e6a0653-0b0e-4683-aca4-b3e68d7e7498",
    "body" : "Is Line 25 bus(it goes into Netherlands) included in the NRW Semesterticket?\nI am currently a student of a University in Köln. I am currently planning to travel to Dreiländereck in Aachen. Google Maps and DB Navigator suggests to take a line 25 bus from Aachen to reach there. But the bus has it's final stop in Netherlands, so I am thinking whether it's covered in my semester ticket. Any info would be helpful.\n\nN.B. this might be a silly question but consider this is my first time here in Germany",
    "username" : "Partha_CMPLearner",
    "timestamp" : "2023-12-25T19:35:45Z"
  }, {
    "reportedcomment" : false,
    "_id" : "0010ea1c-1a52-4494-ba79-b43a55f8bb88",
    "body" : "How is the law and order situation on 31st December night in Köln? I am a new student here and was thinking of going out on the 31st night. But someone from my WG told me that there is a lot of street crime on that particular night. Is it true?",
    "username" : "Partha_CMPLearner",
    "timestamp" : "2023-12-30T08:29:04Z"
  }, {
    "reportedcomment" : false,
    "_id" : "ed02134a-578b-4164-a2cb-c47416f0af5f",
    "body" : "I am visiting soon and deciding what to pack - in the winter when going out to bars or clubs, what do young people do about their coats? Are there usually coat racks or chairs, or should I wear my coat inside?",
    "username" : "absentdandelion",
    "timestamp" : "2023-12-31T20:27:52Z"
  }, {
    "reportedcomment" : false,
    "_id" : "0e144bd7-81c5-4999-a4d6-aa1e241d23eb",
    "body" : "Hello, \n\nWe are planning to visit Cologne with 17 friends on the 20th of April. We are 17 guys from the Netherlands, and I am hosting the party. We are all between 36 and 40 years old. We are looking for a Kneipeviertel that suits our age :). Furthermore we are looking for a bar where we can rent out a room or part of the bar for a couple of hours. This so that we can comfortably drink and chat. After this bar, we are looking for a nice spot were we can get our dance on. Preferably with people in our own age range :D. And to close it off, we are looking for a nice club for the after hours. It has to be spacious and it would be nice if there are more than 1 rarea, so everybody can enjoy themselves.   \nI know I am asking an awful lot. But it would mean the world to me if you would help me along. Cologne is an enormous city and the night life is pretty overwhelming. I like to hear from you. Thanks!!",
    "username" : "Fillester",
    "timestamp" : "2024-01-16T14:46:08Z"
  }, {
    "reportedcomment" : false,
    "_id" : "64190f79-d868-454c-b582-0263d6f502ae",
    "body" : "Hi,\n\nVisiting Cologne this weekend with friends. We’re interested in going to watch some football and saw Viktoria Kolne are playing at home. Is it easy enough to buy tickets at the gate or should we purchase in advance? Thanks.",
    "username" : "Repulsive-Aioli-949",
    "timestamp" : "2024-01-23T21:44:44Z"
  }, {
    "reportedcomment" : false,
    "_id" : "0025264d-ed5e-4cbc-8501-3d510dd229ce",
    "body" : "Hallo/Alaaf :) Ich besuche Koeln zum ersten Mal zu Karneval (9.2 - 13.2). Ich kann schon Deutsch aber ich reise mit einem Freund, der kaumes Wort Deutsch sprechen kann. Zurzeit habe ich vor in dem Hilton am Dom zu bleiben - war nicht meine erste Wahl, weil das Zimmer ziemlich klein ist und ich wollte eher eine \"authentischere\" Erfahrung haben. In dem Sinn - findet ihr, es waere uns wert lieber ein Airbnb zu buchen? Wenn ja, in welchem Viertel? Wir sind 33 und 35. \n\nLetzte Frage: ich interessiere mich natuerlich fuer Balls und Sitzungen, aber ich weiss nicht, ob sie dem Freund gefallen wuerden wenn er nur Englisch spricht?",
    "username" : "mbear818",
    "timestamp" : "2024-01-24T03:03:47Z"
  }, {
    "reportedcomment" : false,
    "_id" : "f5a59156-1b74-4009-b0b5-fa3e3398a6e2",
    "body" : "Could anyone suggest some sports bars? ",
    "username" : "Partha_CMPLearner",
    "timestamp" : "2024-02-24T16:53:07Z"
  }, {
    "reportedcomment" : false,
    "_id" : "4f98b528-062c-4595-a91d-636043b852da",
    "body" : "If you want to visit a cemetery, Victoria Köln home games are a great choice. If y want to have a great football experience, you have to go to Fortuna Köln.",
    "username" : "MorukDilemma",
    "timestamp" : "2023-05-03T10:00:06Z"
  }, {
    "reportedcomment" : false,
    "_id" : "826265ae-7a0e-4edc-9aae-b215fabd5bb7",
    "body" : "As parties are currently not allowed I don't think it will be worth this year unfortunately.",
    "username" : "kundensupport",
    "timestamp" : "2022-01-24T17:43:15Z"
  }, {
    "reportedcomment" : false,
    "_id" : "e587e059-cc2c-4b01-91f3-b40d4953d62d",
    "body" : "I talked to them in advance and they told me they'll sticky it. They'll probably see it soon.",
    "username" : "kundensupport",
    "timestamp" : "2021-12-18T00:06:10Z"
  }, {
    "reportedcomment" : false,
    "_id" : "0d844d9c-6644-47cc-811f-f79f5ed3b422",
    "body" : "Not at the moment, no. This might of course change.",
    "username" : "kundensupport",
    "timestamp" : "2021-12-17T16:56:46Z"
  }, {
    "reportedcomment" : false,
    "_id" : "465a4689-bb97-4eb9-b2d1-e15afa8f940c",
    "body" : "added, thanks",
    "username" : "kundensupport",
    "timestamp" : "2021-12-19T10:01:02Z"
  }, {
    "reportedcomment" : false,
    "_id" : "548f2051-7cec-4a03-b4bb-e72de399ffe8",
    "body" : "Have you tried the [Kölner Grüngürtel](https://www.ich-geh-wandern.de/k%C3%B6lner-gr%C3%BCng%C3%BCrtel-rundwanderweg)? There should be more than enough trees there.",
    "username" : "None",
    "timestamp" : "2022-07-21T08:41:44Z"
  }, {
    "reportedcomment" : false,
    "_id" : "5a4f959e-22b3-4fb0-8f46-66b3cb13bcb6",
    "body" : "jeans stupendous sink toy deserve crush connect bedroom slimy joke\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
    "username" : "kaiomann",
    "timestamp" : "2024-08-06T10:03:41Z"
  }, {
    "reportedcomment" : false,
    "_id" : "c662aed4-610f-4b80-a27e-85ad1ab2ddce",
    "body" : "Zur Malzmühle, Lommerzheim, Früh am Dom, Schreckenskammer, Haus Unkelbach\n\nJust to name a few",
    "username" : "kundensupport",
    "timestamp" : "2024-03-19T06:33:00Z"
  }, {
    "reportedcomment" : false,
    "_id" : "3ee9d902-1ce3-4298-aa2c-51641894b308",
    "body" : "Most restaurants should be open. Shops will be closed on Friday, Sunday and Monday.",
    "username" : "kundensupport",
    "timestamp" : "2024-03-24T19:13:47Z"
  }, {
    "reportedcomment" : false,
    "_id" : "81892cda-eed9-412e-b969-dd562815039f",
    "body" : "RE8 or RB27 from Cologne would be your best option.",
    "username" : "kundensupport",
    "timestamp" : "2024-03-25T11:04:26Z"
  }, {
    "reportedcomment" : false,
    "_id" : "28108428-7f11-4155-aeb5-f02f186adac8",
    "body" : "Most gyms are members only. The only one I know that offers a 2 hour ticket for 10 € is Just Fit.",
    "username" : "kundensupport",
    "timestamp" : "2024-04-06T12:04:16Z"
  }, {
    "reportedcomment" : false,
    "_id" : "bf129943-ed8c-443b-80a4-64a0cdfe5b62",
    "body" : "Nothing spectacular. You could do a walk at the Rhine.",
    "username" : "kundensupport",
    "timestamp" : "2024-04-07T18:26:28Z"
  }, {
    "reportedcomment" : false,
    "_id" : "960af70c-fbaf-40db-88fc-886596f3507f",
    "body" : "VRS is an alliance of smaller public transportation businesses in the area. KVB is part of the VRS so it doesn't really matter where you buy it. App is fine. You don't have to scan the ticket anyway. You just have to show it if a ticket inspector asks you for it.\n\nA good advice is to just install the VRS eezy app. You check in when you enter the tram/train and check out when you leave it.",
    "username" : "kundensupport",
    "timestamp" : "2024-04-26T21:53:25Z"
  }, {
    "reportedcomment" : false,
    "_id" : "511c26ae-e1a0-4c49-8b65-ce00a75e79ad",
    "body" : "The trains you mentioned are included in the Deutschland Ticket. The only ones not included are IC and ICE. Don't forget to cancel the ticket immediately because it's a subscription.",
    "username" : "kundensupport",
    "timestamp" : "2024-05-16T22:55:14Z"
  }, {
    "reportedcomment" : false,
    "_id" : "466ce965-9ca7-4ee6-9d64-8a6bed520196",
    "body" : "Probably not much. Sorry.",
    "username" : "kundensupport",
    "timestamp" : "2024-06-17T20:27:18Z"
  }, {
    "reportedcomment" : false,
    "_id" : "d08218ce-a248-4b51-b3af-6cf7506e193e",
    "body" : "Sadly very difficult. If youre not German, twice as hard. If youre not European, even harder. Rent very much depends. Your best bet is to find a shared flat with other students via wg-gesucht.de. You can look there to get a feel for the average prices. If you want your own flat, it will be 700 a month at least on the open market, but just look on ImmobilienScout.de and see for yourself, we might have different standards for what is acceptable. Be aware that a lot of flats come without kitchens, si thats an additional expense you need to be aware of. Look at the housing section of the /r/germany wiki for additional information.",
    "username" : "vodkaflavorednoodles",
    "timestamp" : "2024-07-29T08:09:37Z"
  }, {
    "reportedcomment" : false,
    "_id" : "272b82dd-d713-44eb-a002-d6ffe522006d",
    "body" : "Some quick ideas:\n\n- Skeeball Bar ([Red Fox Bar](https://redfoxbar.cologne/))\n\n- [Buddy Bash](https://www.buddybash.de/) (Not sure if they offer English games, but you could ask)\n\n- [BattleKart](https://www.battlekart.com/de/koeln/), Mario Kart in RL",
    "username" : "kundensupport",
    "timestamp" : "2024-08-09T11:52:16Z"
  }, {
    "reportedcomment" : false,
    "_id" : "26cf41dc-20d7-4e01-aa47-a78a3273f3a6",
    "body" : "Yes, at least Früh, Mühlen and Gaffel Kölsch have alcohol-free versions. Not sure about the others tough. You can buy them at most supermarkets or kiosks. Usually they have a blue or red stripe saying \"alkoholfrei\" or \"0,0%\".\n\nCareful: alcohol-free (\"alkoholfrei\") in Germany doesn't mean that there is 0% alcohol in it. They are allowed to still have up to 0,5% of alcohol. Check the label on the back if that matters to you. If labeled 0,0% there is no alcohol in it.",
    "username" : "kundensupport",
    "timestamp" : "2024-08-14T09:52:18Z"
  }, {
    "reportedcomment" : false,
    "_id" : "7df93276-8c3e-42d5-a210-f34051a8befb",
    "body" : "According to the FAQ you can't use a foreign address. But it states that you are able to buy tickets just without registering. You can still set a payment method without being logged-in.",
    "username" : "kundensupport",
    "timestamp" : "2024-08-15T08:30:24Z"
  }, {
    "reportedcomment" : false,
    "_id" : "378a4d73-92bf-4f06-a4a2-8efa37dbb24e",
    "body" : "There are no really unsafe areas in Cologne, just parts that are not very nice and you might want to avoid, like Kölnberg or Görlinger Zentrum. As we're in a housing crisis you can't really choose where to live. If you like it quite at night you should look in the outer districts or suburbs with good S-Bahn connection.",
    "username" : "kundensupport",
    "timestamp" : "2024-09-18T06:07:35Z"
  }, {
    "reportedcomment" : false,
    "_id" : "f0d668e0-049a-4e13-ac8f-a37b62d674bb",
    "body" : "To add onto what was already said: Ebertplatz or Neumarkt at night can be a bit spooky, but its nothing compared to the bad areas in citys like LA, Detroit or Chigaco, I lived in what people consider a bad area of Cologne for three years and even my girlfriend at the time never feared for her safety, just the trash on the streets and the frequent break ins into cellars were annoying. Your two requirements kinda exclude each other, if its vibrant and artsy its not quiet. Maybe Nippes, which can be very quiet but is still close to everything. Unless you have a very high income (120k €+), its going to be very hard to find a place to live, even more so if you dont speak german. Btw please dont become one of the people who moves to Ehrenfeld because of the artists/clubs and then prices the artists out of the housing market and shuts the clubs down with noise complaints.",
    "username" : "vodkaflavorednoodles",
    "timestamp" : "2024-09-19T12:45:21Z"
  }, {
    "reportedcomment" : false,
    "_id" : "e32c51d0-72c9-4b12-b511-64e97330d82b",
    "body" : "I'm not clear about what you want to ask. There are a lot of period tickets - it is not clear what your requirements are.",
    "username" : "Caladeutschian",
    "timestamp" : "2021-12-17T23:22:26Z"
  }, {
    "reportedcomment" : false,
    "_id" : "be0e049c-6bf8-4f1e-8608-dd69a4ca4704",
    "body" : "There of course is a semester pass. You can use public transport in Cologne if you either have a VRS semester pass or a NRW semester pass (which is offered by most universities here).\n\nEdit: Correcting the availability of NRW semester pass",
    "username" : "Redditquaza",
    "timestamp" : "2021-12-18T06:41:52Z"
  }, {
    "reportedcomment" : false,
    "_id" : "a3dc444c-68bc-45d4-9674-214c57fa4f05",
    "body" : "Only thing that comes to my mind is under [right side of the Zoobrücke](https://maps.app.goo.gl/E9kARvHWFrckD6Uc7) . You have to walk a bit to get to the Dom but the Rheinpark is worth a visit.",
    "username" : "kundensupport",
    "timestamp" : "2021-12-18T09:55:05Z"
  }, {
    "reportedcomment" : false,
    "_id" : "29f09d0e-b97f-4fb6-af28-d89dc43ad2a5",
    "body" : "I don't think there are much options. While bars currently are open, we're awaiting new rules today and I higly doubt they will allow New Years parties in bars. So if you don't plan to stay with friends I would highly suggest to postpone your visit. But wait until we know more later today.",
    "username" : "kundensupport",
    "timestamp" : "2021-12-21T12:34:21Z"
  }, {
    "reportedcomment" : false,
    "_id" : "e0f388c1-9eb6-4755-8953-00f8d53d87c1",
    "body" : "From the 28^th on there will be contact limitations. Vaccinated people can only meet with up to 10 people in private. I don't know yet what that means for bars, but it doesn't look good for New Years Eve. I say: postone your visit. It's not worth it currently.",
    "username" : "kundensupport",
    "timestamp" : "2021-12-21T18:30:10Z"
  }, {
    "reportedcomment" : false,
    "_id" : "09ac848e-9e9c-4858-bd36-dbc431fb7c56",
    "body" : "We're awaiting new rules today. So I would wait for the results.",
    "username" : "kundensupport",
    "timestamp" : "2021-12-21T12:36:06Z"
  }, {
    "reportedcomment" : false,
    "_id" : "66ccd6cd-199d-4b9f-a042-e155d3ba57f9",
    "body" : "Es gibt nur privates Feuerwerk, wenn Leute noch gebunkert haben oder es sich im Ausland besorgt habe. Auf allen öffentlichen Plätzen gilt Pyro- und Versammlungsverbot. War glaub letztes Jahr auch schon und gefühlt war es wirklich echt wenig Feuerwerk (zumindest in der Südtstadt). Von den gängigen Plätzen wird man also vielleicht vertrieben werden. Brücken sind eh gesperrt für Fußgänger. Eine Idee wäre vielleicht der Herkulesberg am Mediapark, aber ob sich das lohnt weiß ich nicht.",
    "username" : "kundensupport",
    "timestamp" : "2021-12-24T22:10:55Z"
  }, {
    "reportedcomment" : false,
    "_id" : "42df2f95-bff9-4ebf-93aa-a86d95c6ebfe",
    "body" : "I can't anwser your question. A quick google search gave me this map where you can check the connection speeds in Germany. Look's like 100 MBit/s is mostly common in Cologne: https://breitbandmessung.de/kartenansicht",
    "username" : "kundensupport",
    "timestamp" : "2022-01-04T09:42:55Z"
  }, {
    "reportedcomment" : false,
    "_id" : "600e9954-bc63-42bd-b9ba-12ec541eaa50",
    "body" : "Search for \"Park and Ride Köln\". They should be free of charge and are always next to a tram station. Like [this](http://Park & Ride Longerich\nhttps://maps.app.goo.gl/2FANhoPNbSfqj3HQ8) one for example.",
    "username" : "kundensupport",
    "timestamp" : "2022-01-29T23:46:48Z"
  }, {
    "reportedcomment" : false,
    "_id" : "e5f1640d-20a8-438c-8675-556074ae8cde",
    "body" : "There is one in Aachen as well, but are you sure the one in Ritterstr. Is closed? Google says it's open.",
    "username" : "kundensupport",
    "timestamp" : "2022-02-08T06:53:19Z"
  }, {
    "reportedcomment" : false,
    "_id" : "0bcfe750-0c9c-4b10-b00a-280255e1ed00",
    "body" : "What time of the year are we talking about?",
    "username" : "kundensupport",
    "timestamp" : "2022-02-22T19:19:08Z"
  }, {
    "reportedcomment" : false,
    "_id" : "26d58317-6ede-4e5f-a809-5de05e726207",
    "body" : "This is very specific maybe ask over at /r/Germany or /r/Finanzen",
    "username" : "kundensupport",
    "timestamp" : "2022-03-21T17:25:01Z"
  }, {
    "reportedcomment" : false,
    "_id" : "772e06ad-19aa-44b9-b6bb-b22a6c1ddfb8",
    "body" : "Shops (as in retail stores and supermarkets) are always closed on Sundays in Germany. Museums and tourist stuff, restaurants, cafés are open, some bars might be closed but a lot open on Sunday as well.",
    "username" : "kundensupport",
    "timestamp" : "2022-04-12T13:11:52Z"
  }, {
    "reportedcomment" : false,
    "_id" : "63247de0-7bff-47cc-a875-468ee1c038c5",
    "body" : "Germans would just say \"Bierchen?\" or \"Kölsch?\". Your phrase would probably translate to \"Drinkste de a Kölsch/Bier met mir?\"",
    "username" : "kundensupport",
    "timestamp" : "2022-04-14T23:22:17Z"
  }, {
    "reportedcomment" : false,
    "_id" : "897dadeb-bb9f-4bc5-bec2-af383c669ca2",
    "body" : "Hey, so first BBQ is allowed in Cologne's parks (forbidden only in the Stadtgarten and the Rheinpark). If you don't want to bring your own stuff, you could check out [this place in the Grüngürtel near Venloer](https://goo.gl/maps/Wb8mkGEzD5K7E6tN9).\n\nEdit: Oh, disposable grills are forbidden. So bring a small reusable one.",
    "username" : "kundensupport",
    "timestamp" : "2022-04-25T14:27:35Z"
  }, {
    "reportedcomment" : false,
    "_id" : "0549394b-afc4-4184-b974-4be419ab4c08",
    "body" : "The [Poolball Arena ](https://www.fun-and-sport.de/poolball-arena-koeln/) is quite large (3 football pool tables and football darts etc.) I would just call them and ask. It's not that well known.\n\nAnother option would be [Buddy Bash](https://www.buddybash.de/). You compete in several fun sport and games against each other. Not sure they'll speak English though.",
    "username" : "kundensupport",
    "timestamp" : "2022-05-06T14:35:24Z"
  }, {
    "reportedcomment" : false,
    "_id" : "cdc97a32-8a14-4c7b-842c-c88f0074d7ad",
    "body" : "Just grab a beer and sit by the Rhein.",
    "username" : "kundensupport",
    "timestamp" : "2022-05-09T21:09:00Z"
  }, {
    "reportedcomment" : false,
    "_id" : "fc312cbf-5bf6-436a-ab0f-a895cbac78b1",
    "body" : "That is very specific. Only place I could think of is Joe Champs at Rudolfplatz. Maybe give them a call.",
    "username" : "kundensupport",
    "timestamp" : "2022-05-16T11:57:11Z"
  }, {
    "reportedcomment" : false,
    "_id" : "459913c2-81d1-4bf8-baea-774051e75541",
    "body" : "This thread is more for to short time visits. Can't really help here. Check wg-gesucht.de maybe.",
    "username" : "kundensupport",
    "timestamp" : "2022-06-08T21:54:33Z"
  }, {
    "reportedcomment" : false,
    "_id" : "23bd382c-589e-41fd-9619-6c1a4d087a7c",
    "body" : "Have you enrolled in the dorm list and put pressure on the KSTW to get you a room? It's a bit russian roulette on what you will get there, but particularly if you get sent to efferen you'll have a lot of opportunities to be around other students",
    "username" : "Expert_Donut9334",
    "timestamp" : "2022-06-18T23:56:02Z"
  }, {
    "reportedcomment" : false,
    "_id" : "353b2522-a6bb-445d-87ce-5086a7df4ed3",
    "body" : "No, but Craft Beer Corner has usually 2-3 stronger, darker beers on tap.",
    "username" : "kundensupport",
    "timestamp" : "2022-07-12T16:37:41Z"
  }, {
    "reportedcomment" : false,
    "_id" : "0fdacc73-1d39-4654-af31-0247b4cb6c17",
    "body" : "Hey, I'll keep it short. Music scene in Cologne is great. Lots of concerts of any kind of rock subgenre. Just check bandsintown regularly (https://popanz.ticket.io/ are doing a lot of psychadelic rock/pop shows lately). Sidenote: [There is a shop for alternative rock and stone rock merchandise](https://g.page/LoFi404?share) (mostly t-shirts) in Ehrenfeld.\n\nAs for quarters: I wouldn't recommend limiting yourselves to specific quarters. Finding an appartment is not easy. Just make sure it has a good ÖPNV connection. You'll fit in everywhere in Cologne, despite being Bavarian. Feels like our second favorite beer style in this city is bavarian Helles anyway. ;)\n\nEdit: Good ÖPNV = near KVB tram lines and an S-Bahn station in the near vicinity.",
    "username" : "kundensupport",
    "timestamp" : "2022-07-24T20:38:27Z"
  }, {
    "reportedcomment" : false,
    "_id" : "f94e2c2d-1ed1-4155-b335-f86610b5f169",
    "body" : "What you are looking for is \"Zwischenmiete\" in German. Might check wg-gesucht.de",
    "username" : "kundensupport",
    "timestamp" : "2022-08-25T19:49:23Z"
  }, {
    "reportedcomment" : false,
    "_id" : "9039d68f-538e-4b27-9146-0a615637ec0d",
    "body" : "There are parties in a lot of places around the city. Hard to tell what are the best ones. Depends on your taste ofc.",
    "username" : "kundensupport",
    "timestamp" : "2022-09-23T15:41:26Z"
  }, {
    "reportedcomment" : false,
    "_id" : "dbd01126-5d37-4d98-99cc-a4a35186e604",
    "body" : "Wahrscheinlich eine spezielle Messe? Die sind nicht immer so beworben.",
    "username" : "kundensupport",
    "timestamp" : "2022-10-12T20:04:11Z"
  }, {
    "reportedcomment" : false,
    "_id" : "e88982f9-2d88-4016-8f98-c8c382d8ff4a",
    "body" : "I would probably look for a place that has a good connection to \"Heumarkt\". That would be tram lines 7,9 and 1. But Cologne is in general pretty walkable, so I wouldn't worry too much about.\n\nI don't know your budget, but hotels can be quite expensive this time of the year. Just checked Art Hotel for example and it's 125€ per night (room only): https://www.artotelcologne.com/\n\nHostel would be an option to check: The area is a little sketchy because it's close to the central station, but there is a new hostel that looks quite nice and is very close to all the christmas markets: https://urbanlofthotels.com/",
    "username" : "kundensupport",
    "timestamp" : "2022-11-06T10:08:46Z"
  }, {
    "reportedcomment" : false,
    "_id" : "d710e8a1-9e3b-4876-b4e6-319625d2f280",
    "body" : "Train is your best option.",
    "username" : "kundensupport",
    "timestamp" : "2022-11-18T09:59:46Z"
  }, {
    "reportedcomment" : false,
    "_id" : "12b11460-7bea-4771-a272-539b7a7d0f28",
    "body" : "Nope. Still illegal in Germany.",
    "username" : "kundensupport",
    "timestamp" : "2022-11-18T20:20:53Z"
  }, {
    "reportedcomment" : false,
    "_id" : "ec773ff6-e637-472b-a845-3864c25d38c5",
    "body" : "23.12. is right, some are even opened longer.",
    "username" : "kundensupport",
    "timestamp" : "2022-11-19T11:20:38Z"
  }, {
    "reportedcomment" : false,
    "_id" : "ab8f9a82-7f3a-4ed8-bb27-e1a25339dab8",
    "body" : "Joe Champs at Rudolfplatz",
    "username" : "kundensupport",
    "timestamp" : "2022-12-03T10:17:08Z"
  }, {
    "reportedcomment" : false,
    "_id" : "afe4165d-bb68-4a32-ab41-03acb93c4996",
    "body" : "Only heard good things about http://www.wallczka.com/",
    "username" : "kundensupport",
    "timestamp" : "2022-12-04T14:45:54Z"
  }, {
    "reportedcomment" : false,
    "_id" : "5697922b-496c-467e-950e-92ce593666f8",
    "body" : "Here are two options. But there are many more\n[Longerich ](https://maps.app.goo.gl/Fq6xVyrfXPMRyCi58) (Next to train station for S6 ans S11)\n\n[Brück ](https://maps.app.goo.gl/pe6mKXrgK7gQFztQ8) (Next to Tram line)",
    "username" : "kundensupport",
    "timestamp" : "2022-12-04T17:50:48Z"
  }, {
    "reportedcomment" : false,
    "_id" : "4f20698e-2dc7-42a5-abf3-1865ee695852",
    "body" : "Never been there but it's probably a rather small one.",
    "username" : "kundensupport",
    "timestamp" : "2022-12-04T19:07:59Z"
  }, {
    "reportedcomment" : false,
    "_id" : "89c8af08-49b8-4b15-92bc-1cd7a0c24324",
    "body" : "Yes, you use it for the all whole ÖPNV.",
    "username" : "kundensupport",
    "timestamp" : "2022-12-16T21:30:16Z"
  }, {
    "reportedcomment" : false,
    "_id" : "12fa461b-7dbc-4796-a792-a86a5add9a3d",
    "body" : "Phew, tough age. What are his interests?",
    "username" : "kundensupport",
    "timestamp" : "2022-12-31T12:12:18Z"
  }, {
    "reportedcomment" : false,
    "_id" : "d4c6ef17-67bc-49d2-9f21-cf1a96a8d02d",
    "body" : "Don't worry, nearly everyone speaks English here. The \"beer halls\" will probably be in carnival mode but you can check Gaffel am Dom, maybe there will be regular service. However vegetarian and vegan restaurants are plentiful. I linked an older thread you might want to check.",
    "username" : "kundensupport",
    "timestamp" : "2023-01-01T11:25:28Z"
  }, {
    "reportedcomment" : false,
    "_id" : "768c5cfe-3e73-4690-9eaa-3d4c9b11b6f5",
    "body" : "It's the same as in Berlin maybe(?) even worse. If you work remote look for appartments in Leverkusen, Hürth, Pulheim for example.",
    "username" : "kundensupport",
    "timestamp" : "2023-01-15T00:48:35Z"
  }, {
    "reportedcomment" : false,
    "_id" : "0130f295-528f-4d58-a218-abe6764a185b",
    "body" : "I think you have no understanding what happens on Rose Monday. Sitting in a café next to or near the parade will be impossible.",
    "username" : "kundensupport",
    "timestamp" : "2023-01-18T06:23:38Z"
  }, {
    "reportedcomment" : false,
    "_id" : "a0a4f17b-7b5f-4e6b-9ccd-1fb71b2e8381",
    "body" : "Bars in the Belgian Quarter. If you're into Football there should be even some options for day drinking at Gottes grüne Wiese or Zum goldenen Schuss.\n\nOtherwise check Rausgegangen.de for some Tipps. (it's in German tough)",
    "username" : "kundensupport",
    "timestamp" : "2023-02-04T17:48:00Z"
  }, {
    "reportedcomment" : false,
    "_id" : "83d88d19-1beb-44f7-a7ea-26945184f41f",
    "body" : "If lack of comfort isn´t a problem for you, you´ll be perfectly good to go with the RE. If there´s no major events or soccer game the train probably won´t be too full. \n\nCheers, enjoy your stay!",
    "username" : "quienEsLeon",
    "timestamp" : "2023-04-24T20:51:28Z"
  }, {
    "reportedcomment" : false,
    "_id" : "257ea3d0-12c1-4d50-9c51-d09b7983fd78",
    "body" : "check https://www.wg-gesucht.de",
    "username" : "kundensupport",
    "timestamp" : "2023-04-21T07:03:19Z"
  }, {
    "reportedcomment" : false,
    "_id" : "50ca2a24-8917-415d-ab88-95ac0e3d8427",
    "body" : "Isn't that just Pseudoephedrine? Any pharmacy should have something like that, not necessarily the same brand. I would just go to one and describe your symptoms.",
    "username" : "kundensupport",
    "timestamp" : "2023-05-05T13:54:18Z"
  }, {
    "reportedcomment" : false,
    "_id" : "d9a56c6b-5db3-40d7-8903-94f88aec68c9",
    "body" : "Depends on the group and what you want to do. If you just want to drink: Altstadt",
    "username" : "kundensupport",
    "timestamp" : "2023-05-31T05:01:22Z"
  }, {
    "reportedcomment" : false,
    "_id" : "be3d6028-e52a-4e26-96b2-f46c8fc9534a",
    "body" : "1. It's in the city center next to the cathedral. So very touristy. Should be a good starting point to explore the city.\n\n2. No fan parks I know of yet, but probably there will be some. IRC they usually do one on the Heumarkt close to where you are staying.",
    "username" : "kundensupport",
    "timestamp" : "2023-08-30T11:44:41Z"
  }, {
    "reportedcomment" : false,
    "_id" : "bdf0f47f-83b2-46b2-888a-a4872476092d",
    "body" : "ImmobilienScout24, Kleinanzeigen, Real Estate Agents. Plan a lot of time and nerves. It's hard currently.",
    "username" : "kundensupport",
    "timestamp" : "2023-09-09T09:18:33Z"
  }, {
    "reportedcomment" : false,
    "_id" : "ea26cfa2-40fc-4410-8c84-efe6548d5b15",
    "body" : "Can't really help here. 24h hours ticket should work, yes. If you're from the EU you can also buy a 49€ ticket afaik.",
    "username" : "kundensupport",
    "timestamp" : "2023-09-09T09:17:37Z"
  }, {
    "reportedcomment" : false,
    "_id" : "6b34d628-adc5-47cf-a778-f74247fa50c6",
    "body" : "Adjust it to the weather on the day - in the last years December temperatures could be anywhere between -5c and +15c.\n\nI don't have kids, so can't give you specific advice on that front, however - wool > cotton.",
    "username" : "weisswurstseeadler",
    "timestamp" : "2023-11-20T11:35:45Z"
  }, {
    "reportedcomment" : false,
    "_id" : "77048415-e5de-4870-9737-d60dc41a7076",
    "body" : "Not a student anymore, but isn't the Semesterticket also a \"Deutschlandticket\"?\n\nEdit: Nevermind it says you can use all busses in NRW, so the bus is included.",
    "username" : "kundensupport",
    "timestamp" : "2023-12-26T12:28:04Z"
  }, {
    "reportedcomment" : false,
    "_id" : "9205c921-f768-446e-a67f-1028e5a6d35f",
    "body" : "It's not true. You are fine.",
    "username" : "kundensupport",
    "timestamp" : "2023-12-30T09:58:45Z"
  }, {
    "reportedcomment" : false,
    "_id" : "c9c4e014-6a11-4028-86e8-040d8ba0e27f",
    "body" : "Depends on the venue. Clubs always have a cloakroom. Bars usually don't. Some will have coat racks, some don't and you put your jacket wherever you'll find a place for it or you hang it on your chair.",
    "username" : "kundensupport",
    "timestamp" : "2024-01-01T00:35:21Z"
  }, {
    "reportedcomment" : false,
    "_id" : "00a8b9f8-335e-49b8-897c-043b4498899e",
    "body" : "You can book a large tables in nearly every brew pub (Brauhaus) in Cologne. I would recommend Zur Malzmühle. After that you can do a pub crawl through the old town or take the tram to Rudolfplatz and explore the bars around Aachener Str.\n\nCan't help with the clubs. There are no multiple area clubs I know of. Mostly one genre or different styles of one specific genre is played. Mostly electronic or Hip-Hop. Maybe check out Club Subway. Avoid clubs on the rings.",
    "username" : "kundensupport",
    "timestamp" : "2024-01-16T15:50:11Z"
  }, {
    "reportedcomment" : false,
    "_id" : "efa58266-077b-48a5-81fb-650c6208fe8e",
    "body" : "According to my friend who has been there several times you don't need to book a ticket in advance.",
    "username" : "kundensupport",
    "timestamp" : "2024-01-24T07:15:06Z"
  }, {
    "reportedcomment" : false,
    "_id" : "bd646cf4-513a-4060-9a23-c0a5daf24d1c",
    "body" : "Hilton ist doch gut. Von da kommt man ja ganz gut in alle Ecken Kölns. Eine Sitzung ohne Deutsch zu können ist vermutlich ziemlich langweilig. Ist ja schon viel sprachliches.",
    "username" : "kundensupport",
    "timestamp" : "2024-01-24T07:17:00Z"
  }, {
    "reportedcomment" : false,
    "_id" : "8e9a4583-f992-4d55-9677-645e518a49d9",
    "body" : "Joe Champs at Rudolfplatz for international sports. There is also a smaller Joe Champs in Deutz. That's pretty much all there is.",
    "username" : "kundensupport",
    "timestamp" : "2024-02-25T07:24:35Z"
  }, {
    "reportedcomment" : false,
    "_id" : "09dffa25-daef-46bb-90f8-7a736f0e3754",
    "body" : "Remind me to reply to this in a year.",
    "username" : "Caladeutschian",
    "timestamp" : "2023-05-03T16:44:16Z"
  }, {
    "reportedcomment" : false,
    "_id" : "d5c0c536-d2a5-474c-900b-56391d839b6d",
    "body" : "Ok, thank you thats really clear, I wasn't sure if it would proceed from the Cologne tourism website. Thank you!",
    "username" : "camdencailin",
    "timestamp" : "2022-01-24T18:33:07Z"
  }, {
    "reportedcomment" : false,
    "_id" : "1daf5b9b-53ec-46bf-ac88-12f833add63d",
    "body" : "Thx! I was not sure because I read that x-mas markets closed at 10pm.",
    "username" : "lietaert",
    "timestamp" : "2021-12-17T17:00:53Z"
  }, {
    "reportedcomment" : false,
    "_id" : "bc689521-0b34-4690-b117-a92a6127ee8c",
    "body" : "Vielen dank!",
    "username" : "Legal-Plankton-7306",
    "timestamp" : "2024-03-19T10:02:19Z"
  }, {
    "reportedcomment" : false,
    "_id" : "9d1fcb8b-7871-4efa-8fe8-d7011bb2e40e",
    "body" : "Perfect, much appreciated!",
    "username" : "None",
    "timestamp" : "2024-03-26T02:21:16Z"
  }, {
    "reportedcomment" : false,
    "_id" : "ee030eac-bd74-498a-94cb-54458cabf8ed",
    "body" : "Thanks for the info!",
    "username" : "Skid_RAW",
    "timestamp" : "2024-04-06T23:12:01Z"
  }, {
    "reportedcomment" : false,
    "_id" : "62242c11-1b09-4d0b-be6f-c09f671726ba",
    "body" : "Thank you very much!",
    "username" : "fleetcommand",
    "timestamp" : "2024-04-27T15:32:36Z"
  }, {
    "reportedcomment" : false,
    "_id" : "afccaf84-fca2-4e51-b658-c5cbbc4c7335",
    "body" : "Thank you! Do you know if there’s a page or fahrplan available for these?",
    "username" : "mrperfectlyfine99",
    "timestamp" : "2024-05-16T23:03:18Z"
  }, {
    "reportedcomment" : false,
    "_id" : "78679f4b-0b54-455d-b32a-2bc642b50117",
    "body" : "Here's a sneak peek of /r/germany using the [top posts](https://np.reddit.com/r/germany/top/?sort=top&t=year) of the year!\n\n\\#1: [It’s nearly News Years Eve](https://i.redd.it/13pk3b9dst8c1.jpeg) | [335 comments](https://np.reddit.com/r/germany/comments/18ryxru/its_nearly_news_years_eve/)  \n\\#2: [Am I cursed now?](https://i.redd.it/uyyss01vhvbc1.jpeg) | [832 comments](https://np.reddit.com/r/germany/comments/194bytr/am_i_cursed_now/)  \n\\#3: [Why do you have emojis as road signal?](https://i.redd.it/zi8djubbgpdb1.jpg) | [460 comments](https://np.reddit.com/r/germany/comments/157d4q0/why_do_you_have_emojis_as_road_signal/)\n\n----\n^^I'm ^^a ^^bot, ^^beep ^^boop ^^| ^^Downvote ^^to ^^remove ^^| ^^[Contact](https://www.reddit.com/message/compose/?to=sneakpeekbot) ^^| ^^[Info](https://np.reddit.com/r/sneakpeekbot/) ^^| ^^[Opt-out](https://np.reddit.com/r/sneakpeekbot/comments/o8wk1r/blacklist_ix/) ^^| ^^[GitHub](https://github.com/ghnr/sneakpeekbot)",
    "username" : "sneakpeekbot",
    "timestamp" : "2024-07-29T08:09:52Z"
  }, {
    "reportedcomment" : false,
    "_id" : "fda11f74-0080-4174-aafa-6b6df0d25530",
    "body" : "Ah great, danke! I’m assuming they would be served in some bars/pubs too?",
    "username" : "tiggytigtigtig",
    "timestamp" : "2024-08-14T10:16:47Z"
  }, {
    "reportedcomment" : false,
    "_id" : "95c2adf5-6023-4949-a3ef-d32b46955b33",
    "body" : "Unfortunately it just comes up with an error message saying I must register before making a purchase.",
    "username" : "tiggytigtigtig",
    "timestamp" : "2024-08-15T08:36:03Z"
  }, {
    "reportedcomment" : false,
    "_id" : "e53c3b97-9e52-4299-b455-0aee0b3ba257",
    "body" : "Thank you. Can you recommend any nice outer districts or suburbs?",
    "username" : "Fit-Ad-5145",
    "timestamp" : "2024-09-19T23:28:53Z"
  }, {
    "reportedcomment" : false,
    "_id" : "2e402524-65b0-41c4-a015-6dc02227100c",
    "body" : "Thank you. Why is it extra hard to find a place if one doesn’t speak German?",
    "username" : "Fit-Ad-5145",
    "timestamp" : "2024-09-19T23:36:22Z"
  }, {
    "reportedcomment" : false,
    "_id" : "d744d580-e5ac-4e88-b9e7-304b16b44521",
    "body" : "Isn't it the other way around? NRW Ticket when you're studying at University of Cologne, VRS Ticket for students at TH Köln.",
    "username" : "k-ramba",
    "timestamp" : "2021-12-18T10:11:25Z"
  }, {
    "reportedcomment" : false,
    "_id" : "978b0f32-ad34-4d42-a729-3229a633afb9",
    "body" : "Perfect! Thank you for this.",
    "username" : "caffeine_lights",
    "timestamp" : "2023-08-28T08:19:05Z"
  }, {
    "reportedcomment" : false,
    "_id" : "86aff80f-7a91-4491-a703-4ae33fbf806a",
    "body" : "Just saw them posted. Has that affected your opinion of visiting at this time?",
    "username" : "TradingToilets4Shoes",
    "timestamp" : "2021-12-21T22:53:52Z"
  }, {
    "reportedcomment" : false,
    "_id" : "c891dc57-94dd-47d9-93cb-f6e864be5225",
    "body" : "Upcoming weekend. Arriving Friday night, leaving Tuesday mid day. We found also the Odysseum.",
    "username" : "Zahnriemen",
    "timestamp" : "2022-02-22T19:26:21Z"
  }, {
    "reportedcomment" : false,
    "_id" : "a3ca2328-6572-4be2-bd7c-91edda6ccd2c",
    "body" : "Thank you. I was a little worried I would need to shop for food for Sunday, on Saturday",
    "username" : "Picnut",
    "timestamp" : "2022-04-12T13:58:34Z"
  }, {
    "reportedcomment" : false,
    "_id" : "e012b6b2-b779-408a-af35-f68ef6c858c5",
    "body" : "awesome, this is next to our hotel!",
    "username" : "TQairstrike",
    "timestamp" : "2022-04-25T14:34:52Z"
  }, {
    "reportedcomment" : false,
    "_id" : "6e3f0231-a59c-4178-8869-cc3383222412",
    "body" : "Yes! I sent the application in december and recently I’ve emailed them a few times. They told me that they start offering rooms in summer, so apparently I need to wait until that. Also I know people who got the room when the semester had already begun so i’m not that sure about waiting that much",
    "username" : "irenedix0n",
    "timestamp" : "2022-06-19T01:15:56Z"
  }, {
    "reportedcomment" : false,
    "_id" : "d67b7996-7cbe-48f1-b4d5-5b388ceeb7da",
    "body" : "Ahh I'm gonna check it out! Thank you!",
    "username" : "veggiemon_star",
    "timestamp" : "2022-07-12T17:41:48Z"
  }, {
    "reportedcomment" : false,
    "_id" : "9e07f811-9d95-463b-86e3-d001a6d751dc",
    "body" : "For Rock and Stone!",
    "username" : "WanderingDwarfMiner",
    "timestamp" : "2022-07-24T20:38:39Z"
  }, {
    "reportedcomment" : false,
    "_id" : "3e9d88a1-5411-404b-8d48-b3fefea772e6",
    "body" : "Awesome!! Thank you!!",
    "username" : "NumbTheFather",
    "timestamp" : "2022-08-26T18:43:38Z"
  }, {
    "reportedcomment" : false,
    "_id" : "994fa31c-ea27-4a3c-8469-aeb1d5f78570",
    "body" : "I am mid 30s single male looking for a nice Helga?",
    "username" : "None",
    "timestamp" : "2022-09-23T20:28:32Z"
  }, {
    "reportedcomment" : false,
    "_id" : "46e9dae8-3dae-41c7-9a7b-b1ca9fb57683",
    "body" : "Ist aber auch im Messekalender nichts zu finden, was darauf hindeutet.",
    "username" : "Fluktuation8",
    "timestamp" : "2022-10-13T11:33:16Z"
  }, {
    "reportedcomment" : false,
    "_id" : "13071422-8840-49a8-934e-bf81570645d6",
    "body" : "Dankeschon!",
    "username" : "FunkierMonk",
    "timestamp" : "2022-11-20T12:30:07Z"
  }, {
    "reportedcomment" : false,
    "_id" : "a55816f9-3bc1-4016-81d5-ec30671f6725",
    "body" : "Thank you! Really helps!",
    "username" : "yappyboomerang2",
    "timestamp" : "2022-12-05T08:56:13Z"
  }, {
    "reportedcomment" : false,
    "_id" : "cbac3ae9-137f-42c4-8159-93215bd9d343",
    "body" : "Sorry, what does ÖPNV mean?",
    "username" : "Interesting-Wish-836",
    "timestamp" : "2022-12-16T21:36:00Z"
  }, {
    "reportedcomment" : false,
    "_id" : "a5fbc68d-792c-4da0-8721-f79a99e36b1b",
    "body" : "Gaming and adventures he likes activities but gets bored easily",
    "username" : "OrangePr1ncess",
    "timestamp" : "2023-01-06T08:49:40Z"
  }, {
    "reportedcomment" : false,
    "_id" : "12096415-c444-4372-8902-6099fb4ee3da",
    "body" : "Brilliant thanks for the advice.  Is it the same all over Germany?  \n\nI hate to think what worse than Berlin looks like.... :-(",
    "username" : "Prize_Passion_8437",
    "timestamp" : "2023-01-15T12:20:47Z"
  }, {
    "reportedcomment" : false,
    "_id" : "e2ebc23a-c3c9-426a-b44d-9ee47d8915bc",
    "body" : "Thank you so much.  \n\n\n:-)",
    "username" : "teZtinglotus",
    "timestamp" : "2023-09-09T19:24:27Z"
  }, {
    "reportedcomment" : false,
    "_id" : "24af2f3e-9450-4600-a1a2-79927e7a95a1",
    "body" : "Thank you so much for your elaborate answer (and sorry für meine verspätete Nachricht :))",
    "username" : "Fillester",
    "timestamp" : "2024-02-18T16:29:53Z"
  }, {
    "reportedcomment" : false,
    "_id" : "98a864d0-9a78-477b-8fe2-58247dccb7a7",
    "body" : "Here’s your reminder.",
    "username" : "panchoh12",
    "timestamp" : "2024-07-02T09:54:39Z"
  }, {
    "reportedcomment" : false,
    "_id" : "3627c8e4-8cb8-4b75-bf16-8c3457c57573",
    "body" : "They usually close at that very early time in many cities. I think they want to avoid super drunk people outsode of the regular super-drunk-people areas",
    "username" : "starfish0r",
    "timestamp" : "2021-12-17T20:13:49Z"
  }, {
    "reportedcomment" : false,
    "_id" : "de15ff7e-5f26-4a98-90d1-4df72322f628",
    "body" : "That's true but they fall under different regulations as they are on public property. There are several smaller christmas market on private grounds like at Buman & Sohn or Helios37 that maybe have different opening hours. But not sure about that.",
    "username" : "kundensupport",
    "timestamp" : "2021-12-17T17:14:19Z"
  }, {
    "reportedcomment" : false,
    "_id" : "87edef9b-e0e3-406c-a794-8e98122cbc99",
    "body" : "I use the DB Navigator app.",
    "username" : "kundensupport",
    "timestamp" : "2024-05-16T23:43:37Z"
  }, {
    "reportedcomment" : false,
    "_id" : "6003142d-4de6-4176-9b5a-3d6a49c5cbb3",
    "body" : "Usually most bars will have one kind of non-alcoholic beer, yes.",
    "username" : "kundensupport",
    "timestamp" : "2024-08-14T10:22:18Z"
  }, {
    "reportedcomment" : false,
    "_id" : "2024c8bf-6013-4939-87bc-f9bba4d548f4",
    "body" : "Hmmn, than I don't know. Another option would be the VRS eezy App. You tap a button when enter a train and tap it again when you get out and it automatically gives you the best price for the trip.",
    "username" : "kundensupport",
    "timestamp" : "2024-08-15T09:42:12Z"
  }, {
    "reportedcomment" : false,
    "_id" : "fe6a774f-589e-4e38-8fec-145637ce845e",
    "body" : "Because we have a housing crisis and landlords can be incredibly picky. Im pretty close to everything that landlords want in a tenant(except rich, bit i have a decent steady income) and it took me four months if searching every single day ro find a flat. If you dont send an application within an hour or two of the flat being online, you usually dont even get an answer. So you not being german and not speaking German adds a little risk for the landlord (communication issues, you just leaving the country one day without paying rent for example). Since they have dozens of other applicants, the smallest additional risk can get you denied.",
    "username" : "vodkaflavorednoodles",
    "timestamp" : "2024-09-20T17:33:27Z"
  }, {
    "reportedcomment" : false,
    "_id" : "437f7ff5-c140-4dc7-aa5b-de0d19daa9ef",
    "body" : "I'm a student at TH Köln myself, we get NRW tickets. I think I heard from a friend at Uni Köln that they only get VRS tickets, but looked it up again now, looks like they also get NRW tickets.",
    "username" : "Redditquaza",
    "timestamp" : "2021-12-18T10:15:46Z"
  }, {
    "reportedcomment" : false,
    "_id" : "7a28ae03-7da3-4204-a903-6a877fa03d37",
    "body" : "Looks like stuff like museums, restaurants and even bars stay open. But that could change anytime. I would probably postpone and come here in spring.",
    "username" : "kundensupport",
    "timestamp" : "2021-12-21T22:58:55Z"
  }, {
    "reportedcomment" : false,
    "_id" : "79e94ff1-f7e4-4d7a-93a6-b7919580c4b3",
    "body" : "Reminder: It's the carnival weekend, so double check if everything you planned is actually open.\n\nI was at the Odysseum with m then 5 year old nephew and it was only okay. I think being in elementary school would be better.\n\nWhen you're at the zoo you can also take with the cable train across the Rhine.",
    "username" : "kundensupport",
    "timestamp" : "2022-02-22T20:23:44Z"
  }, {
    "reportedcomment" : false,
    "_id" : "f41b0638-1833-432a-830a-131c08201fb0",
    "body" : "Na, we have so many nice restaurants.",
    "username" : "kundensupport",
    "timestamp" : "2022-04-12T17:21:50Z"
  }, {
    "reportedcomment" : false,
    "_id" : "33409eea-ba3d-4d0b-9244-4dd9368a5f88",
    "body" : "I know it can be pretty nerve-wracking to just wait for them, but in the worst case scenario and you don't have a room a couple weeks before the semester starts, call them and make a big drama. Otherwise I'd say just keep looking on WG Gesucht",
    "username" : "Expert_Donut9334",
    "timestamp" : "2022-06-19T08:52:05Z"
  }, {
    "reportedcomment" : false,
    "_id" : "c77d99d7-fc9f-4cb4-8fc0-84c34e29a417",
    "body" : "Good bot! Now I want to play Deep Rock Galactic!",
    "username" : "kundensupport",
    "timestamp" : "2022-07-24T20:46:14Z"
  }, {
    "reportedcomment" : false,
    "_id" : "ade2efd6-6607-40b4-a7eb-bbe09548c01d",
    "body" : "Mal die Jugendherbergen (Niehl/Deutz) gecheckt? Die haben okaye Doppelzimmer.",
    "username" : "kundensupport",
    "timestamp" : "2022-10-13T13:17:08Z"
  }, {
    "reportedcomment" : false,
    "_id" : "a42e9421-17c7-44d3-81c9-5dcc8d05492b",
    "body" : "All gaming related stuff is mostly happening during gamescom in August. That would probably be the most exciting thing to do in this regard. If he likes theme parks Phantasialand is pretty close and is much fun. Other than that I'm out of ideas unfortunately.",
    "username" : "kundensupport",
    "timestamp" : "2023-01-06T11:04:18Z"
  }, {
    "reportedcomment" : false,
    "_id" : "f5c5060b-dfcf-4003-a4d3-3f76e56c71f2",
    "body" : "Not everywhere. Mostly in dense populated urban areas.",
    "username" : "kundensupport",
    "timestamp" : "2023-01-15T15:48:26Z"
  }, {
    "reportedcomment" : false,
    "_id" : "91fe4c49-da1d-4ba3-a9eb-03dce8252621",
    "body" : "Oh, neat. I graduated from University of Cologne not long ago, and yes, we got NRW tickets.",
    "username" : "k-ramba",
    "timestamp" : "2021-12-18T10:31:12Z"
  }, {
    "reportedcomment" : false,
    "_id" : "7d0bd016-24a5-49dd-b062-d3487b452b43",
    "body" : "How often do you guys get updates on new rules?",
    "username" : "TradingToilets4Shoes",
    "timestamp" : "2021-12-22T03:04:19Z"
  }, {
    "reportedcomment" : false,
    "_id" : "1fabc004-e03c-41a1-a954-d08f4fea8423",
    "body" : "Is there any chance to get some carnival without buying a ticket for the stadium?",
    "username" : "Zahnriemen",
    "timestamp" : "2022-02-22T20:26:01Z"
  }, {
    "reportedcomment" : false,
    "_id" : "983ee2b2-e799-4eb9-bbf8-14cc539aec52",
    "body" : "Thank you! I'm very excited",
    "username" : "Picnut",
    "timestamp" : "2022-04-12T18:30:52Z"
  }, {
    "reportedcomment" : false,
    "_id" : "f2977428-4056-4a5f-8edc-c58d7cf370ec",
    "body" : "Cheers for the advice - much appreciated",
    "username" : "Prize_Passion_8437",
    "timestamp" : "2023-01-15T22:04:03Z"
  }, {
    "reportedcomment" : false,
    "_id" : "f5e35f86-3a71-4869-b3ba-84aa55438961",
    "body" : "It varies. If infection rate is rising there might be changes soon. Germany is a federation so each individual country can implement new regulations without having to wait for Berlin.",
    "username" : "kundensupport",
    "timestamp" : "2021-12-22T10:34:17Z"
  }, {
    "reportedcomment" : false,
    "_id" : "1d13c611-27b5-4bf9-bd83-652b32cda026",
    "body" : "According to the newspaper:\n\n> Die Persiflagewagen werden nach Durchfahrt des Innenraums in die Stadt fahren und an 12 Standorten entlang des „normalen“ Zugwegs jeweils paarweise aufgestellt. Die Standorte sind Chlodwigplatz, Severinskirchplatz, Waidmarkt, Schildergasse, Neumarkt, Rudolfplatz, Hohenzollernring, Appellhofplatz, Oper, Gürzenich, Heumarkt und Dom. Die Wagen werden dort über Nacht – dann beleuchtet - bis Dienstag gegen 14 Uhr stehen bleiben.",
    "username" : "kundensupport",
    "timestamp" : "2022-02-22T20:56:52Z"
  } ]
}