{
  "id" : 200030,
  "community_name" : "Riga",
  "username" : "Muizmuizmuiz",
  "post_body" : "Kā cīnaties mazā kolektīvā? Vadība izliekas neredzam. Dilemma - pēc 2 gadiem bulingotāja dodas pensijā.Darbi pārklājas.Sevis stutēšana debesīs,visa jaunā nicināšana, zināšanu noniecināšana, kažoka mētāšana, izmanto tavus vārdus pret tevi un nopelnu piesavināšanās.Grūti,liekas saslimšu.",
  "timestamp" : "2024-12-15 12:50:16",
  "num_comment" : 11,
  "reported_post" : false,
  "comment" : [ {
    "reported_comment" : false,
    "body" : "Ej prom no turienes.  \nTas ir vienīgais risinājums.  \nKad nokļūsi labākā vietā, pats(-i) brīnīsies par to, kā tas ir iespējams, ka pastāv normālas darba vietas.\n\nViens jautājums intereses pēc. Vai tas ir vīriešu vai sieviešu kolektīvs?",
    "username" : "Available-Safe5143",
    "timestamp" : "2024-12-15 12:57:07"
  }, {
    "reported_comment" : false,
    "body" : "Te bij viens gudra psihologa padoms - pieņem, ka tu atrodies trakomājā un visi tev apkārt ir attiecīgi - pacienti.\n\nNo tā kas man apkārtnē, var ieteikt - galvenais lai tavs lauciņš būtu sakopts cik iespējams ar cik maz iespējamu laika patēriņu. Slavē un stutē to personu, vērsies lai pieņem lēmumus viņa, lai visa atbildība iet uz viņu. Visādas procedūras un pieņemtā prakse un amatapraksti ir tik jauka padarīšana, lai citiem birokrātiski čakarētu mozgas, ja ir laba pieredze. Galvenais saglabāt visu dokumentētu un lai pec iespējas būtu vadība uz cc visā.",
    "username" : "Ok_Corgi4225",
    "timestamp" : "2024-12-15 12:50:16"
  }, {
    "reported_comment" : false,
    "body" : "Hehe, stāsts gandrīz 1:1 ar mani, jau 3 gadus velkas, bet pēdējā laikā ir kosmoss. Situācija drausmīga, viņa dodas pensijā pēc 4 gadiem. Es izlēmu iet prom nākamgad martā, kādu laiku padzīvot uz bezdarbnieku pabalstiem un domāt, ko darīt. Kāpēc martā? Jo tad sākas pavasaris, negribējās pa drūmo ziemu sākt savu atveseļošanās ceļu.\n\nMan gan ir lielisks atbalsts aiz muguras, nezinu, kā ir Tev. Kādu laiku vīrs varētu nosegt maksājumus, kamēr es pa psihoterapeitiem pastaigāju, atgūstos :D\n\nTad nu ar visu šo lēmumu, ka man nevajag tādu toksisku vidi paciest... es paliku stāvoklī un... dekrēts sāksies tieši martā! :) Tieši tā, kā biju plānojusi, sagaidīt skaisto pavasari prom no visām šīm šausmām, kas ir darbā. Varam pateikt paldies Latvijas demogrāfijas uzlabotājai- toksiskajai kolēģei :))))\n\nP.S. Ja gribas parunāties, dod ziņu!!",
    "username" : "shushimushii",
    "timestamp" : "2024-12-15 18:45:37"
  }, {
    "reported_comment" : false,
    "body" : "Eksperts-šmeksperts studijā.\n\nSāksim ar tēlainu stāstījumu.\n\nŠī ir tā situācija dzīvē, kad Tu atrodies cīņā.\n\nJa tu būtu treniņā vai sacenītēs, iedomājies, tevi kāds klopē, rauj, grib nogāzt uz zemes, žnaugt un vēl dievs ko. Ejot padeni uzliek. Fakuci vēl parāda. Ko tu? Dusmojies, ciet, bet tu neesi izpratusi vienu lietu-ja tev kaut ko dara, tev ir visas tiesības darīt to pašu pretim. Nē nu labi, protams, ka juridiski nē, ķip menti jāsauc, HR jāraksta, jāiet jārunā. Tikai īstenībā, pēc fakta nekas ne sūda nemainās, personu nesauc pie atbildības, kam tur asāka mēle, kam tur smirdīgāka peža, bet viss jau ķip ok. Tu jau pati saprati, ka tev ir tieši tādas pašas tiesības uz vidi, cieņu un visu pārējo, ko tā kaza negrib ievērot, bet ko tu nesaproti ir tas, ka tu tieši tāpat kā viņa vari bļaut viņai sejā. Vai nē. Raksti papīru. Vēl vienu, vēl vienu, vēl vienu...un izbaudi procesu, jo taisnība ir tāvā pusē. Kas tad tev būs? Reāli, ko tieši viņa tev var izdarīt, smirdīgi virsū uzelpot?\n\nBET STOP!\n\nIzrādās šī ir double whammy situācija, šīs ir bomžu cīņas-tā vietā lai pretim stāvētu divi vienlīdzīgi cilvēki, viens ir kaut kāds no ielas savākts urļiks, kas visu dzīvi cilvēkus pizģījis, jo tas viņam sagādā baudu, bet otrs cilvēks ir bomzis-cilvēks, kas šajā avantūrā ir, jo iekšā ir silts un komfortabls un viņam par to labi samaksāja.\n\nLabi, ne vislabākais salīdzinājums, bet es noprotu, ka tu, pretēji urlāniem un gopņikiem, neizjūti baudu no šādiem procesiem. Tu negribi cīnīties. Tu nenosūtīji sūdzību, lai gan to uzrakstīji (šis gan ir nē-nē solis). \n\nPieņemu, ka tev, ir vairāk agreeable, jeb saticīgs temperaments un konflikti tev nepatīk kā tādi. Drīzāk cietīsies un paslaucīsi zem tepiķa.\n\nReāli, spēka nepietiks uzrakstīt visus iemeslus, kāpēc tas tomēr neder, bet īsumā-tu tak negribi būt bomzis kuru pizģī? Tā dzīve  irkāda ir, par spīti tavām preferencēm tā teikt, tiesībām un citām lietām, cilvēki ir kādi ir,  un dažkārt  ir jāmāk vai nu TIEŠĀM pacelties tam pāri, tā teikt, izmantot greyrock metodi pret šādiem morālajiem pydarasiem, vai tieši otrādāk, ir jāmāk nolaisties līdz viņu līmenim, jo tikai šajā zonā šie cilvēki saprot un tikai šādi ar viņiem var tikt galā reizi par visām reizēm.\n\nKļūsti par cīnītaju vai kļūsti Zen, izvēlies, kas tavai veselībai nekaitīgāk, bet dzīvē noteikti noder abi.\n\nP.S. Es rakstīju skaidrā, bet ātri-ja kaut kas sanāca murgaini var jautāt.",
    "username" : "Mediocre_Owl7613",
    "timestamp" : "2024-12-18 10:17:59"
  }, {
    "reported_comment" : false,
    "body" : "Izklausāa pēc valsts pārvaldes",
    "username" : "LemarIsNotTaken",
    "timestamp" : "2024-12-18 11:53:06"
  }, {
    "reported_comment" : false,
    "body" : "Sieviešu. Jau 15 gadus besos.. Darbs ļoti latīk un  labi apmaksāts, bet vienas dēļ gadā kādas 360 dienas nodomāju vai tas ir to vērts. Tagad atkal domāju, ja jau izturēju tik ilgi un nesalūzu, varbūt 2 ir sīkums. Man liekas, ka man smadzene vairs nespēj atbrīvoties. Kā sektā. Varbūt meklēt psih palīdzību, tikai nezinu ko īsti.",
    "username" : "Muizmuizmuiz",
    "timestamp" : "2024-12-15 13:01:26"
  }, {
    "reported_comment" : false,
    "body" : "Paldies, ka padalies! Man vēl dien dienā, kad kaut kas ir jārisina, tad ir manipulatīvais teksts \"mēs\", \"mūs\", \"mums\". Un tas, ka no vadības tiek skandēts \"komanda\" utt, sajūta, kā nobloķētai, jo ja teikšu skaļi, ka \"dari pati\", iešaušu sev kājā. \n\nPie sevis es nopukstu, ka tad, kad darbs jādara, tad ir \"mēs\", savukārt, kad pie bankomāta jāstāv, tad ir \"es\". Tas, protams, salīdzinājums.\nViņa pat nekaunas atklāti kā joku skandēt, ka dzīvē lielākā māksla esot iesēsties otram čuprā.\nVadītāja blisina acis un smaida kā joku dzirdējusi.",
    "username" : "Muizmuizmuiz",
    "timestamp" : "2024-12-15 20:47:03"
  }, {
    "reported_comment" : false,
    "body" : "Oh, paldies par iedvesmu! Sāku darīt pretī, plīsa vaļā un visu klātbūtnē pateicu, kas notiek. Nervi vibrēja un pašlaik ir saspringts klusums 3. dienu. Grūtākais ir pusdienlaikā, kad sanāk darba ēdamtelpā pie viena galda pusdienot. Es šīs  dienas esmu izvairījusies. Vadība šo pusdienlaika paēšanu nez kapēc ir pasludinājusi, ka \"tad arī pārspriežam visu par darbu\". Man vienmēr ir gribējies teikt, ka es tagad gribu mierīgi paēst nevis atkal iziet vārdu cīņas raundā ar jums. Tā nodot kārtīgi pa bundžām nekad nav izdevies, jo vienmēr pusdebīli izdalot sīkus smiekliņus, tiek pateikts, ka \"neviens jau netraucē arī ēst\". Nu, vārdsakot, sviests. Pašlaik, liekas, esmu tā, kas \"buntojas\". Grūti pieņemt, ka vakar viss kolektīvs uz mani skatījās un prasīja kā svinēsim Zsv. Bulingotāja atklāi smīnot piecēlās no galda. Man raudāt gribas, jo labprāt mazgātu grīdu visu dienu vai raktu.",
    "username" : "Muizmuizmuiz",
    "timestamp" : "2024-12-18 11:22:03"
  }, {
    "reported_comment" : false,
    "body" : "Nezinu gan kādā industrijā tas ir, bet Tu vari darīt to pašu lietu citviet, baudīt šo darbu, bet klāt tam - Tev būtu labs kolektīvs.\n\nVienkārši, es pats pastrādāju vairākās labās vietās, ar iespaidīgiem labumiem, labām algām, attālinātā darba iespējām, bet kolektīvs tur ēda viens otru. Toksiskums, visi vaino viens otru, smejas viens par otra \"stulbumu\", u.t.t.\n\nPamainīju darbu, un atklāju, ka to pašu darbu var darīt ar ļoti uzticamu, izpalīdzīgu un saprotošu kolektīvu. Ka tiešie vadītāji var nostāsties Tavā pusē, nevis uzņēmuma pusē. Ka kļūdas tiek piedotas un pat esi mudināts mēģināt, kļūdīties un iemācīties ko jaunu.\n\nEs zinu, ka 15 gadi ir daudz un mainīt ko tādu ir grūti.   \nJa Tu saredz, ka konkrētās toksistās darbības un attieksme nav ok, tad Tu esi pelnījis(-usi) ko labāku.  \nPsihoterapeits palīdzēs ar sekām, bet nepalīdzēs ar celoņiem.  \nEs ieteiktu uzstādīt mērķi meklēt darbu lēnām. Nu tā, divas reizes nedēļā pa stundai veltīt meklējumiem. Lai atrastu tieši to, kas aizrauj.  \nLatvijā tiešām kļūst laba, izglītota un strādātgriboša darba spēka.\n\nVēlu veiksmi, Tev viss izdosies :)",
    "username" : "Available-Safe5143",
    "timestamp" : "2024-12-15 13:24:05"
  }, {
    "reported_comment" : false,
    "body" : "Es nopietni apsvēru rakstīt iesniegumu personāldaļai, īstenībā jau uzrakstīju, bet nenosūtīju. Tad aprunājos ar vadītāju, kura, protams zina, kāda ir situācija ar šo kolēģi, jo es jau neesmu pirmā, kurai ar viņu ir konflikts. Viņas atbilde bija uz šo visu: \"Viņa jau nav ļauna, tikai ar tādu asāku mēli.\" Tad es viņai teicu, jā, tieši tāpēc es gribēju iet caur personāldaļu, lai saprot, ka šāds komunikācijas stils, kas otram liek justies slikti, NAV normāls.\nŠī mana \"jaukā\" kolēģe arī manā pirmajā darba dienā pateica tekstu: \"Mēs esam kolēģi, nevis draugi.\" Nu, tas jau arī bija sarkanais karogs, ka nebūs labi :)\n\nIesaku iet prom, ja nav iespēju, ka šo kolēģi atlaiž no darba. 2 gadi ir ļoti ilgs laiks, lai tik slikti justos!",
    "username" : "shushimushii",
    "timestamp" : "2024-12-15 20:58:05"
  }, {
    "reported_comment" : false,
    "body" : "Augstākā vadība regulāri liek pildīt dažādua testus par vidējo temperatūru palātā, sūta epastā visādas.lekcijas un piedāvājumus kā atpūsties un rūpēties par sevi mentāli, tikai liekas, ka tas ķeksītim, modes lieta un, ja es tiešām dotos pie viņiem, droši vien tiktu vēl vairāk nosmīkņāta un teikts, ka sūdzos.",
    "username" : "Muizmuizmuiz",
    "timestamp" : "2024-12-15 21:17:39"
  } ]
}