{
  "Id" : 200002,
  "Community_name" : "Paris",
  "Username" : "amy-schumer-tampon",
  "Post_body" : "Pensez vous finir vos jours a Paris ?",
  "Timestamp" : "2024-12-22 22:10:33",
  "Num_comment" : 40,
  "reported_post" : false,
  "Commenti" : [ {
    "Username" : "BK010989",
    "reported_comment" : false,
    "Timestamp" : "2024-12-22 22:15:18",
    "Body" : "Oui totalement. J’adore la France entière mais Paris… c’est juste… la maison. J’y suis trop attachée"
  }, {
    "Username" : "johnnys7788",
    "reported_comment" : false,
    "Timestamp" : "2024-12-22 22:10:33",
    "Body" : "J'aime Paris, mais la météo commence vraiment à me peser.\nLes journées de grisaille semblent s''enchaîner sans fin, et les rares jours de soleil semblent faire exception. Je ne dis pas que Paris ait été particulièrement ensoleillée par le passé, mais ces dernières années, j'ai l'impression que le soleil est plus rare. \n\nC'est peut-être juste une impression, mais j'espère pouvoir passer mes vieux jours dans un endroit plus paisible et ensoleillé, même si ma carrière me retient encore pour le moment. Il y a des coins sympas dans le sud."
  }, {
    "Username" : "Mrcactus90",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 00:13:20",
    "Body" : "Je suis parisien.\n\nJ’ai grandi à Paris, entre le 13ᵉ et le 5ᵉ arrondissement, et j’ai poursuivi mes études à Londres. Aujourd’hui, je vis dans le 15ᵉ. Honnêtement, je ne me vois pas habiter ailleurs que dans une grande ville.\n\nBien sûr, parfois c’est le chaos : le temps est gris, il pleut sans s’arrêter et il y a toujours quelqu’un d’étrange qui veut te coller sans raison. Mais, il y a tellement de belles choses à voir, de conversations à partager et de plats à découvrir. Et puis, ces rares moments où l’on peut prendre un peu de hauteur sur Paris me touchent toujours autant."
  }, {
    "Username" : "Chuusei_",
    "reported_comment" : false,
    "Timestamp" : "2024-12-22 22:35:28",
    "Body" : "Oui, sans aucun doute. Cette ville a beaucoup de défauts mais j'y suis trop attachée pour ne serait-ce qu'envisager de partir."
  }, {
    "Username" : "Mouffles",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 01:40:18",
    "Body" : "Pour les transports, les soins et les hopitaux c’est surement la meilleure ville de France pour ça. L’accessibilité je n’en suis pas certain par contre vu les transports en commun."
  }, {
    "Username" : "flyblown",
    "reported_comment" : false,
    "Timestamp" : "2024-12-22 22:51:41",
    "Body" : "J'adore Paris et je compte rester le temps que je peux en profiter. Mais à un moment donné, je partirai"
  }, {
    "Username" : "Tchaikovskin",
    "reported_comment" : false,
    "Timestamp" : "2024-12-22 23:07:30",
    "Body" : "Non, j’adore Paris et je passe un super moment, mais j’ai besoin d’accès à la nature et de vie un peu plus “simple”. Mais la diversité culturelle parisienne va carrément me manquer"
  }, {
    "Username" : "WorriedWorry1371",
    "reported_comment" : false,
    "Timestamp" : "2024-12-22 23:56:14",
    "Body" : "Non."
  }, {
    "Username" : "Moug-10",
    "reported_comment" : false,
    "Timestamp" : "2024-12-22 22:21:16",
    "Body" : "Non. C'est pour les études et le début de la vie active. Après, on ne sait pas de quoi demain sera fait."
  }, {
    "Username" : "CMDRJohnCasey",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 01:54:42",
    "Body" : "Non. J'espère pouvoir retourner sur le bord de la Méditerranée là où j'ai grandi. Paris j'aime bien mais honnêtement je ne suis là que pour y travailler."
  }, {
    "Username" : "Garsbriel",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 09:58:42",
    "Body" : "Je suis né à Paris, hôpital Saint Antoine. Et j'ai pratiquement toujours vécu en banlieue. À cause de mon asthme infantile, mes parents ont dû déménager fin 59, sinon c'était cure à la Bourboule tout au long de l'année. \n\nOn l'a oublié maintenant, mais Paris était encore plus polluée que maintenant à cause du chauffage au charbon et des trains à vapeur, sans compter la pollution automobile et les interminables bouchons.\n\nJe ne me vois pas forcément vivre à Paris à cause de la chaleur l'été."
  }, {
    "Username" : "Serendipi-me",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 01:01:49",
    "Body" : "Je suis né et j'ai été élevé à Paris, dans le 5ème arrondissement.\n\nJ'ai voyagé dans toute l'Europe, en Asie, en Amérique du Nord. J'ai longtemps cru que rien ne me serait plus doux que de m'éteindre rive gauche.\n\nMais aujourd'hui je ne reconnais plus la ville et les clans qui l'occupent et s'affrontent. Le piéton est le nouveau Gazaoui : les bonnes consciences le pleureront quand il aura disparu... Le plus vite possible ! \n\nDe cosmopolite et multiculturelle, Paris est devenue une ''ville ouverte'' : livrée à l'occupant dans l'espoir qu'il n'y fera pas trop de dégâts. Peine perdue : de bites en banquettes, de couloirs en pistes, l'espace urbain est divisé, sectorisé, massacré.\n\nLes villages qui composaient ce grand patchwork on disparu.  Les marchés se sont réduits, les bouchers les premiers ont baissé le rideau, suivi par tous les petits commerces chassés par des loyers indécents. On n'achète plus une baguette, mais une bannette... de Pelleport à la Croix Nivert, tous les franprix se ressemblent. \n\nBref.\n\nC'est le sens de l'histoire, comme dirait une édile en préretraite (plus que 18 mois, courage). Moi je m'exile en Bourgogne. Je m'exile ?  Non : je renais au milieu de gens vrais connectés à la terre et pour lesquels l'écologie ne se limite pas à promener ses poubelles multicolores en vélo cargo.\n\nBon courage à ceux qui restent,  puissiez vous voir la ville renaître après 2026 🙏"
  }, {
    "Username" : "LeRaminagrobis",
    "reported_comment" : false,
    "Timestamp" : "2024-12-22 22:56:43",
    "Body" : "Oui ! \n\nEn tout cas en l'état actuel des choses je ne me vois pas habiter durablement ailleurs et je serais ravi d'un vieillir entouré de choses que j'aime."
  }, {
    "Username" : "ClarkSebat",
    "reported_comment" : false,
    "Timestamp" : "2024-12-22 23:41:27",
    "Body" : "Probablement."
  }, {
    "Username" : "Jennifer24242424",
    "reported_comment" : false,
    "Timestamp" : "2024-12-22 23:57:22",
    "Body" : "Je ne sais pas. Pour le moment je travaille à Paris donc j'y reste. C'est sympa et pas besoin de voiture. Je n'arrive pas à me projeter dans le futur. Paris m'offre le travail alors je reste. Et puis cela fait 20 ans que j'y suis, c'est une belle ville 😃"
  }, {
    "Username" : "StoreWeak5292",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 00:48:44",
    "Body" : "Non"
  }, {
    "Username" : "Alternative_Ad_3300",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 02:04:22",
    "Body" : "Si la vie le permet, oui"
  }, {
    "Username" : "minuipile",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 08:38:53",
    "Body" : "Il y a des chances... J'ai besoin d'un suivi médical qui ne va pas s'améliorer avec le temps... Donc ceci explique cela."
  }, {
    "Username" : "Aromatic-Bell-7085",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 08:50:18",
    "Body" : "Je suis sur la région parisienne proche Paris depuis 2013.je suis du Sud.et un jour je retournerai dans le Sud."
  }, {
    "Username" : "fm75",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 10:27:55",
    "Body" : "Oui. Je suis expat depuis 2005 et c'est une ville magnifique. Cette année j'ai aussi acheté ma résidence principale à côté - secteur Boulogne - donc je vais littéralement y passer le reste de ma vie et ça me va très bien! 😂"
  }, {
    "Username" : "gamoulox",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 11:55:59",
    "Body" : "Je l’espère oui"
  }, {
    "Username" : "pvalverdee",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 13:38:01",
    "Body" : "Oui, 100%"
  }, {
    "Username" : "encreturquoise",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 13:42:32",
    "Body" : "Oui, je ne me vois pas vivre ailleurs"
  }, {
    "Username" : "hyp_reddit",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 14:31:21",
    "Body" : "absolument pas\n\nparis est bien pour travailler et avoir unbon salaire mais la retraite sera ailleurs"
  }, {
    "Username" : "fdesouche",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 15:21:16",
    "Body" : "Non, j’ai besoin d’un jardin et de vraie gadoue. Ce sera la Normandie mais je garderai mon chez moi parisien et le marocain aussi"
  }, {
    "Username" : "Additional-Bed365",
    "reported_comment" : false,
    "Timestamp" : "2024-12-22 23:15:04",
    "Body" : "Plutôt mourir"
  }, {
    "Username" : "RubberDuck404",
    "reported_comment" : false,
    "Timestamp" : "2024-12-22 23:45:48",
    "Body" : "J'aimerais bien mais je ne sais pas si j'aurais les moyens financièrement quand je serais à la retraite. Je pense que le coût de la vie m'aura fait partir d'ici là malheureusement."
  }, {
    "Username" : "DoublePsychology9598",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 03:06:19",
    "Body" : "C'est une très bonne question je vis à Paris et en ce moment je crois que je vais regagner une petite ville tranquille qu'on appelle Vichy pour la tranquillité"
  }, {
    "Username" : "Hartmallen",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 10:12:13",
    "Body" : "Absolument pas."
  }, {
    "Username" : "ReinePoulpe",
    "reported_comment" : false,
    "Timestamp" : "2024-12-22 23:02:47",
    "Body" : "Jusqu’à récemment, je me voyais facilement finir ma vie à Paris. J’adore cette ville, son architecture, sa vie culturelle, son cosmopolitisme. \n\nMais avec le réchauffement climatique qui se fait de plus en plus sentir et les épisodes de canicule de plus en plus longs et intenses (pas en 2024, certes), j’en suis beaucoup moins sûre. Les épisodes de canicule sont particulièrement pénibles dans cette ville et sa banlieue.\n\nCertes la municipalité actuelle fait de gros efforts pour adapter la ville aux fortes chaleurs végétaliser et réduire la place de la voiture, mais la ville part de très loin et pour le moment, la banlieue suit à pas mesurés. Je crains que d’ici 2050, ce soit un coin trop hostile 4 mois par an pour pouvoir y rester."
  }, {
    "Username" : "Zgnorf",
    "reported_comment" : false,
    "Timestamp" : "2024-12-22 22:46:41",
    "Body" : "Je n'envisage pas d'en partir pour le moment.\nC'est trop cool Paris."
  }, {
    "Username" : "Alps_Disastrous",
    "reported_comment" : false,
    "Timestamp" : "2024-12-22 23:53:36",
    "Body" : "Ben oui, pourquoi pas ? Ça ne devrait pas ?"
  }, {
    "Username" : "Relative-Tune85",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 02:14:14",
    "Body" : "Non puisque je n'y habite pas."
  }, {
    "Username" : "Captain_Flemme",
    "reported_comment" : false,
    "Timestamp" : "2024-12-22 22:36:37",
    "Body" : "J’ai l’impression que c’est presque devenu inavouable en public. Les gens aiment tellement cracher sur la ville pour je ne sais quelle raison. Alors que oui, Paris c’est la maison."
  }, {
    "Username" : "Mrcactus90",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 00:15:34",
    "Body" : "Absolument ! Fluctuat nec mergitur"
  }, {
    "Username" : "fm75",
    "reported_comment" : false,
    "Timestamp" : "2024-12-22 22:12:46",
    "Body" : "Je suis rentré d'Irlande l'année dernière et Paris me semble une ville dans un pays tropical 😂"
  }, {
    "Username" : "Exact_Deal1348",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 06:55:11",
    "Body" : "On a été gâté en 2022 et c'était même trop"
  }, {
    "Username" : "Mouffles",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 01:42:57",
    "Body" : "Le mauvais temps c’est bien pire ailleurs, t’as encore moins de choses à faire quand il fait moche en province."
  }, {
    "Username" : "BK010989",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 06:23:31",
    "Body" : "Oui c’est vrai ! On me demande souvent quand est-ce que je vais partir, pourquoi je reste, « mais si t’as des enfants » … je comprends pas pourquoi se justifier"
  }, {
    "Username" : "johnnys7788",
    "reported_comment" : false,
    "Timestamp" : "2024-12-22 22:14:32",
    "Body" : "Oui tout est relatif. C'est sûr."
  } ]
}