{
  "postId" : 200251,
  "community" : "London",
  "username" : "tylerthe-theatre",
  "post" : "Rise in attacks on police is due to ‘lack of respect of authority,’ Met chief Sir Mark Rowley tells LBC",
  "timestamp" : "2024-12-23T09:32:46Z",
  "numcomment" : 113,
  "reportedpost" : false,
  "comment" : [ {
    "reportedcomment" : false,
    "body" : "Plus you'll come back in for your next shift and it would be NFA.",
    "username" : "MassiveVuhChina",
    "timestamp" : "2024-12-23T10:00:43Z"
  }, {
    "reportedcomment" : false,
    "body" : "He's right but it's a vicious circle. There's many people out there who are intimidating, violent etc but get away with it because the Police don't bother turning up or just give them a slap on the wrist when they do. The more people get away with stuff the more they will push the boundaries.",
    "username" : "London--Calling",
    "timestamp" : "2024-12-23T09:35:42Z"
  }, {
    "reportedcomment" : false,
    "body" : "The proper answer to this question requires a much larger scoped  answer than anyone who writes or reads a newspaper to understand or convey.",
    "username" : "Angry_Wizzard",
    "timestamp" : "2024-12-23T10:47:44Z"
  }, {
    "reportedcomment" : false,
    "body" : "Whether the police are deserving of respect or not this is an end consequence of years of disinformation claiming authorities are lying about everything and cannot ever be trusted",
    "username" : "markusw7",
    "timestamp" : "2024-12-23T09:57:36Z"
  }, {
    "reportedcomment" : false,
    "body" : "I had a no fault crash a few years ago when someone pulled out of a side street while I had right of way. \n\nThe police were not at all kind or nice when they arrived, but I deemed it as them not trying to show sides? The offender was a young lad who's car was packed to the brim, casually eating sweets as he told me this stuff happened to him all of the time.\n\nAfter the initial assessment and waiting for the car to be towed an officer approached me and said he could smell weed and that I had to do a drugs test for it. I was in shock at the time and complied, despite clearly not smelling of weed or showing any signs of being innebreiated. \n\nHe held me in the police car for 45 minutes waiting for the test to come up positive. Just kept turning back to look at me then the test. When it was pretty obvious that I was sober he was clearly disappointed and frustrated, then told me that I was lucky it was clear \"You would have been locked up\". \n\nLike, fuck off mate? I'm sober and just had my car written off? Lost any remaining respect for the police about then",
    "username" : "HalfJaked",
    "timestamp" : "2024-12-23T10:58:30Z"
  }, {
    "reportedcomment" : false,
    "body" : "I’ve personally seen loads of “challenge the police” type videos on various social media platforms. All\nSpecifically in the uk. It’s almost like someone outside the UK is trying to sew decent in this country ",
    "username" : "Parking_Aerie3734",
    "timestamp" : "2024-12-23T09:37:34Z"
  }, {
    "reportedcomment" : false,
    "body" : "Quite scary to me that someone so senior in the Police Service has such a one dimensional and simplistic view of this.",
    "username" : "Stunning-North3007",
    "timestamp" : "2024-12-23T11:48:02Z"
  }, {
    "reportedcomment" : false,
    "body" : "Maybe if authority was deserving of respect?",
    "username" : "ohmyblahblah",
    "timestamp" : "2024-12-23T09:41:13Z"
  }, {
    "reportedcomment" : false,
    "body" : "![gif](giphy|uQHtUvva9Qljy)",
    "username" : "joe_hello",
    "timestamp" : "2024-12-23T10:41:20Z"
  }, {
    "reportedcomment" : false,
    "body" : "Which itself is due to... what, Mark? Wanna continue this thought just a lil further, hmm?",
    "username" : "false_flat",
    "timestamp" : "2024-12-23T09:59:24Z"
  }, {
    "reportedcomment" : false,
    "body" : "Criminals think to themselves 'am I going to jail for being an outrageous c#@t today' the answer is no. Police are the scape goat for government under funding. The jail's are full and cops are seen as a wet blanket. What does that tell you.",
    "username" : "Fantastic_Camel_1577",
    "timestamp" : "2024-12-23T12:24:36Z"
  }, {
    "reportedcomment" : false,
    "body" : "so the reason we don't attack police is because we respect authority?",
    "username" : "dpoodle",
    "timestamp" : "2024-12-23T10:07:31Z"
  }, {
    "reportedcomment" : false,
    "body" : "I wonder why? \n\nhttps://www.google.com/search?q=met+police+scandals",
    "username" : "Blandiblub",
    "timestamp" : "2024-12-23T09:32:46Z"
  }, {
    "reportedcomment" : false,
    "body" : "I rather think that if you expect people to respect your authority you should lead by example, and let's face it our authority figures; the met, the royals, parliament, C of E etc haven't exactly covered themselves in glory over the last decade.\n\nA fish rots from the head.",
    "username" : "SmokyBarnable01",
    "timestamp" : "2024-12-23T11:07:45Z"
  }, {
    "reportedcomment" : false,
    "body" : "Lack of respect for authority is caused by lack of respect BY authority \n\nIf the Met sort out their own corruption, racism, assault, rape and murder then maybe the public might respect them a little more",
    "username" : "JimmyBallocks",
    "timestamp" : "2024-12-23T11:13:06Z"
  }, {
    "reportedcomment" : false,
    "body" : "The police are incapable of tackling street crime, society has been run by a bunch of scam artists who did whatever they wanted for years. On top of that, the police are in the news on a weekly basis because their officers are arrested for rape, abuse, etc. It's a mess, and the police have their part to pay in it.",
    "username" : "unbelievablydull82",
    "timestamp" : "2024-12-23T10:25:04Z"
  }, {
    "reportedcomment" : false,
    "body" : "The Met police aren’t taken seriously for very good reason",
    "username" : "ueffamafia",
    "timestamp" : "2024-12-23T09:37:37Z"
  }, {
    "reportedcomment" : false,
    "body" : "The police do fuck all to prevent the widespread theft and they crack down on nightlife venues for a couple of drug deaths and a stabbing (talking about drumsheds here) when Winter Wonderland has violence every year even an acid attack this year and they do nothing.",
    "username" : "RamboRobin1993",
    "timestamp" : "2024-12-23T11:41:29Z"
  }, {
    "reportedcomment" : false,
    "body" : "Invest in the prison estate and the police force and see an upswing in respect for authority ensue",
    "username" : "Smiley_Dub",
    "timestamp" : "2024-12-23T10:00:34Z"
  }, {
    "reportedcomment" : false,
    "body" : "Maybe nobody respects the Met due to the out of control corruption, incompetence and utter lack of effort in solving crimes against the public like the rampant mobile phone theft?",
    "username" : "codernaut85",
    "timestamp" : "2024-12-23T10:27:08Z"
  }, {
    "reportedcomment" : false,
    "body" : "Kinda hard to respect rapists and murders at worst and a bunch of bullies at best. Ive been verbally abused and threatened for being the victim of crime. Ive seen teenagers beaten bloody. Ive seen loads of issues over the years with the police both as a regular joe and as someone who worked with them. \n\nSo you can point that fucking finger up your arse, mate. The failure of respect came from your side LONG before it came from us.",
    "username" : "BarnabyBundlesnatch",
    "timestamp" : "2024-12-23T12:05:32Z"
  }, {
    "reportedcomment" : false,
    "body" : "I swear on my life this is true. My pregnant wife and I was assaulted with a weapon outside \nA police station. We gave the exact time stamp for cctv and reported it. No further action after a week.",
    "username" : "lalabadmans",
    "timestamp" : "2024-12-23T13:47:21Z"
  }, {
    "reportedcomment" : false,
    "body" : "I feel sorry for the police. Part of the underpaid public face of a corrupt, self serving system - a farm for humans.",
    "username" : "Striking-Passage-752",
    "timestamp" : "2024-12-23T14:25:11Z"
  }, {
    "reportedcomment" : false,
    "body" : "The thing Rowley doesn't get is that authority has to earn people's respect. It isn't given automatically.",
    "username" : "TomLondra",
    "timestamp" : "2024-12-23T09:59:49Z"
  }, {
    "reportedcomment" : false,
    "body" : "Oooh, I dunno, Mr Rowley, could it because you and far too many of your officers are racist, misogynist cockwombles?",
    "username" : "JohnDStevenson",
    "timestamp" : "2024-12-23T10:05:12Z"
  }, {
    "reportedcomment" : false,
    "body" : "Maybe do your job properly then. You know what you're paid to so.",
    "username" : "Puzzleheaded-Ad-6530",
    "timestamp" : "2024-12-23T10:02:07Z"
  }, {
    "reportedcomment" : false,
    "body" : "I have no respect for authority. I do not attack people. I have respect for humanity.",
    "username" : "YSNBsleep",
    "timestamp" : "2024-12-23T10:16:50Z"
  }, {
    "reportedcomment" : false,
    "body" : "I disagree with these attack but they do not have respect even to themselves",
    "username" : "Haha_Kaka689",
    "timestamp" : "2024-12-23T10:38:46Z"
  }, {
    "reportedcomment" : false,
    "body" : "Because fuck-all happens when people break the law?\n\nBecause police call criminals ‘suspect’ even when they witness a crime happen.",
    "username" : "IsDinosaur",
    "timestamp" : "2024-12-23T10:14:11Z"
  }, {
    "reportedcomment" : false,
    "body" : "Police aren’t responsible for the result of the investigation. The slap in the wrist is from the courts. \n\nThe police have to decide which calls to go to. If you have two calls one with a higher risk then guess which one they go to. It’s not a case of them not bothering to. If we don’t pay for the police sufficiently they have to make a decision on which one is more serious.",
    "username" : "Awkward_Swimming3326",
    "timestamp" : "2024-12-23T10:03:20Z"
  }, {
    "reportedcomment" : false,
    "body" : "Gee, it's like we're at shadow war with a country known for hybrid warfare including mass social media PsyOps campaigns.\n\nSay it with me: We're in asymetrical warfare with Russia. Russia has racked up at least 150 direct hybrid warfare attacks on NATO infrastructure, from the underseas cables, to hospitals, GPs, transport. Russia is hacking and disrupting us.\n\n\"About 150 cases of Kremlin-backed hybrid operations on NATO territory have occurred since Russia launched its full-scale invasion of Ukraine in February 2022, the Helsinki Commission, an independent U.S. government agency, said in a report issued Friday.\"\n\n[https://www.stripes.com/theaters/europe/2024-12-16/russia-nato-shadow-war-16181028.html](https://www.stripes.com/theaters/europe/2024-12-16/russia-nato-shadow-war-16181028.html)",
    "username" : "SwordfishSerious5351",
    "timestamp" : "2024-12-23T13:58:37Z"
  }, {
    "reportedcomment" : false,
    "body" : "Is that disinformation though? I mean look at Starners first few months in office...",
    "username" : "pulphope",
    "timestamp" : "2024-12-23T10:04:40Z"
  }, {
    "reportedcomment" : false,
    "body" : "Had a cop challenge me in my car. It had been broken into the night before, and I was looking over the damage. Steering column was super fucked and needed towed to a garage. Anyway, Im sitting in the car when CID pull up in front of the parked car like Starsky and Hutch. Bail out with extendables fully erect and ready go, and are eyeballing me like like the last turkey at christmas. Drag me out, acting like Im driving the parked, broken, not on engine and ready to boot it away. \n\nSo, I explain the details. I further explain that they should already know this, since they responded the night before and took a detailed report. Had caught in the cunts in the act, and was really a big deal only 8 hours earlier. So there I am, standing outside my house and the prick says \"Where do you live?\". So I point and say \"there.\". Prick gets right in my grill and starts calling me all the cheeky little cunts under the sun. A bit of back and worth, because I wont fucking stand being spoken to like that, and he finally asks the question that he meant to in the first place. \"What is your address?\".\n\nAt no point in the interaction was there any attempts on their part to de-escalate. It was ramped up at every turn in an effort to make me cower to them. And that was my crime too. That I dared to look at them when they jumped out their car brandishing weapons, in plain clothes, in broad daylight. Apparently I should have been too scared to look or something. \n\nLost all respect for cops right then and its never come back. Ill be civil, but thats it. Any interaction with cops from then on is sterile and to the point and nothing more.",
    "username" : "BarnabyBundlesnatch",
    "timestamp" : "2024-12-23T12:29:08Z"
  }, {
    "reportedcomment" : false,
    "body" : "honestly the only people in london that would want to be a copper in the met must have ego problems, otherwise why risk your life, mental wellbeing, for a city that doesn't respect you, oh and now the mayor will throw you under the bus even when a jury aquits you in 3 hrs",
    "username" : "rattlee_my_attlee",
    "timestamp" : "2024-12-23T11:12:22Z"
  }, {
    "reportedcomment" : false,
    "body" : "You realize how many people die to drunk/drug drivers right? That cop has likely seen decapitations of children crushed up in cars. But hey, you got a little upset at being tested, boohoo.",
    "username" : "SwordfishSerious5351",
    "timestamp" : "2024-12-23T14:01:45Z"
  }, {
    "reportedcomment" : false,
    "body" : "I agree with your sentiment. However your typo is making me laugh 😅",
    "username" : "SherlockScones3",
    "timestamp" : "2024-12-23T09:41:03Z"
  }, {
    "reportedcomment" : false,
    "body" : "> It’s almost like someone outside the UK is trying to sew decent in this country   \n\nThere's already enough people in the UK doing it.",
    "username" : "Lightertecha",
    "timestamp" : "2024-12-23T11:42:00Z"
  }, {
    "reportedcomment" : false,
    "body" : "People are still responsible for their own behaviour! I know what you mean though",
    "username" : "123Dildo_baggins",
    "timestamp" : "2024-12-23T09:47:03Z"
  }, {
    "reportedcomment" : false,
    "body" : "must be elon he hates the cops and rule of law /s",
    "username" : "rattlee_my_attlee",
    "timestamp" : "2024-12-23T11:09:15Z"
  }, {
    "reportedcomment" : false,
    "body" : "There's a scandal in the news everyday. It's not surprising there is no trust and respect for the police. \n\nPeople aren't happy with the police, not everything is a foreign psy-op. \n\nIts criminals who are attacking the police not the people who want to see some reform.",
    "username" : "Competitive_Art_4480",
    "timestamp" : "2024-12-23T09:46:21Z"
  }, {
    "reportedcomment" : false,
    "body" : "Correct.\n\nWhile I don’t condone attacking the police, respect is earned, not assumed",
    "username" : "G_UK",
    "timestamp" : "2024-12-23T09:50:41Z"
  }, {
    "reportedcomment" : false,
    "body" : "Police risk their lives daily. How can you not respect that?",
    "username" : "GoldenFutureForUs",
    "timestamp" : "2024-12-23T10:01:11Z"
  }, {
    "reportedcomment" : false,
    "body" : "Yeah I'm spinning on this one too. It's such an idiotic analysis that I wonder if he is as incompetent on the rest of his work areas ",
    "username" : "Risingson2",
    "timestamp" : "2024-12-23T10:58:28Z"
  }, {
    "reportedcomment" : false,
    "body" : "You’re justifying attacks on a group due to a tiny percentage of that group being bad? Imagine if that was applied to other groups, demographics etc. Your logic is awful.",
    "username" : "GoldenFutureForUs",
    "timestamp" : "2024-12-23T10:00:40Z"
  }, {
    "reportedcomment" : false,
    "body" : "and what does this prove? some police are bad? is that all?",
    "username" : "beeteexd",
    "timestamp" : "2024-12-23T09:50:34Z"
  }, {
    "reportedcomment" : false,
    "body" : "Are they not the world standard?\n\nAnd what standard do you propose they be replaced with?\n\nhttps://en.m.wikipedia.org/wiki/Guidance_Patrol",
    "username" : "mooseneck",
    "timestamp" : "2024-12-23T11:42:52Z"
  }, {
    "reportedcomment" : false,
    "body" : "Police cannot find anyone guilty that’s the job of the legal system. You’re upset by a very important division of power.",
    "username" : "chrissssmith",
    "timestamp" : "2024-12-23T10:34:52Z"
  }, {
    "reportedcomment" : false,
    "body" : "So why do we under fund our police and make further cuts when it’s clear there are long term issues at play. Telling politicians to “defund the police” while moaning about the lack of inaction does have consequences. The public can’t have their cake and eat it too.",
    "username" : "Oli_Picard",
    "timestamp" : "2024-12-23T12:18:35Z"
  }, {
    "reportedcomment" : false,
    "body" : "The Police can give a caution and decide not to involve the CPS for various crimes.",
    "username" : "London--Calling",
    "timestamp" : "2024-12-23T10:08:30Z"
  }, {
    "reportedcomment" : false,
    "body" : "> make a decision on which one is more serious\n\nYeah like whether to turn up to a phone theft or burglary, or take the easier job of investigating someone for being mean on Twitter.",
    "username" : "afrophysicist",
    "timestamp" : "2024-12-23T10:38:05Z"
  }, {
    "reportedcomment" : false,
    "body" : "What's that got to do with the police not turning up to burglaries or anti social behaviour? Is that the Kremlin's fault as well?",
    "username" : "afrophysicist",
    "timestamp" : "2024-12-23T14:22:59Z"
  }, {
    "reportedcomment" : false,
    "body" : "The fact you've used Starmer in your response shows that yes, it is",
    "username" : "markusw7",
    "timestamp" : "2024-12-23T10:05:29Z"
  }, {
    "reportedcomment" : false,
    "body" : "Sigh. What is that even supposed to mean? Starmer is an elected official, heading a government of elected officials. Whether you like him or his politics, he has a mandate to try and achieve his party's political aims for 5 years. The police are a downstream entity from that, they simply enforce the laws that parliament sets.",
    "username" : "harmslongarms",
    "timestamp" : "2024-12-23T10:31:12Z"
  }, {
    "reportedcomment" : false,
    "body" : "I've had a few interactions with them due to living in a high crime area. \n\nSome have been very nice, others look at you and treat you with contempt.\n\nBurglaries became very common here so once we found a guy trying door handles of homes, we followed him at distance. \nTwo police women turn up, I get out the car to direct them, they look at me like I'm scum. They go to other men who'd followed the guy and gave them a telling off. \n\nLike sorry we didn't sit around and wait 20 minutes for you turn up and so this man would never be found.",
    "username" : "Odd-Neighborhood8740",
    "timestamp" : "2024-12-23T13:13:25Z"
  }, {
    "reportedcomment" : false,
    "body" : "The sad truth is he was embarrassed to have made a mistake and tried to get a bite out of you to book you for something just to save face. \n\nA lot of the police officers in this country are just immature children in a dick swinging competition. \n\nI've had this with the police countless times, I live in south London I'm stop searched constantly and they've never found me to have anything, they've never once said sorry, and have always copped an attitude like they're disappointed I'm not carrying a knife or a bag of weed. \n\nEVERY SINGLE TIME you meet their attitude by standing up for yourself they react by threatening an arrest and, in some cases, moving their hands to rest on taser or baton to threaten you into obedience. \n\nThe police force get no respect because they behave like criminals and gangsters.",
    "username" : "Smevurst",
    "timestamp" : "2024-12-23T14:23:39Z"
  }, {
    "reportedcomment" : false,
    "body" : "I’ll not correct it as it’s bringing joy 😄",
    "username" : "Parking_Aerie3734",
    "timestamp" : "2024-12-23T10:07:35Z"
  }, {
    "reportedcomment" : false,
    "body" : "No its always shadowy conspiracies, not just idiots supporting these things.",
    "username" : "Nervous-Peanut-5802",
    "timestamp" : "2024-12-23T12:43:47Z"
  }, {
    "reportedcomment" : false,
    "body" : "No- worse than Elon ",
    "username" : "Parking_Aerie3734",
    "timestamp" : "2024-12-23T11:25:17Z"
  }, {
    "reportedcomment" : false,
    "body" : "You’re right, it is criminals attacking the police but there is a lot of encouragement to do it. For the record, yes I think policing does need a lot of reform and I’ve been absolutely appalled at some of the stuff that has come out about the police.",
    "username" : "Parking_Aerie3734",
    "timestamp" : "2024-12-23T10:19:02Z"
  }, {
    "reportedcomment" : false,
    "body" : "A lot of people risk their lives daily. The police won't get my respect until the system that allows people who abuse the authority given to them by the role of police officer, actually punishes the police who abuse that power. And when the police aren't trotted out to arrest or intimidate people based on corporate interests.",
    "username" : "Melodramatic_Raven",
    "timestamp" : "2024-12-23T10:11:36Z"
  }, {
    "reportedcomment" : false,
    "body" : "Respect is earned, not given automatically.",
    "username" : "jiminthenorth",
    "timestamp" : "2024-12-23T10:11:47Z"
  }, {
    "reportedcomment" : false,
    "body" : "Flashback to them cracking skulls at a candlelit vigil for a woman murdered by a police officer.",
    "username" : "ActivisionBlizzard",
    "timestamp" : "2024-12-23T10:29:17Z"
  }, {
    "reportedcomment" : false,
    "body" : "Misguided policies have consequences. We’re apparently entering the more advanced failed state phase of the downfall following WWII. \n\nhttps://en.m.wikipedia.org/wiki/Failed_state",
    "username" : "mooseneck",
    "timestamp" : "2024-12-23T11:34:38Z"
  }, {
    "reportedcomment" : false,
    "body" : "He's saying there's a reason why people don't respect the police, and when you hear about an officer abusing a woman or a racist scandal every other week, it does erode your confidence a little bit.\n\nThe sexism problem in the met in reality is not a small problem either.",
    "username" : "tylerthe-theatre",
    "timestamp" : "2024-12-23T10:07:00Z"
  }, {
    "reportedcomment" : false,
    "body" : "Those are the ones that have been caught and investigated. The police watchdog only investigates 1 in 28 offences. \n\nGoing by that the stats really don't do justice to how bad policing has become.",
    "username" : "Powerful-Payment5081",
    "timestamp" : "2024-12-23T10:00:15Z"
  }, {
    "reportedcomment" : false,
    "body" : "Do you think when poor people say 'defund the police' they mean cops walking their street or the 10 cops and six cars needed to get the PM or King to their next engagement?",
    "username" : "lontrinium",
    "timestamp" : "2024-12-23T12:50:10Z"
  }, {
    "reportedcomment" : false,
    "body" : "On low level offences where someone has admitted it in very specific circumstances. Anything of significance is decided by the CPS and the courts.",
    "username" : "Awkward_Swimming3326",
    "timestamp" : "2024-12-23T10:11:51Z"
  }, {
    "reportedcomment" : false,
    "body" : "Yes but that is based on their knowledge of the cps not recommending charges, so there's no point.\n\nCan't imagine the horrendous backlog in the justice system is a benefit to this either. Wouldn't be shocked if the cps is recommending fewer offences for prosecution, which informs police decisions. but of course that's just idle speculation",
    "username" : "eunderscore",
    "timestamp" : "2024-12-23T11:56:24Z"
  }, {
    "reportedcomment" : false,
    "body" : "If the burglar isn’t there as it happened hours ago and the thief is gone and you only have one unit I’m sure you’ll understand them going to the domestic where she’s screaming that they have a knife before the line goes dead.",
    "username" : "Awkward_Swimming3326",
    "timestamp" : "2024-12-23T10:40:11Z"
  }, {
    "reportedcomment" : false,
    "body" : "Yes i agree, they shouldnt waste their time policing political crimes on the internet, but the politicians make them so they have to prioritise time. Vote for the politicians who can sort it.",
    "username" : "Nervous-Peanut-5802",
    "timestamp" : "2024-12-23T12:42:02Z"
  }, {
    "reportedcomment" : false,
    "body" : "it's to do with the \"years of disinformation claiming authorities are lying about everything and cannot ever be trusted\" ... which I was replying to...\n\nit's literally in USA and UK DOD/MOD documents, that Russia does this.\n\nAre you thinking I'm replying to a different comment or something? TBH another part of Putin's playbook is: don't discuss politics, and if you do, be parabolic and ridicule them into silence. Most Russians wont give a genuine opinion on its war of aggression. Putin wants that future for us.",
    "username" : "SwordfishSerious5351",
    "timestamp" : "2024-12-23T14:27:18Z"
  }, {
    "reportedcomment" : false,
    "body" : "The person i was responding to was saying people put out disinformation that authorities lie, Starmer and his government are an example that authorities do in fact lie (denying the Waspi women tehir compensation, denying the gaza genocide, enlarging the House of Lords)\n\nI swear to god this sub turns into a bunch of thickos whenever Labour is criticised, i hate the Tories but at least theyre explicitly bastards and dont hide it.",
    "username" : "pulphope",
    "timestamp" : "2024-12-23T10:51:41Z"
  }, {
    "reportedcomment" : false,
    "body" : "Needs a place on r/boneappletea",
    "username" : "SherlockScones3",
    "timestamp" : "2024-12-23T10:12:28Z"
  }, {
    "reportedcomment" : false,
    "body" : "not possible surely /s",
    "username" : "rattlee_my_attlee",
    "timestamp" : "2024-12-23T12:13:50Z"
  }, {
    "reportedcomment" : false,
    "body" : "So, because some abuse the power, the ones who do their job well should also be punished, despite not being able to control the behaviour of their colleagues? It’s pretty ignorant to suggest all police are the same, much like any other group of people in life.",
    "username" : "ohreallyohreilly",
    "timestamp" : "2024-12-23T11:29:37Z"
  }, {
    "reportedcomment" : false,
    "body" : "Risking your life daily *is what earns respect*.",
    "username" : "GoldenFutureForUs",
    "timestamp" : "2024-12-23T10:18:15Z"
  }, {
    "reportedcomment" : false,
    "body" : "no skulls were cracked afaik?",
    "username" : "Best-Hovercraft-5494",
    "timestamp" : "2024-12-23T10:48:19Z"
  }, {
    "reportedcomment" : false,
    "body" : "That literally never happened.",
    "username" : "bricklanevisitor",
    "timestamp" : "2024-12-23T10:39:12Z"
  }, {
    "reportedcomment" : false,
    "body" : "Do you seriously think that people assaulting police are upset about sexism?",
    "username" : "bricklanevisitor",
    "timestamp" : "2024-12-23T10:39:53Z"
  }, {
    "reportedcomment" : false,
    "body" : "Are you justifying assaulting police officers based of the actions of a few? If so why not just say what you mean?",
    "username" : "Blue_Heron4356",
    "timestamp" : "2024-12-23T10:15:16Z"
  }, {
    "reportedcomment" : false,
    "body" : "So the attacks on police is warranted? Because some police are hideous human beings? \n\nIt’s the same for teachers, some are disgusting people that are pedos for example, if we suddenly start attacking teachers because of those individuals will you start to point at stats and say well I wonder why it’s happening. \n\nStupidity from people smearing all police officers for the minority.",
    "username" : "beeteexd",
    "timestamp" : "2024-12-23T11:10:06Z"
  }, {
    "reportedcomment" : false,
    "body" : "I'm pretty sure they're just parroting things from the US, where the police have much bigger budgets spent on things that don't at all benefit the community.",
    "username" : "listingpalmtree",
    "timestamp" : "2024-12-23T13:10:18Z"
  }, {
    "reportedcomment" : false,
    "body" : "The term “defund the police” means defund. the. police. Is it that *hard* to understand? It means to defund the police in its entirety. You don’t get to cherry pick the narrative.",
    "username" : "Oli_Picard",
    "timestamp" : "2024-12-23T13:02:32Z"
  }, {
    "reportedcomment" : false,
    "body" : "> them going to the domestic where she’s screaming that they have a knife before the line goes dead.\n\nDo they ever actually show up on time though?",
    "username" : "afrophysicist",
    "timestamp" : "2024-12-23T10:50:02Z"
  }, {
    "reportedcomment" : false,
    "body" : "But now you’re doing exactly what the media do and holding Labour to a far higher standard than they do the Tories, “ah sure the Tories are cunts but they always have been” but Labour step out of line on one or two issues and now they are the devil.\n\n1) the Waspi situation is not great but to play devils advocate I don’t believe Labour ever explicitly said they would give compensation.\n\n2) Labour have never run on the platform of calling the Gaza genocide a genocide, that’s not what they were voted in for.\n\nLabour have been in power for 6 months. The Tories lied repeatedly for 13 years, including the most egregious when they partied during lockdown meanwhile Joe Public were forbidden from saying goodbye to their dying loved ones. I will judge Labour after their first full term, as should anyone.",
    "username" : "RamboRobin1993",
    "timestamp" : "2024-12-23T11:37:01Z"
  }, {
    "reportedcomment" : false,
    "body" : "They... don't hide it?\n\nI think people take issue because it's an insane example to use next to the past 14 years. So yeah, you did prove OP's point.",
    "username" : "Stunning-North3007",
    "timestamp" : "2024-12-23T11:51:51Z"
  }, {
    "reportedcomment" : false,
    "body" : "You are a victim of Putin's and Khamenei's extensive covert social media based PsyOps. Labour haven't even been in power long enough to enact a budget. \n\n[https://greydynamics.com/russian-psyops-in-northern-europe/](https://greydynamics.com/russian-psyops-in-northern-europe/)",
    "username" : "SwordfishSerious5351",
    "timestamp" : "2024-12-23T13:59:54Z"
  }, {
    "reportedcomment" : false,
    "body" : "The good cops that sit by and do nothing as bad cops abuse their power are not, infact, good cops.",
    "username" : "HawaiianSnow_",
    "timestamp" : "2024-12-23T12:07:28Z"
  }, {
    "reportedcomment" : false,
    "body" : "I didn't suggest they're all the same, I said that the system they uphold is biased and therefore not worth my respect. Why are you so upset that I am saying I won't respect people who haven't earned it? And why do you think lack of respect is a punishment? Are you a cop?",
    "username" : "Melodramatic_Raven",
    "timestamp" : "2024-12-23T14:27:20Z"
  }, {
    "reportedcomment" : false,
    "body" : "Agreed, that's why I respect drug dealers and gang members.",
    "username" : "afrophysicist",
    "timestamp" : "2024-12-23T10:38:52Z"
  }, {
    "reportedcomment" : false,
    "body" : "I risk my life every time I cross a road. Why don't police officers talk to me with respect?",
    "username" : "Smevurst",
    "timestamp" : "2024-12-23T14:27:18Z"
  }, {
    "reportedcomment" : false,
    "body" : "It's an idiom for heavy handedness by the police ",
    "username" : "AnotherSlowMoon",
    "timestamp" : "2024-12-23T11:36:55Z"
  }, {
    "reportedcomment" : false,
    "body" : "Guess they paid damages for nothing then??\n\nhttps://amp.theguardian.com/uk-news/2023/sep/14/met-police-pays-damages-to-women-arrested-at-sarah-everard-vigil\n\nNever ever forget that a police officer is there to enforce, not to protect. ACAB.",
    "username" : "ActivisionBlizzard",
    "timestamp" : "2024-12-23T10:42:02Z"
  }, {
    "reportedcomment" : false,
    "body" : "I'm not giving an answer to why people are assaulting police, I'm saying why people have lost confidence and respect for them. The two things are definitely linked but ofc someone could just be a low life attacking an officer, it's random.",
    "username" : "tylerthe-theatre",
    "timestamp" : "2024-12-23T11:16:49Z"
  }, {
    "reportedcomment" : false,
    "body" : "Its saying I don't respect, on sight, a police officer as they themselves collectively have shown themselves to not deserve respect. The police are here to serve our communities, not scare them. Its been shown that wether due to sex or race, the police services have inherent built in biases and intolerances that mean folks are angry and fearful on sight. Due to not tackling burglary and anti social behaviour incidents within the community that cause normal folks every day damage. For getting heavy handed when they finally do get their arse in gear and decide to do something, normally in an over zealous fashion on the wrong type of issue. ",
    "username" : "ukstonerguy",
    "timestamp" : "2024-12-23T10:28:28Z"
  }, {
    "reportedcomment" : false,
    "body" : ">So the attacks on police is warranted? Because some police are hideous human beings? \n\nCan you please quote me where I have said anything remotely like this? \n\nI was simply pointing out that the government's own site admits that only 1 in 28 referrals are investigated so any stats about police misconduct will be undervalued due to this.\n\nYou have completely made up your own argument here .",
    "username" : "Powerful-Payment5081",
    "timestamp" : "2024-12-23T11:49:07Z"
  }, {
    "reportedcomment" : false,
    "body" : "Yes, very true. I believe the original idea behind the slogan was that some funding should be pulled from the police and distributed to community based organisations. This came about because of the issue of police with guns turning up to situations such as mental health cases, which escalated the problems, sadly resulting in some incidents of unnecessary deaths. These issues were more likely to occur in communities of colour where the police were not as diverse as the community they represented exacerbating cultural misunderstandings. The original idea, as I understand it, was that if the money spent on the police dealing with those issues was just given to the community in the first place, then there would be less issues and less people hurt. The political right took advantage of the slogan and turned it into these crazy leftists want to get rid of the police altogether.",
    "username" : "ShortArugula7340",
    "timestamp" : "2024-12-23T13:49:16Z"
  }, {
    "reportedcomment" : false,
    "body" : "Maybe you should do some reading as that is a bit of a straw man fallacy. Here is the Wiki page for you: https://en.wikipedia.org/wiki/Defund_the_police \n\nYes, some proponents of the movement may argue for the complete defunding of the police.\n\nHowever, within the umbrella of defunding, are those who believe in funding social institutions like health, education, and other services that can tackle the root causes of crime. It's about investing in other social institutions and not relying only on policing for social issues. \n\nI hope that clears up the confusion for you.",
    "username" : "tropicalcannuck",
    "timestamp" : "2024-12-23T13:35:14Z"
  }, {
    "reportedcomment" : false,
    "body" : "I agree - but you’re also assuming that all police officers have witnessed abuse of power/poor behaviour and not called it out.",
    "username" : "ohreallyohreilly",
    "timestamp" : "2024-12-23T12:14:36Z"
  }, {
    "reportedcomment" : false,
    "body" : "😂",
    "username" : "Ecomalive",
    "timestamp" : "2024-12-23T11:18:23Z"
  }, {
    "reportedcomment" : false,
    "body" : "Some degenerates genuinely think like this",
    "username" : "LDel3",
    "timestamp" : "2024-12-23T10:54:54Z"
  }, {
    "reportedcomment" : false,
    "body" : "Damages for arrest, which is a far cry from smashing skulls with batons. Don't lie, and don't double down when called out.",
    "username" : "SavlonWorshipper",
    "timestamp" : "2024-12-23T10:52:42Z"
  }, {
    "reportedcomment" : false,
    "body" : "They can’t tackle enough crime because we continuously vote for austerity",
    "username" : "GrouchyAction5371",
    "timestamp" : "2024-12-23T10:40:30Z"
  }, {
    "reportedcomment" : false,
    "body" : "So the reasoning for you pointing out the governments own admission to me is for what reason then? I already acknowledge some police are bad. There for sure is more that haven't been caught. But to smear the whole police force like the majority are doing is ludicrous.\n\n  \n'oh my trust in police is down, oh I distrust police because of this, oh the police are bad' The amount of good the police do far outweighs the pile of dog rubbish the few commit. Yet its ok to smear all of them with the same brush, no I do not condone what the minority do",
    "username" : "beeteexd",
    "timestamp" : "2024-12-23T12:13:45Z"
  }, {
    "reportedcomment" : false,
    "body" : "And we're repeating it here, where the Conservatives have been defending police (and every other public service) for over a decade and it's not going well for us.",
    "username" : "listingpalmtree",
    "timestamp" : "2024-12-23T13:50:27Z"
  }, {
    "reportedcomment" : false,
    "body" : "There's also huge problem with these institutions that they make reporting things obstructive and difficult. I'm a doctor, I'd say many of the same things about the NHS. I bend over backwards for a lot of my patients, and I still think it is not an institution that I think deserves the blind praise it does because it relies heavily on decreasing amounts of goodwill.\n\nAnd, as we've seen in tragedies like the Lucy Letby case, people with good intentions are often threatened with professional sanctions. And what do you do then? Lose your job, your career? All for it to get covered up by Trusts until it's too late and they run PR on how \"everything that could be done, was done, and that they'll review their internal processes to make sure it never happens again\". The easy answer is that people don't *have* to work these jobs, but it's also pretty easy to get instutitionalised into a career, or not everyone has the luxury of being able to move laterally or just quit when they need an income to survive.\n\nI imagine it's the same in the police force, or any other institution.",
    "username" : "TeaAndLifting",
    "timestamp" : "2024-12-23T12:23:11Z"
  }, {
    "reportedcomment" : false,
    "body" : "Lol why are you trying to protect them, are you a bootlicker.\n\n“Cracking skulls” is an idiom and isn’t meant literally, it means unnecessary use of force.",
    "username" : "ActivisionBlizzard",
    "timestamp" : "2024-12-23T10:54:57Z"
  }, {
    "reportedcomment" : false,
    "body" : "Once again you are creating your own arguments and vomiting words at me. \n\nNothing you have said has anything to do with my comment that the stats are massively under-reported due to the investigation process.\n\nYou clearly want to argue and fight with randoms on the internet. Are you ok? I know it can be a stressful time of year. I wish you nothing but the best ✌🏼",
    "username" : "Powerful-Payment5081",
    "timestamp" : "2024-12-23T12:23:52Z"
  }, {
    "reportedcomment" : false,
    "body" : "Yeah it's a bad slogan to repeat because they already have been defunded but the money wasn't redirected into mental health services and community outrage programs so we have the worst of both worlds",
    "username" : "Acrobatic-Prize-6917",
    "timestamp" : "2024-12-23T13:54:22Z"
  }, {
    "reportedcomment" : false,
    "body" : "I’m also not suggesting that the police deserve blind praise. Of course there are issues, and the one you mention I imagine is a big one. \n\nHowever, I think it’s dangerous to suggest all police officers, or any group, should be tarred with the same brush. There are good and bad police officers, like there are good and bad doctors, or any other group. The good ones still have families who fear for their lives on a regular basis. This rhetoric we are slipping into of ‘all police officers are terrible’ is not helpful. If I were a good police officer (I’m not one at all, FYI), it must be really demoralising to be on the receiving end of this constantly when you know you’re doing a good job. I can’t for the life of me fathom why anyone would want to do it as a career, and given one of the other major issues they face is lack of resources, this rhetoric isn’t exactly going to encourage people who can help to make a difference to join.",
    "username" : "ohreallyohreilly",
    "timestamp" : "2024-12-23T12:33:54Z"
  }, {
    "reportedcomment" : false,
    "body" : "A heavily context-dependent idiom at best, which your comment lacked. Learn to communicate effectively.",
    "username" : "SavlonWorshipper",
    "timestamp" : "2024-12-23T12:55:41Z"
  }, {
    "reportedcomment" : false,
    "body" : "For sure, I'm not disagreeing with you in the slightest. I don't think it's helpful to condemn all coppers, much in the way I don't think it's helpful how we blindly praise the NHS as being a national treasure. They're both problematic instututions in their own way, in spite of the good and bad people that work for both.\n\nLikewise, knowing what the police see, and hearing about the stuff they do, for what little pay they get. I don't know why anyone does the job. Even the most doe-eyed person will get worn down over time.",
    "username" : "TeaAndLifting",
    "timestamp" : "2024-12-23T12:39:49Z"
  }, {
    "reportedcomment" : false,
    "body" : "I meant to say I wasn’t directing this at you! \n\nBut yes, compassion fatigue is real, as I’m sure you’re very well aware.",
    "username" : "ohreallyohreilly",
    "timestamp" : "2024-12-23T12:47:11Z"
  } ]
}