{
  "id" : 200307,
  "community_name" : "Monaco",
  "username" : "Pretty-West-1001",
  "post_body" : "What's so bad about Beausoleil/Cap-d'Ail?",
  "timestamp" : "2024-12-20 08:04:59",
  "num_comment" : 17,
  "reported_post" : false,
  "comment" : [ {
    "reported_comment" : false,
    "body" : "Nothing at all, neighbours always “fight”.",
    "username" : "Exit_mm00",
    "timestamp" : "2024-12-20 08:04:59"
  }, {
    "reported_comment" : false,
    "body" : "Cap d'Ail is beautiful and has some very nice restaurants.",
    "username" : "mantiki63",
    "timestamp" : "2024-12-20 08:31:00"
  }, {
    "reported_comment" : false,
    "body" : "It’s a snark page - it makes fun of life in general in Monaco.\n\nEdit : if this is the post you’re talking about you could also take it as being directed at the shallow women looking for sugar daddies which is common here - it’s a common theme on that page \n\nhttps://www.instagram.com/reel/DCR-oSCSD5h/",
    "username" : "holly-golightly-",
    "timestamp" : "2024-12-20 11:27:03"
  }, {
    "reported_comment" : false,
    "body" : "It's just expensive ;)",
    "username" : "vilo236",
    "timestamp" : "2024-12-20 10:44:21"
  }, {
    "reported_comment" : false,
    "body" : "Nothing is bad about them. It’s just about financial status and this is sadly an obsession for a vast majority of people here in Monaco. Living in Beausoleil or cap d’ail is proof that you are not rich enough to be in Monaco, and monégasque laugh about it. It’s very sad but it’s the truth.",
    "username" : "bilth007",
    "timestamp" : "2024-12-20 16:09:14"
  }, {
    "reported_comment" : false,
    "body" : "Nothing wrong with them",
    "username" : "IndineraFalls",
    "timestamp" : "2024-12-20 13:12:04"
  }, {
    "reported_comment" : false,
    "body" : "If it wasn't for Beausoleil and Cap d'Ail the streets of Monaco would be littered with trash and there would be nobody making and serving you food in any of the restaurants of Monaco, nor welcoming you in any hotel. \n\nSo Monegasques should only be grateful of their neighbours.",
    "username" : "Vast_Decision3680",
    "timestamp" : "2024-12-23 14:22:42"
  }, {
    "reported_comment" : false,
    "body" : "Hoping I don't run into whoever runs that account but it's funny that Charles Leclerc follows them",
    "username" : "PradaAndPunishment",
    "timestamp" : "2024-12-20 13:20:08"
  }, {
    "reported_comment" : false,
    "body" : "FYI when I clicked that link it shared your insta account.",
    "username" : "Shoddy_Stretch_6585",
    "timestamp" : "2024-12-20 15:51:55"
  }, {
    "reported_comment" : false,
    "body" : "I don't get it!  Even when I was younger, I NEVER got it.  \n\nWhy do women think some wealthy guy is going to take care of them and their family?  Just for some p\\*ssy?  \n\nEven when I was 21 and could throw down for 8 hours a day, it made NO sense to waste 50% (or more of my money) on \"ONE\" girl.  If I could throw down 12 hours a day, it would start to make economic sense, but only 8 hours?  Also, +99.99% of girls can NOT and will NOT throw down for 8 hours a day...every day.\n\nIt's like a house being €10 million, but you can only spend 8 hours in it a day.  How does that make sense?\n\nNot to mention the repetition of it all.  I can't even eat chicken on my diet 3 days in a row.  Why am I going to put 50% of my wealth on something that I will get tired of in a few days, or at the most, weeks?\n\nWhat are these girls thinking?  Are they thinking?\n\nI've been confused by this my entire life, and if I ask the girls to explain themselves, they start calling me horrible names :)",
    "username" : "After_Pomegranate680",
    "timestamp" : "2024-12-20 13:24:28"
  }, {
    "reported_comment" : false,
    "body" : "Maybe it IS Charles Leclerc 🤔🤭",
    "username" : "holly-golightly-",
    "timestamp" : "2024-12-20 13:23:01"
  }, {
    "reported_comment" : false,
    "body" : "I think for these older guys it’s maybe like the male version of a Birkin. Having a status symbol on your arm 🤣 They’re also unlikely to marry them so I’m sure they can get away with not giving them 50%",
    "username" : "holly-golightly-",
    "timestamp" : "2024-12-20 13:34:59"
  }, {
    "reported_comment" : false,
    "body" : "A Russian girl that I dated once told me that I had to provide for the family, have a great job, earn lot of money, do everything and all that bullshit and when I asked her what she was providing in exchange she just said her pussy. Well, I said that all girls have pussies so she's not special and she was kind of shocked about my answer, still fucked her few times though.\n\nShe even complained that \"you fucked me without buying me a Gucci bag\" ahahahahah",
    "username" : "Vast_Decision3680",
    "timestamp" : "2024-12-23 10:56:09"
  }, {
    "reported_comment" : false,
    "body" : "I mean \"women\" don't think that, a small number of women may. But I'd guess that based on how you phrased it here, you get called horrible names because you speak about women as if they are inanimate objects or possessions that are disposable to you and it's honestly really disgusting and makes you look incredibly misogynistic.",
    "username" : "McLarenFan0481",
    "timestamp" : "2024-12-20 15:26:30"
  }, {
    "reported_comment" : false,
    "body" : "🤣🤣🤣  \nI laughed so hard at the Birkin reference 🤣🤣🤣\n\nYeah, sounds plausible, but who in the HELL wants to impress others with a young purchasable girl?  \n\nOne would assume these wealthy men have nothing else to prove in life....but I guess we'd be wrong for such assumptions 🤣",
    "username" : "After_Pomegranate680",
    "timestamp" : "2024-12-20 13:43:30"
  }, {
    "reported_comment" : false,
    "body" : "hahahahaha....\n\nI love it!\n\n**You are THE KING!**  \n\n  \nPS.  So, I ask them if they believe in slavery and if some people deserve to be slave masters and others deserved to be slaves!  I warn her that her answer will have DIRE consequences on her life going forward! :)\n\nInvariably, they ALL say that slaves should NOT exist!  So, it is at that point, I tell her how everyone need to EAT what THEY catch!  Nobody should be a slave to anyone else!  They move on to more gullible and THIRSTY guys!  :)",
    "username" : "After_Pomegranate680",
    "timestamp" : "2024-12-23 11:02:43"
  }, {
    "reported_comment" : false,
    "body" : "Thank you! :)\n\nI'll take that as a compliment!  \n\nMy luck is changing for the better every day!\n\nChristmas is looking good!  \n\nKudos!",
    "username" : "After_Pomegranate680",
    "timestamp" : "2024-12-21 02:59:04"
  } ]
}