{
  "_id" : "c04bc2c7-f72c-40ee-80f8-97d41226c21e",
  "community" : "Skopje",
  "username" : "gIantCheese60",
  "post" : "Visiting Skopje/is it safe? ",
  "timestamp" : "2024-12-14T21:49:03Z",
  "numcomment" : 17,
  "reportedpost" : false,
  "comment" : [ {
    "reportedcomment" : false,
    "_id" : "1fc6be28-341b-41e0-a394-d8f956efc70f",
    "body" : "Nobody will bother you as long as you don’t bother them. That’s how the balkans are.",
    "username" : "Myfriendscallme_Lolo",
    "timestamp" : "2024-12-14T21:49:03Z"
  }, {
    "reportedcomment" : false,
    "_id" : "7ac21d08-af0d-4a9c-8436-492087af7f86",
    "body" : "This sub is not as active as /mkd . You will get more answers there. \n\nIt’s definitely safe. It may not be if you are overly open about it like kissing on the street, otherwise there are obviously many gay couples living here safely. Enjoy your stay 🌿",
    "username" : "FenerNaPatot",
    "timestamp" : "2024-12-14T22:15:22Z"
  }, {
    "reportedcomment" : false,
    "_id" : "392171f5-e087-4d02-b973-0a1813728a6a",
    "body" : "It's frowned upon, but as the others said, just avoid showing physical affection in public and you will be alright.",
    "username" : "claw1919",
    "timestamp" : "2024-12-14T23:46:41Z"
  }, {
    "reportedcomment" : false,
    "_id" : "0acb3e6d-79ad-4706-90de-1a8a0af767f3",
    "body" : "The absurd thing is locals tend to be more tolerant about foreign queer people than local ones so you should be alright as long as you dont start walking around holding hands etc.\n\nthe only openly-lgtb place that I have heard of is Komitet, bars that will 100% not be bothered with who you are: Short Bus, Bookva, La Kaña, others that should be alright too: Radio Bar, Laboratorium, Kotur, Brutalisk, Public Room, Izlet. Also look for events in MKC where you can behave as you want.\n\nThey all stage small events so check their insta few days before you arrive\n\nmust see places:\n\nOld Bazaar, Kale Frotress, the center of Skopje with all the statues of men in skirts lol\n\nnature around Skopje (Matka Canyon and Vodno mountain)\n\nmuseums: Museum of Contemporary Art and the two objects of National Gallery in the Old Bazaar\n\nBrutalism: Post Office\n\nfor restaurants; Debar Maalo district is the number one area",
    "username" : "relaksirano",
    "timestamp" : "2024-12-15T12:27:02Z"
  }, {
    "reportedcomment" : false,
    "_id" : "a0a70d8e-9c25-4a6a-befa-e8bbb20d40e2",
    "body" : "Not at all don't come here, they will beat both of you",
    "username" : "youdknowme",
    "timestamp" : "2024-12-15T10:22:15Z"
  }, {
    "reportedcomment" : false,
    "_id" : "66d064ef-cba9-480d-9697-f9b4b05baaaa",
    "body" : "Thank you ❤️ \n\nYeah ofc, we are bahaving in public regularly",
    "username" : "gIantCheese60",
    "timestamp" : "2024-12-14T22:18:14Z"
  }, {
    "reportedcomment" : false,
    "_id" : "20a9a555-c810-4b98-b3a8-e6c24111ddc5",
    "body" : "Ofc, and can you guys recommend some locations to visit?",
    "username" : "gIantCheese60",
    "timestamp" : "2024-12-14T23:48:11Z"
  }, {
    "reportedcomment" : false,
    "_id" : "0c52276c-7df1-42c7-b6fa-0fbd2a2e626f",
    "body" : "IMHO the city doesnt have any particular hidden gems nor culture (that has remained) to be experienced.\n\nill throw in here some recommendations that might not be on trip advisor and similar apps:\n\n- if you are into art, museum of contemporary art is the only official institution on the topic (AFAIK, but unlikely im wrong.)\n- live music, as in original works from domestic artists rarely happens. \n- theatre/opera/etc. - stick to MOB, they are actually kinda good (a miracle) \n-architecture - Yugoslav brutalism is all over it. There is nothing else on the topic.\n- Zimzolend is the hottest thing in town rn, google it and see if its something you'd like to visit.\n- the museums are alright, if that's your thing. But they do tend to focus on more boring aspects of history. \n\n\nIf during your visit you get a whiff of depression, trust me, its not you its the city. I think that the biggest thing to experience here is to see what happens to society when you steal it's soul, it's livelihood. That by itself, is hard to find elsewhere. There is a dose of \"given up\" in the air.\n\nP.s. If you are going to use public transport, keep in mind that JSP (state owned company responsible for the 90% of buses) declared bankruptcy some days ago, buses are rare, drivers are on edge and so are citizens using them. Apps showing bus schedule shows the default schedule, not taking into account that JSP operates woth half capacity at best. Which might leave you hanging at the bus stop for hours waiting for a bus lol.",
    "username" : "claw1919",
    "timestamp" : "2024-12-15T00:09:00Z"
  }, {
    "reportedcomment" : false,
    "_id" : "19f985e8-6619-4dba-9a62-48fc3be77766",
    "body" : "Od kade infoto deka JSP imaat deklarirano bankrot?",
    "username" : "LieutenantWho",
    "timestamp" : "2024-12-15T04:06:10Z"
  }, {
    "reportedcomment" : false,
    "_id" : "850edddd-a0f0-4717-8450-ecf8bc78eef8",
    "body" : "the only depressed one is you.",
    "username" : "relaksirano",
    "timestamp" : "2024-12-15T12:04:29Z"
  }, {
    "reportedcomment" : false,
    "_id" : "a4a9e7b7-e0b3-498d-a1a5-ac3542d304f0",
    "body" : "od negovata depresija sedejki doma i citanje vesti 24/7",
    "username" : "relaksirano",
    "timestamp" : "2024-12-15T12:05:00Z"
  }, {
    "reportedcomment" : false,
    "_id" : "0f5c00d6-1da0-4f6a-a92c-1c2d7a49a2a2",
    "body" : "https://kurir.mk/vesti/skopje/blokirana-e-smetkata-na-jsp/",
    "username" : "claw1919",
    "timestamp" : "2024-12-15T12:14:33Z"
  }, {
    "reportedcomment" : false,
    "_id" : "837dccaa-50a5-48c0-a36b-67fe83c7bcef",
    "body" : "No. Everyone that has appetites for life larger than designerica is.",
    "username" : "claw1919",
    "timestamp" : "2024-12-15T12:15:54Z"
  }, {
    "reportedcomment" : false,
    "_id" : "cc785d4a-60bb-4b44-a5a7-283560df3c2c",
    "body" : "what is designerica?",
    "username" : "relaksirano",
    "timestamp" : "2024-12-15T12:35:27Z"
  }, {
    "reportedcomment" : false,
    "_id" : "2f834909-f14f-4a45-a7f3-02b83410e88b",
    "body" : "https://youtu.be/Vp3skCtZmAM?si=PIuiOm2wUBmmxoah\nThe hottest artist among the ex-yu youngs.",
    "username" : "claw1919",
    "timestamp" : "2024-12-15T12:36:43Z"
  }, {
    "reportedcomment" : false,
    "_id" : "48e2fc2c-184b-4b59-9bd8-95bfdfdb17c9",
    "body" : "Thanks. problemot e vo to sto mislis deka si opkruzen samo so ovakvi lugje. Ova sto go napisa \"live music, as in original works from domestic artists rarely happens\" e poveke od netocno, sekoj vikend ima svirki na makedosnki bendovi ili gosti od regionot/stranstvo.",
    "username" : "relaksirano",
    "timestamp" : "2024-12-15T12:43:36Z"
  }, {
    "reportedcomment" : false,
    "_id" : "649caccb-c967-4943-a571-dafa2287ff59",
    "body" : "Kade?",
    "username" : "claw1919",
    "timestamp" : "2024-12-15T12:44:25Z"
  } ]
}