{
  "id" : 200115,
  "community" : "Paris",
  "username" : "No-Ratio-2547",
  "post" : "Ouvrir un restaurant à Paris encore un moyen de faire de l’argent ou plus du tout ",
  "timestamp" : "2024-12-22T19:26:18Z",
  "numcomment" : 29,
  "reportedpost" : false,
  "comment" : [ {
    "reportedcomment" : false,
    "body" : "Je ne suis en aucun cas restaurateur donc ma réponse se limitera à ce que j'ai appris d'une de mes connaissances qui a ouvert un bar-restaurant à Paris, qui fonctionne bien depuis quelques années, et de ce que j'ai eu comme longues discussions avec quelques patrons et patronnes.\n\nConcernant ma connaissance, elle s'en est bien sortie, de ses propres mots, par la conjonction de plusieurs facteurs :\n\n\\- Le bar est ce qui remplit la caisse ; sans bar elle aurait du mal à s'en sortir et aurait eu beaucoup plus de mal à constituer sa clientèle régulière.  \n\\- Elle a eu une opportunité particulièrement intéressante qui lui a permis d'avoir un bail et un loyer à un prix plus bas que celui du marché.  \n\\- Sa soeur est à la cuisine, c'est une excellent cuisinère et elles s'entendent super bien toutes les deux.  \n\\- Elle s'est installée dans un lieu de bureaux avec beaucoup de \"jeunes actifs\" avec des salaires corrects ; c'est important car cela veut dire qu'ils sortent facilement boire des coups le soir, et ils restent pour consommer plus, le midi ils peuvent se payer un restaurant régulièrement.\n\nConcernant les longues discussions que j'ai eu avec les patrons parisiens de restaurants \"purs\" :\n\n\\- Si l'on fait de la très bonne cuisine, ça se sait assez vite à Paris ; à la condition que l'on soit dans un quartier où il y a un minimum de vie pendant les heures d'ouverture.  \n\\- Le grand problème des restaurants, c'est la cuisine (unanimité sur la question) ! Les bons cuisiniers, qui plus est chefs cuisiniers, sont très dur à trouver, forcément chers, et très difficiles à garder. Perdre un bon chef peut facilement faire couler un restaurant.  \n\\- Le second problème, très proche du premier : trouver de bon serveurs et les garder est très difficile.  \n\\- Le reste est une histoire de compta, de logistique et d'organisation ; c'est fastidieux et oblige souvent à des semaines de 50h+ mais c'est solvable avec de la motivation.",
    "username" : "rapsca2",
    "timestamp" : "2024-12-22T19:41:51Z"
  }, {
    "reportedcomment" : false,
    "body" : "Sans vouloir te décourager, il y a plus d'un resto pour 200 habitants à Paris",
    "username" : "Ythio",
    "timestamp" : "2024-12-22T21:05:50Z"
  }, {
    "reportedcomment" : false,
    "body" : "Ça fait 20 ans que je travaille dans ce milieu, et non, si le but est de faire les sous, c'est une très mauvaise idée. Si tu as un énorme budget de départ (genre 800k), là ça peut se faire - et même avec cela, ce sera compliqué.\n\nLes marges sont très basses dans les restaurants. Disons que tu devrais avoir une marge de 30% sur la nourriture et 22% sur les boissons - là on parle juste du prix d'achat et du prix de vente des produits. Après, tu paies ton loyer, ton staff, ton électricité, tes droits de musique, ton comptable, ta vaisselle, ton prêt, tes poubelles, etc etc etc. Gérer un petit business à Paris est très, très compliqué. Il ne faut pas imaginer de faire des sous avant la deuxième année, donc avoir le chômage, c'est très bien, car tu vas faire des semaines à 80h pour zéro au début, et cela pendant un bon moment.\n\nSi tu arrives à acheter les murs avec le fond de commerce (plutôt rare), au moins tu auras un investissement immobilier. Mais en général les petites entreprises ferment dans les 5 premières années, sans rapporter grande chose.\n\nJe le déconseille très très très fortement, sauf si tu es un cuisinier connu avec un grand nom déjà réputé et un gros budget de démarrage.",
    "username" : "thataintrightlureen",
    "timestamp" : "2024-12-23T00:34:46Z"
  }, {
    "reportedcomment" : false,
    "body" : "Statistiquement, à Paris chaque jour 1 restau ferme, et 3 ouvrent\n\nMa sœur est comptable et un gros bout de sa clientèle sont des restaurateurs. Ça diffère bcp d’un restaurant à l’autre standing etc, mais c’est comme n’importe quel autre business: si c’est mal géré ça ne marchera pas, si c’est bien géré ça marchera.\n\nEn fait tu devrais t’adresser à des comptables. Son retour à elle est que souvent les restaurateurs négligent l’aspect business comptable, et mène l’aventure \"au feeling\", et se retrouvent surpris quand ils commencent à aligner les chiffres",
    "username" : "Raccoons-for-all",
    "timestamp" : "2024-12-23T01:42:49Z"
  }, {
    "reportedcomment" : false,
    "body" : "Oui ! Très difficile, mais possible, il faut trouver son marché, bien définir sa cible et donc son modèle de restaurant (volume, prix, nombre de couverts, offre).\n\nPeut-être plus facile quand on est chef et gérant. \n\nLe plus important : l'emplacement !",
    "username" : "Head-Star-8005",
    "timestamp" : "2024-12-22T19:31:40Z"
  }, {
    "reportedcomment" : false,
    "body" : "Le restaurant c’est une très bonne façon de faire faillite, le taux de gens qui essaient (pour la première fois) et ratent est très élevé \nÇa ne veut pas dire que ça ne peut pas bien fonctionner par contre",
    "username" : "BlueLem0n",
    "timestamp" : "2024-12-23T07:35:11Z"
  }, {
    "reportedcomment" : false,
    "body" : "Il y a plus de 10000 restaurants à Paris, pas facile de trouver sa place. Ces dernières années, pas mal d'adresses dont j'ai entendu parler à un moment ont fermé avant que j'ai pu les essayer... Et d'autres ont tenu et ont trouvé leur public.",
    "username" : "Safe_Opinion_2167",
    "timestamp" : "2024-12-22T19:43:48Z"
  }, {
    "reportedcomment" : false,
    "body" : "Je travaille dans le milieu, honnêtement je pense que c'est le business le plus ingrat qui soit. Il y a que des sources de problèmes. Le personnel fiable dur a trouver et garder, l'absence de clientèle, le four qui lâche, les souris, le fournisseur qui ne livre pas et j'en passe. Je pense que c'est impossible d'y arriver sans une très forte expérience du milieu et un ou des associés extrêmement débrouillard",
    "username" : "BertrandQualitay",
    "timestamp" : "2024-12-23T12:47:38Z"
  }, {
    "reportedcomment" : false,
    "body" : "Non. Enfin.. c’est un peu plus compliqué que cela. Je pense qu’il est effectivement encore possible de faire de l’argent en ouvrant un restaurant à Paris mais seulement au-delà de 50 couverts en moyenne par jour. Je m’explique, en servant une moyenne de 25 couverts pr exemple quotidiennement tu n’aura ps la capacité d’employer plus d’un salarié (en dessous de 1000€ de CA par jour) ce qui veut dire que tu vas devoir travailler à la fois dans ton restaurant (souvent en tant que chef..) et aussi en tant que gérant, tu vas d’épuiser.. mon conseil serait celui d’ouvrir un restaurant a concept que tu peux développer en plusieurs fois (ps forcément en franchise), c’est un autre métier mais si ton objectif est celui de faire de l’argent je pense que c’est le bon truc. Aussi autre conseil : si tu peux achète les murs en même temps que ton fond de commerce, cela vas t’éviter de payer tes loyers et sur le long terme ça fait vraiment la différence … tu peux aussi négocier davantage en achetant les deux en même temps.",
    "username" : "Interesting_Let6371",
    "timestamp" : "2024-12-22T19:44:00Z"
  }, {
    "reportedcomment" : false,
    "body" : "Une bonne comm, un bon concept je vois que ça,  l'emplacement c'est important aussi",
    "username" : "adrie9512",
    "timestamp" : "2024-12-22T19:58:45Z"
  }, {
    "reportedcomment" : false,
    "body" : "faire de l'argent ? Non ! \n\nEn perdre par contre sans problème \\^-\\^",
    "username" : "ImFrenchSoWhatever",
    "timestamp" : "2024-12-23T11:25:41Z"
  }, {
    "reportedcomment" : false,
    "body" : "Tout les restaurants dans lesquelles j'ai eu l'occasion de parler avec le gérant semblaient tenir de travail dur et de passion, le reste c'est McDonald's et burger king.  \n  \nSi je fais le parallèle de la passion avec le marché du développement logiciel (que je connais), les développeurs les plus passionnés sont en général dans le jeu vidéo, qui est le milieu le plus mal payé.  \n  \nA l'inverse, les agents immobiliers sont tous relativement d'accord sur le fait de gagner de l'argent donc j'imagine que monter une entreprise dans l'immobilier est plus simple et rentable qu'un restaurant",
    "username" : "cryptomonein",
    "timestamp" : "2024-12-23T11:56:32Z"
  }, {
    "reportedcomment" : false,
    "body" : "Oui mais faut pas se louper, les charges sont tellement élevées que si tu décolles pas dès le début c'est mort.",
    "username" : "Mozaiic",
    "timestamp" : "2024-12-22T19:30:37Z"
  }, {
    "reportedcomment" : false,
    "body" : "J'habite Paris et si vous voulez faire un restaurant à Paris ça va être difficile parce qu'il faut avoir une cuisine qui soit pas trop cher extraordinaire et qui a un excellent goût parce qu'il est passé à son très difficile à moins que vous verrez vous les restaurants le midi fermer le soir si vous faites deux petits plats par exemple au fait steak flageolet pas trop cher rien pour le midi purée rosbif boudin aux pommes les petits plats tranquille anciens et là vous ferez de l'argent vous trouverez un restaurant sans place et vous faites que le midi et parisiens bien manger mais pas trop cher il faut pas que votre plat déplace les 12 € avec le café ça peut vous faire 15 € voilà plus que les gens consomment vous pouvez faire en une seule personne une cinquantaine d'euros ça augmente le chiffre mais c'est à vous de voir et c'est très difficile il faut avoir des idées",
    "username" : "DoublePsychology9598",
    "timestamp" : "2024-12-23T02:18:47Z"
  }, {
    "reportedcomment" : false,
    "body" : "C'est un moyen oui",
    "username" : "elcanariooo",
    "timestamp" : "2024-12-22T19:26:18Z"
  }, {
    "reportedcomment" : false,
    "body" : ">Le grand problème des restaurants, c'est la cuisine (unanimité sur la question) ! Les bons cuisiniers, qui plus est chefs cuisiniers, sont très dur à trouver, forcément chers, et très difficiles à garder.\n\nJe vais apporter mon grain de sel de consommateur mais pour fréquenter quasi-quotidiennement des restos moyen de gamme à Paris (quartiers popu comme très bourgeois) faut par être sherlock pour comprendre que le milieu des bistros à Paris tient encore grâce à des chefs de communautés étrangères (pakistanais, sri-lankais, maliens...), payés au black, peut être \"chers\" pour les standards des restaurateurs mais on est loin des salaires moyens intra-muros...",
    "username" : "Ravius",
    "timestamp" : "2024-12-22T20:06:38Z"
  }, {
    "reportedcomment" : false,
    "body" : "Un resto pour 138 habitants, d'après les chiffres de la chambre de commerce et de l'industrie de Paris",
    "username" : "Ok-Government-9847",
    "timestamp" : "2024-12-23T03:44:00Z"
  }, {
    "reportedcomment" : false,
    "body" : "Mais pourquoi yen a autant alors?",
    "username" : "pizzamaztaz",
    "timestamp" : "2024-12-23T10:30:12Z"
  }, {
    "reportedcomment" : false,
    "body" : "À ce rythme là, dans moins de trois mille ans il y aura plus de restaurants que d'habitants 😆",
    "username" : "PreemoRM",
    "timestamp" : "2024-12-23T10:23:28Z"
  }, {
    "reportedcomment" : false,
    "body" : "L'emplacement et l'adéquation de ce qu'on propose par rapport à cet emplacement. Je pense à un resto de tartines danoises qui a ouvert dans un quartier de bureaux avec deux tartines à 16€. \n\nJe pense que c'était objectivement très qualitatif, mais dans aucun monde les gens irait à la pause.",
    "username" : "PierreTheTRex",
    "timestamp" : "2024-12-22T22:12:05Z"
  }, {
    "reportedcomment" : false,
    "body" : "Je pense que ça dépend du fait que ce soit de la vraie cuisine ou simplement des recettes Marmiton concoctées à base d'ingrédients premier-prix Rungis, comme 50%+ des restaurants à Paris.\n\nCar quelle que soit la nationalité des cuisiniers, j'ai du mal à imaginer que l'on puisse faire de la cuisine à la fois vraiment bonne et authentique (c'est-à-dire autre chose que la cinquantaine de plats-clichés qu'on retrouve partout), dans un restaurant, sans un minimum de formation, d'expérience et de talent.\n\nSi c'est pour faire un menu oeufs mayo / burger / salade / entrecôte-frites, c'est sûr qu'il n'y a pas besoin d'être très doué (bien que beaucoup arrivent quand même à faire ça mal).",
    "username" : "rapsca2",
    "timestamp" : "2024-12-22T20:33:09Z"
  }, {
    "reportedcomment" : false,
    "body" : "Pour illustrer ton propos: https://www.streetpress.com/sujet/1416216981-la-vraie-vie-des-cuisiniers-tamouls-de-paris",
    "username" : "RedditTipiak",
    "timestamp" : "2024-12-23T07:44:56Z"
  }, {
    "reportedcomment" : false,
    "body" : "Oui mais dans ces restaus y a combien de grec ?  \nY a des rues avec 20-30 kebabs a paris",
    "username" : "mumuuuuuuu",
    "timestamp" : "2024-12-23T12:40:13Z"
  }, {
    "reportedcomment" : false,
    "body" : "Parce que c'est pas vrai xD\n\nC'est fatigant, mais il y a une marge énorme sur certaines cuisines, comme l'italienne surtout. Il dit qu'il faut une marge de 30 % sur la nourriture (juste le prix d'achat). Tu sais combien ça coûte de faire une pizza ? On parle d'un euro, ou à peine plus, pour la farine, la tomate et le fromage, plus quelques centimes pour les garnitures, et c'est vendu à 8/9 euros minimum. Comment est-ce possible de ne pas y arriver ? Et si on parle de pâtes, ce n'est pas très différent.\n\nJ'avais un ami restaurateur sur Paris, et il achetait les ingrédients les moins chers possibles en réutilisant n'importe quoi. Personne dans la restauration n'avouera jamais qu'il y a des marges énormes. Comment est-ce possible de ne pas réaliser au moins 30 % (juste sur le prix d'achat des ingrédients) sur une pizza, un plat de spaghettis ou une barquette de frites (pommes de terre) vendue 4 euros ? Et ça, ce n'est même pas le pire. Le plus gros, ils le gagnent sur les boissons, le vin, etc.\n\nJ'ai fait des études pour ouvrir un restaurant il y a quelques années, validées par la chambre de commerce pour obtenir un prêt bancaire et ouvrir un resto, après il est arrivé le covid. Si maintenant les loyers l'énergie et les salaire sont augmentés énormément je ne sais pas, mais la on parlait que de prix d'achat.",
    "username" : "erbazzone",
    "timestamp" : "2024-12-23T12:26:53Z"
  }, {
    "reportedcomment" : false,
    "body" : "C’est un peu notre biais franco-français sur la « haute » cuisine que tu exprimes. Une cuisine peut être « bonne et authentique » sans être très complexe. \nLes chefs occidentaux diplômés plairont à une certaine clientèle car ils emmèneront originalité (dans le sourcing des ingrédients et la diversité des recettes) tout en correspondant à nos palais. \n\nC’est différent mais je n’irai pas jusqu’à dire que leurs collègues étrangers ne font pas de la « vrai » cuisine. Ils fonctionnent avec 90% des mêmes ingrédients, sur des recettes certes classiques mais surtout rapides à expédier quand t’es seul ou à 2 dans une cuisine de 4m2",
    "username" : "Ravius",
    "timestamp" : "2024-12-23T06:21:26Z"
  }, {
    "reportedcomment" : false,
    "body" : "Les chefs bengladais par exemple ont bonne réputation, ils savent déjà bien cuisiner. C'est pas des Paul Bocuse, mais ils sont chauds.",
    "username" : "ljog42",
    "timestamp" : "2024-12-23T09:26:05Z"
  }, {
    "reportedcomment" : false,
    "body" : "C'est vrai que là je parlais plutôt des restos qualitatifs où on retrouve ces marges là. Et oui, si on veut faire un truc de merde, on peut gratter sur les marges et faire des kebabs, mais c'est un autre business qui compte moins sur la réputation et plus sur la facilité - et on a quand même les mêmes charges autour. Et même avec ça, les marges ne sont pas hallucinantes dans la nourriture ; les prix de vente vont forcément descendre.\n\nJ'ai géré neuf établissements différents à Paris plus deux dans le sud de la France, dont la plupart avait de grands investisseurs derrière, et pour ceux-là c'était les doigts dans le nez car ils pouvaient prendre des emplacements supers et faire bcp de pub autour. Pour les petits bars et restos indépendants c'est bien plus compliqué.",
    "username" : "thataintrightlureen",
    "timestamp" : "2024-12-23T13:24:07Z"
  }, {
    "reportedcomment" : false,
    "body" : "Alors pardon si c'est ce que j'ai fait passer comme message mais je ne voulais absolument pas limiter la bonne cuisine à la grande gastronomie ou à la cuisine française. C'est le fait d'avoir cité Marmiton qui doit donner cette impression.\n\nMon intention est bien de défendre la cuisine authentique tout court donc nous sommes tout à fait d'accord.\n\nEt il me semble que j'ai dit \"peu importe leur nationalité\". Je n'ai personnellemment aucun soucis avec les fait que les chefs ou cuisiniers soient étrangers, je ne sais pas où vous m'avez vu insinuer ça...\n\nLa seule limite que je mettrai est le \"rapide à expédier\". Si cela inclut une préparation en amont pour gagner du temps au service : oui. Par contre, si c'est simplement faire des sandwichs, salades ou équivalent, là on n'est plus dans la restauration mais dans le fast-food (par définition). Je n'ai rien contre le fast-food mais par respect pour les gens qui travaillent très dur pour peaufiner leur passion, je ne me permettrai pas de les inclure dans les restaurants.\n\nDonc cuisine de \"grand-mère\" ou \"comme à la maison\", peu importe le pays, oui à 100% ! Mais absolument toutes celles que je connais (une bonne cinquantaine si l'on se limite aux pays) demandent du travail, de l'expérience, et du temps, au moins en amont.\n\nLa cuisine à la fois sans préparation et rapide à expédier ça n'est pas de la cuisine selon moi. Ça peut être bon au goût, mais c'est juste de la cuisson-assemblage.",
    "username" : "rapsca2",
    "timestamp" : "2024-12-23T11:14:44Z"
  }, {
    "reportedcomment" : false,
    "body" : "Oui j'ai l'impression que mon commentaire a donné le sentiment que je limitais la bonne cuisine à la gastronomie et aux cuisniers français, ce qui n'était pas du tout mon désir...\n\nJe suis moi-même très éclectique en terme de cuisine, ayant vécu plusieurs années dans quelques pays. Ce que je veux défendre, ce sont ces artisans qui justement s'entrainent et travaillent passionément pour donner le meilleur et rendre leur clientèle heureuse.\n\nÉtant développeur informatique et passioné par mon travail, j'ai l'impression de les comprendre, à ma manière.",
    "username" : "rapsca2",
    "timestamp" : "2024-12-23T11:29:36Z"
  } ]
}