{
  "_id" : "c9c16bd4-da55-4ca7-a1c0-67055fd7418e",
  "community" : "Sofia",
  "username" : "GreenHero681",
  "post" : "Редовна липса на топла вода",
  "timestamp" : "2024-12-21T11:51:15Z",
  "numcomment" : 6,
  "reportedpost" : false,
  "comment" : [ {
    "reportedcomment" : false,
    "_id" : "068771e9-118c-4392-9b72-7ad5b9de4199",
    "body" : "Вероятно нямате \"обръщач\" на топлата вода (трета тръба, с помпа, която я държи циркулираща, точно за да не трябва да се \"източва\" докато стигне загрятата вода). Това е доста често срещан проблем. Или генерално няма, или помпата не работи, или е премахнат.",
    "username" : "Neurenos",
    "timestamp" : "2024-12-21T12:08:33Z"
  }, {
    "reportedcomment" : false,
    "_id" : "a7a6467d-8944-4b45-b350-a80304be4d38",
    "body" : "Зависи как е настроена абонатнана станция и колко е потреблението през даден перион от деня. На автоматичен режим ,абонатната държи водата винаги подгрята и постоянно циркулира топла вода. Ако потреблението е ниско това резултира в поне 30-50 загуби и високи сметки за погравяне на топлата вода. Решете дали си струва и се обадяте в топлофикация",
    "username" : "Which-Apartment7124",
    "timestamp" : "2024-12-21T11:51:15Z"
  }, {
    "reportedcomment" : false,
    "_id" : "0bd21ed5-f149-44ed-8f0c-665144feeac3",
    "body" : "При нас беше подобно, но не чак толкова бавно. От както ремонтираха абонатната станция положението се подобри значително. Опитайте да се свържете с Топлофикация.",
    "username" : "ViktorKitov",
    "timestamp" : "2024-12-21T12:57:40Z"
  }, {
    "reportedcomment" : false,
    "_id" : "d8b56a5f-3997-4617-b210-1c9300e8db04",
    "body" : "Аз съм със същия проблем в панелен блок в южен квартал. Също като теб обмислях проточен бойлер, та ти пиша да те предупредя да внимаваш с избора на такъв. Обикновено, за да върши работа при къпане, проточният бойлер изисква голяма електрическа мощност, която е труднопостижима в панелен апартамент със стара ел. инсталация.",
    "username" : "Last-County-6411",
    "timestamp" : "2024-12-21T13:59:21Z"
  }, {
    "reportedcomment" : false,
    "_id" : "482627b3-1a11-4263-9cf4-37469524b5fc",
    "body" : "Първо, това ^, но и второ - на ТЕЦ е така, поне в София, за други градове не съм сигурен. Дори и с функционираща циркулярна тръба в ненатоварените часове и на по-високите етажи се чака да тръгне топла вода.",
    "username" : "danemepoznaqt",
    "timestamp" : "2024-12-21T12:28:22Z"
  }, {
    "reportedcomment" : false,
    "_id" : "aff6f334-ffc7-49ce-9b6b-f963e0e4a1f4",
    "body" : "Абонатната станция е собственост на Топлофикация. Ако има проблем, те трябва да си го оправят за тяхна сметка. Задължително е да се свържете с тях. Домоуправителя какво разбира е отделен въпрос…",
    "username" : "PublicPalpitation618",
    "timestamp" : "2024-12-21T13:43:10Z"
  } ]
}