{
  "id" : 200015,
  "community_name" : "London",
  "username" : "AutoModerator",
  "post_body" : "Weekly Q&A Megathread. Please post any questions about visiting, tourism, living, working, budgeting, housing here!",
  "timestamp" : "2024-12-23 10:47:44",
  "num_comment" : 6,
  "reported_post" : false,
  "commenti" : [ {
    "reported_comment" : false,
    "body" : "Want recommendations for what’s on this week? Check [this helpful post](https://www.reddit.com/r/london/s/yXZbBX1H7d)\n\nNeed some help planning your NYE? [There’s a comprehensive guide here](https://www.reddit.com/r/london/comments/1h553k8/the_complete_guide_to_london_new_years_eve_parties/)\n\nWhat’s open in London on 25th December? Very little (and no public transport), but [Londonist has collated a helpful list](https://londonist.com/london/christmas-in-london/what-open-london-christmas-day-restaurants-cafes-pubs-museums).",
    "username" : "polkadotska",
    "timestamp" : "2024-12-23 11:19:03"
  }, {
    "reported_comment" : false,
    "body" : "Hello I will be landing in London on Christmas day at LHR airport. The problem is we have a lot of luggage and I believe most of public transport is closed on that day. I will be staying on the east side which is an hour away from LHR. Would the best bet be to take an Uber? What do you suggest?",
    "username" : "dashboardrage",
    "timestamp" : "2024-12-23 15:12:05"
  }, {
    "reported_comment" : false,
    "body" : "Has anyone ever used ticketapt website? Is it a genuine website? \n\nReally interested in this event and my last minute plans allow me to be in London. Official website everything is sold out. Hence, pretty excited looking at this website which says its available. Obviously, the doubts are much higher too. Please share your experience here.",
    "username" : "elpsyRed",
    "timestamp" : "2024-12-23 10:47:44"
  }, {
    "reported_comment" : false,
    "body" : "There is no public transport at all - that's why your flights were cheap. \n\nIf you want the cheapest option: you can get the National Express coach to Victoria and take a cab/Uber/Bolt/whatever app takes your fancy from there. Though if there's a few of you, cab/Uber the whole way won't be that much more expensive. Expect the cab fare to be more expensive than usual.",
    "username" : "wwisd",
    "timestamp" : "2024-12-23 15:20:13"
  }, {
    "reported_comment" : false,
    "body" : "[Trustpilot](https://uk.trustpilot.com/review/ticketapt.com) is better at these things than reddit.",
    "username" : "wwisd",
    "timestamp" : "2024-12-23 11:25:49"
  }, {
    "reported_comment" : false,
    "body" : "As someone who buys too many tickets to stuff I've *never* heard of it, so I wouldn't trust it.\n\nTwickets or any official resale platforms listed on the event's official website are the only platforms I'd use if you are not based in London. \n\nIf you're talking about the NYE fireworks, then only use Ticketmaster.",
    "username" : "BulkyAccident",
    "timestamp" : "2024-12-23 15:00:28"
  } ]
}