{
  "id" : 200049,
  "community_name" : "Munich",
  "username" : "ax0ne",
  "post_body" : "FAQ for Visitors / FAQ für Besucher",
  "timestamp" : "2024-06-07 11:23:48",
  "num_comment" : 14,
  "reported_post" : false,
  "comment" : [ {
    "reported_comment" : false,
    "body" : "Thank you so much for this thread! Hopefully this will answer a lot of questions for new visitors",
    "username" : "dfreeezzz",
    "timestamp" : "2024-06-07 11:23:48"
  }, {
    "reported_comment" : false,
    "body" : "**What Tourists Should Know When Visiting Munich**\n\n**1. Cultural Etiquette and Local Customs**\n> \n* Greetings: Bavarians often greet with a firm handshake. In informal settings, a friendly \"Grüß Gott\" (God greet you) is common.\n* Dress Code: While casual attire is acceptable, more formal dress is appreciated in nicer restaurants or cultural events.\n* Tipping: Tipping around 5-10% is customary in restaurants, rounded up to the next euro in bars and cafes.\n* Quiet Hours: Munich is known for its peaceful neighborhoods. Observe quiet hours from 10 PM to 6 AM, especially in residential areas.\n* Escalators: On automatic stairways (escalators), it is customary to stand on the right side and walk on the left side.\n\n**2. Bikes**\n> \n* Bike Rentals: Munich is bike-friendly with many rental options. You can rent bikes from shops, automated stations, or bike-sharing programs.\n* Bike Lanes: The city has an extensive network of bike lanes. Always use them where available and follow traffic rules.\n* Safety Gear: Wearing a helmet is recommended, and using lights and reflectors at night is mandatory.\n* Parking: Park bikes only in designated areas. Lock your bike securely to prevent theft.\n* Bike Tours: Consider joining a guided bike tour to explore Munich’s sights and learn about the city’s history.\n\n**3. Language**\n> \n* German: The official language is German, but many locals speak English, especially in tourist areas.\n* Basic Phrases: Learning a few basic German phrases can enhance your experience. Examples include \"Bitte\" (please), \"Danke\" (thank you), and \"Entschuldigung\" (excuse me).\n\n**4. Safety**\n> \n* General Safety: Munich is considered one of the safest cities in Germany. However, it's wise to stay aware of your surroundings and keep valuables secure.\n* Emergency Numbers: Dial 110 for police and 112 for medical emergencies.\n\n**5. Eating and Drinking**\n> \n* Traditional Cuisine: Try local dishes such as Weißwurst (white sausage), Brezen (pretzels), and Schweinshaxe (pork knuckle).\n* Beer Culture: Munich is known for its beer culture. Visit beer halls and gardens to enjoy locally brewed beers. Remember, in beer gardens, it's customary to bring your own food, but drinks must be purchased on-site.\n\n**6. Public Transportation**\n> \n* Tickets: Purchase tickets before boarding trains, trams, and buses. Validate your ticket at the designated machines.\n* Types of Tickets: Single tickets, day passes, and group tickets are available. The Munich Card offers unlimited travel and discounts on attractions.\n\n**7. Where to Shop**\n> \n* Opening Hours: Most shops are open Monday to Saturday from 9 AM to 8 PM. Shops are usually closed on Sundays, except for some bakeries and convenience stores.\n\n**8. Weather and Packing Tips**\n> \n* Summer: Warm and pleasant, ideal for outdoor activities. Pack light clothing, but bring a light jacket for cooler evenings.\n* Winter: Cold with possible snow. Bring warm clothing, including a hat, gloves, and a scarf.\n* Spring and Fall: Mild but variable. Layered clothing is recommended.\n\n**9. Sightseeing Tips**\n> \n* Plan Ahead: Some attractions, like Neuschwanstein Castle, require advance booking.\n* City Pass: The Munich City Pass can save you money on transportation and entrance fees to major attractions. 8https://www.muenchen.travel/artikel/gaestekarten/muenchen-card-city-pass)\n\n**10. Accommodation**\n> \n* Book Early: Accommodation can fill up quickly during peak seasons like Oktoberfest and major trade fairs.\n* Areas to Stay: Popular areas include the city center (Altstadt), Schwabing for a bohemian vibe, and Glockenbachviertel for nightlife.",
    "username" : "ax0ne",
    "timestamp" : "2024-06-07 14:22:15"
  }, {
    "reported_comment" : false,
    "body" : "Great Guide! In addition, if any football fans want to celebrate their team until late into the night, there is a guide on the nightlife and clubs in Munich on: [https://nightradar.net/Munich](https://nightradar.net/Munich)",
    "username" : "nightradarnet",
    "timestamp" : "2024-06-21 03:04:54"
  }, {
    "reported_comment" : false,
    "body" : "Kurzer Guide für einen Layover in München (MUC)\n\nMünchen Flughafen (MUC) bietet viele Möglichkeiten, einen kurzen Layover angenehm und sinnvoll zu gestalten. Hier sind einige Tipps und Aktivitäten, die du in Betracht ziehen kannst:\n\n**1. Planung der Zeit**\n>\n* Immigration und Sicherheitskontrolle: Plane mindestens 30-60 Minuten ein, um durch die Immigration und Sicherheitskontrolle zu kommen.\n* Verkehrsanbindung: Die S-Bahn (S1 und S8) bringt dich in etwa 45 Minuten ins Stadtzentrum von München.\n* Rückkehr zum Flughafen: Plane genügend Zeit für die Rückkehr zum Flughafen und erneute Sicherheitskontrollen ein. Insgesamt solltest du etwa 3 Stunden für die Hin- und Rückfahrt sowie die Kontrollen einplanen.\n\n**2. Layover von 4-6 Stunden**\n\n>\n* Besuch des Englischen Gartens: Einer der größten innerstädtischen Parks der Welt. Ideal für einen kurzen Spaziergang oder eine Pause im Biergarten.\n* Marienplatz und Viktualienmarkt: Besuche das Herz der Stadt mit dem berühmten Glockenspiel am Neuen Rathaus und schlendere über den Viktualienmarkt, um lokale Köstlichkeiten zu probieren.\n* Hofbräuhaus: Das berühmte Bierhaus ist ein Muss für einen schnellen Besuch, um die bayerische Bierkultur zu erleben.\n\n**3. Layover von 6-8 Stunden**\n\n>\n* Deutsches Museum: Das größte Technikmuseum der Welt bietet spannende Ausstellungen und interaktive Erlebnisse.\n* BMW Welt und Olympiapark: Besuche die BMW Welt, um die neuesten Automodelle zu sehen, und erkunde den Olympiapark mit seinen Sportstätten und Grünflächen.\n* Nymphenburger Schloss: Ein beeindruckendes Schloss mit wunderschönen Gärten, etwa 20 Minuten vom Stadtzentrum entfernt.\n\n**4. Transportmöglichkeiten**\n\n>\n* S-Bahn: Die S1 und S8 fahren alle 10 Minuten und verbinden den Flughafen direkt mit dem Stadtzentrum.\n* Taxi: Eine bequeme, aber teurere Option. Die Fahrt ins Stadtzentrum dauert etwa 30-40 Minuten.\n\n**5. Flughafenaktivitäten**\n\nFalls du dich entscheidest, am Flughafen zu bleiben:\n\n>* Einkaufen: Zahlreiche Geschäfte bieten eine große Auswahl an Produkten, von Mode bis zu Souvenirs.\n* Kulinarisches Erlebnis: Zahlreiche Restaurants und Cafés bieten eine Vielfalt an Speisen und Getränken. \n* Das Airbräu am Flughafen München ist die weltweit einzige Mikrobrauerei an einem Flughafen, die traditionelle bayerische Gerichte und frisch gebraute Biere in einem gemütlichen Biergarten anbietet. (https://www.munich-airport.de/airbraeu/de)\n* Wellness: Einige Lounges und Einrichtungen bieten Spa-Dienste und Ruhebereiche an.\n\n**6. Besuch von Freising**\n\n>* Beschreibung: Freising, nur etwa 15 Minuten mit dem Zug vom Flughafen entfernt, ist eine der ältesten Städte Bayerns und bekannt für ihre historische Altstadt und die berühmte Weihenstephaner Brauerei.\n* Sehenswürdigkeiten: Besuche den beeindruckenden Freisinger Dom und erkunde die malerischen Gassen der Altstadt.\n* Weihenstephaner Brauerei: Die älteste noch bestehende Brauerei der Welt bietet Führungen und Verkostungen an, die einen Einblick in die lange Brautradition geben.\n* Kulinarisches: Genieße in den örtlichen Wirtshäusern traditionelle bayerische Küche und das berühmte Weihenstephaner Bier.\n\nAnreise\n\n>* Mit der S-Bahn: Die S1 fährt regelmäßig vom Flughafen München nach Freising. Die Fahrt dauert etwa 15 Minuten.\n* Buslinie 635: Diese Buslinie fährt direkt vom Flughafen München zum Bahnhof Freising. Die Fahrt dauert etwa 20 Minuten.\n\nEin Abstecher nach Freising ist eine ideale Möglichkeit, während eines Layovers ein Stück bayerische Geschichte und Kultur zu erleben.\n\n**Fazit**\n>Ein kurzer Layover in München kann eine wunderbare Gelegenheit sein, die Stadt kennenzulernen oder einfach die Zeit sinnvoll zu nutzen. Plane deine Zeit gut, um Stress zu vermeiden und das Beste aus deinem Aufenthalt zu machen.",
    "username" : "ax0ne",
    "timestamp" : "2024-07-08 09:20:41"
  }, {
    "reported_comment" : false,
    "body" : "Hi,  \nich wollte fragen, oder ergänzen, ob man das Tollwood (Sommer- und Winter) noch ergänzen kann?  \nIch glaube aktuell findet es ja gerade wieder statt:  \n[https://www.tollwood.de/](https://www.tollwood.de/)  \n21. Juni bis 21. Juli und diesmal im Olympiapark.",
    "username" : "538ku",
    "timestamp" : "2024-06-26 11:14:24"
  }, {
    "reported_comment" : false,
    "body" : "Wo kann ich Kletterausrüstung für den Klettersteig im Süden von München ausleihen? Ich habe ein Fahrzeug und kann daher fahren.",
    "username" : "roottootchebsoot",
    "timestamp" : "2024-08-26 22:27:54"
  }, {
    "reported_comment" : false,
    "body" : "Is it unreasonable to schedule the Deutsches Museum and their (separate site) Verkehrszentrum as one day?",
    "username" : "Random_Introvert_42",
    "timestamp" : "2024-11-11 23:21:38"
  }, {
    "reported_comment" : false,
    "body" : "Thanks! Let's see if it works :)",
    "username" : "ax0ne",
    "timestamp" : "2024-06-07 13:59:04"
  }, {
    "reported_comment" : false,
    "body" : "an awesome guideline.\n\nI'd add the D-ticket into Public Transportation section  \n[https://deutschlandticket.de/](https://deutschlandticket.de/)",
    "username" : "mission711",
    "timestamp" : "2024-06-11 07:57:43"
  }, {
    "reported_comment" : false,
    "body" : "Short Guide for a Layover in Munich (MUC)\n\nMunich Airport (MUC) offers many opportunities to make a short layover enjoyable and worthwhile. Here are some tips and activities to consider:\n\n**1. Time Planning**\n\n>* Immigration and Security: Allow at least 30-60 minutes to get through immigration and security.\n* Transportation: The S-Bahn (S1 and S8) takes about 45 minutes to get to Munich city center.\n* Return to the Airport: Allow enough time for the return trip and security checks. Overall, plan about 3 hours for the round trip and checks.\n\n**2. Layover of 4-6 Hours**\n\n>* Visit the English Garden: One of the largest urban parks in the world. Perfect for a short walk or a break in a beer garden.\n* Marienplatz and Viktualienmarkt: Visit the heart of the city with the famous Glockenspiel at the New Town Hall and stroll through Viktualienmarkt to sample local delicacies.\n* Hofbräuhaus: The famous beer hall is a must-visit for a quick stop to experience Bavarian beer culture.\n\n**3. Layover of 6-8 Hours**\n\n>* Deutsches Museum: The largest science and technology museum in the world offers exciting exhibitions and interactive experiences.\n* BMW World and Olympic Park: Visit BMW World to see the latest car models and explore the Olympic Park with its sports facilities and green spaces.\n* Nymphenburg Palace: An impressive palace with beautiful gardens, about 20 minutes from the city center.\n\n**4. Transportation Options**\n\n>* S-Bahn: The S1 and S8 run every 10 minutes and connect the airport directly to the city center.\n* Taxi: A convenient but more expensive option. The ride to the city center takes about 30-40 minutes.\n* Rental Car: If you want to be flexible, the airport offers several car rental providers.\n\n**5. Airport Activities**\n\nIf you decide to stay at the airport:\n\n>* Shopping: Numerous shops offer a wide range of products, from fashion to souvenirs.\n* Culinary Experience: Several restaurants and cafes offer a variety of food and drinks. \n* Airbräu at Munich Airport is the world's only airport microbrewery, offering traditional Bavarian dishes and freshly brewed beers in a cozy beer garden setting.(https://www.munich-airport.com/airbraeu/en)\n* Wellness: Some lounges and facilities offer spa services and relaxation areas.\n\n**6. Visit to Freising**\n\n>* Description: Freising, only about 15 minutes by train from the airport, is one of Bavaria's oldest towns, known for its historic old town and the famous Weihenstephan Brewery.\n* Attractions: Visit the impressive Freising Cathedral and explore the charming streets of the old town.\n* Weihenstephan Brewery: The oldest continuously operating brewery in the world offers tours and tastings, providing insight into its long brewing tradition.\n* Culinary Experience: Enjoy traditional Bavarian cuisine and the renowned Weihenstephan beer in local taverns.\n\nGetting to Freising\n\n>* By S-Bahn: The S1 line regularly runs from Munich Airport to Freising. The journey takes about 15 minutes.\n* Bus Line 635: This bus line goes directly from Munich Airport to Freising train station. The journey takes about 20 minutes.\n\nA trip to Freising is an ideal way to experience Bavarian history and culture during a layover.\n\n**Conclusion**\n\n>A short layover in Munich can be a wonderful opportunity to get to know the city or simply use the time productively. Plan your time well to avoid stress and make the most of your stay.",
    "username" : "ax0ne",
    "timestamp" : "2024-07-08 09:24:10"
  }, {
    "reported_comment" : false,
    "body" : "Danke! Ist hinterlegt",
    "username" : "ax0ne",
    "timestamp" : "2024-06-28 12:47:07"
  }, {
    "reported_comment" : false,
    "body" : "**Guide to the Deutschlandticket**\n\nWhat is the Deutschlandticket?\n\n>The Deutschlandticket, also known as the \"Germany Ticket,\" is a monthly public transportation pass that allows unlimited travel on local and regional public transportation throughout Germany.\n>\nhttps://deutschlandticket.de/\n\nKey Features:\n>\n* Unlimited Travel: The ticket provides unlimited travel on buses, trams, subways, and regional trains.\n* Monthly Subscription: The Deutschlandticket operates on a monthly subscription basis.\n* Price: The cost is typically €49 per month, but it is advisable to check for the latest price as it may vary or be subject to discounts.\n\nWhere Can You Use It?\n>\n* Local Public Transport: All city and regional public transportation, including buses, trams, subways (U-Bahn), and suburban trains (S-Bahn).\n* Regional Trains: Valid on regional trains (RB, RE, IRE) across the entire country.\n* Exceptions: Not valid on most long-distance trains (IC, ICE, EC) and some private train companies.\n\nHow to Purchase the Deutschlandticket:\n>\n* Online: Available on various public transportation websites and apps, including Deutsche Bahn and regional transport associations.\n* In-Person: Purchase at ticket machines or customer service centers in train stations and public transport hubs.\n\nHow to Use the Deutschlandticket:\n>\n* Subscription: Subscribe online or at a service center. Your ticket will be available digitally on your smartphone or as a paper ticket.\n* Validation: Ensure your ticket is valid for the month of travel. No additional validation is needed for each journey.\n* Carry ID: Always carry a valid ID with you as proof of identity when using the Deutschlandticket.",
    "username" : "ax0ne",
    "timestamp" : "2024-06-11 09:08:14"
  }, {
    "reported_comment" : false,
    "body" : ">S-Bahn: Die S1 und S8 fahren alle 10 Minuten und verbinden den Flughafen direkt mit dem Stadtzentrum.\n\nzumindest die S8 fährt nur alle 20 Minuten",
    "username" : "Low-Dog-8027",
    "timestamp" : "2024-07-13 03:54:57"
  }, {
    "reported_comment" : false,
    "body" : "Damit ist die Kombination S1/S8 gemeint",
    "username" : "ax0ne",
    "timestamp" : "2024-07-13 11:06:17"
  } ]
}