{
  "_id" : "c20803fc-d306-419d-a575-db0a8b5e5deb",
  "community" : "Frankfurt",
  "username" : "TheFighter461",
  "post" : "Verkehr in Frankfurt: „Nicht mit Ängsten der Menschen spielen“",
  "timestamp" : "2024-12-22T17:34:05Z",
  "numcomment" : 44,
  "reportedpost" : false,
  "comment" : [ {
    "reportedcomment" : false,
    "_id" : "e1348bc4-5793-4e65-a7d2-effb25853ce2",
    "body" : "You have posted a link to fr.de. Sometimes there is a softpaywall which demands that you switch off your adblocker. This is annoying but there seems to be no harm otherwise,\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/frankfurt) if you have any questions or concerns.*",
    "username" : "AutoModerator",
    "timestamp" : "2024-12-22T17:34:05Z"
  }, {
    "reportedcomment" : false,
    "_id" : "9f8a97f9-0ce5-4101-b5a4-ebc12b423600",
    "body" : "Also das sind Initaiven denen es null Komma null um ein Miteinander geht. Man liest es ja schon zu Beginn: es geht um angeblichen Stau und kostenlose Parkplätze. Das Argument das Rettungskräfte zu spät kommen ist Humbug. Bestätigt auch die Feuerwehr. Im Gegenteil, im Notfall können die Radstreifen dazu dienen das Einsatzkräfte am Verkehr vorbeifahren. Dann macht die FDP was sie am besten kann. Blockieren: \n\n„Die Stadt Frankfurt hat in einem Prozess mit Bürgerbeteiligung den Masterplan Mobilität entwickelt. Auf 200 Seiten sind Strategien unter anderem für den Fuß-, Rad-, und Autoverkehr sowie den öffentlichen Nahverkehr aufgeführt. Mit Einzelstrategien will die Stadt die Themen weiter vertiefen. Die FDP im Römer blockiert seit geraumer Zeit einen Stadtverordnetenbeschluss zum Masterplan.“",
    "username" : "Holgerson80",
    "timestamp" : "2024-12-22T18:13:12Z"
  }, {
    "reportedcomment" : false,
    "_id" : "213257f0-c1f4-4618-bc20-d4ff5e8667d6",
    "body" : "Ist ja klar das die #1Prozenter Partei FDP alles blockiert.",
    "username" : "fite_ilitarcy",
    "timestamp" : "2024-12-23T08:36:47Z"
  }, {
    "reportedcomment" : false,
    "_id" : "773d15c4-8d36-46b3-a036-d53cb8f0c927",
    "body" : "Das Problem ist, dass das Konzept und vor allem die Umsetzung katastrophal ist. In einer Stadt wie Frankfurt, die tagsüber das 3-4fache an Menschen beherbergt, sollte ERST an Alternativen gearbeitet werden (Nahverkehr - Zuverlässigkeit, Personal, Taktung, Wagen, Preis, P&Rs außerhalb etc.) und den Menschen somit ein Anreiz geboten werden umzusteigen. Aktuell hat man kein Personal, Verspätungen ohne Ende und im Endeffekt die Verkehrssituation mit Einbahnstraßen und Radwegen verschlimmert…\n\nAls Anwohner befürworte ich allerdings die “Idee - gerne auch mehr Entsiegeln und begrünen. Andere Städte zeigen ja wie es gehen kann (siehe Amsterdam, Gent, Paris, Oslo Helsinki, Bogota, Mailand..)",
    "username" : "Responsible-Egg-4559",
    "timestamp" : "2024-12-22T18:53:15Z"
  }, {
    "reportedcomment" : false,
    "_id" : "09d05a73-7c94-4c3b-aa38-eacd64ead945",
    "body" : "Der Verkehr in Frankfurt ist bereits verloren , leider",
    "username" : "real_Freshmaker",
    "timestamp" : "2024-12-22T17:42:53Z"
  }, {
    "reportedcomment" : false,
    "_id" : "88dc94e5-3252-4d8c-bd39-9550c06a356b",
    "body" : "Ich bin Radler und Autofahrer. Und als Radler oft alleine auf den Radwegen, für die eine autospur geopfert wurde. Als Autofahrer dann dafür im Stau mit gestressten Verkehrsteilnehmern um mich herum. Kann nicht erkennen, dass die Erstellung der Radwege überall eine geniale Idee war.",
    "username" : "haefler1976",
    "timestamp" : "2024-12-22T17:59:31Z"
  }, {
    "reportedcomment" : false,
    "_id" : "854c460a-15f8-4a16-bc85-cd5e67925864",
    "body" : "Am gefährlichsten ist der Verkehr ohnehin immernoch im Bahnhofsviertel.\n\n\n\nWas man sich da alles einfangen kann D:",
    "username" : "Deuteronymus",
    "timestamp" : "2024-12-23T10:31:18Z"
  }, {
    "reportedcomment" : false,
    "_id" : "edfbb8f6-d55c-4f33-b844-35022282c7d8",
    "body" : "Zumal die Wissenschaft da eindeutig ist. Die Kapazität innerstädtischer Straßen wird maßgeblich durch die Kreuzungen beeinflusst und separate Fahrradspuren entlasten den Autoverkehr ebenso. Hier werden nur die letzten Argumente für eine gescheiterte Verkehrspolitik zusammengekratzt... ",
    "username" : "Hightidemtg",
    "timestamp" : "2024-12-23T11:35:33Z"
  }, {
    "reportedcomment" : false,
    "_id" : "0fe6a308-ee4c-4646-92b8-7c59137eab46",
    "body" : "PR Eschborn war letztes Mal randvoll. Es braucht mehr Kapazitäten",
    "username" : "Classic_Department42",
    "timestamp" : "2024-12-22T19:06:11Z"
  }, {
    "reportedcomment" : false,
    "_id" : "d1a5e9e6-5182-43e0-9cb0-6e13a1a5c9e9",
    "body" : "Fahrradwege anzulegen ist doch das Angebot einer Alternative zum Auto. Da gibt es auch durchaus Gesamtkonzepte zu. Nur wird das (leider) halt nicht von heute auf morgen alles gleichzeitig umgesetzt. Sonst hätten wir heute schon ein deutlich besseres und zusammenhängendes Radverkehrsnetz in Frankfurt.",
    "username" : "TheFighter461",
    "timestamp" : "2024-12-22T19:22:14Z"
  }, {
    "reportedcomment" : false,
    "_id" : "fb69bca3-ec33-451d-a258-d5b3fad176ff",
    "body" : "Das Problem an diesem \"erst die alternativen\" ist, dass die Gegner hier die Ziellinie ständig verschieben und man eben nicht bis zu einem ÖPNV Utopia warten kann.\n\nAlternativen zum PKW fördern heißt eben auch Fahr- und Parkspuren für Bus und Rad zu reservieren, Kreuzungen und Fußwege von Falschparkern zu räumen, Vorrangschaltungen, undundund.\n\n\n\nDie von dir genannten Städte haben ja auch nicht gewartet, bis die Straßen plötzlich leer waren, um dann die Straßen umzugestalten.",
    "username" : "artsloikunstwet",
    "timestamp" : "2024-12-22T20:06:09Z"
  }, {
    "reportedcomment" : false,
    "_id" : "fdfa3737-2143-4240-abbe-bd40e231554f",
    "body" : "Erstens ist es \"nur\" das doppelte und nicht 3-4 fache. Zweitens wirst du keine Kapazitäten ausbauen können, ohne Nachfrage zu schaffen und es wird nur Nachfrage geben, wenn der Auto-Ist-Zustand unangenehmer wird.",
    "username" : "TheJoez",
    "timestamp" : "2024-12-22T19:25:20Z"
  }, {
    "reportedcomment" : false,
    "_id" : "ca104d3c-e455-45e6-8844-e55e25d27bb2",
    "body" : "Ich bezweifle dass du jemals auf einem Rad durch Frankfurt gefahren bist, bei solch einer Aussage. Ich bin früher, bevor es Radwege gab, sicherlich 3,4 mal pro Woche von amAutofahrern übersehen worden - ach ja, und ich war naturgemäß dran schuld. Ich weiss auch nicht, warum Menschen immernoch denken, dass ein Automobil in einer Stadt ein Menschenrecht zu sein scheint. Aber hey, die Radwege waren ein Fehler;)",
    "username" : "Used-Art-3543",
    "timestamp" : "2024-12-22T18:08:11Z"
  }, {
    "reportedcomment" : false,
    "_id" : "47052650-0021-49e2-8f7e-61b29f42ae04",
    "body" : "Genau dann fahr jetzt mal den „staufreien“ City oder Anlagenring noch ohne Radwege als Radfahrer. Stau gab es schon immer, dafür war Radfahren auf vielen großen Straßen großflächig unmöglich oder lebensgefährlich. ",
    "username" : "hansgorgel",
    "timestamp" : "2024-12-22T19:50:09Z"
  }, {
    "reportedcomment" : false,
    "_id" : "f4267efc-9ea1-45cf-9b99-771a955e866e",
    "body" : "Allein aud dem Radweg im Frankfurt? Radlst du nur am Stadtrand oder was?",
    "username" : "_Hangry_Hedgehog_",
    "timestamp" : "2024-12-22T18:56:52Z"
  }, {
    "reportedcomment" : false,
    "_id" : "7b47a974-0403-492e-878e-eda4295b7422",
    "body" : "Als Autofahrer ist man Stau. Radwege werden auch oft zusammenhangslos irgendwo hin gesetzt und sind dann nicht gut mit dem Fahrrad erreichbar. So wie es in einem oberen Post beschrieben ist, kann es gemacht werden. Man benötigt ein umfassendes Konzept statt einzelne Pflaster an verschiedenen Orten. In allen Städten die auf ÖPNV und Fahrradinfrastruktur setzen ist Auto fahren besser geworden für die die es müssen oder wollen und es sich leisten können.",
    "username" : "M4nfredbreiterbach",
    "timestamp" : "2024-12-22T18:38:01Z"
  }, {
    "reportedcomment" : false,
    "_id" : "1251a6b7-2eaa-48bf-badc-a3a9e51b7442",
    "body" : "Ich sehe als Radfahrer permanent Fahrradfahrer auf Radwegen. Wo fährst du denn lang?",
    "username" : "Pinguin71",
    "timestamp" : "2024-12-22T20:42:03Z"
  }, {
    "reportedcomment" : false,
    "_id" : "c0e443c4-c56a-4a1b-a4da-9c45d6c816a3",
    "body" : "Ich gebe Dir völlig Recht.\n\nWie bereits in einem anderen Post geschrieben, bin ich ebenfalls Rad und Autofahrer.\n\nUnd nochmal: Radwege müssen nicht auf den Hauptachsen (nehmen wir die Eschersheimer Landstraße als Beispiel). \nIch kann wunderbar links und rechts in den Seitenstraßen radeln. Ja, da ist rechts vor links - muss ich mich mitm Rad aber auch dran halten.\n\nIch will doch gar nicht auf der Hauptachse mit Abgasen fahren.\n\nWir benötigen ein Gesamtkonzept mit Achsen nach FFM rein. Z.b.: aus dem Taunus kommend an der Nidda lang. Da sehe ich von 20km Strecke auf den letzten 1,2 km in Bockenheim erstmals Verkehr. Dort brauche ich Anbindung in den Nebenstraßen als Fahrraddstrasse. \nIch brauche diese nicht im Grüneburgweg - warum auch? Da kann ich auch wieder wunderbar parallel radeln…\n\nUnd jetzt seid mal alle wirklich ehrlich zu Euch und führt nicht auch noch diesen Krieg Auto vs Fahrrad aus.\n\nPS: Nochmal: Ich fahre Rennrad, MTB und nen Stadtrand. Rücksicht muss jeder auf jeden nehmen.",
    "username" : "Both-Researcher4153",
    "timestamp" : "2024-12-22T21:34:52Z"
  }, {
    "reportedcomment" : false,
    "_id" : "862a7317-64a6-4aaa-a8cf-eb35d6e960e0",
    "body" : "Eschborn ist dahingehend kein gutes Beispiel, da dort alles hin fährt zum Arbeiten und die P&Rs belagert (arbeite dort). Wenn wir mal nördlich aus Frankfurt rausgehen, da ist man weiterhin quasi verloren als Pendler zum Arbeiten nach Frankfurt zu gelangen…",
    "username" : "Responsible-Egg-4559",
    "timestamp" : "2024-12-22T19:19:24Z"
  }, {
    "reportedcomment" : false,
    "_id" : "aff9c514-4b39-4264-ae75-4b8d181b3f57",
    "body" : "das spricht vielleicht die einwohner an aber nicht die leute die 20, 30 km von ausserhalb kommen. schon gar nicht wenn man zu stosszeiten rein oder raus muss und die sbahn so vollgestopft ist das man sich schon um fummler und taschendiebe sorgen machen kann.",
    "username" : "waiting4singularity",
    "timestamp" : "2024-12-23T00:43:12Z"
  }, {
    "reportedcomment" : false,
    "_id" : "7ae0e63b-75e3-47aa-a5b5-3f0cc73eeeff",
    "body" : "Primäres Problem sind aber Pendler (oder?), die sind leider auf ein Auto angewiesen oder müssen halt für 10-20km zwei Stunden zur Arbeit in brechend vollen oder unpünktlichen Zügen einplanen. Als Frankfurter begrüße ich wie gesagt die Idee und brauche kein Auto, da mir Nahverkehr/Rad in der Stadt reicht. :)",
    "username" : "Responsible-Egg-4559",
    "timestamp" : "2024-12-22T19:44:50Z"
  }, {
    "reportedcomment" : false,
    "_id" : "e7cc9491-afbf-4fbc-90b9-1cbd771bd106",
    "body" : "Also sobald ich schneller, günstiger und komfortabler ohne einen anderen Menschen zu begegen an mein Ziel komme, steige ich sofort um, aber nur dann /s.",
    "username" : "Pinguin71",
    "timestamp" : "2024-12-22T23:28:51Z"
  }, {
    "reportedcomment" : false,
    "_id" : "80431ee6-2a46-4c16-854c-f6a7e91e970e",
    "body" : "Ich werde es heute noch. Trotz der Radwege...\n\nAber gut - es ist deutlich besser geworden",
    "username" : "Blumi511",
    "timestamp" : "2024-12-22T20:18:54Z"
  }, {
    "reportedcomment" : false,
    "_id" : "287da497-c1a9-4f1a-8477-32b0f835c56f",
    "body" : "Wir sind alle froh, dass du es trotzdem überlebt hast.",
    "username" : "haefler1976",
    "timestamp" : "2024-12-22T20:06:39Z"
  }, {
    "reportedcomment" : false,
    "_id" : "a81d2a58-78ef-4796-b496-61efcda7926d",
    "body" : "Es gibt ein umfassendes Konzept. Demokratische etabliert durch den Radentscheid. Umfasst Hauptachsen, Schnellwege, Fahrradstrassen und Gestaltungsvorgaben zu Nebenstraßen. ",
    "username" : "hansgorgel",
    "timestamp" : "2024-12-22T19:56:20Z"
  }, {
    "reportedcomment" : false,
    "_id" : "e678c91e-4df7-48a9-b5ca-49c9894d8ac9",
    "body" : "Du meinst so ein richtiges Konzept? Das man mit den Bürger:innen erarbeitet? So einen richtig großen Plan? Den man dann am besten Masterplan nennt? - Moment mal!!",
    "username" : "Commune-Designer",
    "timestamp" : "2024-12-22T20:52:26Z"
  }, {
    "reportedcomment" : false,
    "_id" : "ffdf0f1c-50cb-4ad5-8c31-5f5fa958629a",
    "body" : "S Bahnhof Eschborn wird ab 2027 umgebaut. ",
    "username" : "hansgorgel",
    "timestamp" : "2024-12-22T19:46:31Z"
  }, {
    "reportedcomment" : false,
    "_id" : "212c410d-b1b6-4372-a0d1-80749e720dd9",
    "body" : "Auch den Pendlern ist aber geholfen, wenn du auf der Kurzstrecke das Auto stehen lässt.",
    "username" : "artsloikunstwet",
    "timestamp" : "2024-12-22T20:07:07Z"
  }, {
    "reportedcomment" : false,
    "_id" : "c9447456-7e90-4693-aac4-80b398748a42",
    "body" : "Als Pendler sag ich, dass 2h für 10-20km, brechend volle und unpünktliche Züge maßlose Übertreibungen sind.",
    "username" : "Danghor",
    "timestamp" : "2024-12-22T22:12:00Z"
  }, {
    "reportedcomment" : false,
    "_id" : "9d659c13-323c-415c-a3a7-5f9556b16636",
    "body" : "Ich bin Fahrradpendler, wieso sollten Leute nicht mit dem Rad pendeln? Deutschlandweit machen das 10% in Frankfurt werden das sicher mehr sein. Und wenn man keine Angst haben muss totgefahren zu werden, werden das sicher mehr werden.",
    "username" : "Pinguin71",
    "timestamp" : "2024-12-22T20:36:51Z"
  }, {
    "reportedcomment" : false,
    "_id" : "eb466f3a-a00b-42c9-8a7a-f9f62acbaee2",
    "body" : "Manche halt nicht. Witzig ist das nicht ",
    "username" : "hansgorgel",
    "timestamp" : "2024-12-22T20:42:01Z"
  }, {
    "reportedcomment" : false,
    "_id" : "3c46e8e7-0960-4f6f-9a15-bef8182811d3",
    "body" : "steht das weiße fahrrad noch vor der bank? bring doch mal blumen hin.",
    "username" : "waiting4singularity",
    "timestamp" : "2024-12-23T00:50:33Z"
  }, {
    "reportedcomment" : false,
    "_id" : "c70c6091-96c8-4e92-a82d-3b58e970a310",
    "body" : "Mit der geflissentlichen Arschloch-Attitüde kannste ma ganz für dich allein sprechen.",
    "username" : "PetrovskyKSC",
    "timestamp" : "2024-12-23T07:28:02Z"
  }, {
    "reportedcomment" : false,
    "_id" : "410da657-5d25-4ec5-9877-00743562429c",
    "body" : "Weil Fahrradfahren im Deutschen Winter halt nur was für echte enthusiasten ist und auch mit der richtigen Fahrradkleidung nur nervt und daher für mich und ich denke mal sehr viele andere auch im Winter keine echte Alternative ist. Wohne zum Glück in der Stadt und bin mit UBahn gut und zuverlässig angebunden aber von außerhalb ist schon oft katastrophal",
    "username" : "GrandmasterTrend",
    "timestamp" : "2024-12-22T20:52:57Z"
  }, {
    "reportedcomment" : false,
    "_id" : "44c8776a-9134-4ef2-aa8e-741e9998f7eb",
    "body" : "Richtig, wenn man eine sichere Infrastruktur für Rad und Auto schafft, dann steigen auch mehr Leute auf das Rad um.",
    "username" : "Holgerson80",
    "timestamp" : "2024-12-23T13:05:55Z"
  }, {
    "reportedcomment" : false,
    "_id" : "5f2adf95-0fb1-4730-841c-280d1f560df5",
    "body" : "Das stimmt gar nicht. In Finnland gibts ne Stadt, da nimmt die anzahl der Radfahrer bis -20°C nicht ab. [https://www.youtube.com/watch?v=Uhx-26GfCBU](https://www.youtube.com/watch?v=Uhx-26GfCBU) \n\nIch glaube wir müssen uns nicht drüber streiten, dass finnische Winter härter sind als deutsche.",
    "username" : "Pinguin71",
    "timestamp" : "2024-12-22T21:00:22Z"
  }, {
    "reportedcomment" : false,
    "_id" : "3fbaf67d-5df3-4632-b13c-d8e7387600fa",
    "body" : "lol was für ein Argument. Finnen sind halt wohl offensichtlich auch einfach abgehärteter. Außerdem bei trockener Kälte und Schnee ist es wahrscheinlich wirklich besser als bei nasskalten 4 grad mit Nieselregen und Gegenwind. In ffm zumindest ist die Fahrrad dichte im Sommer deutlich höher als im Winter.",
    "username" : "GrandmasterTrend",
    "timestamp" : "2024-12-22T21:04:39Z"
  }, {
    "reportedcomment" : false,
    "_id" : "4dbd4a06-cea0-43f2-894d-76c105990260",
    "body" : "Denkst du die Finnen sind uns da genetisch überlegen (was ich weird finde) oder das es ne Gewohnheitssache ist? Weil bei letzerem sehe ich nicht, wo das Gegenargument sein soll. Wenn du das Video gesehen hättest, wüsstest du, dass man sich dort darauf verlassen kann, das Radwege instand gehalt sind und auch geräumt werden",
    "username" : "Pinguin71",
    "timestamp" : "2024-12-22T21:08:24Z"
  }, {
    "reportedcomment" : false,
    "_id" : "c534e812-645d-4a3f-b62b-3405f00fcfa9",
    "body" : "Natürlich nicht genetisch, sollte eigentlich durch meine Wortwahl selbsterklärend sein. Ich hätte aber auch bei geräumten Radwegen wahrscheinlich da oben im Winter keinen Bock aufs Rad. Es geht darum das es im Winter auf dem Rad einfach scheiße ungemütlich ist egal ob das in Finnland funktioniert. Ich denke hier geht es vielen wie mir und es daher im Winter wieder mehr Leute in die Autos oder Bahnen zieht. Daher kann nicht alles nur aufs Fahrrad ausgerichtet werden.",
    "username" : "GrandmasterTrend",
    "timestamp" : "2024-12-22T21:19:30Z"
  }, {
    "reportedcomment" : false,
    "_id" : "f4c4a7b6-5566-4b50-b5e5-4e0a2908c73b",
    "body" : "Und du denkst nicht, dass du dich daran genau so gut wie die Finnen gewöhnen könntest? Woran liegt das?\n\nUnd es soll ja auch nicht alles aufs Rad ausgerichtet sein, das ist ja gar nicht der Plan, aber man kann Fahrräder halt mitdenken.",
    "username" : "Pinguin71",
    "timestamp" : "2024-12-22T21:24:54Z"
  }, {
    "reportedcomment" : false,
    "_id" : "9024568b-e910-4528-8b76-48499ec26bcc",
    "body" : ">Daher kann nicht alles nur aufs Fahrrad ausgerichtet werden.\n\nLMAO. Du scheinst in einer anderen Welt zu leben. In Deutschland, auch Frankfurt, ist alles aufs Auto ausgerichtet. Sobald Fahrradfahrer auch etwas Infrastruktur zugestanden bekommen ist plötzlich alles aufs Fahrrad ausgerichtet. Die Realitätsferne mancher 100% Autofahrer ist beeindruckend.",
    "username" : "TheFighter461",
    "timestamp" : "2024-12-22T21:29:57Z"
  }, {
    "reportedcomment" : false,
    "_id" : "84e8ddfb-a85c-4719-84d7-1bacbdc32f24",
    "body" : "Du scheinst meinen Punkt nicht zu verstehen oder verstehen zu wollen. Ich bin gar kein 100% Autofahrer, fahre in den angenehmeren Monaten auch sehr viel mit dem Fahrrad in der Stadt und begrüße einen Großteil der ausgebauten Fahrradwege. Insgesamt wird mir aber bei der Neuausrichtung weg vom auto zu viel Fokus aufs Fahrrad gelegt und als der gamechanger schlechthin gesehen. Was ich bei den deutschen Wetterverhältnissen im Herbst und Winter halt nicht für realistisch halte. Beim ÖPNV ist viel bla bla und wenig was wirklich besser wird.",
    "username" : "GrandmasterTrend",
    "timestamp" : "2024-12-22T22:05:39Z"
  }, {
    "reportedcomment" : false,
    "_id" : "70bba235-60d9-4a78-9c96-7726bb466b28",
    "body" : "Ist das Wetter in den Niederlanden besser? Bitte verallgemeinere nicht deine eigenen Befindlichkeiten und projiziere das auf die deutsche Verkehrspolitik. Auch im Herbst und Winter gibt es keine Gründe nicht Fahrrad zu fahren wie es in anderen Ländern Europas gezeigt wird.",
    "username" : "TheFighter461",
    "timestamp" : "2024-12-23T11:02:11Z"
  }, {
    "reportedcomment" : false,
    "_id" : "5a3ac9f4-f854-4d83-b36a-ce85ffc784a4",
    "body" : "Am ÖPNV wird auch gearbeitet. Das ist allerdings viel komplexer als mal so eben paar Fahrradstreifen hinzubauen. Daher dauert es eben länger. Das eine schließt das andere nicht aus.",
    "username" : "mac-claen",
    "timestamp" : "2024-12-23T11:55:12Z"
  } ]
}