{
  "postId" : 200106,
  "community" : "Budapest",
  "username" : "ajfa218",
  "post" : "Moving to Budapest – Advice Needed on Districts and Living",
  "timestamp" : "2024-12-23T10:18:30Z",
  "numcomment" : 5,
  "reportedpost" : false,
  "comment" : [ {
    "reportedcomment" : false,
    "body" : "Well, it depends on which part of the IX. district. If you would like to have lots of green area I would suggest to check József Attila Lakótelep, it is in the IX. district but not in the middle of the city, however it is connected to the metro (actually has 2 metro stations) and you can be in the middle of the city in 15 minutes. Many people have here dogs and there is also a small forest when you can let your dog run around freely.\n\n[https://www.google.com/maps/place/Budapest,+J%C3%B3zsef+Attila-lak%C3%B3telep/@47.4632895,19.1077892,2210m/data=!3m2!1e3!4b1!4m6!3m5!1s0x4741c2d492fec111:0xb0f23cf96daaff75!8m2!3d47.4635155!4d19.1175377!16s%2Fg%2F120rs1lg!5m1!1e2?entry=ttu&g\\_ep=EgoyMDI0MTIxMS4wIKXMDSoASAFQAw%3D%3D](https://www.google.com/maps/place/Budapest,+J%C3%B3zsef+Attila-lak%C3%B3telep/@47.4632895,19.1077892,2210m/data=!3m2!1e3!4b1!4m6!3m5!1s0x4741c2d492fec111:0xb0f23cf96daaff75!8m2!3d47.4635155!4d19.1175377!16s%2Fg%2F120rs1lg!5m1!1e2?entry=ttu&g_ep=EgoyMDI0MTIxMS4wIKXMDSoASAFQAw%3D%3D)",
    "username" : "redikarus99",
    "timestamp" : "2024-12-23T10:18:30Z"
  }, {
    "reportedcomment" : false,
    "body" : "Dog regulations: there are no prohibited breeds, you always have them on leash when you are out. There are areas in park that are dogpark and you can take them off the leash. There is a whole island which is free for dogs, no leash (Hajógyári sziget).\n\nYour dog should have a microchip with your data, and the yearly vaccination is a must. Sometimes there is a \"dogcounting\" or surveying dogs then you have to fill that out for the municipality. \n\nMost of the coffees, bar, restaurants are dogfriendly, even some shops. But none of the supermarkets are dogfriendly.\n\nFrom january if you have a yearly os monthly ticket to the public transport your dog can go with you for free but with leash and muzzle or in a carrier.\n\nIn the rents dogs are not so welcome unfortunately. But you can alway find a few.",
    "username" : "PhysicalFollowing755",
    "timestamp" : "2024-12-23T11:03:56Z"
  }, {
    "reportedcomment" : false,
    "body" : "for a good one bedroom place budget at least 300K + house fees + internet + gas + electricit. this is for the inner districts where most expats want to live.\n\nas for dogs, do some good research on this as this yank who transferred in seemingly did none and didn't realize that his dogs would be quarantined for a while. unfortunately one didn't survive it. :(\n\nit's been my observation that most yanks don't really train their dogs much, if at all. that is not the case here and dogs outside of their house are expected to behave. there are many dog-friendly places, but you have to ask the employees of the store.  most chains don't unless they are true service dogs. (we don't have the lax and permissive standards that the usa does) they have to be muzzled on public transport. \n\ndistrict vi has the most expats living there, but except for the area near the városliget, doesn't have much green space and is well known for people who don't pick up after their dogs.",
    "username" : "VszVszVsz",
    "timestamp" : "2024-12-23T11:08:40Z"
  }, {
    "reportedcomment" : false,
    "body" : "I’d go for District XI. There are plenty of dog parks and you’ve got easy access to District IX. Avoid District VI and VII since the number of green areas is quite limited and not totally dog friendly. \n\nRegarding renting an apartment, your place to search will be Ingatlan.com. Please bear in mind you will be limited to the number of apartments available. Not a lot of landlords allow pets in apartments so this will limit your choices.\n\nHungary is very very safe. Not sure where you’re from, but you could literally walk alone at 3 AM as a female and no one would disturb you. However, always exercise common sense.\n\nFor costs: [https://www.numbeo.com/cost-of-living/in/Budapest](https://www.numbeo.com/cost-of-living/in/Budapest)\n\nEdit: Typo",
    "username" : "igenigen",
    "timestamp" : "2024-12-23T10:20:18Z"
  }, {
    "reportedcomment" : false,
    "body" : "i can recommend district IX, mostly belső-ferencváros or középső-ferencváros. there are a lot of dog-friendly places, also a lot of dog parks and small but cozy parks with green space, also nice restaurants and amazing bars. the rental prices should be no more than 400k huf/month for a 1-2 bedroom apartment. also look out for the landlords who only accept cash payment, those have shady business going on. the easiest districts for commuting are basically any inner districts on the pest side (V, VI, VII, VII) and district XX, which is a cheaper district in budapest, but also a bit less secure than others, any district that has metro m3 stations or district XI on the buda side.",
    "username" : "evening-peak-7672",
    "timestamp" : "2024-12-23T12:49:17Z"
  } ]
}