{
  "id" : 200181,
  "community_name" : "Amsterdam",
  "username" : "fatsamco",
  "post_body" : "PSA—theft on ICE train Amsterdam to Köln",
  "timestamp" : "2024-12-23 11:38:21",
  "num_comment" : 39,
  "reported_post" : false,
  "comment" : [ {
    "reported_comment" : false,
    "body" : "I was recently in an ICE train where one of the conductors was warning a few people in my carriage and telling this example multiple times. She said it happens on her shifts every single time in every direction. \n\nNot to say you are at fault, but these rats are constantly active.",
    "username" : "suchpostsowow",
    "timestamp" : "2024-12-23 11:38:21"
  }, {
    "reported_comment" : false,
    "body" : "https://www.nsinternational.com/how-to-protect-yourself-from-pickpockets-on-trains\n\nThey have a page warning people of this and tips to avoid it, most importantly never leave your valuables in overhead racks. Also it seems that they look specifically for inconspicuous black backpacks",
    "username" : "DashingDino",
    "timestamp" : "2024-12-23 11:42:03"
  }, {
    "reported_comment" : false,
    "body" : "Geez, the DB ticket inspector even told me his bag was stolen a few weeks ago. The crime rates in Cologne are insane.",
    "username" : "christophr88",
    "timestamp" : "2024-12-23 11:59:49"
  }, {
    "reported_comment" : false,
    "body" : "Thanks for the headsup ill be on this train in March.",
    "username" : "MyParentsWereHippies",
    "timestamp" : "2024-12-23 12:41:36"
  }, {
    "reported_comment" : false,
    "body" : "I never put my bags above me....I put them across from me and forward so they are always in sight. And backpack never leaves me.",
    "username" : "BobcatSpiritual7699",
    "timestamp" : "2024-12-23 13:17:15"
  }, {
    "reported_comment" : false,
    "body" : "Sorry this happened to you. Similar thing happened to me at London Paddington. Organised gangs target the trains sadly 😔",
    "username" : "Fabulous-Web7719",
    "timestamp" : "2024-12-23 13:45:25"
  }, {
    "reported_comment" : false,
    "body" : "Sorry you had this experience. Ive yet to hear to of good ICE experience where there wasn't theft on the train. People think they are being careful but don't seem to appreciate how clever/well trained the thieves are, this is their profession.",
    "username" : "thefore",
    "timestamp" : "2024-12-23 12:33:25"
  }, {
    "reported_comment" : false,
    "body" : "Would it be too much for them to put cameras\n in the train and prosecute these thieves?",
    "username" : "CarelessInevitable26",
    "timestamp" : "2024-12-23 13:48:30"
  }, {
    "reported_comment" : false,
    "body" : "Happens a fair bit on Eurostar too, always got to keep an eye on your shit unfortunately.",
    "username" : "downlau",
    "timestamp" : "2024-12-23 14:16:40"
  }, {
    "reported_comment" : false,
    "body" : "I regularly take this train and I would have never guessed, thanks for the heads up! I",
    "username" : "annabiler",
    "timestamp" : "2024-12-23 14:26:34"
  }, {
    "reported_comment" : false,
    "body" : "In Europe, always keep your valuables beside you, in fact hug them in front of you and beware of distraction. Are you of Chinese/Indian or looking like tourists (Caucasian and other ethnicities)? If so they may have targeted you from the station.",
    "username" : "readni",
    "timestamp" : "2024-12-23 14:48:49"
  }, {
    "reported_comment" : false,
    "body" : "Thanks for the post and warning and I'm sorry to hear your things were taken.\n\nI'll be taking a similar route soon and this is a good reminder to keep my belongings where I can easily see them.",
    "username" : "TheUncommonTraveller",
    "timestamp" : "2024-12-23 15:07:06"
  }, {
    "reported_comment" : false,
    "body" : "Please please keep your valuables with you, not in some rack or some other places, if you are going to toilet ? Then take  it with you, you want to sleep ? Then hold it with your hands and sleep.",
    "username" : "raebyddub",
    "timestamp" : "2024-12-23 12:25:32"
  }, {
    "reported_comment" : false,
    "body" : "Get this, 17 december 2021 I took the ICE to Köln. And I was sitting in the first or last carriage (can't remember correctly).  \nIt was very quiet since most of the passengers where in the middle of the train.\n\nAnd to the note, I had the same thing happen to me. Saw the guy, moved my bag, walked off, other the course of multiple times back and forth.  \nIn hindsight, it was a friday eveneing, I was tired from the workweek. Took the train because I didn't want to drive myself. And was chilling, watching some Netflix.  \nI had a false sense of security. I had that feeling when boarding a plane, once you are seated and the doors are closed you wait until arrival.\n\nIt was an expensive lesson, ever since I lock my luggage to the overhead with a small chain and lock when traveling by international train.",
    "username" : "Blapeuh",
    "timestamp" : "2024-12-23 14:02:22"
  }, {
    "reported_comment" : false,
    "body" : "This happens all the time, they even announce it in the train and I know various people who got their stuff stolen in the ICE. I guess you were the last person who didn't know.",
    "username" : "Zooz00",
    "timestamp" : "2024-12-23 13:00:43"
  }, {
    "reported_comment" : false,
    "body" : "I feel sorry for you. \n\nBut you've been lucky in Asia and South America then because these things happening there also. In fact it happens all over our world. It is not new, it is only more known because of the social media. Never leave any bags unattended, not for a second anywhere. I still see people in restaurants have their bags over their chairs and are sometimes shocked some is stolen out of it by a person sneeked behind for a moment.\n\nWhen these things happen to you this mostly could be avoided. So it IS your fault (EDIT: it is not really your fault but you could have avoided happening). Sadly criminals are everywhere and that will never change, only your behaviour can be changed.",
    "username" : "dutchcharm",
    "timestamp" : "2024-12-23 13:29:50"
  }, {
    "reported_comment" : false,
    "body" : "First time out in the world?",
    "username" : "LiverKiller3000",
    "timestamp" : "2024-12-23 13:37:26"
  }, {
    "reported_comment" : false,
    "body" : "Yep I suppose my fault was not being extra vigilant. I’ve travelled to places in Asia and South America unscathed so I stupidly dropped my guard in Europe and that’s on me! \n\nFunny thing, there was a group of individuals being really loud in the quiet carriage sitting next to us and at the station the theft likely occurred act, a man came up to our seats and said he booked ours and we were in the wrong seats. Now all of this could’ve been a coincidence or they could’ve all been in on it and created distractions while the bag was stolen. I’ll never know but I’ll definitely never drop my guard after this experience.",
    "username" : "fatsamco",
    "timestamp" : "2024-12-23 12:53:29"
  }, {
    "reported_comment" : false,
    "body" : "Usually such a warning comes after someone reports something is stolen",
    "username" : "AdApart2035",
    "timestamp" : "2024-12-23 12:00:14"
  }, {
    "reported_comment" : false,
    "body" : "Thanks for this link! I’m sure it’ll be helpful to anyone else who comes across this post! (Wish I’d seen this before my travels because I fit the bill perfectly to be targeted, lol)!",
    "username" : "fatsamco",
    "timestamp" : "2024-12-23 12:38:03"
  }, {
    "reported_comment" : false,
    "body" : "You’re welcome! I hope you don’t experience what I did, but I’m glad you came across the post—that was my intention in posting it!",
    "username" : "fatsamco",
    "timestamp" : "2024-12-23 13:52:12"
  }, {
    "reported_comment" : false,
    "body" : "Yep, great strategy and one that I’ll employ the next time I travel!",
    "username" : "fatsamco",
    "timestamp" : "2024-12-23 13:53:52"
  }, {
    "reported_comment" : false,
    "body" : "Yep I was in the ice from koln and I kept my bag with me. I've seen these videos of people stealing in planes. And I've got things stolen from me before and know how fast it happens. Like put my coat down. Turn around. And gone.",
    "username" : "Khabba",
    "timestamp" : "2024-12-23 15:00:11"
  }, {
    "reported_comment" : false,
    "body" : "Thank you for your kindness! This was actually my first time travelling via train around Europe so it was definitely a learning experience to keep my wits about me the next time!",
    "username" : "fatsamco",
    "timestamp" : "2024-12-23 13:57:51"
  }, {
    "reported_comment" : false,
    "body" : "Yep, I’m actually impressed at the whole maneuver and initially I felt really upset but now that it’s been a few days, I’m trying to adopt a more stoic and pragmatic attitude. I browsed Reddit before my trip so thought of posting this here in case someone else benefits from my experience. I have a good friend who travels frequently on the ICE but never mentioned this issue—I suppose if it doesn’t happen to you, you don’t think of warning others. Oh well, lesson learned!",
    "username" : "fatsamco",
    "timestamp" : "2024-12-23 12:36:30"
  }, {
    "reported_comment" : false,
    "body" : "So there are cameras on the trains and the Dutch police in Arnhem went above and beyond to try to help me—but the fact is this happens so often that the helpers are outnumbered by the criminals. I think both DB and the police truly did everything they could to help—most importantly encouraging me to file a police report for insurance purposes. Realistically once the stuff is gone, it’s gone for good.",
    "username" : "fatsamco",
    "timestamp" : "2024-12-23 13:55:52"
  }, {
    "reported_comment" : false,
    "body" : "Oof sorry this happened to you too! You’re spot on about that sense of security—I also felt that before this incident but now I definitely will lock my things or just be extremely alert!",
    "username" : "fatsamco",
    "timestamp" : "2024-12-23 14:12:02"
  }, {
    "reported_comment" : false,
    "body" : "In my case, the announcement was about thieves on the station, not in the train. So as a first time traveler along this route/train I didn’t think about the obvious translation error. In hindsight, if they’re on the station, they’ll likely be on the train too! Once I reported my incident the train attendant made the announcement about theft on the train in English.",
    "username" : "fatsamco",
    "timestamp" : "2024-12-23 13:59:38"
  }, {
    "reported_comment" : false,
    "body" : "Yeah, buddy my post is to serve an information to the next person who might come across it. Not asking you to feel sorry for me, and I’m certainly not asking for you to assign blame. I hope kindness finds you when you err, as humans often do.",
    "username" : "fatsamco",
    "timestamp" : "2024-12-23 13:47:32"
  }, {
    "reported_comment" : false,
    "body" : "It is never your fault. The fault is the existence of these rats stealing stuff that doesn't belong to them. Really frustrating, sorry it happened to you!",
    "username" : "suchpostsowow",
    "timestamp" : "2024-12-23 12:58:06"
  }, {
    "reported_comment" : false,
    "body" : "It’s hard because you want to do the right thing and make sure you keep space for other passengers but if you end up losing clothes, medication and other essentials you bring to travel it’s a real pain. Let alone the violation of being robbed. Hope you’ve got some insurance which at least gets you some money back!",
    "username" : "Fabulous-Web7719",
    "timestamp" : "2024-12-23 14:03:50"
  }, {
    "reported_comment" : false,
    "body" : "Sad. Sorry for your loss. :(\n\nMy mum got robbed in the tram in NL and the police didn’t give two shits",
    "username" : "CarelessInevitable26",
    "timestamp" : "2024-12-23 15:25:59"
  }, {
    "reported_comment" : false,
    "body" : "Allso I found the police lacking.\nEverywhere are cameras on the train station.\nThe guy checks in and checks out.\nThey even told me they could follow him on the images. But no arrest could be made 🤷🏻‍♂️",
    "username" : "Blapeuh",
    "timestamp" : "2024-12-23 14:14:25"
  }, {
    "reported_comment" : false,
    "body" : "Good that you post your experience here as a warning to other travellers.\n\nMy post is also only to warn people that anyone can be robbed anywhere,  even when people travelled safely in third world countries. People may easily get a wrong safe feeling travelling in Europe and only your behaviour can make your travelling safer. \n\nAnd I feel sorry for anyone who has been robbed, especially when it happens in my country.",
    "username" : "dutchcharm",
    "timestamp" : "2024-12-23 14:02:06"
  }, {
    "reported_comment" : false,
    "body" : "Thank you for your kindness and empathy! Everyone thinks it won’t happen to them, and some folks on here are really quick to pass judgement—always need to look for the helpers and healers!",
    "username" : "fatsamco",
    "timestamp" : "2024-12-23 13:51:19"
  }, {
    "reported_comment" : false,
    "body" : "Exactly this! I realize now why people put their things on the seat next to them—it’s a safety thing! \n\nThe pharmacy and doctor in Köln were excellent in prescribing and dispensing my medication super fast. \n\nThings can eventually be replaced but the violation and distress an experience like this causes is awful. The feeling of being violated is one that lasts but I’m headed home now and hoping to put this behind me. Fingers crossed for insurance!",
    "username" : "fatsamco",
    "timestamp" : "2024-12-23 14:18:34"
  }, {
    "reported_comment" : false,
    "body" : "Yeah unfortunately the police might be limited because I am not a VVIP individual. Perhaps if I was a government official I could allocate more resources to a manhunt lol. But honestly the police did what they could’ve and more importantly they treated me with empathy—I know they see this everyday and it meant a lot for them to not blame me.",
    "username" : "fatsamco",
    "timestamp" : "2024-12-23 14:20:21"
  }, {
    "reported_comment" : false,
    "body" : "Thanks for making the edit to your original post, it’s never ok to victim blame. Sure we can all take precautions but the shame must live with the criminals and perpetrators and not the victims. Cheers!",
    "username" : "fatsamco",
    "timestamp" : "2024-12-23 14:13:58"
  }, {
    "reported_comment" : false,
    "body" : "Wishing you the best of luck, try your best to put it behind you. I honestly do feel your pain. Have to remember it’s not personal and that they are essentially professional thieves.\n\nSafe travels back, hopefully next time European trains will treat you a bit kinder ☺️",
    "username" : "Fabulous-Web7719",
    "timestamp" : "2024-12-23 14:22:56"
  } ]
}