{
  "Id" : 50060,
  "Community_name" : "Zagreb",
  "Username" : "Oblacniputnik",
  "Post_body" : "Glavni kolodvor - Dubrava 170 eura",
  "Timestamp" : "2024-12-23 00:26:07",
  "Num_comment" : 45,
  "reported_post" : false,
  "Commenti" : [ {
    "Username" : "Baba_NO_Riley",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 00:53:14",
    "Body" : "Ako je platio karticom a čini se tako - onda i vidi koja je firma/ taxi služba to bila. Možda se i može nešto napraviti. Kakvi god bili i taxi trebaju imati cjenik po kilometru + start i taj cjenik treba biti vidljiv i objavljen. Možda da prikupiš što više podataka ( kad je voznja bila, je li mu uručen račun - najčešće nije - i koja je firma) pa bilo kontaktirati njih direktno - prvo usmeno a paralelno i pisano. Uz to se obratiti i udruzi Potrošač, možda i oni imaju nekih iskustava. Ti \"šahisti\" ispred kolodvora su najgori."
  }, {
    "Username" : "Background_Read786",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 00:26:07",
    "Body" : "Pas mater koja stoka mrtva….starome covjeku to naplatit, pa gdje smo zavrsili kao ljudi…..NIGDJE"
  }, {
    "Username" : "avrend",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 00:59:56",
    "Body" : "inace nisam za nasilje al tog majmuna(/e) koji dezura ispred GK treba ispendrecit"
  }, {
    "Username" : "TomatilloBorn8458",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 06:50:16",
    "Body" : "probisvijeti i klošari sa glavnog, koji vuku svaku staru osobu koja siđe sa vlaka da ih mogu pokrast. Uvijek su starci ti koji najebu, zašto meni ne naplate 170 eura? Aha, jer su čkepi. Dok sam vozio uber, pokupio sam dečka i curu sa glavnog. Do auta mi je došao jedan od tih šerifa sa glavnog i rekao da ne dolazim više tu. Kad sam mu izašao iz auta, mirno se povukao. Toliko o pičkama sa glavnog. Sve ih treba šamarat"
  }, {
    "Username" : "Jan_Vollgod",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 06:41:33",
    "Body" : "kakva mafia. A Bolt i Uber vozace napadaju pred Kolodvorom, nedaju im tam stati. Kakvu stetu naprave i za turizam. Prvo sto Turist vidi od zagreba kad dodje sa vlakom, da te taxista odere. Jako dobra reklama. Taj bude sigurno i rado dosao opet.   \nNije mi jasno zasto gradski organi nista protiv toga ne pouzimaju. Nije to bas tako da su to dva ili tri slucaja."
  }, {
    "Username" : "zAngryPvP",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 00:56:58",
    "Body" : "Ako je placeno karticom, moze se pokusati napraviti chargeback u banci"
  }, {
    "Username" : "BornaBorski",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 09:21:04",
    "Body" : "Rijetki su ljudi koje prezirem. Taksisti su na vrhu te liste!"
  }, {
    "Username" : "Haloefekt",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 02:47:46",
    "Body" : "Tosu taksiji koji vize s nepoznatom tarifom, a onda il pitas tarifu pa ne ulazis ili se pogodis poprek, za sto sumnjam da ce pristati jer su gulikoze koji love ljude koji ne znaju o cemu se radi. Vidjela sam jednom da cak postoji taksi s Wizi oznakom na autu a ne vozi za njih i ne po njihovoj tarifi. Sva sreca nije bila duga voznja ali bila je preskupa!!! Ne mislim da tu ima pomoci kada je vec voznja gotova..."
  }, {
    "Username" : "kemosabe1212",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 09:35:41",
    "Body" : "Isao sam boltom u 3 ujutro s domjenka i ocekivao sam da ce me mrvu oderati za tih 3..4 km.\n\n4,1e su mi naplatili.\n\nJebeni gradski taksi, uzas."
  }, {
    "Username" : "avrend",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 09:50:53",
    "Body" : "Grad bi trebao staviti table upozorenja, ako moze u tramvaju bit upozorenje na dzepare moze kod kolodvora i aerodroma bit upozorenje na drumske razbojnike"
  }, {
    "Username" : "CortexThrill",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 04:46:50",
    "Body" : "Plenković : To je ne-tema.\n\nŠta ne bi nevidljiva ruka tržišta to trebala riješiti ? I smanjiti cijenu taxi  usluge , kad je država im dopustila da slobodno formiraju cijene ? \n\nGdje je Goran Vojković koji zagovara liberalizaciju tržišta u ekonomiji,  bez državnih intervencija,  da nam pojasni kako je ovo dobra stvar za sve nas . \n\nI za 200 - 300 godina se budu cijene smanjile. \n\nŠta ste nestrpljivi ?"
  }, {
    "Username" : "fritula00",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 10:23:59",
    "Body" : "A zašto vi te stare ljude kad idu u Zagreb ne upozorite da ima kretena i lopova koji samo čekaju ljude poput tvog djeda da mu naplate 170 eura. Ako može sam uzet taksi do bolnice, valjda može i taksista pitat koliko će ga doći vožnja. Doslovno uputite žrtvu direktno lopovima. \nRazumio bi da je prvi put, ali svaki tjedan na redditu, jedna baba ili djed, postanu žrtve uvijek iste grupe taksista. \nBabi ili djedu možete naručit taksi ispred kolodvora u Zagrebu i iz Karlovca ili Varaždina preko aplikacije."
  }, {
    "Username" : "Ok-Explorer461",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 11:19:21",
    "Body" : "Na žalost,  to rade svakome koji nije iz Zagreba.  Još ga i vozaju unaokolo da vide jel znaš Zgb..i onda naplate. Svakako prijaviti jer će se dobiti novac natrag. \nNo kad smo kod toga, frajer taxi mi je od vinogradske do Trga Francuske revolucije, odnosno samo se spustio dolje i vratio gore pred Vinogradsku naplatil 14 eura.  Inače je 2 do 3.."
  }, {
    "Username" : "Powerful-Proposal139",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 11:41:40",
    "Body" : "Tko je uopće dopustio tim krkanima da zauzmu cijeli prostor ispred kolodvora? Veća prava imaju taksisti od hitne."
  }, {
    "Username" : "tsereg",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 12:29:18",
    "Body" : "Sigurno se može, jer frajer sigurno ne naplaćuje svakome 170 eura, a morao bi za istu relaciju naplaćivati isto ili imati aplikaciju kao što Uber ima."
  }, {
    "Username" : "xennon",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 14:25:00",
    "Body" : "Objaviti javno račun i ime firme i šofera pa će index objaviti. Nije baš da će nešto koristiti ali se može i poslati društvu za zaštitu potrošača."
  }, {
    "Username" : "No-Permission5869",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 14:41:27",
    "Body" : "ne bi imao srca luki modricu naplatiti od tuđmana do sheratona toliko a ne starcu"
  }, {
    "Username" : "Impressive-Blues",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 14:59:44",
    "Body" : "Ja bih to prijavio policiji. 170€ je očigledna prevara i vjerujem da se to može vratiti."
  }, {
    "Username" : "Old-Enthusiasm-6286",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 15:16:21",
    "Body" : "E bas ti hvala ja svoje roditelje od 60 nemrem nagovorit da nose karticu kad ovo procitaju pocet ce samo sitnis nosit"
  }, {
    "Username" : "Dr-k1ng321",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 07:34:50",
    "Body" : "Ne mozes nista ljudi zasto ne pitate kad ulazite u taxi. Da znam da je debil taj taksist i neka propadne al drzava je omogucila da cijene mogu staviti kakve hocu. Uvijek pitajte pa jel pitate kad odete neku drugu uslugu trazit. U ovom slucaju su i tvoj djed i taj taksist krivi."
  }, {
    "Username" : "Svudec",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 09:27:36",
    "Body" : "Sve je po zakonu i imaju propisno istaknute cijene. To su privatni obrti, nije radio taxi, i taktički su ispred autobusnog, glavnog, bolnica itd.\n\nLove stare ljude, turiste i slične koji nisu svjesni toga."
  }, {
    "Username" : "MusicC1HzProd",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 11:21:47",
    "Body" : "Ništa od svega toga, budi 2000% siguran, cijelu priču možeš okačit mačku o rep. Samo će se nasekirati i morati ranije na novu terapiju.\n\nPa, baba koja prodaje pečene kukuruze i marune deset metara od Trga nema istaknut cjenik, nego odmjeri kupca i izvali iznos. Ako se počneš derati na nju, odvede te ova tinejdžerska murija kojih je na Trgu više od svih drugih.\n\nJedini način je da čovjeku netko (ili on sam) instalira Bolt ili, nedajbože, Uber."
  }, {
    "Username" : "JadenAX",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 01:28:28",
    "Body" : "gradski taksisti nisu ljudi"
  }, {
    "Username" : "Dr-k1ng321",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 07:35:25",
    "Body" : "Zahvali ministarstvu prometa koji je dao da mogu slobodne cijene biti. Sve legalno ako je dobio racun."
  }, {
    "Username" : "TomatilloBorn8458",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 08:50:00",
    "Body" : "A gle, ne rade ništa protuzakonito. Zakon kaže da mogu naplatiti cijenu kakvu god žele. To što nije moralno je druga stvar. Ali čim si taksist na glavnom, moral ti je nepoznat pojam"
  }, {
    "Username" : "MusicC1HzProd",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 11:15:55",
    "Body" : "Al kad bolje pogledaš, sirotom taksistu je to 10 porcija Dubai fritula, plus mu ostane još za rundu pive s dečkima. Ako ima troje djece i žemu, to im je samo dva puta da uzmu fritule i vrte se po Trgu sat - dva da svi vide da ima se može se. Samo DVA PUTA!"
  }, {
    "Username" : "TomatilloBorn8458",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 06:47:52",
    "Body" : "Onda bi ih trebao sve jer su svi takvi "
  }, {
    "Username" : "MusicC1HzProd",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 11:25:31",
    "Body" : "A tko će ga ispendrečit kad pod a) sve je bilo po zakonu, i pod be) pendreci su kod murije, a murija je na njegovoj strani jer vidi pod a)?"
  }, {
    "Username" : "Dr-k1ng321",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 07:37:19",
    "Body" : "S tim se slazem da sam znaju odrat starije ili turiste. Mlade ljude domace nece sigurno jer znaju da su najebali. Ista takva situacija tih serifa je i na aerodromu sad su se prebacili neki s kolodvora tam kolko sam skuzio."
  }, {
    "Username" : "dinaakk",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 07:09:27",
    "Body" : "A gle. Sve više ljudi zna za taxi scam. Nije to samo u Hrvatskoj. \n\n\nTuristi su mislim već naučili pogotovo oni mlađi tako da se populacija smanjuje što češće oni to rade. \nAl očito se još uvijek isplati kad su još uvijek tam na tom mjestu i vrebaju."
  }, {
    "Username" : "deviantLolit_a",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 11:04:38",
    "Body" : "Moze on boga oca probat napast ako sam ga ja pozvala. Probali su jednom, nije im vise padalo napamet"
  }, {
    "Username" : "Djozefin_djozla",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 07:42:44",
    "Body" : "Da, ja sam tako napravila sa Boltom, ali ne znam da li bi ovo prihvatili budući nije išlo preko aplikacije (moj argument je bio da nije takav iznos pisao pri narudžbi).. jedino da možda kaže da nije cjenik bio jasno prikazan."
  }, {
    "Username" : "midnight_blur",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 13:53:59",
    "Body" : "Drumske razbojnike, baš tako lol"
  }, {
    "Username" : "Forward_Slip_4386",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 06:16:21",
    "Body" : "Taxi prijevoz je nikad jeftiniji i dostupniji svima...ovo za sobom povlaci i mesto ovakvih klosara koji iskoristavaju situaciju i peljese ljude kojo su stari/neinformirani.\n\nDa je deda znao, 5 metata falje bi mu stao taxi koji za 6  eura vozi"
  }, {
    "Username" : "Background_Read786",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 01:36:19",
    "Body" : "Ralicom na njih i sve to povuci do CIOS-a"
  }, {
    "Username" : "NalaLee48",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 09:23:16",
    "Body" : "I upravo se ovakvih stvari treba sjetiti kad budu kmečali protiv konkurencije"
  }, {
    "Username" : "tsereg",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 12:26:36",
    "Body" : "Ako su slobodne cijene krivac, kako to da onda iste priče ne čujemo za sve druge stvari u kojima se slobodno formiraju cijene - kruh, cipele, autobusna karta, itd."
  }, {
    "Username" : "NoExide",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 08:28:18",
    "Body" : "Poznato je da svi taksisti govna, a oni s kolodvora i aerodroma su najveća govna među njima. O onom starom tipu taksista govorim, ne ovi uber i slični danas, ti si priča za sebe."
  }, {
    "Username" : "CortexThrill",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 06:20:29",
    "Body" : "A da se ograniči maksimalna cijena po km na ispod 20 eura ? Šta bi se desilo ?\n\nOvaj koji vozi za 6 eura bi prestao poslovati ?"
  }, {
    "Username" : "Dr-k1ng321",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 12:29:04",
    "Body" : "A sto ne cujes kako inflacija dize cijene i da su sve stvari osle gore. Naravno da moze trgovina stavit kruh po cijeni 10€ ako hoce. Ali uvijek ti pise cijena proizvoda ili ne pise ali znas otp kolko je kruh. Zamisli na trznici dodes kazes ocu 2 kg jabuka a nema cijene i ne pitas. Ovaj kaze 15€ ti das i onda kasnije skuzis kolko si dao. Ljudi moji nemre pomoci vama niko jedino sami sebi da pitate"
  }, {
    "Username" : "Dr-k1ng321",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 08:41:51",
    "Body" : "A gle u svakom poslu ce biti dio ljudi koji su govna i uzet pare sto vise za uslugu koju nude. Uvijek pitam kolika je cijena ne samo taxi nego bilo sto ako ne pise cijenik."
  }, {
    "Username" : "tsereg",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 12:32:30",
    "Body" : "Zašto bi drugačije bilo s taksijem? Isto ili piše cijena vožnje po kilometru ili ne piše (po zakonu, isto mora pisati, kao što po zakonu mora pisati i u dućanu). I u čemu je problem ako ti netko na placu kaže cijenu unaprijed i ti pristaneš? Meni su nudili kilu očišćenog graha za skoro 10 eura i nisam pristao. \n\nDa li bi po tebi vlada trebala određivati sve cijene, uključujući i cijenu tvog rada?"
  }, {
    "Username" : "NoExide",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 10:20:51",
    "Body" : "Ovi su govna i bez da uopće pričamo o novcima."
  }, {
    "Username" : "Dr-k1ng321",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 12:40:59",
    "Body" : "Treba pisat cijenik ili ako ne vidis pitas kolko je start i km i kolko bi doslo do odredista. Ako ti ne pase odes u drugi jednostavno. Ja sam hrpu ljudi vidio koji sam ulete niti ne pitaju cijenu kolka. Pa onda kasnije stavljamo racune da je voznja od 7 km dosla 150€. Kriv si jednako jer nisi pitao cijenu. I ne treba odredivati cijene rada niti cijene namirnica. Slobodno je trziste svako moze staviti cijenu koju hoce, ako imas kupaca i ide ti zasto ne staviti cijenu 10€ start i 10€ po km."
  }, {
    "Username" : "MusicC1HzProd",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 11:29:58",
    "Body" : "Slažem se s tobom, ali nemoj previše to ponavljati jer će se javiti dosta njih koji će tvrditi da imaš problema u ponašanju i da ti treba hospitalizacija i terapija. Jer u biti napadaš divljačko slobodno tržište, a to je bog iznad Boga. Imaju genijalne metode, ponavljaju da si stalno mrzovoljan, da samo jamraš, i na kraju završiš s pričom \"ne vidi svijet u pravom svjetlu\". A Pravo Svjetlo su Dubai fritule i lampice na Trgu i čestit narod koji se raduje."
  } ]
}