{
  "id" : 200345,
  "community_name" : "Stockholm",
  "username" : "swedish_tcd",
  "post_body" : "Moderaternas krav: Tvångsförvalta problemskolor",
  "timestamp" : "2024-12-22 11:06:34",
  "num_comment" : 29,
  "reported_post" : false,
  "comment" : [ {
    "reported_comment" : false,
    "body" : "Jag är gammal nog att minnas när friakolereformen skedde, högern var helt jävla DÖDskränkta när man påpekade att konsekvenserna skulle bli att vissa skolor skulle utarmas och bli sämre.\n\nVA?! Bättre och sämre skolor? I Sverige? ALLA skolor ska vara bra skolor och friskolereformen skulle ABSOLUT inte rucka på det faktumet...",
    "username" : "ola_bister",
    "timestamp" : "2024-12-22 11:22:24"
  }, {
    "reported_comment" : false,
    "body" : "Moderaterna hävdar att det är skolledningens fel att dessa elever inte klarar skolan.\n\nSocialdemokraterna hävdar att problemskolorna behöver mer pengar än andra skolor.\n\nVem har mest rätt?",
    "username" : "swedish_tcd",
    "timestamp" : "2024-12-22 11:06:34"
  }, {
    "reported_comment" : false,
    "body" : "Sälja ut allt som funkar och tvångsförvalta när det är kört i botten känns som en rätt kass lösning rent skattemässigt...",
    "username" : "FaithlessnessBig2064",
    "timestamp" : "2024-12-22 12:42:41"
  }, {
    "reported_comment" : false,
    "body" : "Riktigt /r/leopardsatemyface på det här.\n\nOckså något ironiskt att högerns tänkta lösning på de problem som friskolereformen har medfört är statlig tvångsförvaltning.",
    "username" : "SuperUranus",
    "timestamp" : "2024-12-23 05:26:04"
  }, {
    "reported_comment" : false,
    "body" : "Behövs 2 lärare per klass om klassen har 30 elever eller ens 20, sen behövs ”tvångs” läxhjälp med tanke på att många hellre vill hänga med kompisar än att gå på läxhjälp. Största problemet är ju dock problem barnet som existerar i flera klasser antingen beror det på någon diagnos eller föräldrar som inte bryr sig men något underliggande problem finns",
    "username" : "bippos",
    "timestamp" : "2024-12-22 12:57:58"
  }, {
    "reported_comment" : false,
    "body" : "Om IQ hos barnen är under 85 kommer de få svårt att klara gymnasiet. Är IQ under 115 kommer de ha svårt för högskolestudier. IQ styrs mestadels av genetiska faktorer i rika länder med tillgång till skolor och mat. \n\nPolitiker vill att skolornas problem ska kunna lösas med politik men tyvärr beror problemen till stor del på eleverna. I en viss utsträckning kan problemen minska om problemskolor har strikt disciplin och förlängda öppettider så att eleverna kan spendera mer tid i lugn och ro för att kompensera för den långsammare inlärningen.",
    "username" : "hamatehllama",
    "timestamp" : "2024-12-22 12:10:32"
  }, {
    "reported_comment" : false,
    "body" : "Jag är å andra sidan gammal nog för att uppleva tiden innan friskolereformen, och hur mina föräldrar fick slåss för att jag skulle få gå i en annan skola än den kommunen valt och som inte ens ville ha mig.\n\nAllt var inte bättre innan, långt ifrån, och det är skrämmande vilka rosenskimrande glasögon vänstern använder sig av.",
    "username" : "CountMordrek",
    "timestamp" : "2024-12-22 18:10:51"
  }, {
    "reported_comment" : false,
    "body" : "Socialdemokraterna har mer rätt här.\n\nMen det största problemet är friskolesystemet i sig som aktivt bidrar till att utöka skillnaderna mellan skolorna.\n\nEDIT: Om du samlar fler bra elever i bra skolor och fler sämre elever i sämre skolor så blir det ohållbart. Alla som gått i skolan vet att om det finns 1 \"bråkstake\" i en klass så är det hanterbart. Men när det blir 3 eller fler \"bråkstakar\" i samma klass så blir det kaos. Det är ju en grov förenkling men det finns så tydliga brytpunkter i hur skolundervisning funkar.",
    "username" : "Barneyk",
    "timestamp" : "2024-12-22 11:45:53"
  }, {
    "reported_comment" : false,
    "body" : "Båda?\n\nDe som är duktiga på sitt jobb drar sig oftast inte till att jobba i problematiska miljöer, utan ville hellre jobba i stabila lugna klimat där lönen är bättre.  Vilket leder till skolor som inte får tag i bra lärare för de vet att det är problematiskt där och de har andra alternativ, de som istället börjar är allt som oftast bottenskrapet. Självklart finns det undantag men som regel tycker jag det stämmer. Detta leder i sin tur till skolledningar som inte består av våra mest kompetenta lärare, specialpedagoger,rektorer osv.\n\nSedan är de här skolorna belägna i områden med stora sociala utmaningar(läs mycket arbetslöshet och lågavlönat arbete) och det krävs helt enkelt mycket mer resurser för att hantera det elevunderlaget. Lägg där till att saker utanför undervisningen också kostar mer, t.ex. ersätta grejer som går sönder på grund av skadegörelse av snorungar. Vilket gör det dyrare att bedriva verksamheten.",
    "username" : "RoutineWolverine1745",
    "timestamp" : "2024-12-22 12:05:02"
  }, {
    "reported_comment" : false,
    "body" : "Problemskolor får redan mycket mer pengar per elev än ”bra” skolor, det handlar inte om pengar\n\nEdit: \n\nI Stockholm 2021 t.ex fick elever i utsatta områden i snitt 45000kr mer i skolpeng. Eller nästan 60% mer än övriga. Om man jämför ”bra” skolor med problemskolor blir skillnaden ännu större, mälahöjdens skola fick bara 68000kr per elev per läsår men Rinkebyskolan får 170000kr, mer än 100k kr mer. \n\nhttps://kvartal.se/artiklar/den-ojamlika-skolan-del-1/",
    "username" : "Helmic4",
    "timestamp" : "2024-12-22 12:13:38"
  }, {
    "reported_comment" : false,
    "body" : "Så du menar att 75% av Sverige befolkningen inte skulle klara av högskolan eller ha svårt för.",
    "username" : "Admirable_Hornet7479",
    "timestamp" : "2024-12-23 10:45:54"
  }, {
    "reported_comment" : false,
    "body" : "Brodern har autism",
    "username" : "TigerbeLEE",
    "timestamp" : "2024-12-22 17:44:41"
  }, {
    "reported_comment" : false,
    "body" : "Du måste dock skilja på fria skolvalet, dvs att få välja vilken skola i kommunen man vill gå på, och friskolor, dvs vilken huvudman som driver skolorna.",
    "username" : "Trubaduren_Frenka",
    "timestamp" : "2024-12-23 09:27:09"
  }, {
    "reported_comment" : false,
    "body" : "Ja, det är klart att det fanns problem innan. Men vi behövde väl inte slänga ut barmet med badvattnet heller? Det finns ju tusen sätt att lösa ditt dilemma.\n\nAmbitionen att alla skolor skulle vara bra skolor var så otroligt naturlig och är idag totalt bortflugen, idag ska varje barn skylla sig själv för att deras barn vald fel skola.",
    "username" : "ola_bister",
    "timestamp" : "2024-12-22 20:10:31"
  }, {
    "reported_comment" : false,
    "body" : "Nope. Höjs elevpengen i en kommun (tex för att möta ökade kostnader bland skolor med problem) så måste den höjas för alla friskolor också.\n\nGöteborg försökte ju kräva att friskolorna skulle bevisa samma utökade kostnader som de kommunala skolorna för att bevilja dem samma extra stöd men blev i domstol tvingade att ge dem samma slant utan att friskolorna behövde redovisa något behov.",
    "username" : "Republiken",
    "timestamp" : "2024-12-22 12:40:50"
  }, {
    "reported_comment" : false,
    "body" : "Du har 2 argument.\n\n1. Problemskolor får generellt mer pengar än andra skolor.\n\n2. Det handlar inte om pengar.\n\nPunkt 1 stämmer men det saknas en hel del steg för att dra slutsats nummer två baserat bara på det.\n\nDet handlar om mycket mer än **bara** pengar, men pengar är fortfarande en faktor.\n\nSedan skolan kommunaliserades på 90-talet så har den fått allt mindre resurser och de resurser som fås går till allt mer onödiga saker som vinstutdelning, lokalhyror där man tidigare ägde sina lokaler, dålig fördelning eftersom skolpengen är fast, mer byråkrati för att hantera och kontrollera skolor, onödiga tomma platser som måste hållas öppna om en friskola väljer att lägga ner eller går i konkurs osv. osv. osv.",
    "username" : "Barneyk",
    "timestamp" : "2024-12-22 13:57:29"
  }, {
    "reported_comment" : false,
    "body" : "Men herregud. Har du ens läst artikeln du länkar eller sprider du medvetet missvisande information?\n\n\nHela artikeln handlar om att resurstilldelningen till skolor med problem är ojämn. I Stockholms kommun får de skolor somhar störst problem ca 44 000 kronor mer per läsår och elev medan i Södertälje är motsvarande summa 4 000. Du tar alltså den mest extremt generösa kommun och låtsas att detbara är \"ett exempel\". Läser du dessutom vidare framgår det tydligt att artikelförfattarna inte har möjlighet att ta fram genomsnittskostnaden per elev eftersom en ansenlig del av kostnaden är oklar. Således kan du inte göra något som helst påstående om hur mycket mer vissa elever får procentuellt. ",
    "username" : "Ok_Choice_2656",
    "timestamp" : "2024-12-22 17:30:36"
  }, {
    "reported_comment" : false,
    "body" : "Detta löses ofta med sk socioekonomisk ersättning som delas ut till alla skolor (oavsett friskola eller ej) som har vissa typer av elevunderlag. Det är också en stor anledning till att du hittar många friskolor i socialt utsatta områden. De får helt enkelt mer pengar för att vara där.\n\n\nDet är inte en del av skolpengen dock.",
    "username" : "Latringuden",
    "timestamp" : "2024-12-22 13:14:18"
  }, {
    "reported_comment" : false,
    "body" : "Nja, det finns socioekonomiska styrmedel som gör det möjligt att ge mer pengar till utsatta skolor. Det är dock ett väldigt trubbigt och svåranvänt verktyg och friskolor kan ju använda dom pengarna lite hur dom vill osv.",
    "username" : "Barneyk",
    "timestamp" : "2024-12-22 13:53:51"
  }, {
    "reported_comment" : false,
    "body" : "Du har fel. I Stockholm t.ex får elever i utsatta områden i snitt 45000kr mer i skolpeng. Eller nästan 60% mer än övriga. Om man jämför ”bra” skolor med problemskolor blir skillnaden ännu större, mälahöjdens skola får bara 68000kr per elev per läsår men Rinkebyskolan får 170000kr, mer än 100k kr mer. \n\nhttps://kvartal.se/artiklar/den-ojamlika-skolan-del-1/",
    "username" : "Helmic4",
    "timestamp" : "2024-12-22 12:47:20"
  }, {
    "reported_comment" : false,
    "body" : "Konstigt nog så har skolan trots det resultat i världsklass. Topp i Europa, bättre än våra nordiska grannar i ämne efter ämne. Det är bara att invandrare drar ner, men även de presterar bättre än invandrare i andra länder. \n\nSen är det också inte sant att skolan fått mindre resurser, vi spenderar mer (inflationsjusterat) på skolan än vi någonsin gjort tidigare, mycket mer än innan kommunaliseringen.",
    "username" : "Helmic4",
    "timestamp" : "2024-12-22 14:50:21"
  }, {
    "reported_comment" : false,
    "body" : "Stockholms kommun är Sveriges överlägset största kommun med ca 10% av Sveriges befolkning och 40% av länets befolkning, så är ganska relevant som exempel. Även i Göteborg landets näst största får dessa skolor 28k mer. Detta är förövrigt en tråd om just Stockholm så är inte så konstigt att fokusera på\n\n\nJämförelsen med resten av landets kommuner gör det ännu mer relevant. Skolor i utsatta områden i Stockholm får mycket mycket mer pengar än andra skolor, trots det går det inte jättemycket bättre för utsatta skolor i Stockholm än i övriga landet. De enorma resurserna man lagt har inte gett resultat. Mer pengar är inte lösningen, vi har redan försökt det",
    "username" : "Helmic4",
    "timestamp" : "2024-12-22 17:40:25"
  }, {
    "reported_comment" : false,
    "body" : ">Sen är det också inte sant att skolan fått mindre resurser, vi spenderar mer (inflationsjusterat) på skolan än vi någonsin gjort tidigare, mycket mer än innan kommunaliseringen.\n\nHar du källa på det?\n\nFör siffrorna jag har sett visar att så inte är fallet.",
    "username" : "Barneyk",
    "timestamp" : "2024-12-22 15:34:43"
  }, {
    "reported_comment" : false,
    "body" : "Ja, det är en tråd om stockholm så varför låtsas du som att stockholm är ett helt vanligt exempel i det här sammanhanget när det är den mest extrema kommunen?\n\n\nÄr det här en tråd som handlar om att hitta på egna procentsatser också?\n\n\nEdit: Kan också för övrigt berätta för dig att jag blir väldigt glad om jag får en elev från Stockholms grundskolor istället för Södertälje, givet allting annat lika. Stockholm må misslyckas med sitt kompensatoriska uppdrag men de lyckas bra mycket bättre än de flesta...",
    "username" : "Ok_Choice_2656",
    "timestamp" : "2024-12-22 17:53:52"
  }, {
    "reported_comment" : false,
    "body" : "https://www.skolverket.se/download/18.308cb2e18340b1064f37f/1663845421112/pdf10327.pdf\n\nhttps://www.ekonomifakta.se/sakomraden/utbildning-och-forskning/investeringar-i-utbildning-och-forskning/utbildningskostnader-per-elev-internationellt_1211682.html\n\nInnan 2015 ( du får lägga på inflationsjustering själv för dessa siffror) \nhttps://www.ekonomifakta.se/sakomraden/utbildning-och-forskning/lagre-skolpeng-for-fristaende-skolor_1210160.html?chart=1210158%2F%2F\n\nÖver tid har vi ökat och ökat hur mycket pengar vi lägger per elev i skolan",
    "username" : "Helmic4",
    "timestamp" : "2024-12-22 15:42:15"
  }, {
    "reported_comment" : false,
    "body" : "Förstår inte varför du gråter över att använda Stockholms kommun 2021 som exempel i en tråd om Stockholms kommun.",
    "username" : "Helmic4",
    "timestamp" : "2024-12-22 17:58:33"
  }, {
    "reported_comment" : false,
    "body" : "Okej, intressant, måste dubbelkolla de siffrorna jag sett. För de siffrorna jag såg handlade inte om kostnaden för skolväsendet utan hur mycket pengar som \"gick till eleverna\".\n\nSå det är inte orimligt att kostnaden per elev är högre men att pengarna som går till varje elev är mindre då man har räknat bort administrativa kostnader osv.\n\nPå de sista siffrorna, \"Kommunens kostnad per elev\", vet du på vilket sätt som olika generella och riktade statsbidrag är medräknade där?",
    "username" : "Barneyk",
    "timestamp" : "2024-12-23 12:28:42"
  }, {
    "reported_comment" : false,
    "body" : "För att det inte är ett exempel. Jag förstår inte hur man kan länka en artikel som man själv inte klarar av att läsa. Kanske borde hålla dig till Omni eller 8 sidor istället.",
    "username" : "Ok_Choice_2656",
    "timestamp" : "2024-12-22 18:21:23"
  }, {
    "reported_comment" : false,
    "body" : "Lyfts sällan fram i debatten då alla har incitament att framställa det som att skolan är utarmad. Politiker vill ha mer pengar, skolorna lärarna och rektorerna vill ha mer pengar. På samma sätt kan ingen erkänna att svensk skola har vänt och är idag bland världens bästa, för om det är fallet kommer de inte få mer pengar, vänstern kommer få svårare att få igenom sitt förstatligande, och högern kommer få svårare att ta sig tillbaka till 50 talets auktoritära klassrum. \n\nSen finns det absolut en chans att de ökade kostnaderna gått till admin, andra typer av lösningar osv. Dessutom är det ojämnt fördelat där i t.ex Stockholm fick en skola 70k per elev, en annan 170k, så intrycket kommer där vara olika. \n\nFör att svara på din sista fråga så går statsbidragen till kommunerna på intäktsidan och sen kommer alla kostnader på kostnadssidan, så de är med. Så har det sett ut när jag läst kommunala årsredovisningar där statsbidrag hamnar på intäktsidan. Dock är jag inte säker på att exakt alla statsbidrag sköts på det sättet.",
    "username" : "Helmic4",
    "timestamp" : "2024-12-23 13:06:39"
  } ]
}