{
  "_id" : 200132,
  "community" : "Dublin",
  "username" : "Diligent_Mechanic902",
  "post" : "Motorbikes in Dublin centre?",
  "timestamp" : "2024-12-22T15:22:45Z",
  "numcomment" : 34,
  "reportedpost" : false,
  "comment" : [ {
    "reportedcomment" : false,
    "body" : "Gardai need more resources, more power and harsher penalties for offenders.\n\nMost/all of the thieves are < 18, so there are very little consequences.\n\nGardai won't chase for fear of lost of life, be it the offender or innocent people and the Gardai get the blame.\n\nHarsher punishment for repeat juvenile offenders, this slap on the wrist has to stop.\n\nMotorbike ramming policies like the UK, with appropriate vehicles and tools.",
    "username" : "Gluaisrothar",
    "timestamp" : "2024-12-22T15:50:57Z"
  }, {
    "reportedcomment" : false,
    "body" : "In Japan they shoot them with paintballs to track them I heard. But tbh. I'm at the point where if your engaging in criminal behavior their should be indemnity for you making a claim for action taken to apprehend you. You want to infringe on everyone else's rights and to hell with not being a Prick then you waive yours",
    "username" : "dimebag_101",
    "timestamp" : "2024-12-22T16:10:03Z"
  }, {
    "reportedcomment" : false,
    "body" : "Guards park an expensive bike in town with a tracker and remote disabler. Give them heavy sentences. Job done.",
    "username" : "berno9000",
    "timestamp" : "2024-12-22T17:10:05Z"
  }, {
    "reportedcomment" : false,
    "body" : "Combination of things. Reformation of the Gardai and how they operate, increased resources there, reformation of the justice system and how we deal with repeat offenders and soft sentences, and then (what most people on Reddit will disagree with), investment and encouragement in the communities where they come from. A lot of community centres and other outlets like boxing or sports clubs etc are being hamstrung by increasing rents, insurance etc and all the costs are making it unsustainable to make it available for those who’s parents don’t have a couple of quid to give them. Plus they’re kids being raised in some awful environments and all this is learned behaviour because they know no better.",
    "username" : "blueghosts",
    "timestamp" : "2024-12-22T15:27:13Z"
  }, {
    "reportedcomment" : false,
    "body" : "This is hardly a new problem, it has been reported on the news many times and AGS has had more than two years to train officers and update procedures and they don't have anything to show for it. Hopefully when this gets worse and people do actually get hurt (yes when, not if) someone has to answer for the lack of action...",
    "username" : "Realistic_Caramel513",
    "timestamp" : "2024-12-22T19:35:00Z"
  }, {
    "reportedcomment" : false,
    "body" : "These are not unregistered motorbikes,  or off road enthusiasts with no tracks that need government funding for \"facilities\".  THEY ARE STOLEN FROM HARD WORKING BIKERS.  THE GARDAI AND THE LEGAL SYSTEM ARE LETTING US DOWN. ",
    "username" : "KTRIC",
    "timestamp" : "2024-12-23T06:01:51Z"
  }, {
    "reportedcomment" : false,
    "body" : "Prison for the adults, some sort of modern borstal for the youths.\n\nThe can't steal anything or attack anyone if they've no access to society.\n\nFund said prisons with all the money wasted on youth clubs, schemes, grants, allowances etc.\n\nAlso, make dole, council accommodation and other benefits contingent upon no further convictions for arrestable offences. There should be no indirect state subsidies for criminality.",
    "username" : "BackstabbingCentral",
    "timestamp" : "2024-12-22T15:22:45Z"
  }, {
    "reportedcomment" : false,
    "body" : "They had this exact same problem in the UK. It wasn't resolved until the police were given powers to drive their cars into the bikes. If you get injured doing something illegal, that's your fault, not the fault of the gardai. \n\nThere's a lot to be done societally to stop the kids from wanting to do it in the first place, but in the interim the gardai should be able to pursue them without fear of losing their jobs.",
    "username" : "TheRoar7",
    "timestamp" : "2024-12-22T21:39:02Z"
  }, {
    "reportedcomment" : false,
    "body" : "In Maryland 🇺🇸 Baltimore police can take advantage of a new law allowing them to seize unregistered motorcycles anywhere in the city unless they are immobilized by the owner. The law is the latest attempt by the city to keep off-road vehicles from city streets, a problem that has vexed city officials for years. The rules on dirt bikes have grown sufficiently complex that a measure currently under consideration by the city would fund a public service campaign to explain them.\n\nThe police follow riders from the air, then send cruisers to confiscate the motorcycles and quad bikes. No chases are allowed.",
    "username" : "tomtermite",
    "timestamp" : "2024-12-22T20:09:51Z"
  }, {
    "reportedcomment" : false,
    "body" : "In WWII they would string up wire that was basically invisible \n\nBut it depends whether the solution is actually even worse than not solving the problem\n\nMost proposed solutions to this problem are probably worse than just not solving it, hence why no one does anything",
    "username" : "Professional_Elk_489",
    "timestamp" : "2024-12-22T21:53:49Z"
  }, {
    "reportedcomment" : false,
    "body" : "Flogging, wip the little sods bloody",
    "username" : "misterboyle",
    "timestamp" : "2024-12-22T21:53:56Z"
  }, {
    "reportedcomment" : false,
    "body" : "Waffle",
    "username" : "Vegetable-Ad8468",
    "timestamp" : "2024-12-22T22:22:25Z"
  }, {
    "reportedcomment" : false,
    "body" : "There's no reason for Gards to try to enforce the law because they know the judge will just give 200 suspended sentences",
    "username" : "AxelJShark",
    "timestamp" : "2024-12-22T22:33:04Z"
  }, {
    "reportedcomment" : false,
    "body" : "In London they ram and use tracking sprays. Those pricks would be no loss to society if they got injured.",
    "username" : "Annihilus-",
    "timestamp" : "2024-12-22T23:19:30Z"
  }, {
    "reportedcomment" : false,
    "body" : "They steal those bikes",
    "username" : "r_Yellow01",
    "timestamp" : "2024-12-23T10:57:05Z"
  }, {
    "reportedcomment" : false,
    "body" : "They can’t read, that’s why they get suspended sentences.",
    "username" : "FakeNewsMessiah",
    "timestamp" : "2024-12-23T11:35:34Z"
  }, {
    "reportedcomment" : false,
    "body" : "I think the Gardaí are just a symptom. The problem is the lower courts/prison service. There is literally nothing to be gained if the Gardaí pick these kids up and get them in front of a Judge, who then lets them out the same day with a tap on the wrist. \n\nWe need to be harsher with sentencing on violent crimes, sex crimes and repeat offenders. \n\n>Hopefully when this gets worse and people do actually get hurt\n\nWe're already there mate: https://www.breakingnews.ie/ireland/man-jailed-for-the-raping-teenage-girl-after-a-new-years-eve-party-1709356.html\n\n> the man has four previous convictions for defilement of a child under 17\n\nhttps://www.breakingnews.ie/ireland/man-beat-partner-and-threatened-to-cut-her-throat-and-eat-her-liver-1699983.html\n\n\n> Doyle has 74 previous convictions for offences including assault, public order, violence in a garda station and possession of articles with intent to cause harm\n\nThe system is failing to keep people safe from serious harm, on a regular basis. I don't know how this still isn't an issue for people.",
    "username" : "dmullaney",
    "timestamp" : "2024-12-22T21:02:50Z"
  }, {
    "reportedcomment" : false,
    "body" : "If you completely cut people off from society and resources you end up with extremely dangerous ghettos",
    "username" : "ChadONeilI",
    "timestamp" : "2024-12-22T15:55:25Z"
  }, {
    "reportedcomment" : false,
    "body" : "Ireland's approach to justice is that everyone can be redeemed which means none of what you say will ever happen. At a time like this it's grim for normal hardworking people and politicians simply won't push for justice reform",
    "username" : "alfbort",
    "timestamp" : "2024-12-22T19:44:52Z"
  }, {
    "reportedcomment" : false,
    "body" : "Woke Irish people will downvote you for saying the truth.",
    "username" : "CrispsInTabascoSauce",
    "timestamp" : "2024-12-22T15:29:17Z"
  }, {
    "reportedcomment" : false,
    "body" : "Exactly, and it would fairly soon stop or lessen a lot of there was repercussions",
    "username" : "dimebag_101",
    "timestamp" : "2024-12-23T05:14:24Z"
  }, {
    "reportedcomment" : false,
    "body" : "Yeah that’s the point. The guards should be using bait bikes to easily catch them.",
    "username" : "berno9000",
    "timestamp" : "2024-12-23T11:04:03Z"
  }, {
    "reportedcomment" : false,
    "body" : "If a ghetto means all the violent people are locked up, sign me up for the ghetto!",
    "username" : "BackstabbingCentral",
    "timestamp" : "2024-12-22T16:01:35Z"
  }, {
    "reportedcomment" : false,
    "body" : "I tried asking a door knocker about it before the election. Was met with stunned silence and then they made their excuses and left",
    "username" : "dmullaney",
    "timestamp" : "2024-12-22T20:48:56Z"
  }, {
    "reportedcomment" : false,
    "body" : "It wouldn't really work. I agree we need more prison capacity and we need to start handing out harsher sentences for violent crime. If we actually start pulling social welfare services, then we end up with even more of a homelessness crisis. People who have convictions already struggle with employment, if you take away the social safety nets you're forcing them into crime to stay alive. You're essentially advocating for indirect and incredibly inhumane form of capital punishment.",
    "username" : "dmullaney",
    "timestamp" : "2024-12-22T15:37:12Z"
  }, {
    "reportedcomment" : false,
    "body" : "Why stop there sure, we could put them on boats and send them to Australia",
    "username" : "ChadONeilI",
    "timestamp" : "2024-12-22T16:05:02Z"
  }, {
    "reportedcomment" : false,
    "body" : "It doesn't. It just means all the criminals are homeless and broke, and have no option but crime to survive",
    "username" : "dmullaney",
    "timestamp" : "2024-12-22T16:52:51Z"
  }, {
    "reportedcomment" : false,
    "body" : "Give them 1000 hugs then and see what happens.",
    "username" : "CrispsInTabascoSauce",
    "timestamp" : "2024-12-22T15:59:54Z"
  }, {
    "reportedcomment" : false,
    "body" : "Mate I'm not saying we need to keep being soft on crime, we don't. Any investment we make in youth services won't have an impact for a decade, so we need to implement the changes now to the Gardaí, the lower courts and the prison system, to tackle the current situation. I just think that targeting social welfare programs will cause more problems than it solves, unless you have suggestions in mind to offset the inevitable homelessness and crime that you're introducing",
    "username" : "dmullaney",
    "timestamp" : "2024-12-22T16:07:26Z"
  }, {
    "reportedcomment" : false,
    "body" : "You are delusional, this social liberal bullshit never worked and never will. That’s not how physics works. If there is no fear of loosing your livelihood there is no good behaviour. Your corporate employer would cut your salary the moment you misbehave, while the Irish government is incentivising scrotes and thugs to keep doing what they do. Grow up!",
    "username" : "CrispsInTabascoSauce",
    "timestamp" : "2024-12-22T16:29:56Z"
  }, {
    "reportedcomment" : false,
    "body" : ">That’s not how physics works\n\n??",
    "username" : "dmullaney",
    "timestamp" : "2024-12-22T16:33:37Z"
  }, {
    "reportedcomment" : false,
    "body" : "In real world, when animals do something stupid they either get bitten or die. When people do something stupid, they should face the consequences of their actions immediately but somehow modern society turns a blind eye to it and rewards them for bad behaviour.",
    "username" : "CrispsInTabascoSauce",
    "timestamp" : "2024-12-22T17:34:46Z"
  }, {
    "reportedcomment" : false,
    "body" : "Good thing we don't live in caves and bite each other anymore.\n\nI don't think the guy is saying no consequences for anything, hold their hand and kiss their boo boos.\n\nI hate these arseholes as much as any other but realistically the data supports that most crime comes from low-income households - if you further ostracise them from society it increases crime. Just look at the Parisian banlieues, American ghettos.\n\nUnless you're advocating for a shoot them in the head if they commit a crime approach, taking away everything they have won't work.\n\nThat said, OBVIOUSLY no consequences also doesn't work, what we're operating under now with only talking offering diversions won't bear fruit for multiple years. I do think penalties need to be applied, but not to the point of driving them to destitution. Drop you down on the housing lists, drop your welfare per conviction, apply actual sentences - all of these should probably also happen. If they're too far gone, locked up. Actual consequences.\n\nWe need stick AND carrot. Here are activities to join, trades schools and higher education opportunities, but also if you act up, you're going to feel the consequences.",
    "username" : "IManAMAAMA",
    "timestamp" : "2024-12-22T17:44:51Z"
  }, {
    "reportedcomment" : false,
    "body" : "I assume you haven't actually read anything from the thread, so I'll repost it with emphasis for your benefit: \n\n> Mate **I'm not saying we need to keep being soft on crime,** we don't. Any investment we make in youth services won't have an impact for a decade, so **we need to implement the changes now to the Gardaí, the lower courts and the prison system, to tackle the current situation**. I just think that targeting social welfare programs will cause more problems than it solves, unless you have suggestions in mind to offset the inevitable homelessness and crime that you're introducing",
    "username" : "dmullaney",
    "timestamp" : "2024-12-22T18:24:51Z"
  } ]
}