{
  "id" : 200000,
  "community_name" : "Travel",
  "username" : "Careful_Way_1",
  "post_body" : "longest you’ve ever spent at an airport?",
  "timestamp" : "2024-12-22 20:37:40",
  "num_comment" : 155,
  "reported_post" : false,
  "commenti" : [ {
    "reported_comment" : false,
    "body" : "I was in Singapore’s airport for almost 3 days way back when the Iceland volcano erupted and sent ash all over Europe. I was supposed to be flying from Melbourne Aus to Munich for a conference. Being stuck in that airport was probably the best though! Showers, movie theater, the works. It actually was enjoyable due to the circumstances.",
    "username" : "Inevitable_Brag_5507",
    "timestamp" : "2024-12-22 20:55:24"
  }, {
    "reported_comment" : false,
    "body" : "I was trapped in SFO for 54 hours a few years back. Ended up not being able to get to my destination and flew to another city and took a bus to my original destination.",
    "username" : "Sea_Concert4946",
    "timestamp" : "2024-12-22 20:42:35"
  }, {
    "reported_comment" : false,
    "body" : "11 hours in Seoul. Fun airport though so time went fast",
    "username" : "one11travel",
    "timestamp" : "2024-12-22 20:38:57"
  }, {
    "reported_comment" : false,
    "body" : "Had a 10.5 hour delay at Gatwick once on the way to Mallorca as a kid. That and my mum likes to get to the airport 4 hours early in case she misses the plane, then we had left about 17 hours before we got on the flight.",
    "username" : "Big-Parking9805",
    "timestamp" : "2024-12-22 20:49:34"
  }, {
    "reported_comment" : false,
    "body" : "I’m surprised nobody with a 9/11 experience has weighed in with some crazy number of days. \n\n*for context: an hour after the planes hit they closed all US airspace. 1000 flights had to land immediately in the first hour - 4000 more continued landing at the closest airport under them and no airplane that wasn’t military took off again for over 3 days. There were church groups bringing people food at random airports all across America. No hotels available, no cars left to rent just thousands stuck in airports day in and day out.",
    "username" : "SlurReal",
    "timestamp" : "2024-12-22 22:05:57"
  }, {
    "reported_comment" : false,
    "body" : "Cairo airport for 4 days.\n\nI went on a business trip to Cairo and when I was going through immigration, the guy took my passport and said he had to check something. \n\nWaited for an hour or so, then I asked another agent where the guy who was handling my passport will be back. He goes and checks and tells me the guy has left for the day and he has no idea where my passport is.\n\nI ask to speak to their boss who takes me to his office and attempts to call the guy who I had originally dealt with and he doesn’t answer. The guy tells me I have to wait at the airport until the guy comes back to work the next day. \n\nNext day rolls around and I ask if the guy is back and they tell me he is sick therefore he won’t be coming in. I go back to their bosses office and he apologizes, and says he will send someone to the guys home to find out what he did with my passport. \n\nNext day rolls around and there are more excuses, at which stage I call the Canadian embassy and explain this bizarre scenario I am faced with. The same day, a guy from the Canadian embassy comes to the airport and verifies some details, and the next day I am issued with an emergency passport so I can fly back home.\n\nSo It turns out that I was purposely being messed around with because of the purpose of my visit. I was on a business trip to bid on a project, and the only other company that was bidding on the project was a company run by the Egyptian military. They basically didn’t want to have a fair bidding process so what better way then to have your only competition lose out as a “no show” by engaging in shenanigans at the airport.",
    "username" : "Rabbit-Hole-Quest",
    "timestamp" : "2024-12-22 23:06:23"
  }, {
    "reported_comment" : false,
    "body" : "I had an awful trip last year.\n\nFlew from Portland to Newark, a 10pm > 6:30am flight. So already awful, and had me landing exhausted.\n\nThen in Newark, I had an 8 hour layover. Fantastic, I know. But I had a nap on the floor, watched the sunrise, had some coffee, and finally made it to the 2:30pm flight.\n\nBut, no. Flight was delayed, then delayed some more. Then we boarded, then we had to de-board. Then I watched the sunset, and we were delayed some more. Then finally we were able to take off, at 10:30pm, 8 hours later. So a 16 hour layover in Newark, after a red eye flight.\n\nAnd then we flew to Lima, Peru. An 8 hour flight. Made it to my hostel (a horrible cramped hostel with everyone sound asleep) about 35 hours after leaving my accommodation in Portland.\n\nUnited gave me a $150 credit, and a $10 meal voucher. If this happened in Europe they'd have given me $625 cash, and covered all my meals.",
    "username" : "The-Smelliest-Cat",
    "timestamp" : "2024-12-22 20:51:59"
  }, {
    "reported_comment" : false,
    "body" : "You know why US airlines are notoriously delayed and often cancelled?\n\nBecause there are zero repercussions for the airlines. In Europe and Asia, airlines get heavily fined and passengers are substantially compensated. In the US, passengers mean shit. \n\nMakes you think eh",
    "username" : "hkfuckyea",
    "timestamp" : "2024-12-22 20:46:59"
  }, {
    "reported_comment" : false,
    "body" : "12 hours in CDG on the way to Toronto. What an awful airport to be stuck in",
    "username" : "Generic_Username_Pls",
    "timestamp" : "2024-12-22 20:54:37"
  }, {
    "reported_comment" : false,
    "body" : "Over the night at Heathrow (closed Heathrow, of course)\n\n\nArrival benches are not very comfortable",
    "username" : "schokac",
    "timestamp" : "2024-12-22 20:40:57"
  }, {
    "reported_comment" : false,
    "body" : "Arrived at LAX before TSA opened to fly back to SEA on Spirit. Board as normal, then the mechanical delays started. On and on it went, with very little communication from Spirit. And, as many of you know, it isn't easy to move between terminals at LAX. So I sat. When Spirit finally cancelled the flight, I zoomed down to ticketing to get my options. Since Spirit didn't interline, I took my refund and hopped on the phone with Alaska to see what they could do (they were awesome). This isn't a \"bash on Spirit post\" but it explains my timing. So, a family member had credit on Southwest and got me a ticket via OAK... and misspelled my name. So I hoofed it to T1 to see what I could do. As I was on the phone with my family member, explaining that I'd already been at LAX for 9 hours, the guy in front of me in the WN line, when it was his turn, told me to go ahead of him because \"you need the help more than I do.\" I get to the ticket counter and the WN agent quickly fixed my ticket, tells me I got the last seat... and the flight is delayed. Because of course. The TSA agent did a double-take when I went through because apparently I didn't look too good. Spent time in T1 and then flew to OAK and then to SEA where a friend picked me up. So I spent 12 hours at LAX, a few at OAK, and have to say one of the most amazing flight attendants ever on the WN OAK-SEA segment (and I wrote to WN to tell them how amazing she was). I love airports but... ooof. A dozen hours at LAX.",
    "username" : "updated_me",
    "timestamp" : "2024-12-22 21:09:27"
  }, {
    "reported_comment" : false,
    "body" : "I went on a American Airlines flight earlier this month, they where late to the airport and made me miss my layover, instead of taking the vouchers for a free hotel for the night I instead stayed in the Dallas airport all night to explore, because it seemed like a pretty cool airport, I was exploring all night, and missing a night of sleep before, this was my second night where I didn’t sleep, got home and slept for 16 hours straight, it was glorious",
    "username" : "COCK5000",
    "timestamp" : "2024-12-22 20:51:03"
  }, {
    "reported_comment" : false,
    "body" : "2 days Las Vegas. i had to catch the city bus to get food for my dog. He was just happy to be with me.",
    "username" : "DubsAnd49ers",
    "timestamp" : "2024-12-22 21:31:43"
  }, {
    "reported_comment" : false,
    "body" : "I remembered waiting for my flight from Boston, MA to London Heathrow, but it got canceled because of a maintenance problem. They had to put me on a different flight to Frankfurt, Germany, and then connect to another flight directly to London Heathrow. It was incredibly tiring. Overall, I believe it took 12 hours of waiting and boarding the planes.",
    "username" : "LittleBiscuitLady",
    "timestamp" : "2024-12-22 20:45:19"
  }, {
    "reported_comment" : false,
    "body" : "29 hours at CDG to save money on a connection. Never again.",
    "username" : "CuriosTiger",
    "timestamp" : "2024-12-22 21:22:07"
  }, {
    "reported_comment" : false,
    "body" : "I was flying stand-by, free because my son works at Delta, and sat at the Rome airport for 5 days waiting for a flight!!! I finally gave up, flew to Amsterdam and caught a flight to the US from there. It was hot, frustrating, and hellish. \nI could have bought a couple of tickets if I had $1600!",
    "username" : "redpepperdeb",
    "timestamp" : "2024-12-22 20:40:56"
  }, {
    "reported_comment" : false,
    "body" : "16 hours in Frankfurt. 2 hours were delay. The other 14 were cruddy flight scheduling. Got a lounge pass to pass time. \n\nLongest delay was 14 hours in ATL. 8 PM flight got 4 successive 90 min delays then by 2 am it got bumped as flight attendants timed out. Flight got cancelled and I got moved to a 10 am flight. Didn’t get situations settled until 3:30am. Didn’t make much sense to leave the airport for 4 hours.",
    "username" : "SnooLobsters6880",
    "timestamp" : "2024-12-22 20:52:39"
  }, {
    "reported_comment" : false,
    "body" : "About 36 hours in JFK during a blizzard. Followed by another 12+ in Paris. Flying around the holidays can suck. Had to spend Christmas Eve night at an airport hotel in London once too bc we missed our connecting flight while waiting 3 hours in customs and everything else was shut down for Christmas.",
    "username" : "jordandavila88",
    "timestamp" : "2024-12-22 20:55:14"
  }, {
    "reported_comment" : false,
    "body" : "4 days in LaGuardia. My sister and I got our second flight cancelled due to an act of God, and then we got bumped for days and days because it was right before the 4thof July.",
    "username" : "Living_Injury_636",
    "timestamp" : "2024-12-22 21:05:15"
  }, {
    "reported_comment" : false,
    "body" : "During the Delta meltdown this July, I met a number of passengers who were stuck at DTW for 2+ days.  Thankfully I was able to sweet-talk my gate agent into getting me on a *confirmed* flight. I was there *only* about 30 hours.\n\nThat airport was cold at night. Hotels within a 30-minute drive were all booked. Delta did hand out blankets. When I got to my destination, they said that they did not have facilities to recover the blankets, so I ended up with a nice souvenir :)",
    "username" : "davidhaha",
    "timestamp" : "2024-12-22 21:13:13"
  }, {
    "reported_comment" : false,
    "body" : "3 days at Bangkok Suvarnabhumi airport. The airline I was planning to fly went bankrupt and the next reasonably priced flight was in three days. What makes this a funny story is that I hadn't gone through security check and customs ie. i could have just walked out of the airport and returned after three days to catch my flight. For some unbeknownst reason I decided to stay at the airport sleeping on the floors and benches and eating KFC/BK or whatever cheap fast food they had available 😂",
    "username" : "Consistent_Potato291",
    "timestamp" : "2024-12-22 21:16:51"
  }, {
    "reported_comment" : false,
    "body" : "Back in 2010 my wife and I got stuck in La Paz airport for 24 hours, we found some ancient (incredibly useful!) website that I think was literally sleepinginairports.com and it let us find the places that are best for sleeping, when to expect the heat being turned off, safety issues, etc.",
    "username" : "City_Goat",
    "timestamp" : "2024-12-22 21:48:48"
  }, {
    "reported_comment" : false,
    "body" : "5 fucking days in the Orlando Airport waiting for a check to clear.",
    "username" : "dixbietuckins",
    "timestamp" : "2024-12-22 22:18:46"
  }, {
    "reported_comment" : false,
    "body" : "A whole night and then some at the old airport in Baku. No cash machine, could not leave the security area, no food, just water from the loo. All due to my employer inviting me over to Kazakhstan for a presentation but forgetting it was a public holiday and there was no visa on arrival possible for me. I was stopped in Baku and then sent back home.",
    "username" : "orbitolinid",
    "timestamp" : "2024-12-22 22:21:32"
  }, {
    "reported_comment" : false,
    "body" : "I spent 27 hours in CDG during covid with nothing open.",
    "username" : "o-Spooky-o",
    "timestamp" : "2024-12-22 22:54:23"
  }, {
    "reported_comment" : false,
    "body" : "Spent my whole childhood and young adulthood as a nonrev (flying standby), so suffice it to say I’ve spent so so so so many ungodly hours at airports. Slept on the floor at LAX and had the janitor vacuum up to an inch away from me. Slept in SJC (San Jose) on Christmas Eve. My dad got kicked out of an airport bar for putting a splash of beer in my baby bottle (it was the 80s) after over a day stuck in the Omaha airport. I could go on and on.",
    "username" : "billyskillet",
    "timestamp" : "2024-12-22 22:56:15"
  }, {
    "reported_comment" : false,
    "body" : "I got stuck in Miami for 10hrs after a a string of flight delays. They wanted to give us vouchers for a hotel and meals and put us on a flight the following evening. We ended up renting a car and driving to NJ out of being so frustrated with that whole trips flight and airport experience.",
    "username" : "Soft_Lemon7233",
    "timestamp" : "2024-12-22 23:33:02"
  }, {
    "reported_comment" : false,
    "body" : "Spent 8hrs at JFK flying from Paris to Los Angeles. Was wiped out and didn’t feel like going anywhere.",
    "username" : "randomiguessx",
    "timestamp" : "2024-12-22 23:43:56"
  }, {
    "reported_comment" : false,
    "body" : "LAX, 16 hours. It just as covid was happening so nothing was open either.",
    "username" : "jamiebaxter666",
    "timestamp" : "2024-12-22 23:49:12"
  }, {
    "reported_comment" : false,
    "body" : "YYZ domestic for 11 hours after continuous delays.",
    "username" : "the_hardest_part",
    "timestamp" : "2024-12-22 23:55:12"
  }, {
    "reported_comment" : false,
    "body" : "12 hours at LAX with the family as standby pax because of full/overbooked flights…",
    "username" : "Upbeat_Bus_5864",
    "timestamp" : "2024-12-22 20:37:40"
  }, {
    "reported_comment" : false,
    "body" : "Was at Boston from 5am-1130am with delays today but also had 14 hour delay/layover in Hong Kong earlier this year.  More to do in that airport than Boston for sure.",
    "username" : "BaileyVineyard",
    "timestamp" : "2024-12-22 20:41:54"
  }, {
    "reported_comment" : false,
    "body" : "I was stuck in Ft. Lauderdale for 2 days over some nonsense, so I sympathize.",
    "username" : "Awkward-Vermicelli85",
    "timestamp" : "2024-12-22 20:51:10"
  }, {
    "reported_comment" : false,
    "body" : "Was flying home from San Antonio after basic training graduation and I spent 26 hours trying to get my ass back to Columbus. No weather delays just combination of canceled flights and mechanical problems. Was pre cell phone and 9/11 days so my GF went to the airport for awhile several times only to later learn that the flight was cancelled. I was brain dead when I finally got home.",
    "username" : "cinciTOSU",
    "timestamp" : "2024-12-22 20:54:55"
  }, {
    "reported_comment" : false,
    "body" : "17 hours in Philadelphia. Numerous issues including the weather and planes.",
    "username" : "Leather_Ad_3140",
    "timestamp" : "2024-12-22 20:59:27"
  }, {
    "reported_comment" : false,
    "body" : "At least two days after flying back from Europe during Covid. Spent two days in the Denver airport due to how infrequent flights were being scheduled at the time. I was too broke to afford a hotel because I ended up being stranded in Europe for 2 more months than I intended lol.\n\nI have spent way too many nights at airports lol. ",
    "username" : "Awanderingleaf",
    "timestamp" : "2024-12-22 21:03:39"
  }, {
    "reported_comment" : false,
    "body" : "A 7 hour flight delay at Budapest airport; I had got there somewhat early, so a total of 10 hours sitting around. I'd gladly revisit Budapest but I respectfully never want to see that airport again 🫠",
    "username" : "ItIsAboutABicycle",
    "timestamp" : "2024-12-22 21:04:40"
  }, {
    "reported_comment" : false,
    "body" : "Houston Bush  ... 40+ hours before getting a hotel for a night, then finally left from Hobby. Late September, 2018ish??? . Having flown from MCO to IAH for a few days ahead of a tropical storm (nothing crazy, not a hurricane, maybe even just a depression at that point), I was back at IAH to connect through DFW home on AA. However, the weather had other plans. Lightning delays, then the rain set up over north Houston for hours. All roads in and out were flooded. Then there were power issues. All flights canceled, and all hotel booked. No one-way rental cars allowed. No taxi or ride share able to get through. Nearly 2 days in IAH before I could get to a hotel (that was on backup power) & no water. There was a pancake restaurant next door that had electricity and water. I was happy for the bed, then I was finally able to get rebooked from HOU for the following day. Power eventually came on at the hotel. I didn't smell wonderful when I got on that plane!",
    "username" : "Captain_Wingit",
    "timestamp" : "2024-12-22 21:07:52"
  }, {
    "reported_comment" : false,
    "body" : "Toronto. Arrived at 9am, left at 12:45am. Delays into JFK that started before our flight and I think they got us out that late so we weren’t hanging around there. It sucked, I could have driven home quicker.",
    "username" : "Loud_Mycologist5130",
    "timestamp" : "2024-12-22 21:16:09"
  }, {
    "reported_comment" : false,
    "body" : "I once spent 12 hours at Chania airport waiting for a one hour flight to Thessaloniki.  It was summer so I had lunch at a taverna just off the airport with the meal ticket from the airline.  Not bad but was intending to catch a 3pm bus from Thessaloniki to Sofia, 6 hour bus ride, got the next bus which was 3 am.",
    "username" : "oldfartMikey",
    "timestamp" : "2024-12-22 21:20:04"
  }, {
    "reported_comment" : false,
    "body" : "10 hours at CLT north carolina. Flight got delayed twice and then canceled twice. Meaning the first flight got delayed after we boarded then canceled. Then the next scheduled flight, same thing.\n\nGave me a voucher for another flight and paid for food, but did not pay for the hotel. So I just slept in the airport overnight until the next scheduled flight at 10am.\n\nDidn't feel like taking an ubur or something to a hotel. Paying the hotel and getting in line the next day to go through tsa. Just figured I skip doing all of that.",
    "username" : "sdrakedrake",
    "timestamp" : "2024-12-22 21:21:56"
  }, {
    "reported_comment" : false,
    "body" : "Ryanair return flight cancelled to come back home. 13pm-24pm in the airport, 24pm flight to another destination, 1pm-8am in the airport, 3 more hours of delay, and finally back home at 13pm lol. So 24 hours for a flight of 1.30 hours at the beginning",
    "username" : "Abibak",
    "timestamp" : "2024-12-22 21:25:09"
  }, {
    "reported_comment" : false,
    "body" : "Spent a night in Mexico City airport once. Fucking freezing. Luckily found someone who offerd to share a sleeping bag. ;)",
    "username" : "pezgringo",
    "timestamp" : "2024-12-22 21:40:19"
  }, {
    "reported_comment" : false,
    "body" : "Overnight in Munich Germany, on my way home from Spain. The airport was surprisingly comfy! They lock the airport around midnight so it felt very safe.",
    "username" : "Illustrious-Lime706",
    "timestamp" : "2024-12-22 21:44:28"
  }, {
    "reported_comment" : false,
    "body" : "Holiday time flying sucks donkey dick! I fly a lot for work and I keep forgetting to stay home and not book any meetings the week leading up to the holidays…delays, delays, delays. \n\nLongest time is around 12 hours. Someone drove one of the small luggage carts into the plane and it had to be maintained, once that was done there was no crew around and I hade to go back home.",
    "username" : "snowst0mper",
    "timestamp" : "2024-12-22 21:45:06"
  }, {
    "reported_comment" : false,
    "body" : "10+ Hours in Tahiti, i think?  Flights all leave early morning.\n\nThen maybe the same amount in Kuwait back in the 90s. Unfortunate timing on that one",
    "username" : "kraftymiles",
    "timestamp" : "2024-12-22 21:56:33"
  }, {
    "reported_comment" : false,
    "body" : "Spent 5 hours in Dubai airport after a 17 hour flight that i couldnt get any sleep on, which was kinda boring. Pretty architecture but not a lot to do. Tbf I've only flown internationally twice and I much prefer being in the airport than on the plane",
    "username" : "DevinChristien",
    "timestamp" : "2024-12-22 21:56:54"
  }, {
    "reported_comment" : false,
    "body" : "About 11 hours - I had a flight from Toronto to London at 21.00 but had to leave my Airbnb at 9-ish. I theoretically could have left my luggage with the held luggage service and seen some of the sights, but ngl Toronto is a pretty bland for tourism. The airport is probably the most boring one I've been to.",
    "username" : "Expression-Little",
    "timestamp" : "2024-12-22 21:58:08"
  }, {
    "reported_comment" : false,
    "body" : "36 hours in Singapore’s Changi. Luckily the airport is sick and the WiFi is fast, you do have to constantly get a new times code for the WiFi though, which was annoying.",
    "username" : "eyeinthesky0",
    "timestamp" : "2024-12-22 22:03:04"
  }, {
    "reported_comment" : false,
    "body" : "About 12 hours before I gave up on Lufthansa and hopped a train to the city. I hate being at the airport.",
    "username" : "whodidntante",
    "timestamp" : "2024-12-22 22:03:33"
  }, {
    "reported_comment" : false,
    "body" : "Fifty seven hours at the Nairobi Airport, 1987.",
    "username" : "Ok_Knee1216",
    "timestamp" : "2024-12-22 22:28:43"
  }, {
    "reported_comment" : false,
    "body" : "20 hours at DTW. would have been 48 but i went to a hotel after 20 hours",
    "username" : "DrySpace469",
    "timestamp" : "2024-12-22 22:29:51"
  }, {
    "reported_comment" : false,
    "body" : "I did 15 hours at DOH a few months ago. Lounge hopping was fun, one of the best nights of my life.",
    "username" : "TomassoLP",
    "timestamp" : "2024-12-22 22:44:57"
  }, {
    "reported_comment" : false,
    "body" : "7-8 hours in Zagreb airport. It is not a good airport to be stuck in. There was one small café and some seating and that's pretty much it (at least at the time, there may be more now). Luckily as it was an airline issue our compensation basically paid for all our travel and some of our hotel costs.",
    "username" : "hulkissmashed",
    "timestamp" : "2024-12-22 22:50:17"
  }, {
    "reported_comment" : false,
    "body" : "About 8 hours in Dublin’s airport.  The people I was traveling with had a 9am flight and mine was at 4pm.  I was so early that the TSA computer had a “too early” warning pop up when they scanned my ticket, though they let me through anyway.",
    "username" : "2-59project",
    "timestamp" : "2024-12-22 22:53:32"
  }, {
    "reported_comment" : false,
    "body" : "Flew from Jacksonville, Florida to Boston. Flight was delayed due to heavy fog in Boston. Hourly updates for five hours were the fog wasn’t lifting so we were rerouted to Newark. Delays to Boston continued until late in the evening. Four of us passengers got together to rent a car and drive up. Just then another airline announced the fog had lifted enough to fly into Boston. So 40 or so passengers boarded, it was a smooth flight, but I swear the approach was at an altitude of fifty feet or so over Boston Harbor for several minutes before landing. All told about a 14 hour delay/trek.",
    "username" : "oldbutsharpusually",
    "timestamp" : "2024-12-22 22:54:00"
  }, {
    "reported_comment" : false,
    "body" : "In last year I was delayed 48 hours and 24 hours. \n\nThey 48 hour could have been worse but I begged and pleaded to get on the plane and was waiting at airport and they let me on a flight.",
    "username" : "Dad_travel_lift",
    "timestamp" : "2024-12-22 22:56:50"
  }, {
    "reported_comment" : false,
    "body" : "9 hours in Riyadh . Hate to say it but I slept like 4 out of those 9 lol",
    "username" : "BaseballEquivalent24",
    "timestamp" : "2024-12-22 23:05:04"
  }, {
    "reported_comment" : false,
    "body" : "26 hours due to a freak spring snow storm flying Denver to Houston. Not near as bad as some others here, but I was 7. It felt like a lifetime. My poor parents had to try to keep their sanity while wrangling three kids.",
    "username" : "mutemarmot42",
    "timestamp" : "2024-12-22 23:05:40"
  }, {
    "reported_comment" : false,
    "body" : "About 8 hours I think but I just go in the lounge and usually bring my steam deck anyway so I don’t mind",
    "username" : "glohan21",
    "timestamp" : "2024-12-22 23:06:24"
  }, {
    "reported_comment" : false,
    "body" : "19 hours in Hong Kong during the Corona time. It was alright. All of the food shops were closed at night. I found a nice quiet gate where I had a lounger to lie on for sometime.",
    "username" : "amzyvista",
    "timestamp" : "2024-12-22 23:06:37"
  }, {
    "reported_comment" : false,
    "body" : "I was flying in from Cuba when there was an airport shooting.  Every other place got turned around, but I guess the nature of the US-Cuba relations made this extra sensitive. We were the only plane to land that day after the shooting.  I had no cell phone (didn't want to take it to Cuba), so I was kinda stuck in the chaos. Every rental car was rented by people driving to another city to take a flight.  Flights were packing people out to other cities, so I just hung out by the gate. If I remember right, it was about 24 hours, either from landing to getting home or from landing until my plane took off.  Call it a day. \n\nWhen security loosened up, I went around collecting carts and turning them in for a quarter.  I had nothing else to do, and it was kinda a game to keep active.  I think I used the money to get a pizza",
    "username" : "Dense_Talker",
    "timestamp" : "2024-12-22 23:19:10"
  }, {
    "reported_comment" : false,
    "body" : "Probably like 25 hours. I was denied entry, so I had to wait for a flight back to the country of departure. It was my most stressful travel ever.",
    "username" : "-SPOF",
    "timestamp" : "2024-12-22 23:52:17"
  }, {
    "reported_comment" : false,
    "body" : "Ive had to overnight it in Miami. Not my\nMost favourite experience. Id try to ask for compensation for all the delays.",
    "username" : "That_Jicama_7043",
    "timestamp" : "2024-12-23 00:03:15"
  }, {
    "reported_comment" : false,
    "body" : "13.5 hour layover at LAX.",
    "username" : "amatea6",
    "timestamp" : "2024-12-23 00:26:33"
  }, {
    "reported_comment" : false,
    "body" : "I had an 11 hour layover in VIE once. I did spend some time exploring Vienna but after having spent a week in Armenia prior, I was just too tired.",
    "username" : "pikay93",
    "timestamp" : "2024-12-23 00:47:55"
  }, {
    "reported_comment" : false,
    "body" : "40 hours in JFK during a winter ice storm. The airport was packed, and there were unaccompanied minors who were just basically dumped off the planes. This was years ago, maybe things are different now. Anyhow, I took a little girl under my wing (I'm a longtime foster mom) and made the best of it. I talked to her parents on the phone, made sure she was safe, watched over her while she napped, and made sure she got on her next flight. It helped pass the time.",
    "username" : "StopLife6992",
    "timestamp" : "2024-12-23 00:54:14"
  }, {
    "reported_comment" : false,
    "body" : "10 hours. Recently at the Manila airport. My hotel wouldn’t let me have a late check-out, and I didn’t want to wander around with luggage, so I thought I would go to the airport and find an airline club. The problem was that everybody at the airport had the same idea, and the airport clubs were all awful and terrible.",
    "username" : "EggStrict8445",
    "timestamp" : "2024-12-23 01:21:00"
  }, {
    "reported_comment" : false,
    "body" : "12 hours during the pandemic so I couldn't leave. DO NOT recommend it",
    "username" : "yankeeblue42",
    "timestamp" : "2024-12-23 02:31:12"
  }, {
    "reported_comment" : false,
    "body" : "In 2008 I was stuck at Chicago O'Hare for over 24 hours. Technically 6 hours were in a hotel. Was connecting through O'Hare coming home from Ireland, should have been home the afternoon of December 24th but didn't make it until 10pm on December 25th. Worst part was a full day of being called to all sorts of different gates before they finally gave us all hotel vouchers for the night to try again in the morning. Will say though, for it being a stressful time of year to travel, let alone be delayed, everyone did a good job of keeping the mood as positive as possible.",
    "username" : "curbyourunenthusiasm",
    "timestamp" : "2024-12-23 03:21:02"
  }, {
    "reported_comment" : false,
    "body" : "Me and my friends used to play pinball all night on acid in Minneapolis.\n\nLate 80's.",
    "username" : "Tehboognish",
    "timestamp" : "2024-12-22 21:33:08"
  }, {
    "reported_comment" : false,
    "body" : "It took us about 52 hours to get from Oslo, Norway to Sarnia, Ontario, when our SAS flight was delayed, causing us to miss our connection in Heathrow. It was a miserable time. We got rescheduled for the next day (they gave us a crappy airport hotel room). The next day, for our flight from Heathrow, they added a connection in Madrid. That flight was delayed 5 hours. When we landed, we were pretty much seconds from missing our last connection to Sarnia - they were calling our names over the speaker. Thank goodness that flight had also been delayed and we made it. Unfortunately, our luggage took two more days to find us.",
    "username" : "10S_NE1",
    "timestamp" : "2024-12-22 21:38:27"
  }, {
    "reported_comment" : false,
    "body" : "Have tried 12 hours in Bangkok and 10 in Dubai. In Dubai I thought I’d head into the centre and have a look at the burj khalifa while I waited for my next flight. Went through immigration only to discover the metro didn’t run at night, so I was officially in Dubai for about 5 minutes before I decided to head back the other way. Then I got pulled aside at passport control and asked wtf I was doing😭 good times tbh",
    "username" : "NikitaMazewin",
    "timestamp" : "2024-12-22 21:47:20"
  }, {
    "reported_comment" : false,
    "body" : "14 hours at Mumbai, knew that Mumbai had 2 airports, but didn’t think I would want to book a hotel for 10am to midnight, so went to the international airport….. couldn’t get to lounge or anything, sat in the ticketing hall for 11 hours, recovering from food poisoning.",
    "username" : "Loveroffinerthings",
    "timestamp" : "2024-12-22 21:47:59"
  }, {
    "reported_comment" : false,
    "body" : "I spent the night at the Lima airport once. On purpose to save a few bucks in my early 20s. Been lucky enough to not experience anything like that due to delays and cancellations, any time I’ve been cancelled on I’ve had a place off airport to stay",
    "username" : "prettyorganic",
    "timestamp" : "2024-12-22 21:48:15"
  }, {
    "reported_comment" : false,
    "body" : "Yep. One year I was going to Southern-ish California to visit a friend - lived in the Lake Tahoe area at the time, so the plan was to fly from Reno to SF, then switch to a \"puddle jumper\" to San Luis Obispo (smaller city on the central coast). Shouldn't have been more than an hour for each leg, plus maybe an hour layover between. But when we got to SFO it was so foggy, they had to delay the flight while the weather cleared. I probably sat there for about 4-5 hours, before they finally said it was clear to leave... flew to SLO, attempted a landing, fog was still too thick, so they dumped us at LAX instead! Another 2 or so hours there (they gave us meal vouchers at least 🙄) before we finally got BACK on the plane and were able to land at SLO.\n\nI think the total travel time ended up being like 12 hours; I literally could have driven there faster! I've also had some overnight cancellations/delays, but in those cases I leave and get a hotel room. Even if they're not sure how long it'll be, I'd rather just rebook than sit there endlessly. That's what I did when a tornado diverted a Baltimore-Chicago-SFO flight to Louisville, Kentucky of all places. I just got a room, and flew home via Houston the next day instead.",
    "username" : "ZoyaZhivago",
    "timestamp" : "2024-12-22 21:52:44"
  }, {
    "reported_comment" : false,
    "body" : "That’s a really good question. The best I can recollect was maybe around 8 hours trying to get to Atlanta from Norfolk a couple of years back.",
    "username" : "SigmaKnight",
    "timestamp" : "2024-12-22 22:00:12"
  }, {
    "reported_comment" : false,
    "body" : "I was flying from SFO-BOS and ended up being delayed 12 hours. Three aircraft swaps. We even left the gate! They kept sending updates every 30 minutes that our flight was delayed another 30 minutes, for twelve hours. I was supposed to land in Boston around 5 PM and I landed around 4:45 the following morning",
    "username" : "jhumph88",
    "timestamp" : "2024-12-22 22:32:04"
  }, {
    "reported_comment" : false,
    "body" : "28 hours at Stansted, outside London.",
    "username" : "FoodExternal",
    "timestamp" : "2024-12-22 23:24:10"
  }, {
    "reported_comment" : false,
    "body" : "2.5 days",
    "username" : "FunFact5000",
    "timestamp" : "2024-12-22 23:27:18"
  }, {
    "reported_comment" : false,
    "body" : "Was supposed to fly home from london at 2.05pm (well... 7.05am but that flight was cancelled)\n\nGot to the airport just after 11am to find out that flight, too, had been cancelled. \n\nManaged to get booked onto a flight scheduled to depart at 7.30pm after many failed attempts to be booked onto earlier flights.\n\nDelayed by another hour, left at 8.30pm\n\n\nSo 9 1/2 hours? \n\nI've had very long layovers a couple of times but i dont think ive ever been at an airport for more than those 9 1/2 hours",
    "username" : "SeaMindless7297",
    "timestamp" : "2024-12-22 23:28:21"
  }, {
    "reported_comment" : false,
    "body" : "24 hours in Moscow Domodedovo in midwinter.  Flight cancelled and spent time in entry hall ( no shops etc).  Was @#@$+-& freezing.  Passed the time learning Cyrillic from the departure board.",
    "username" : "protantus",
    "timestamp" : "2024-12-23 00:25:19"
  }, {
    "reported_comment" : false,
    "body" : "24 hours in Dublin airport in 2022 due to an airport wide system failure that caused all Aer Lingus flights to ground and also rendered all of their POS system useless.\n\nAll the hotels in Dublin were booked solid for a Garth Brooks concert in town, and the only way to get to my destination (Berlin) was to spend the night in the airport and catch a combination of flights to Nantes, France then Berlin.",
    "username" : "Psqwared",
    "timestamp" : "2024-12-23 01:05:24"
  }, {
    "reported_comment" : false,
    "body" : "A friend of mine was stuck in the Jacksonville, FL airport(JAX) for 11 hours shortly after the Delta meltdown.  Pleasant little airport, actually, but not much to do. Delta kept delaying and delaying the flight until they finally canceled it. Fortunately, she got her money back because doubt she’ll ever fly Delta again.",
    "username" : "Even_Management_2654",
    "timestamp" : "2024-12-23 03:53:22"
  }, {
    "reported_comment" : false,
    "body" : "For my first business trip, I naively booked SF Bay Area -> PDX -> ORD -> YUL in the month of February.\n\nGot stuck at PDX for 11 hours due to winter storm delays at ORD. The trip eventually was rerouted from PDX to YVR, and then a red eye to YUL. I think I spent 24 hours to get to my destination all because my manager “recommended” the least expensive flight.\n\nNeedless to say, I learned the valuable lesson of time and money and will never again book travel plans like this whether it’s personal or business.",
    "username" : "mmxxvisual",
    "timestamp" : "2024-12-23 04:57:07"
  }, {
    "reported_comment" : false,
    "body" : "12 hours in Vancouver. I had already had to go through customs and I have no idea why I never ended up going to visit the city",
    "username" : "cardamomcosmiclatte",
    "timestamp" : "2024-12-23 06:38:20"
  }, {
    "reported_comment" : false,
    "body" : "Twenty-four hours in Narita Airport in Japan on a day where most of the stores were closed. It felt like a week.",
    "username" : "Medieval-Mind",
    "timestamp" : "2024-12-23 06:54:22"
  }, {
    "reported_comment" : false,
    "body" : "About 36 hours in the Rome airport",
    "username" : "TemperatureLumpy1457",
    "timestamp" : "2024-12-23 07:20:41"
  }, {
    "reported_comment" : false,
    "body" : "14 hours at changi airport. But my god I had a good time",
    "username" : "radcapper",
    "timestamp" : "2024-12-23 07:52:12"
  }, {
    "reported_comment" : false,
    "body" : "12 hour overnight in Singapore airport. But got a hotel in the Jewel so it was nice.",
    "username" : "BKvoiceover",
    "timestamp" : "2024-12-23 08:18:59"
  }, {
    "reported_comment" : false,
    "body" : "Trapped at LHR for 36hrs during the Great Gas Leak of 2007. Happened to be Wimbledon so there were no hotels available. Also happened to be coming from a country using euros and I was starving and broke every vending machine because they only took pounds. The airport brought out a single case of water for like 300 of us. \n\nAlso super fun… they do a mandatory fire drill every morning at like 4am or something. \n\nI still have a bitter taste in my mouth whenever someone mentions London.",
    "username" : "Spare_Progress_6093",
    "timestamp" : "2024-12-23 08:27:22"
  }, {
    "reported_comment" : false,
    "body" : "About 7 or 8 hours. It was the last day of our cruise which ended in Savona. We then had a 2-hour bus transfer to Milan Linate where we arrived at around 12, and our flight was at around 7 or 8 in the evening. Was a long wait on an airport with very little to do. It got better once it was 2 hours before the flight and we could check in and go through security, more shops and such behind security",
    "username" : "Maxomans",
    "timestamp" : "2024-12-23 08:46:04"
  }, {
    "reported_comment" : false,
    "body" : "26 hours at Bangkok airport once and 24 hours at Doha! Both cancelled flights.",
    "username" : "Comfortable-Toe-863",
    "timestamp" : "2024-12-23 09:13:11"
  }, {
    "reported_comment" : false,
    "body" : "4 days in Narita. \n\nHad to enter and exit the airport each day. Meaning, I had to get a visa each day. \n\nWas flying as a nonrev and it was during the holidays. I needed to be present in order to take a seat when it became available. \n\nSlept in the little sleeping area with the bamboo mats and vending machines each night. \n\nRead a lot and played on my phone.",
    "username" : "Nemothafish",
    "timestamp" : "2024-12-23 13:21:36"
  }, {
    "reported_comment" : false,
    "body" : "It’s the best airport to get stuck in, but three days? That’d stretch my patience.",
    "username" : "Pompelmouskin2",
    "timestamp" : "2024-12-22 21:36:26"
  }, {
    "reported_comment" : false,
    "body" : "If I had to pick an airport to spend 3 days in, it would be Changi. My friend was stuck in Cairo for like 5 days during the Iceland volcano mayhem and she said it was absolute hell",
    "username" : "jhumph88",
    "timestamp" : "2024-12-22 22:30:06"
  }, {
    "reported_comment" : false,
    "body" : "Haha. I’ve seen some vids of that airport and it does seem insanely good\n\nThat waterfall is epic",
    "username" : "RT023",
    "timestamp" : "2024-12-22 22:05:04"
  }, {
    "reported_comment" : false,
    "body" : "Changi is my longest in an airport also, but it was only 13 hours. Also really enjoyed it.",
    "username" : "MrF33n3y",
    "timestamp" : "2024-12-22 23:31:13"
  }, {
    "reported_comment" : false,
    "body" : "Whenever I fly out of Singapore after a holiday, I always hope the plane would be delayed so I can stay for longer.",
    "username" : "Lucky_bum",
    "timestamp" : "2024-12-22 22:52:50"
  }, {
    "reported_comment" : false,
    "body" : "Holy shit.  Can’t imagine that.  Sounds like that Planes, Trains, and Automobiles movie.",
    "username" : "XI-__-IX",
    "timestamp" : "2024-12-22 20:45:09"
  }, {
    "reported_comment" : false,
    "body" : "“You ever take the bus before? Well, your day’s not about to improve” 🤣🤣",
    "username" : "slykido999",
    "timestamp" : "2024-12-22 21:10:24"
  }, {
    "reported_comment" : false,
    "body" : "My wife and I tried to fly from Manchester, UK to Charlotte NC via NY for her job interview to move to the USA, but a big storm blew in and once we landed in NY every flight out got cancelled for the day and they couldn't confirm when they'd be able to to get us on a flight. Somehow our luggage had already made its way to Charlotte, so we ended up taking an overnight bus from Chinatown to Charlotte. That was pretty grim, but it made for a good icebreaker in her interview!",
    "username" : "socialistpancake",
    "timestamp" : "2024-12-22 22:14:17"
  }, {
    "reported_comment" : false,
    "body" : "Didn’t Tom hanks make a movie about that?  O.o",
    "username" : "EightLegedDJ",
    "timestamp" : "2024-12-22 21:51:19"
  }, {
    "reported_comment" : false,
    "body" : "You win. 🥇",
    "username" : "foochacho",
    "timestamp" : "2024-12-22 21:46:26"
  }, {
    "reported_comment" : false,
    "body" : "I had a similar situation in Atlanta. I kept getting bumped as a stand-by and the second day I ended up taking a greyhound from Atlanta to Dallas. My girlfriend picked me up at the airport and said I looked like I had a long trip.",
    "username" : "Figgler",
    "timestamp" : "2024-12-22 23:49:05"
  }, {
    "reported_comment" : false,
    "body" : "Damn, mine was probably 14-15 hrs range.",
    "username" : "NY10",
    "timestamp" : "2024-12-23 01:00:37"
  }, {
    "reported_comment" : false,
    "body" : "Was that during the ice storm in Oregon 2016? I flew into SFO trying to connect to Medford and there were a lot of folks that had already been stranded for over 24 hours. My flight got canceled, rented a truck and got the fuck home..",
    "username" : "LordBucketheadthe1st",
    "timestamp" : "2024-12-23 01:04:34"
  }, {
    "reported_comment" : false,
    "body" : "Once after flying back from Tokyo I spent 9 hrs in LAX then 11hrs in SFO before finally getting to Reno then rented a car and drove two hours in ice fog. Total trip was over 50 hours. And did I mention I had broken my ribs while in Japan?",
    "username" : "LouQuacious",
    "timestamp" : "2024-12-23 05:00:29"
  }, {
    "reported_comment" : false,
    "body" : "Just an fyi for those who do not know.\n\nMajor airports usually have hotels inside the terminals so you don’t have to leave (or go through security/immigration) that have rooms you can rent for just a couple of hours or longer if you want a place to sleep and shower etc.\n\nAlso most major airports have lounges (usually for business, first class and priority members) that allow you to buy lounge access that have ”free” food and drinks including alcohol. If you have 4+ hours between flights it’s usually worth it if you were planning on eating and having a couple of beers anyway with the high prices airports have in the normal restaurants/bars.\n\nThe really good lounges also have ”hotel rooms” that you can use depending on availability and most have showers etc. ”free of charge” if you’ve bought lounge access.\n\n(You can often pre bok and pay before your trip to guarantee you access on the airlines/airports website. If not, go to the lounges for the airline that has that airport as their ”home” airport as they are usually the biggest and most likely can accommodate walk-ins)",
    "username" : "Kallikantzari",
    "timestamp" : "2024-12-22 23:03:58"
  }, {
    "reported_comment" : false,
    "body" : "What’s their airport like?",
    "username" : "XI-__-IX",
    "timestamp" : "2024-12-22 20:44:11"
  }, {
    "reported_comment" : false,
    "body" : "I didn’t know about this. I wasn’t alive when 9/11 happened so that may be why, but that sounds like a nightmare for sure",
    "username" : "Careful_Way_1",
    "timestamp" : "2024-12-22 22:34:17"
  }, {
    "reported_comment" : false,
    "body" : "My husband didn't have a 9/11 experience, but his was connected to it. He flew the red eye into NYC a month later when the plane crashed in Queens. They wondered if it was another 9/11. I don't know when exactly the crash happened, but he spent the day waiting in line for his next segment boarding pass because his flight was cancelled, then having to leave the airport (everybody had to), coming back in to get a new boarding pass again, having to leave the airport again...\n\n\nHe was exhausted by the time he got a connection that went through and then had to drive another 2 hours to his customer.",
    "username" : "PattyRain",
    "timestamp" : "2024-12-23 05:16:55"
  }, {
    "reported_comment" : false,
    "body" : "This is a significant issue. I recently had my flights delayed a full day and it cost me a $1k per night hotel room. Many hotels no longer allow last minute cancellations. That put me off from travel for a bit, airline got their full fair from me still, hotel got a paid for night that I didn’t use, felt completely scammed.",
    "username" : "Dad_travel_lift",
    "timestamp" : "2024-12-22 22:55:26"
  }, {
    "reported_comment" : false,
    "body" : "What is there to do at either Dallas airport?",
    "username" : "Guilty-Ad-2762",
    "timestamp" : "2024-12-22 21:06:24"
  }, {
    "reported_comment" : false,
    "body" : "You could have ducked into Paris in those 29 hours though, granted I dunno about the savings at that point as Paris ain’t cheap.\n\nPlus visas could be another story…",
    "username" : "traumalt",
    "timestamp" : "2024-12-23 10:18:21"
  }, {
    "reported_comment" : false,
    "body" : "When I fly I always pack toothpaste, toothbrush and deodorant in my carryon or purse for these reasons. I simply have to brush my teeth 3-4 times a day. When stuck in an airport for hours or days it’s quite refreshing to have these necessary items on hand.",
    "username" : "Sklawler",
    "timestamp" : "2024-12-22 22:40:18"
  }, {
    "reported_comment" : false,
    "body" : "Ah.. I'm gonna need some more details here.  Age, sex, nationality?  Did you actually get into the sleeping bag with them or use it more as a duvet?",
    "username" : "Murky_30s",
    "timestamp" : "2024-12-23 01:46:02"
  }, {
    "reported_comment" : false,
    "body" : "I didn’t have a choice 😆 but all things considered, it wasn’t bad at all. Plus the food selection is amazing. The lounges are elite.",
    "username" : "Inevitable_Brag_5507",
    "timestamp" : "2024-12-22 21:47:02"
  }, {
    "reported_comment" : false,
    "body" : "But also the most expensive. Cheap and Singapore are mutually exclusive. Your money runs very fast here. ",
    "username" : "smile_politely",
    "timestamp" : "2024-12-23 01:39:48"
  }, {
    "reported_comment" : false,
    "body" : "Oh my gosh, I feel for your friend. Cairo’s airport is truly my worst nightmare. The airport alone makes me never want to go back!",
    "username" : "Inevitable_Brag_5507",
    "timestamp" : "2024-12-23 00:57:10"
  }, {
    "reported_comment" : false,
    "body" : "It’s really spectacular - I don’t use that word lightly 🤣",
    "username" : "Inevitable_Brag_5507",
    "timestamp" : "2024-12-23 00:59:41"
  }, {
    "reported_comment" : false,
    "body" : "It really was the best I’ve been in! I still have not been to Incheon though, so there is always competition!",
    "username" : "Inevitable_Brag_5507",
    "timestamp" : "2024-12-23 04:44:44"
  }, {
    "reported_comment" : false,
    "body" : "It really is like a legit resort in some ways! They know how to make it comfortable and welcoming.",
    "username" : "Inevitable_Brag_5507",
    "timestamp" : "2024-12-23 00:55:47"
  }, {
    "reported_comment" : false,
    "body" : "You're going the wrong way... How do they know where we're going?",
    "username" : "Big-Parking9805",
    "timestamp" : "2024-12-22 20:50:08"
  }, {
    "reported_comment" : false,
    "body" : "My old marching band went to Orlando from Calgary over the summer. One of the flights connected through Toronto, and their first flight was delayed. They were told that they would hold the second plane for them (since they made up like a third of the flight), but this didn't happen, making them all 1-3 days late. I think some got a direct flight, some got redirected through Dallas, possibly some through Atlanta, some even had to bus from Toronto to Pittsburgh to get a flight",
    "username" : "StetsonTuba8",
    "timestamp" : "2024-12-22 20:58:37"
  }, {
    "reported_comment" : false,
    "body" : "Honestly I could have just left, but this was before smart phones and I was a broke student unused to flying. Since I didn't have a boarding pass I was afraid to leave the airport and be unable to get in. I also had a ton of checked bags I wasn't sure how to transport.\n\nNowadays I would have rented a car and driven home, but that's what time, experience, and a credit card teach you.",
    "username" : "Sea_Concert4946",
    "timestamp" : "2024-12-23 01:03:12"
  }, {
    "reported_comment" : false,
    "body" : "Yep! I was trying to get to oregon and I still remember the gate agent looking at their computer and asking me if boise was okay as a final destination lol",
    "username" : "Sea_Concert4946",
    "timestamp" : "2024-12-23 01:06:27"
  }, {
    "reported_comment" : false,
    "body" : "Hard to find a pay-for-the-day lounge in the US anymore. Most people get in with their credit cards that provide it as a perk. Or via status with an airline",
    "username" : "Fabulous-Gas-5570",
    "timestamp" : "2024-12-23 00:34:59"
  }, {
    "reported_comment" : false,
    "body" : "It’s very large. I believe they are the largest airport hub in Asia. Lots of shopping and they had an ice skating rink in airport which my kids enjoyed",
    "username" : "one11travel",
    "timestamp" : "2024-12-22 20:51:04"
  }, {
    "reported_comment" : false,
    "body" : "They also offer excursions into Seoul based on layover time. We were coming from the Philippines so weren’t packed for the occasion (it was snowing outside). They practically laughed at us when we were inquiring about going out of the airport lol",
    "username" : "one11travel",
    "timestamp" : "2024-12-22 20:55:17"
  }, {
    "reported_comment" : false,
    "body" : "It gets talked about like a thing that happened in NY but It was an America wide whirlwind of chaos and fear until every flight was on the ground. The towers fell then an American Airlines flight took out the Navy side of the Pentagon then passengers crashed a United flight before it could take out The House & Senate. Like three or four planes were not responding to air traffic control calls for whatever reason and the news was reporting they were also likely hijacked with unknown targets. It was worse than your average bad day for air travel lol.",
    "username" : "SlurReal",
    "timestamp" : "2024-12-22 23:13:29"
  }, {
    "reported_comment" : false,
    "body" : "It was surreal being in a pretty major metro area and going outside and not seeing or hearing any planes for days. \n\nAnd if you were waiting for a package delivery that involved air mail, good luck. ",
    "username" : "seeking_hope",
    "timestamp" : "2024-12-23 06:20:16"
  }, {
    "reported_comment" : false,
    "body" : "Yea and travel insurance won't pay out shit, because fuck you, that's why. \n\nI wonder if the corrupt oligarchs soon to be running the govt give af about your passenger rights. My guess is lol nope.",
    "username" : "hkfuckyea",
    "timestamp" : "2024-12-22 22:59:30"
  }, {
    "reported_comment" : false,
    "body" : "Get 20k steps in, lol",
    "username" : "Gingerbeerexplorer",
    "timestamp" : "2024-12-22 21:12:43"
  }, {
    "reported_comment" : false,
    "body" : "One of the workers at the 7/11 let me have a free coffee after I tried purchasing",
    "username" : "COCK5000",
    "timestamp" : "2024-12-22 22:38:10"
  }, {
    "reported_comment" : false,
    "body" : "Yep, and that was exactly the problem. The delay saved me about $150, and this was at a time in my life where $150 really mattered. (It was during my university days, and I was flying from the US back to Norway for Christmas.)\n\nI could've gone into Paris, but everything costs money, including transportation from the airport into Paris. Or finding a place to sleep. Or entering the Louvre.\n\nNowadays, I wouldn't hesitate to do that. But at that point in my life, I couldn't afford to.\n\nEdit: Visas were not an issue. As a Norwegian citizen, I have freedom of movement in France.",
    "username" : "CuriosTiger",
    "timestamp" : "2024-12-23 14:16:49"
  }, {
    "reported_comment" : false,
    "body" : "Oops, i forgot to mention a travel size pouch of wipes, baby or other options. The baby wipes have a really fresh scent so that’s my choice.",
    "username" : "Sklawler",
    "timestamp" : "2024-12-23 00:02:28"
  }, {
    "reported_comment" : false,
    "body" : "Why didn’t you go into the city though?",
    "username" : "Yotsubato",
    "timestamp" : "2024-12-23 00:54:45"
  }, {
    "reported_comment" : false,
    "body" : "Hopefully if it was for a conference other people would be paying",
    "username" : "basilect",
    "timestamp" : "2024-12-23 06:21:47"
  }, {
    "reported_comment" : false,
    "body" : "Must be drunk!",
    "username" : "deerskillet",
    "timestamp" : "2024-12-22 22:56:26"
  }, {
    "reported_comment" : false,
    "body" : "54 hrs sounds like stranded at the airport lol…. I would’ve gone mad 😡",
    "username" : "NY10",
    "timestamp" : "2024-12-23 01:04:23"
  }, {
    "reported_comment" : false,
    "body" : "Wow.. small world..",
    "username" : "LordBucketheadthe1st",
    "timestamp" : "2024-12-23 04:26:54"
  }, {
    "reported_comment" : false,
    "body" : "Ok, but the world is bigger than the US and this advice still applies. This is r/travel, not r/travelUS..\n\nUS lounges are, compared to lounges in the rest of the world pretty ”meh” anyway..",
    "username" : "Kallikantzari",
    "timestamp" : "2024-12-23 00:39:07"
  }, {
    "reported_comment" : false,
    "body" : "I think Delta is the only one you can't just buy a day pass in the US. That being said the US lounges are not particularly great. If you're stuck though the lounge agents usually provide better customer service for rebookings (united is a good example of this)..",
    "username" : "rtd131",
    "timestamp" : "2024-12-23 08:21:30"
  }, {
    "reported_comment" : false,
    "body" : "That’s odd. How long ago was this? Same situation, but they had down jackets for all of us on the bus. So, it wasn’t an issue. Went on 3 excursions when I had an 18h layover at ICN. This was back in 2013",
    "username" : "dean16",
    "timestamp" : "2024-12-22 21:13:06"
  }, {
    "reported_comment" : false,
    "body" : "Not a chance, they won’t do anything about this. National parks etc and some road trips is fine with me, a nice break until hopefully things get better.",
    "username" : "Dad_travel_lift",
    "timestamp" : "2024-12-22 23:20:27"
  }, {
    "reported_comment" : false,
    "body" : "I will say I have had decent luck with travel insurance. I lost my cell phone in India a few months ago and the insurance company paid me out my new phone that I got in Mumbai. Now as far as cancellations or lost luggage idk. But I generally carry on bc I do not trust airlines.",
    "username" : "2nd_Chances_",
    "timestamp" : "2024-12-23 00:50:53"
  }, {
    "reported_comment" : false,
    "body" : "Sorry, I guess my answer wasn’t totally accurate to your liking. I did go into the city because the airport organized a bus trip. But I was still in the airport for 3 days. Because my original ticket was canceled, I didn’t have many options until a new ticket was actually reissued, and that new ticket did not include me actually getting to Munich. I went to the US after all of it.",
    "username" : "Inevitable_Brag_5507",
    "timestamp" : "2024-12-23 01:06:15"
  }, {
    "reported_comment" : false,
    "body" : "Absolutely",
    "username" : "Fabulous-Gas-5570",
    "timestamp" : "2024-12-23 00:40:23"
  }, {
    "reported_comment" : false,
    "body" : "7 years ago",
    "username" : "one11travel",
    "timestamp" : "2024-12-22 21:23:51"
  }, {
    "reported_comment" : false,
    "body" : "I mean more like why didn’t you get a hotel in the city and just chill there until you organized a flight?",
    "username" : "Yotsubato",
    "timestamp" : "2024-12-23 01:12:31"
  }, {
    "reported_comment" : false,
    "body" : "Because I was 22 years old traveling on my company dime and relying on them to help me out. I know I didn’t do things right, but I was young, dumb, and broke. I just went with it in the moment and it wasn’t terrible.",
    "username" : "Inevitable_Brag_5507",
    "timestamp" : "2024-12-23 04:16:37"
  }, {
    "reported_comment" : false,
    "body" : "Because some people need visas for that, and if their single entry Schengen visa has been used up, then you are sleeping in an airport. ",
    "username" : "traumalt",
    "timestamp" : "2024-12-23 10:14:55"
  }, {
    "reported_comment" : false,
    "body" : "22 years old and going on international business trips 😱 NZ gotta step up its job game 😔",
    "username" : "fuckimtrash",
    "timestamp" : "2024-12-23 08:15:42"
  }, {
    "reported_comment" : false,
    "body" : "It’s Singapore. Which has visa free entry for Australians and Europeans. They also mentioned they went on a city tour so they did enter the country.",
    "username" : "Yotsubato",
    "timestamp" : "2024-12-23 14:31:09"
  } ]
}