{
  "id" : 200096,
  "community_name" : "Napoli",
  "username" : "simongaslebo",
  "post_body" : "Razzismo solo online",
  "timestamp" : "2024-12-22 18:04:13",
  "num_comment" : 38,
  "reported_post" : false,
  "comment" : [ {
    "reported_comment" : false,
    "body" : "beh di base si, su internet tutti fenomeni per il meme di turno, poi li conosci dal vivo e ti dicono che la nonna è di Ponticelli e che la sfogliatella è buonissima.\n\nDiciamo che nella maggior parte dei casi quello che vedi su internet non è vero razzismo ma principalmente ironia di discutibile qualità, come quello per cui i calabresi sono scimmie, i veneti mangiano i gatti e i cinesi ce l'hanno piccolo\n\nRicordate ragazzi; ognuno è terrone a qualcun'altro, se beccate un milanese che vi sfotte ricordategli che per uno Zurighese par e pall",
    "username" : "Space_Carmelo",
    "timestamp" : "2024-12-22 18:04:13"
  }, {
    "reported_comment" : false,
    "body" : "Io ti posso dire di non aver avuto una gran bella accoglienza a Torino",
    "username" : "laUnpo_nerdxD",
    "timestamp" : "2024-12-22 18:09:34"
  }, {
    "reported_comment" : false,
    "body" : "Mah insomma, tra colleghi e conoscenti, di battute su Napoli ne sento in continuazione. Io non sono di Napoli, immagino che quindi le battute non vengano fatte in presenza dei napoletani per cui ti sembra che il fenomeno irl non esista. \n\nMa basta vedere come è stato trattato Geolier a San Remo non più tardi di qualche mese fa...di razzismo ce n'è eccome anche offline, mi sa che tu vivi in una bolla (e meglio così!).",
    "username" : "palace8888",
    "timestamp" : "2024-12-22 18:23:24"
  }, {
    "reported_comment" : false,
    "body" : "Per chi visita Napoli e scopre di persona che \"non è così male come si dice\", c'è un effetto stupore che porta le persone a parlarne bene, anche le sfumature meno belle sono in realtà parte dell'esperienza verace e in qualche modo piace.\n\nOnline ci trovi chi non c'è mai stato o ci manca da anni, quando chiedo se sono venuti di persona negli ultimi anni perdono immediatamente la parola",
    "username" : "Expensive-Cup6954",
    "timestamp" : "2024-12-22 19:00:42"
  }, {
    "reported_comment" : false,
    "body" : "Non ti sei mai accorto che tutti i discorsi online funzionano così?",
    "username" : "Xaendro",
    "timestamp" : "2024-12-22 22:51:47"
  }, {
    "reported_comment" : false,
    "body" : "Perché fondamentalmente i ratti se ne stanno nelle fogne.",
    "username" : "Radagast92",
    "timestamp" : "2024-12-22 18:09:16"
  }, {
    "reported_comment" : false,
    "body" : "Quello che succede online non sempre rispecchia la realtà, e questo vale per tutto.",
    "username" : "Alessioproietti",
    "timestamp" : "2024-12-22 19:56:52"
  }, {
    "reported_comment" : false,
    "body" : "Ho vissuto per qualche anno a Como e lavoravo in un azienda Svizzera al di la del confine, e li me ne sono sentite dire varie, non gravi, le solite cazzatine sui meridionali sfaticati, rumorosi, ritardatari, etc., ma mi sembravano dette scherzando, e ai miei conoscenti del posto non mancava un po’ di autoironia.\nOvviamente la mia esperienza è aneddotica, quindi va presa per quello che è, ma ho notato una forte correlazione inversa tra titolo di studio e razzismo: in palestra c’era un gruppetto di pitecantropi riottosi che facevano pugilato, e quelli erano tutti fascistoni razzisti; esperienza completamente diversa con le persone conosciute sul lavoro o che, in generale, avevano studiato ed erano più esposti a culture e punti di vista diversi. Curioso anche notare che questi ultimi vivevano a Zurigo e tornavano in Ticino solo per il week end, per stare con la famiglia e gli amici. Mi faceva un po’ ridere notare come i ticinesi fossero i “terroni” della Svizzera, gli italiani del nord “terroni” dei ticinesi, i meridionali “terroni” dei settentrionali, nordafricani e albanesi “terroni” dei meridionali, etc, e in generale siamo tutti terroni di qualcuno. Poi Salvini ha usato questa retorica per venire a prendersi i voti al sud, e purtroppo ha funzionato, e questa cosa non mi fa ridere più. Il razzismo fa cacare.",
    "username" : "Mister_Spaccato",
    "timestamp" : "2024-12-23 00:46:29"
  }, {
    "reported_comment" : false,
    "body" : "Forse certe cose brutte non vengono dette in presenza di altri napoletani (come ha detto qualcuno), oppure alcuni sfogano online le loro frustrazioni. \nSu r/Italia è pieno di razzismo contro i napoletani, anche da parte di altri meridionali o campani. Poi c'è chi dice che è una città sopravvalutata artisticamente perchè ha visto solo Via Toledo, la stazione centrale e il murales di Maradona.\nIo che abito in provincia, quando parlo di Napoli con gente di altre regioni o di altre province della Campania, sottolineo sia gli aspetti positivi e sia gli aspetti negativi (che ci sono in TUTTE le città del mondo)! Non sono nè razzista verso la mia città e nè megalomane.",
    "username" : "Dreamerboy02_",
    "timestamp" : "2024-12-22 18:45:52"
  }, {
    "reported_comment" : false,
    "body" : "Perché nella vita reale tocca incontrare i milanesi",
    "username" : "Tozzoloo",
    "timestamp" : "2024-12-22 19:39:48"
  }, {
    "reported_comment" : false,
    "body" : "Lo fanno perché di persona hanno paura di prendere una coltellata",
    "username" : "Mission_Experience34",
    "timestamp" : "2024-12-23 07:50:33"
  }, {
    "reported_comment" : false,
    "body" : "No , il razzismo è nella vita quotidiana",
    "username" : "Spiritual-Pen584",
    "timestamp" : "2024-12-23 10:31:44"
  }, {
    "reported_comment" : false,
    "body" : "Vivo all'estero e da gente di altre nazioni non lo percepisco ne offline ne online. Percepivo un po di sguardi strani da certi italiani che vivono qui quando ancora mi rivolgevo in maniera amichevole. Oggi con gli italiani parto freddissimo e rimangono spiazzati. Devi invertire il gioco di potere.",
    "username" : "TheGreatMason",
    "timestamp" : "2024-12-22 18:47:22"
  }, {
    "reported_comment" : false,
    "body" : "Non direi \"solo\" online ma \"soprattutto online. Purtroppo su internet ci sentiamo tutti in diritto di fare i fenomeni. Dal vivo ho assistito e anche subito discorsi/frasi razziste, ma per fortuna la maggior parte delle persone riesce ad andare oltre i pregiudizi e i meme.",
    "username" : "vagabondse",
    "timestamp" : "2024-12-22 18:51:08"
  }, {
    "reported_comment" : false,
    "body" : "A me mi hanno detto che alle spalle te le dico... Davanti sembravano aver superato la questione terrone... Ma non è così, insomma penso che per loro stai sempre rubando un posto di lavoro",
    "username" : "Significant_Fee8932",
    "timestamp" : "2024-12-23 07:30:00"
  }, {
    "reported_comment" : false,
    "body" : "Online una volta un imbecille mi disse “sei di Napoli peró parli bene l’italiano”\n\nPoi vabbè vari ultras veronesi,sempre online mi hanno chiamato terrone di m3rda,coler0so e altre amenità,tutto nella norma.\n\nIl razzismo esiste eccome anche irl,anche in forme più subdole,semplicemente non l’ho mai sperimentato di persona.",
    "username" : "Shinygreenapples",
    "timestamp" : "2024-12-23 10:59:13"
  }, {
    "reported_comment" : false,
    "body" : "verissimo, sono stato di recente a Torino e ho incontrato dei turisti bolognesi che non la smettevano di complimentarsi per la bellezza di Napoli, a cui si sono aggiunte due ragazze siciliane (eravamo in un punto turistico) che hanno detto di non vedere l’ora di tornare. E mi è sempre successo questo parlando della nostra città irl in altre parti di Italia, anche durante competizioni, anche all’estero.",
    "username" : "Disastrous_Stick_254",
    "timestamp" : "2024-12-22 18:23:05"
  }, {
    "reported_comment" : false,
    "body" : "noi napoletani non è che siamo tutti riconoscibili, un napoletano può essere benissimo biondo con gli occhi azzurri (i famosi svizzeri di Sarno o i mercenari dei Borbone, vedi anche Heidi), fare i fessi con noi mica è facile...\n\nanche perché poi uno di noi può anche essere responsabile alle assunzioni o dirigente nelle aziende dove il fesso di turno lavora...",
    "username" : "Caratteraccio",
    "timestamp" : "2024-12-23 11:31:21"
  }, {
    "reported_comment" : false,
    "body" : "L'Italiano è fortemente razzista ma se ne vergogna tantissimo al tempo stesso. Quindi di presenza sì, saranno pure cordiali ma a porte chiuse come parlano di te non lo puoi sapere.",
    "username" : "Bladespa",
    "timestamp" : "2024-12-23 12:58:00"
  }, {
    "reported_comment" : false,
    "body" : "Uguale esperienza mia a torino...chiamato \"simpaticamente\" terrone almeno un paio di volte,un altra occasione hanno insinuato che fossi uno sfrattato di casa,inoltre per cercare casa non potevo chiamare i proprietari a telefono sennò sentivano l accento e mi appendevano. Tutto questo con un lavoro e un contratto indeterminato da professionista. Senza parlare delle app di incontri o semplici amicizie...ghostato tre quattro volte appena dicevo di essere di napoli",
    "username" : "scartiloffista",
    "timestamp" : "2024-12-22 19:14:16"
  }, {
    "reported_comment" : false,
    "body" : "Racconteresti di qualche episodio?",
    "username" : "Additional-Space-152",
    "timestamp" : "2024-12-22 18:23:07"
  }, {
    "reported_comment" : false,
    "body" : "I feel you bro",
    "username" : "amdinistraotr",
    "timestamp" : "2024-12-23 00:17:50"
  }, {
    "reported_comment" : false,
    "body" : "Ma è proprio quello che sto dicendo. Non sto negando il razzismo verso i napoletani, ma che si limitano quando in presenza di napoletani per paura. \n\nOnline sembra che tutti odiano Napoli, poi irl personalmente non ho mai subito razzismo, e il mio accento non lo nascondo.",
    "username" : "simongaslebo",
    "timestamp" : "2024-12-22 18:30:35"
  }, {
    "reported_comment" : false,
    "body" : "Non oso immaginare poi nel tuo caso \"aaah Salerno, vabbè napoli praticamente\"",
    "username" : "Duratorq",
    "timestamp" : "2024-12-23 11:43:57"
  }, {
    "reported_comment" : false,
    "body" : "Posso capire tutto ciò che dici è allucinante come si comportano",
    "username" : "laUnpo_nerdxD",
    "timestamp" : "2024-12-22 19:26:29"
  }, {
    "reported_comment" : false,
    "body" : "Ragazzi .. ma non andateci a Torino, evitate quella città di merda con gente troglodita e ottusa. Ma hai mai sentito parlare di un torinese che abbia fatto qualcosa di importante per l'umanita oppure mai incontrato un torinese in giro per il mondo ? Mai ..Ma Che sprofondino pure all'inferno.Sono invidiosi perché nonostante la vittoria della guerra nel 1860 di quella famiglia di codardi dei loro Savoia, Napoli resta milioni di volte più bella di quel cimitero di zombie piemontese",
    "username" : "MarcoJuanPedro",
    "timestamp" : "2024-12-23 12:00:40"
  }, {
    "reported_comment" : false,
    "body" : "Anche semplicemente il dire cornetto al bar invece di croissant e venire sbeffeggiata, o quando appena qualcuno sente l'accento di giù alza il sopracciglio e ti guarda con superiorità. Insomma nessuno ti viene a dire palesemente in faccia mi fai schifo ma te lo dimostrano giornalmente",
    "username" : "laUnpo_nerdxD",
    "timestamp" : "2024-12-22 18:35:49"
  }, {
    "reported_comment" : false,
    "body" : "Beh è normale che in presenza, le offese siano minori. Ma io ti sto dicendo che da non napoletano, battute ne sento in continuazione. Più che paura, é che quando sei adulto non ridi più in faccia alla gente come faresti in terza media, e si preferisce sfottere il sud insieme a un piemontese o a un veneto",
    "username" : "palace8888",
    "timestamp" : "2024-12-22 18:47:56"
  }, {
    "reported_comment" : false,
    "body" : "Ahahah vabbè è risaputo Napoli fagocita un po’ tutto nell’immaginario collettivo,ad ogni modo sono nato a Napoli per cui è una cittá che porto sempre nel cuore.",
    "username" : "Shinygreenapples",
    "timestamp" : "2024-12-23 11:45:05"
  }, {
    "reported_comment" : false,
    "body" : "Se la cosa ti può far stare più serena, quando dal nord vado al sud le reazioni per brioche invece di cornetto sono le stesse, così come la reazione per le vocali aperte invece che chiuse, è semplice campanilismo, comune a tutto lo stivale",
    "username" : "aospfods",
    "timestamp" : "2024-12-23 08:29:09"
  }, {
    "reported_comment" : false,
    "body" : "Non è la prima volta che sento di questo atteggiamento a Torino per i meridionali in generali. \n\nFortuna che ormai a Torino ci sono più meridionali che Torinesi, hai buone probabilità di evitarli e voglio vedere come la portano avanti l'attività con la metà dei clienti!",
    "username" : "Expensive-Cup6954",
    "timestamp" : "2024-12-22 18:54:55"
  }, {
    "reported_comment" : false,
    "body" : "No, gli italiani sono proprio codardi che si sentono forti solo se circondati dalla loro tribù. A una festa in Regno Unito, uno dei paesi dove ho vissuto, un tizio veneto provò a fare una battuta molto offensiva sui napoletani aspettandosi la stessa reazione che di solito riceverebbe tra i suoi simili. Al notare che gli inglesi e altri stranieri non ridevano ma lo guardavano con perplessità (non esiste all'estero la moda di stuzzicare continuamente i napoletani), si mise subito in riga. Sono abbastanza viscidi a dire la verità.",
    "username" : "TheGreatMason",
    "timestamp" : "2024-12-22 19:00:37"
  }, {
    "reported_comment" : false,
    "body" : "i meridionali possono essere i peggio autorazzisti",
    "username" : "moreproteinspls",
    "timestamp" : "2024-12-22 22:37:12"
  }, {
    "reported_comment" : false,
    "body" : "Mah non è vero dai, ogni paese ha i suoi sfottò interni. In Spagna hanno addirittura provato a ottenere l'indipendenza della catalugna qualche anno fa, ma pure Francia e Germania hanno bei dissidi interni\n\nMa poi mi parli di UK che sono appena usciti dall'Europa dicendo che gli rubiamo i soldi e il futuro.....non mitizziamo l'estero per ogni cosa pls",
    "username" : "palace8888",
    "timestamp" : "2024-12-22 19:12:38"
  }, {
    "reported_comment" : false,
    "body" : "Sto dicendo che in 10 anni all'estero, in tre nazioni diverse, da napoletano non ho percepito nessun odio ne online ne offline. L'odio per i napoletani è una cosa prettamente italiana e l'italiano si sente autorizzato ad esprimerlo solo quando ha attorno altri italiani che lo condividono. Appena lo metti fuori dalla sua cerchia di italiani haters, censura tutto.   \nNon mitizzo l'estero, ma se noto che all'estero non mi odiano e nella mia nazione si, il mio affetto per la mia nazione si ruduce e la mia simpatia per altre nazioni aumenta per forza di cose.",
    "username" : "TheGreatMason",
    "timestamp" : "2024-12-22 19:18:02"
  }, {
    "reported_comment" : false,
    "body" : "Ma in che senso?\n\n>L'odio per i napoletani è una cosa prettamente italiana\n\nÈ ovvio, I napoletani sono italiani, perché un francese dovrebbe odiare I napoletani? Non capisco il nesso, perdonami",
    "username" : "palace8888",
    "timestamp" : "2024-12-22 19:21:27"
  }, {
    "reported_comment" : false,
    "body" : "Ci sono comunità napoletane all'estero eppure non sono diventati target di razzismo come (purtroppo e non condivido) provenienze mediorientali e nordafricane. \n\nQuindi non credo che l'odio per i napoletani in Italia sia una conseguenza automatica di difetti dei napoletani, dopotutto gli italiani non odiano allo stesso modo palermitani, catanesi e foggiani che sono pieni di mafia, problemi sociali, inciviltà e via dicendo. È una moda diffusasi per dinamiche ignoranti.",
    "username" : "TheGreatMason",
    "timestamp" : "2024-12-22 19:28:33"
  }, {
    "reported_comment" : false,
    "body" : ">Ci sono comunità napoletane all'estero eppure non sono diventati target di razzismo\n\ninfatti lo sono gli _italiani_ non solo diretto verso il sud lol",
    "username" : "gabrielish_matter",
    "timestamp" : "2024-12-22 20:05:40"
  } ]
}