{
  "_id" : "4ff87fa4-90c0-4965-a7a8-e64e3e83ee97",
  "community" : "Napoli",
  "username" : "AntonioRex_",
  "post" : "Franceso Emilio Borrelli ",
  "timestamp" : "2024-12-22T20:32:33Z",
  "numcomment" : 30,
  "reportedpost" : false,
  "comment" : [ {
    "reportedcomment" : false,
    "_id" : "e28a7858-d23f-41ef-a345-a87661d71649",
    "body" : "Certi modi saranno anche sbagliati per contrastare i disagi su Napoli ma credo che sia l’unico sul territorio ad occuparsene seriamente.",
    "username" : "Major_Employee3087",
    "timestamp" : "2024-12-23T01:33:16Z"
  }, {
    "reportedcomment" : false,
    "_id" : "2d3f5203-ef8d-49d2-bbaa-3c4f36913a60",
    "body" : "Personalmente ho sentito pareri contraddittori e se qualcuno può darmi informazioni ne sarei felicissimo\n\nDa una parte per quello che ha fatto all'ospedale Sanpaolo è una cosa stupenda e meravigliosa, mi è piaciuto moltissimo e lo ringrazio.\n\nMa dall'altra ho sentito (e non ancora verificato) cose del tipo che sua madre aveva degli immigrati in affitto in condizioni terribili, oppure che inveiva contro una madre in lutto perché il figlio 13/14 enne rapinatore era morto ed era solo colpa sua e del figlio.\n\nEdit\n\nPoi per come affronta quelle fogne a cielo aperto, per me fa bene e avremmo dovuto fare tutti così ma da molto tempo e non girare la testa dall'altro lato come abbiamo fatto (mi metto anche io dentro) e come facciamo per poi lamentarci che tutto fa schifo. La situazione sarebbe stata molto diversa ora.",
    "username" : "Less_Ad8891",
    "timestamp" : "2024-12-22T21:49:57Z"
  }, {
    "reportedcomment" : false,
    "_id" : "0ae5c3a8-8eda-4c0e-abfb-5d5f19b493fc",
    "body" : "Ho assistito personalmente a una sua incursione il fine settimana scorso. Tendenzialmente è quello che hanno scritto altri, motivazioni giustissime ma modalità eccessive. Quello che penso però è che se ci fossero più persone come lui anche meno teatrali (noi stessi in primis) ci sarebbe meno bisogno di questi personaggi qui, quindi per ora ben venga Borrelli.",
    "username" : "dnosr",
    "timestamp" : "2024-12-23T11:52:36Z"
  }, {
    "reportedcomment" : false,
    "_id" : "d3e46efb-1923-40e2-837b-309d323fd498",
    "body" : "Le cause che porta avanti Borrelli sono giuste ma è la sua modalità che a mio avviso è totalmente sbagliata. Talvolta con le persone si pone in modo aggressivo e provocatorio, quasi a voler istigare una reazione e poter così dire di essere rimasto vittima dei violenti mentre svolgeva il suo ruolo. Un rappresentante delle istituzioni dovrebbe comportarsi in maniera più seria e non andare in giro a fare le classiche sceneggiate.",
    "username" : "_Giulio_Cesare",
    "timestamp" : "2024-12-22T22:18:45Z"
  }, {
    "reportedcomment" : false,
    "_id" : "f99991d4-cf00-4760-95a9-f374bc75daee",
    "body" : "ne parla male ma ha letteralmente le stesse strategie comunicative di salvini",
    "username" : "seliro",
    "timestamp" : "2024-12-22T22:34:35Z"
  }, {
    "reportedcomment" : false,
    "_id" : "4f1da215-1f9c-45c3-b75a-02c211cd5e4d",
    "body" : "È un tiktoker",
    "username" : "Obeah__Man",
    "timestamp" : "2024-12-23T01:02:55Z"
  }, {
    "reportedcomment" : false,
    "_id" : "bb03b63c-493a-4d62-931d-a3e4c38d5317",
    "body" : "E per quelli che non sanno chi è, è possibile un riassunto? Wikipedia non mi è di grande aiuto",
    "username" : "hk__",
    "timestamp" : "2024-12-23T08:10:24Z"
  }, {
    "reportedcomment" : false,
    "_id" : "3e5c7127-642b-49d0-9d2d-5268e40c0125",
    "body" : "C'è molta teatralità,ma sicuramente è l unico politico della Campania che fa qualcosa.il sindaco è perennemente assente nelle questioni di sicurezza.",
    "username" : "Southern_Area_9791r",
    "timestamp" : "2024-12-23T14:02:56Z"
  }, {
    "reportedcomment" : false,
    "_id" : "3c151eef-4a04-46a5-8f2a-7fdf3786becb",
    "body" : "La causa può essere nobile ma lui è uno sciacallo",
    "username" : "Frvncisk",
    "timestamp" : "2024-12-22T21:18:49Z"
  }, {
    "reportedcomment" : false,
    "_id" : "04d28faf-a39d-40ba-894a-80bdb8a9994a",
    "body" : "Lui è un politico e come tale ha bisogno di visibilità. E grazie alla sua teatralità ottiene proprio la visibilità.\nRiguardo il combattere la criminalità, quali sono stati i benefici del suo approccio? È diminuita la criminalità? \nA parte vincere qualche piccola battaglia localizzata, per il resto non si ottiene nulla rispetto a quello che c’è nella globalità della provincia a livello di criminalità.\nPer combattere la criminalità non basta una persona, non basta un politico; si deve partire da un cambio culturale e di mentalità che richiede volontà, soldi, benessere, infrastrutture.",
    "username" : "PiE81",
    "timestamp" : "2024-12-23T12:11:03Z"
  }, {
    "reportedcomment" : false,
    "_id" : "c0c8868f-c5ce-49f9-a573-b6f98032f242",
    "body" : "Totalmente inutile, per quello che vuole combattere serve solo carcere duro e multe salatissime, e se non vengono pagate carcere ancora più duro, con lavori forzati per pagare il soggiorno.",
    "username" : "MenIntendo",
    "timestamp" : "2024-12-22T20:35:30Z"
  }, {
    "reportedcomment" : false,
    "_id" : "16a8c101-c024-4927-afb0-ac82857859a2",
    "body" : "Sai com'è la gente tramite i social si fa un opinione ancora più sbagliata di Napoli, diciamo che il suo format è \"datemi pieni poteri perché la città è allo sbando e io aggiusterò le cose \"si è fatto una buona propaganda lo devo ammettere,ma ha risolto ben poco",
    "username" : "Significant_Fee8932",
    "timestamp" : "2024-12-23T06:39:17Z"
  }, {
    "reportedcomment" : false,
    "_id" : "d0a233e6-44cd-4bfd-86d6-cad31fe5cdef",
    "body" : "L'unico bene che Borrelli fa è a sé stesso",
    "username" : "Ashamed-Addendum-661",
    "timestamp" : "2024-12-22T20:32:33Z"
  }, {
    "reportedcomment" : false,
    "_id" : "16b0aca9-9998-4bb8-94ee-55e3ad64828a",
    "body" : "È senza dubbio eccessivamente teatrale, ma è proprio questa la sua forza e il suo successo, battersi per le piccole cose come se fossero le più gravi mancanze o disagi della città, vi faccio un esempio: mentre lui faceva una live per un pilone di cemento antitraffico sradicato a Piazza del Plebiscito per la finale di X factor, la viabilità cittadina era saltata a causa di un gravissimo incidente in tangenziale che aveva causato 3km di coda in tutte le direzioni. Le macchine si erano riversate in città e anziché documentare le gravi mancanze dell'amministrazione comunale sulla gestione delle strade, la prevenzione sugli incidenti, la sicurezza ecc. si accaniva su un pilone brutto e rotto di trent'anni fa. \nQuesto per fare capire quanto sia lontana la battaglia che lui porta avanti dalle reali esigenze della cittadinanza, o dai più essenziali servizi o infine da una normale qualità della vita, che a Napoli non si percepisce.",
    "username" : "ozname94",
    "timestamp" : "2024-12-23T08:55:16Z"
  }, {
    "reportedcomment" : false,
    "_id" : "671a4360-5464-4089-a58c-c8e059572cda",
    "body" : "Mi sta sul cazzo",
    "username" : "marianoktm",
    "timestamp" : "2024-12-22T20:39:17Z"
  }, {
    "reportedcomment" : false,
    "_id" : "8385acd6-a90e-4646-becb-622207df6af8",
    "body" : "Penso che sia un po' un pagliaccio, e non condivido per niente la sua idea di come si combattono il crimine e il degrado, però al contempo ammiro il fatto che si spenda con molta energia per (nella sua testa) rendere Napoli un posto migliore.",
    "username" : "CarloneBombolone",
    "timestamp" : "2024-12-23T12:40:24Z"
  }, {
    "reportedcomment" : false,
    "_id" : "ff91a0d3-472b-4e13-9685-c4824448885d",
    "body" : "La domanda delle domanda : Senza social avrebbe fatto lo stesso queste battaglie?",
    "username" : "AntonioRex_",
    "timestamp" : "2024-12-23T12:21:07Z"
  }, {
    "reportedcomment" : false,
    "_id" : "cd35afc1-5c7d-4d0a-aedb-9d64937e873c",
    "body" : "Le questioni infamanti sono fomentate dalla parte di Napoli a cui dà fastidio. Ovviamente non è un santo ma anche se fosse che la mamma fosse implicata in qualcosa… a chi frega? Per me fa un servizio dove porta alla luce quelle cose che a Napoli tutti sanno ma di cui tutti hanno paura di cambiare.",
    "username" : "Qui_percaso",
    "timestamp" : "2024-12-23T07:40:33Z"
  }, {
    "reportedcomment" : false,
    "_id" : "3e36cbdb-5fbc-4d6c-a773-63ff9751c771",
    "body" : ">Ma dall'altra ho sentito (e non ancora verificato) cose del tipo che sua madre aveva degli immigrati in affitto in condizioni terribili,\n\nChe la madre faccia qualche cazzata irregolare é possibile e personalmente ritengo probabile, purtroppo i figli non possono scegliersi i genitori.\n\nSul caso in questione però c'è da ricordare che a fare il video diffamatorio e a chiamare i vigili fu un parcheggiatore abusivo. I vigili arrivarono e verificarono la situazione senza trovare nulla da imputare alla madre, dato che il contratto c'era e che come l'inquilino mantiene l'ordine in casa non é responsabilità del proprietario.\n\n>oppure che inveiva contro una madre in lutto perché il figlio 13/14 enne rapinatore era morto ed era solo colpa sua e del figlio.\n\nI modi di Borrelli sono pienamente e fortemente discutibili, ma come gli si può dare torto sul tema: se a 13/14 tuo figlio scende la notte a fare rapine, il 99% della colpa é dei genitori. Se poi quando muore, tu madre o padre ti stracci le vesti di dosso, per un figlio di cui non te ne sei mai importato veramente, e pretendi pure di farlo passare per Santo, là pure Ghandi avrebbe frenato le mani.",
    "username" : "andxj",
    "timestamp" : "2024-12-23T08:36:45Z"
  }, {
    "reportedcomment" : false,
    "_id" : "be2c7d62-3ba9-4a8d-a451-23a3a51ff128",
    "body" : "É una persona, oggi deputato se non sbaglio, che crede fermamente nella teoria delle \"finestre rotte\", ovvero quella teoria che sostiene che affrontare piccoli crimini e atti di vandalismo contribuisce a prevenire crimini più gravi, poiché si trasmette l'idea che l'ambiente è sotto controllo.\n\nCon contenuti social prova a spingere la politica locale e nazionale, ma anche l'opinione popolare, verso un modello di sicurezza per la città di Napoli sull'orma di quello che fu dato a New York dal sindaco Rudolph Giuliani:\n\n- Maggiore presenza di polizia nei quartieri.\n\n- Arresti per crimini minori, come il salto dei tornelli della metropolitana.\n\n- Tolleranza zero verso ogni forma di illegalità.\n\nLe principali battaglie a Napoli sono quindi state contro parcheggiatori e ormeggiatori abusivi, scaricatori di rifiuti seriali, occupatori di case comunali, ecc.\n\nQuesto tipo di ideologia però porta anche a scontrarsi in maniera forte, quasi avessi davanti un camorrista, anche con chi commette piccole irregolarità, come buttare la spazzatura fuori dall'orario consentito. Ciò lo fa risultare falso e teatrale, oltre che senza misura.",
    "username" : "andxj",
    "timestamp" : "2024-12-23T08:54:40Z"
  }, {
    "reportedcomment" : false,
    "_id" : "d8570a4b-557e-4a4f-8115-95d7d902d359",
    "body" : "In realtà questa é una tematica che Borrelli espone anche in parlamento, venendo però ignorato non contando quasi nulla lì.",
    "username" : "andxj",
    "timestamp" : "2024-12-23T08:39:44Z"
  }, {
    "reportedcomment" : false,
    "_id" : "5d86dfa2-b5e1-4be3-a91a-f4803339713a",
    "body" : "Inasprire le pene non ha mai prevenuto il crimine",
    "username" : "Tipo_Dell_Abisso",
    "timestamp" : "2024-12-22T22:24:44Z"
  }, {
    "reportedcomment" : false,
    "_id" : "eee1c2c9-1809-43c4-819c-504168ba7425",
    "body" : "Guarda non mi pare proprio, visto che rischia letteralmente che un giorno lo facciano fuori. Onore a lui",
    "username" : "sickmind10",
    "timestamp" : "2024-12-22T23:13:38Z"
  }, {
    "reportedcomment" : false,
    "_id" : "9d7c58cc-3ca8-4e62-9468-c14506d1a5da",
    "body" : "Mi domando però cosa ci sia di nocivo nelle sue azioni per me cittadino di Napoli",
    "username" : "andxj",
    "timestamp" : "2024-12-23T09:00:51Z"
  }, {
    "reportedcomment" : false,
    "_id" : "9dee7111-23a1-4ada-8710-354d0b548b69",
    "body" : "Grazie!",
    "username" : "hk__",
    "timestamp" : "2024-12-23T13:09:50Z"
  }, {
    "reportedcomment" : false,
    "_id" : "686cf8c7-4eaf-4c65-8b4d-9a29670df4e7",
    "body" : "Infatti, già far rispettare quelle che ci sono attualmente sarebbe un successone.",
    "username" : "Suna96",
    "timestamp" : "2024-12-22T22:38:06Z"
  }, {
    "reportedcomment" : false,
    "_id" : "cbad8390-217a-4480-a10d-c63eb25217f6",
    "body" : "Guarda potrei tranquillamente passare ORE a spiegarti per quale motivo la gogna mediatica in generale non serve assolutamente a niente, tant'è vero che lo stato moderno abbandona tale concetto per un tipo di pena differente con finalità differenti (per approfondire ti suggerisco Foucault) e per quale motivo un sistema di tipo panopticoniano alla lunga porta solo svantaggi (per approfondire ti suggerisco Bentham), ma sinceramente vista la tua risposta e visti i downvote probabilmente sprecherei solo tempo.\n\nBorrelli è poco più di un tiktoker e infinitamente meno di un giornalista/politico. Andare a riprendere i parcheggiatori abusivi urlando \"CIALTRONE!!!\" non crea nessuna conseguenza, anzi, solo una: quella di dare visibilità a Borrelli stesso. Il parcheggiatore dopo 5 minuti sta di nuovo la a fare quello che faceva prima. Risultato per il sociale? Nessuno. Risultato per l'ego e per le tasche di Borrelli? Immaginalo. Oltretutto c'è un motivo per cui se la prende con due signore che vendono le coca-cola sulla spiaggia e non va nelle piazze di spaccio situate a 20 metri da dove si fa riprendere.\n\nOvviamente io NON STO dalla parte di chi delinque, parcheggiatori abusivi, bibitari e quant'altro, ci mancherebbe. Ma il modus operandi di Borrelli è vergognoso ed è finalizzato solo ed unicamente a sé stesso.",
    "username" : "Ashamed-Addendum-661",
    "timestamp" : "2024-12-23T06:35:04Z"
  }, {
    "reportedcomment" : false,
    "_id" : "726a7763-0cb5-4905-803e-a2c69dad8950",
    "body" : "Non è nocivo, ma inutile e improduttivo rispetto alle reali esigenze della cittadinanza: a me sta bene che toglie dalla strada i parcheggiatori abusivi, ma se per tornare a casa dal lavoro ci metto due ore e mezzo, a me cittadino comune che paga le tasse, cosa interessa? Se per una visita medica si devono aspettare mesi o pagare, a cosa mi giova che fa rimuovere le macchina da Ciro a Mergellina? Lo stesso discorso possiamo farlo per gli asili comunali e le scuole. In quanto Parlamentare avrebbe di gran lunga la forza di impegnarsi per ottenere dei risultati, invece si concentra su queste piccole vittorie.",
    "username" : "ozname94",
    "timestamp" : "2024-12-23T09:13:04Z"
  }, {
    "reportedcomment" : false,
    "_id" : "9fdfdaeb-ed5c-45f2-8637-72322fc06fc5",
    "body" : "Se interessasse davvero risolvere i problemi si fa investendo ed educando, punire non funziona manco coi cani. Purtroppo non interessa, o non conviene",
    "username" : "Tipo_Dell_Abisso",
    "timestamp" : "2024-12-23T01:07:44Z"
  }, {
    "reportedcomment" : false,
    "_id" : "b8204629-9740-4306-af6c-df90dce24c01",
    "body" : "Cominciamo dal fatto che tutto ciò lo fa da molto prima di diventare parlamentare e, per quanto possa essere inutile il 90% delle volte, non c'è nulla di nocivo per il cittadino, quindi non c'è motivo di rigettare queste iniziative, anzi meglio avere un Borrelli che un comune cittadino che asseconda solo l'ambiente che trova. \n\nLe sue azioni alla fine sono nocive solo a Borrelli stesso perché alla fine dei conti viene etichettato solo come persona che fa dirette e TikTok, facendo scivolare nell'ombra le iniziative parlamentari.\n\nSe vai a vedere gli interventi in aula di Borrelli, trovi molto per il territorio campano che non riguarda in alcun modo le sue \"battaglie\" social, ma che invece toccano l'abusivismo edilizio, i sostegni alle imprese agricole, le discrepanze territoriali per le tariffe assicurative, il contrasto all'apologia mafiosa, la gestione delle risorse idriche e tanto altro. \n\nTutte queste cose però nessuno le sa, perché passa e diventa popolare solo il video in cui urla Cialtrone! per 10 minuti.",
    "username" : "andxj",
    "timestamp" : "2024-12-23T09:27:30Z"
  } ]
}