{
  "Id" : 50363,
  "Community_name" : "Madrid",
  "Username" : "Emmanuel_I",
  "Post_body" : "Por qué frenar a Madrid nos empobrecería a todos rápidamente",
  "Timestamp" : "2024-12-23 08:14:56",
  "Num_comment" : 47,
  "reported_post" : false,
  "Commenti" : [ {
    "Username" : "N1A117",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 08:41:03",
    "Body" : "Pero quien está frenando Madrid?"
  }, {
    "Username" : "kossttta",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 09:16:07",
    "Body" : "Yo sinceramente a estas alturas me contentaría con deslocalizar ministerios y agencias y organismos públicos, sinceramente. Que según qué políticos tuviesen que salir de la M30 de vez en cuando. Con eso ya me contentaría."
  }, {
    "Username" : "pmac881",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 09:57:46",
    "Body" : "Gran forma de publicitar el libro de este señor. Al final esto no deja de ser wishful thinking; Los gobiernos regionales y central tienen planes urbanísticos y de transporte hasta 2030 por lo menos."
  }, {
    "Username" : "Juanindaliano",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 08:22:14",
    "Body" : "Estoy leyendo su libro Madrid DF, y tras 100 paginas es mejor de lo que esperaba.  Te hace pensar recordando cosas que ya conocías pero no conectabas.  \nEl articulo dice que hay que construir 150mil viviendas en Madrid al año, imposible para cualquier gobierno por el monto que supone, el dinero privado es necesario.  Si, Socimis y fondos y personas nacionales e internacionales tienen que poner $$$.  \n\nEs injusto? No nos gusta? Puede ser.  A la ley de la gravedad no le importa lo que piense yo.  \n\nNada puede llenar la España vaciada, en todo caso un Madrid exitoso puede subvencionar para que no falten servicios allí."
  }, {
    "Username" : "fogelfors",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 09:25:34",
    "Body" : "Le dijo el lobo a los corderos.....q"
  }, {
    "Username" : "jarilop",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 10:27:58",
    "Body" : "Hay un debate abierto que será más intenso este año entrante. No se trata de frenar Madrid. \nSe trata de que Madrid use el dinero público como debería. \nMiren las Universidades, la Sanidad, el dinero público se esparce por centros concertados que encarecen el servicio y saturan el público al verse minimizado. \nLa derecha está usando un discurso de mal uso de los impuestos pero es la derecha quien prioriza centros privados y no hace llegar recursos a lo público. \nEso y decir que no reciben suficientes recursos cuando se recortan impuestos a grandes fortunas.\nContinuadamente en el tiempo está política está creando un daño irreparable."
  }, {
    "Username" : "rm_enfurecido",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 08:38:31",
    "Body" : "Madrid es un oasis en la meseta. \n\nNo sé quien podría pensar que frenar el crecimiento de la región podría ser positivo para otros sitios (bueno si, la izquierda supongo, que se creen que los programadores de Madrid van a mudarse a Soria). \n\nLo que hay que hacer es reforzar las regiones limítrofes con Madrid: Ávila, Guadalajara, Toledo, Segovia... toda esa zona debería estar muy bien conectada con la ciudad y a medida que vaya creciendo Madrid irán creciendo el resto. \n\nUn ejemplo que me gusta es Toledo con el parque de atracciones Pui Du Fou, no se ha colocado en Madrid pero atrae a todos los vecinos de Madrid, la principal beneficiada es Toledo que dispone de más oferta de ocio y turismo, pero complementa a la vez la oferta de ocio de Madrid, y mucha gente trabaja en Pui Du Fou pero vive en Madrid. \n\nLo importante es mejorar bien el transporte público, yo incluso imagino AVES-lanzadera que han Segovia - Madrid, Toledo - Madrid, Ávila - Madrid y Guadalajara - Madrid, parando en Nuevos Ministerios y Atocha. El de Segovia existe, son 30 minutos, pero yo metería ese servicio en el abono transporte."
  }, {
    "Username" : "clonehazard",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 08:14:56",
    "Body" : "Procura leer mas periódicos y no tanto panfleto."
  }, {
    "Username" : "AMerchantInDamasco",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 10:01:06",
    "Body" : "Varios sectores, por ejemplo, las acusaciones de dumping fiscal por reducir impuestos a los ciudadanos madrileños. Ciertos sectores de la izquierda llevan tiempo estudiando fórmulas para suprimirla, o corregir esta decisión de los ciudadanos madrileños centralizadamente, como se hizo con el impuesto de patrimonio en toda España aprobado en 2022 para frenar el movimiento de fortunas a Madrid por tener bonificado el impuesto de patrimonio anterior.\n\nOtro ejemplo son los discursos populistas que frenan la construcción de vivienda en Madrid, haciendo imposible su crecimiento."
  }, {
    "Username" : "Ludens0",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 09:39:32",
    "Body" : "¿No se iba a hacer eso hace años?\n\nPor mi también. Sinceramente los políticos no aportan nada estando en Madrid (ni en ninguna parte), así por lo menos se descongestiona un poco el centro."
  }, {
    "Username" : "ozdalva",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 08:41:51",
    "Body" : "Ese argumento también se usó en UK, y ahora UK tiene un problema grave de desigualdad regional que le impide progresar.\n\nNo estoy de acuerdo que ni tanto ni tan poco. Es bueno que Madrid progrese, no es bueno que sea un paraiso fiscal dentro de España para hacer dumping fiscal subvencionado por los ciudadanos de forma indirecta."
  }, {
    "Username" : "kossttta",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 09:18:19",
    "Body" : "Es que, sinceramente:\n- creo que sí hay cosas que pueden llenar la España vaciada o, al menos, frenar la sangría\n- y no sé si España quiere vivir subvencionada por Madrid. Mi\nimpresión como no madrileño es que no, de hecho"
  }, {
    "Username" : "Emmanuel_I",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 12:07:59",
    "Body" : "Madrid usará los recursos públicos que genera y que le son transferidos como quiera su gobierno ¿no? Para eso les votan. ¿Qué problema tienes con eso?"
  }, {
    "Username" : "ozdalva",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 08:43:16",
    "Body" : "Nadie creo que piense seriamente frenar madrid. Pero no es bueno tampoco converger en madrid, como dices. Hay que descentralizar un poco algunas cosas, se hace en USA, Alemania... al final si no se acaba con efecto Londres de agujero negro fiscal."
  }, {
    "Username" : "Neuromante",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 11:53:46",
    "Body" : "> que se creen que los programadores de Madrid van a mudarse a Soria\n\nDurante la pandemia muchos programadores de Madrid se volvieron a sus respectivas ciudades de origen. Y los que estaban trabajando en empresas medio serias que no están forzando la vuelta a las oficinas no han vuelto o se han cambiado a empresas que permiten el trabajo en remoto."
  }, {
    "Username" : "Ludens0",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 09:36:51",
    "Body" : "El Confidencial es de lo poco serio que queda en España."
  }, {
    "Username" : "j1mb",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 08:37:02",
    "Body" : "Panfleto, dice.\n\nEl Confidencial es de los pocos medios que publica verdades como puños sobre la corrupción del PSOE, los apaños de Sánchez y su entorno (familiar y profesional), y demás información que otros medios no se atreven a airear porque están comprados.\n\nQue no te guste leer verdades como puños sobre tu líder supremo no convierte dicha verdad en bulo, ni en fango.  Bolchevique."
  }, {
    "Username" : "Emmanuel_I",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 08:32:03",
    "Body" : "Muchísimas gracias. No volveré a leer el Confidencial."
  }, {
    "Username" : "kossttta",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 09:43:39",
    "Body" : "Creo que, de hecho, se está haciendo ya, pero solo con organismos nuevos. Creo que deslocalizar los existentes va a ser más complicado."
  }, {
    "Username" : "_4d2_",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 08:59:06",
    "Body" : "No es un paraíso fiscal por mucho que se repita. El impuesto de sociedades es el mismo que en toda España (menos las provincias forales donde es menor) y el irpf máximo llega hasta el 45%, solo algún punto más bajo que en el resto."
  }, {
    "Username" : "Ludens0",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 09:31:10",
    "Body" : "Al no existir una definición seria de paraíso fiscal, cualquier cosa que se me pase por la cabeza lo puede ser."
  }, {
    "Username" : "Juanindaliano",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 10:07:11",
    "Body" : "Por favor comparte, a mi me interesa.  \n\nLos artículos que leí del catedrático Fernandez Villaverde sobre la España vaciada eran desalentadores."
  }, {
    "Username" : "jarilop",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 12:26:44",
    "Body" : "El problema no es mío. Es de los madrileños.  Sus Universidades públicas no tienen recursos. Sus escuelas públicas tampoco. La sanidad igual.\nNo es solución mandar los recursos públicos a conciertos o sistemas privados.\nLa gente que trabaja no recibe salarios para financiar carreras en la privada, por ejemplo.\nLos empresarios que trabajan y gente con recursos sobrados si, obviamente. Pero ya se está dando que obreros  y gente humilde abandona Madrid. Será más agudo en el tiempo. \nY no veo muy correcto políticamente y solidario con el resto de España que sus recursos gastados en conciertos y empresa privada, luego se tome como infrafinanciacion por parte del Estado y se pidan más recursos. \nMadrid es capital si pero no motivo para tener bulas económicas aparte de ya hacerse notoria una desigualdad y una especie de sectarismo regional con el resto de España. \nSe está construyendo un Madrid para ricos, ni siquiera madrileños. \nY a la larga esto traerá sus consecuencias."
  }, {
    "Username" : "rm_enfurecido",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 08:55:43",
    "Body" : "Como que no? \n\nSi el PSOE y Podemos no dejan de hablar de unificar la fiscalidad para que nos suban los impuestos a los madrileños, lo que provocaría que las empresas que vienen a Madrid se marchen a otras ciudades como Milán, Londres o Amsterdam. \n\nNo vas a descentralizar nada en regiones aisladas, si quieres descentralizar tienes que crear una red de transporte y comunicaciones bastante grande, por mi como si llevas todos los funcionarios a Cáceres (en Madrid se viviría mejor en poco tiempo), lo que hace que Madrid crezca son las empresas privadas, y lo que tienen que crearse son empresas privadas en toda España, empresas que sepan que requiere cada región y respondan ante esas necesidades."
  }, {
    "Username" : "kossttta",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 09:12:29",
    "Body" : "Red flag: verdades como puños."
  }, {
    "Username" : "fogelfors",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 09:26:53",
    "Body" : "Y M. Rajoy que opina de todo eso?"
  }, {
    "Username" : "clonehazard",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 08:48:09",
    "Body" : "Para ser una chica con estudios de educación tienes poca. Si tus papas que te han pagado la carrera no te han enseñado a pensar y después la universidad tampoco te a dado la funcionalidad del pensamiento critico. Es un dinero tirado. Me llamas bolchevique, sin saber mis ideas ni mi filiación política. Pero de donde NO HAY no se puede sacar NADA.\n\nLos bolcheviques (en ruso: большевики, большеви́к, bolshevikí (plural) o bolshevik (singular); 21\"miembro de la mayoría\", en ruso: большинство, bolshinstvó o bol'šinstvo) eran una facción dentro del Partido Obrero Socialdemócrata de Rusia (POSDR), dirigida desde un principio por Vladímir Ilich Uliánov,"
  }, {
    "Username" : "clonehazard",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 08:37:35",
    "Body" : "Si puedes leer el confidencial, pero debes saber la cabecera periodística de donde viene y sus intereses. Prueba aleer la noticia en varios medios El Español el diario, Vospopuli , Publico, y como diria el Manuel Luque director de COLON busca Compara y si encuentras algo mejor compralo."
  }, {
    "Username" : "ozdalva",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 09:09:30",
    "Body" : "En Euskadi solo es menor para empresas pequeñas y cooperativas, para el resto creo que era 3 puntos mas incluso, en Euskadi si, es 1 punto menor.\n\nNo lo es aún por suerte a nivel sociedades (no como la city) debido a como funcionan los impuestos, ya que sociedades no es un impuesto cedido, pero se está empezando a parecer en todos los demás impuestos. Solo digo que hay que tomar notas de como les va a los vecinos que favorecen esas cosas, y evitarlo. Patrimonio, sucesiones, irpf... se estan reduciendo todos los impuestos posibles con el argumento gracioso de curva de laffer, cuando de verdad se favorece dumping fiscal de individuos, sin favorecer a la población realmente."
  }, {
    "Username" : "ozdalva",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 10:16:50",
    "Body" : "No es paraiso fiscal, como tal. Una clave de los paraisos fiscales (que si existen definiciones) es por ejemplo opacidad.\n\nPero tiene ventajas fiscales que no tienen sentido en una zona que ya tiene ventajas comparativas respecto al resto de la región. Ya tiene mejores infraestructuras, mayor población y de mayor nivel educativo, red de servicios mas completa...\n\nOís \"dumping fiscal\" o algo fiscal y os vais al extremo xD El mundo no es solo blanco o negro"
  }, {
    "Username" : "kossttta",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 10:10:56",
    "Body" : "No conozco al amigo ni a sus artículos, infelizmente. Mi opinión desinformada es que volver al pueblo es para valientes, pero las ciudades medianas tienen potencial. Yo empezaría por ahí."
  }, {
    "Username" : "Emmanuel_I",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 12:42:45",
    "Body" : "Los madrileños no tienen ningún problema. Han votado mayoritariamente esto y esto es lo que reciben."
  }, {
    "Username" : "Malcolmlisk",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 09:25:39",
    "Body" : "Tienes un cacao interesante... Cuando se habla de unificar la fiscalidad se habla de dar oportunidades a provincias que tienen a su alcance el crecimiento regional, ya sea por mano de obra, recursos naturales o poder intelectual, y que ahora mismo está siendo absorbido por Madrid. Hacer esto, impediría que nos fuésemos al mismo problema que tienen en Inglaterra con su desigualdad regional y la problemática de no vivir en la city, y podría emular a otros países donde ha sido un éxito, como Alemania.\n\nLa red de transporte de España es de las mejores del mundo. Desde servicios públicos como metro o bus hasta autovias intercomunitarias. Hasta norman Foster te lo dice en una entrevista donde alaba el sistema español.\n\nTú miedo a la izquierda te hace pensar y decir cosas que no son reales.\n\nLo de los funcionarios y tú odio hacia ellos ya tal... Supongo que sabrás que funcionario es un policía y bombero e incluso personal de limpieza."
  }, {
    "Username" : "ozdalva",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 09:11:02",
    "Body" : "Madrid no tiene diferencia en impuesto de sociedades, tu primer argumento es totalmente irrelevante, y un populismo sin fundamento.\n\nY la red de transporte de España es de la mejor del mundo, de verdad. Ferroviaria, autovias, autopistas..."
  }, {
    "Username" : "Ludens0",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 09:38:00",
    "Body" : "Que tiene que ver"
  }, {
    "Username" : "Emmanuel_I",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 08:42:21",
    "Body" : "Vospopuli me gusta mucho, gracias. Dale las gracias también a Manuel Luque director de COLON."
  }, {
    "Username" : "_4d2_",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 11:57:25",
    "Body" : "En Vizcaya y Guipúzcoa el impuesto general de sociedades es de un 24%, y baja al 20% para empresas pequeñas, ([Vizcaya](https://www.bizkaia.eus/es/web/educacion-tributaria/impuesto-sobre-sociedades-is-), [Guipúzcoa](https://www.gipuzkoa.eus/es/web/ekonomiaetazergak/impuesto-sobre-sociedades)). En Navarra es verdad que el tipo general es del 28% pero para pequeñas empresas baja al 19% o 23% ([Navarra](https://www.navarraemprende.com/trabajo-autonomo/guia-tramites/tramites-fiscales/tramites-impuesto-de-sociedades/)).\n\nLos datos de Álava no los he encontrado pero me imagino que serán igual que los de Vizcaya y Guipúzcoa."
  }, {
    "Username" : "Ludens0",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 10:39:31",
    "Body" : "¿¿?Que tiene que ver población, infraestructura, servicios o nivel educativo con fiscal??? ¿Y menos aún con paraíso o dumping?\n\nA ver, es que si llamáis a las cosas por cualquier nombre absurdo que se os pase por la cabeza... Yo voy a empezar a llamar *genocidio* al sistema foral xD"
  }, {
    "Username" : "Ludens0",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 09:35:41",
    "Body" : "Los antimadrileños te dirían que la arquitectura radial del Ave solo beneficia a Madrid y deja fuera a otras regiones."
  }, {
    "Username" : "ozdalva",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 10:42:07",
    "Body" : "Tiene que ver como incentivos a que vengan empresas, sin depender de incentivos fiscales.\n\nDe verdad, que hace falta comprensión lectora"
  }, {
    "Username" : "ozdalva",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 10:13:38",
    "Body" : "Razón no les faltaría. Se está corrigiendo por suerte, el corredor mediterràneo por ejemplo es bastante importante. Pero tenemos bastante buena infraestructura, con sus problemas.\n\nPero si has estado en UK o Francia... les damos mil vueltas. Alemania esta mejor, tb contribuye que tiene mas de 2-3 ciudades importantes, en españa la verdad hay bastante mas desigualdad regional, y eso nunca es bueno (es natural en cierta medida)"
  }, {
    "Username" : "Ludens0",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 10:52:32",
    "Body" : "Tío, fiscal significa fiscal. No \"incentivos no fiscales\".\n\nLas definiciones de las palabras son blanco y negro, significan lo que significan."
  }, {
    "Username" : "Ludens0",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 10:47:19",
    "Body" : "Pues yo pienso que la radialidad es un servicio a las autonomías, no a Madrid. Y además conectan muchas otras ciudades y autonomías entre ellas."
  }, {
    "Username" : "ozdalva",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 11:58:59",
    "Body" : "Te lo voy a explicar despacito con palabras sencillas.\n\nMi punto es que no tiene sentido que Madrid mantenga beneficios como tiene comparados con otras provincias. No afectaría a empresas, ya que realmente no tiene diferente tasa de impuesto de sociedades.\n\nLas empresas no huirían, ni ese cambio de FISCALIDAD afectaría a crear empleo, porque, de nuevo, no es un impuesto que la CAM maneje.\n\nDe hecho el motivo por el que vienen empresas a Madrid no tiene que ver con fiscalidad puramente. Tiene que ver con tener otras ventajas, como las que he explicado.\n\nPor eso encima añadir ventajas fiscales al cocktail solo conlleva a vaciar otras zonas. Es algo que actualmente ya está pasando, Madrid es un agujero negro de población, y se está aumentando con beneficios fiscales a individuos (de momento).\n\nEn mi anterior post hablo de otro tipo de ventajas no fiscales que si que tienen relevancia al tema ya que el tema no es IMPUESTOS solo, sino la centralización de todo en Madrid, y el mundo no es unidimensional, aunque a algunas personas les cueste mantener mas de dos conceptos en su cabeza. Los impuestos son un tema, y hay mas. Y si contamos que ya tiene ventaja comparativa, añadir ventajas fiscales encima significa vaciar el resto de españa, generando desigualdad regional.\n\nLuego, lo próximo es el discurso de: MADRID SUBVENCIONA AL RESTO, que esta empezando, y fue lo que movió el independentismo catalán burgués. Esto ya lo hemos vivido de hecho, y es bueno aprender de la historia."
  }, {
    "Username" : "ozdalva",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 12:22:56",
    "Body" : "Si, el tren en España es bastante bueno. Eso puede ser cierto a la vez que se dice que es Madrid-centrico, criticar algo no es decir que todo mal, es decir que se puede mejorar, y que tiene problemas.\n\nEso provoca problemas. Por ejemplo hace que varias estaciones sean claves para el transporte de toda españa. Provoca puntos únicos de fallo y retrasos.\n\nDebería haber también ciertos servicios que conecten otras ciudades clave para descargar ese tipo de tráfico de la red. De ahi el corredor mediterráneo, y también cosas como trenes de cercanías en ciertas provincias."
  }, {
    "Username" : "Ludens0",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 12:43:13",
    "Body" : "Que sí hombre, pero que hay que llamar a las cosas por su nombre. Esta pared de texto que me has puesto no tiene nada que ver con:\n\n1- Paraíso la fiscales\n2- Dumping fiscal"
  }, {
    "Username" : "ozdalva",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 12:48:31",
    "Body" : "Perdona, mucho texto, se me olvidaba que si escapa de 10 palabras hay gente que pierde capacidad de leer"
  } ]
}