{
  "id" : 200144,
  "community_name" : "Sofia",
  "username" : "Going-Bananas-here",
  "post_body" : "Как да съобщя на шефа ми че искам да съм на половин работно време за 3 месеца докато завърша университет?",
  "timestamp" : "2024-12-21 15:10:52",
  "num_comment" : 16,
  "reported_post" : false,
  "commenti" : [ {
    "reported_comment" : false,
    "body" : "> Притеснявам се че ще ми откажат а не мога да си позволя да остана без работа.\n\n\nКато ти откажат не означава, че оставаш без работа. Означава, че ако не те устройва да си работиш както до сега (и по договор) може да си търсиш ново място.\n\n\nИ не - не може да задължиш шефа ти да те приеме на непълно работно време по закон. Ако не те устройват условията в договора - напускаш. Той като те е наемал не е търсил човек на половин ден освен ако не е бил предупреден.\n\n\nКато цяло най-вероятно ще се разберете и няма да има проблем, но няма как да знаем тук. Питаш го съвсем нормално и това е..",
    "username" : "Neon-Prime",
    "timestamp" : "2024-12-21 15:33:52"
  }, {
    "reported_comment" : false,
    "body" : "Директно.",
    "username" : "Trolef",
    "timestamp" : "2024-12-21 15:10:52"
  }, {
    "reported_comment" : false,
    "body" : "В прав текст.",
    "username" : "ComfortableParty2933",
    "timestamp" : "2024-12-21 15:50:33"
  }, {
    "reported_comment" : false,
    "body" : "Прати родителите си да работят през останалите четири часа - след като толкова много настояват, сигурно ще са съгласни да имат \"skin in the game\". Може и да пробваш да им кажеш да ти направят оферта, която да бие загубите от това, че не си работила на пълен работен ден, по тяхно настояване",
    "username" : "sophos_moros",
    "timestamp" : "2024-12-22 15:05:37"
  }, {
    "reported_comment" : false,
    "body" : "Питаш го директно, но трябва да имаш план какво ще направиш ако ти откаже.",
    "username" : "nzhul",
    "timestamp" : "2024-12-22 18:58:27"
  }, {
    "reported_comment" : false,
    "body" : "Провери какви права имаш като студент. Някога имах подобен казус, за щастие работодателя беше разбран и нямаше проблем. Но помня, че имах право на повече платен отпуск и други подобни.",
    "username" : "Mikiu28",
    "timestamp" : "2024-12-22 14:39:43"
  }, {
    "reported_comment" : false,
    "body" : "Приятелката ми беше на пълно работно време, но понеже започва магистър от догодина директно говори с шефа и той ще - не ще се съгласи да мине на половинка.",
    "username" : "LinguistGuy",
    "timestamp" : "2024-12-23 09:17:55"
  }, {
    "reported_comment" : false,
    "body" : "Аз работех по 11 часа на ден за да мога да се издържам докато бях в университета.\n\nКакто се казва “how bad do you want it ?”",
    "username" : "Pig_Benis__96",
    "timestamp" : "2024-12-21 15:44:00"
  }, {
    "reported_comment" : false,
    "body" : "Писмено",
    "username" : "eggressive",
    "timestamp" : "2024-12-22 12:44:13"
  }, {
    "reported_comment" : false,
    "body" : "Когато бях студент имах колежка която се възползва от правата на студентите.",
    "username" : "Nothereortherexin",
    "timestamp" : "2024-12-23 01:08:10"
  }, {
    "reported_comment" : false,
    "body" : "Имаш платен и неплатен отпуск. Според мен няма нужда да минаваш на половин работен ден. Какво ще стане ако имаш изпит в сряда от 14:00 но тогава си на смяна? Използваш си отпуската, ако наистина ти е важно да завършиш, пък на почивки ще ходиш след това. \nСядате, говорите, обясняваш ситуацията, даваш предложение от твоя страна как биха изглеждали нещата, даваш груб график кога ще взимаш отпуските. Ако не получиш разбиране по-добре да търсиш друга работа. Ако шефът не би те подкрепил за нещо подобно, със сигурност не гледа над теб като ценен кадър, който заслужава честно възнаграждение и условия на труд.",
    "username" : "Environmental-Test87",
    "timestamp" : "2024-12-23 10:05:27"
  }, {
    "reported_comment" : false,
    "body" : "Може и да е възможно но имам хронично заболяване което усложнява нещата, иначе щях да се пробвам.",
    "username" : "Going-Bananas-here",
    "timestamp" : "2024-12-21 16:09:36"
  }, {
    "reported_comment" : false,
    "body" : "\"Мен ме експлоатираха за да мога да завърша how bad do you want и теб да те експлоатират huh liberal?\" 🤓🤓",
    "username" : "Seelenbrechen",
    "timestamp" : "2024-12-21 16:01:40"
  }, {
    "reported_comment" : false,
    "body" : "Къде учиш?",
    "username" : "fluch23",
    "timestamp" : "2024-12-21 20:04:09"
  }, {
    "reported_comment" : false,
    "body" : "Като алтернатива защо не пробваш просто да смениш работата ?",
    "username" : "Pig_Benis__96",
    "timestamp" : "2024-12-21 18:06:11"
  }, {
    "reported_comment" : false,
    "body" : "Нещо не разбирам кой те е експлоатирал. То си е за теб дали искаш да имаш висше образование или не.",
    "username" : "Pig_Benis__96",
    "timestamp" : "2024-12-21 18:05:30"
  } ]
}