{
  "Id" : 200083,
  "Community_name" : "Berlin",
  "Username" : "wet-dreaming",
  "Post_body" : "Visiting Berlin? Moving here incl. Apartment questions? Going clubbing? Have a quick question? Ask here, don't create a new thread.",
  "Timestamp" : "2024-11-19 09:27:08",
  "Num_comment" : 88,
  "reported_post" : false,
  "Commenti" : [ {
    "Username" : "MrMotte",
    "reported_comment" : false,
    "Timestamp" : "2024-11-19 09:27:08",
    "Body" : "How do ya all deal with issues in your flat?\nWe have friends that live in a Altbau flat. That flat has some black mold in the bathroom due to loose Tiles. That should be something that the landlord has to deal with, but I wonder if they can kick you out to deal with the issue. With the current flat market, it seems impossible to find a flat if the landlord decides that you can't live in your flat due to construction work."
  }, {
    "Username" : "MattWatchesChalk",
    "reported_comment" : false,
    "Timestamp" : "2024-11-19 14:25:13",
    "Body" : "With this article on the front page of world news, and me coming for a trip soon, what are these areas I should be avoiding? Are there any touristy things that would accidentally end me up in one of those areas? \n\nhttps://www.ynetnews.com/article/h1atr7kgke"
  }, {
    "Username" : "gunbuster363",
    "reported_comment" : false,
    "Timestamp" : "2024-11-20 09:36:08",
    "Body" : "just came back from Munich and I love those meat product from vinzenzmurr. Where in Berlin can I can a Krustensemmel or Leberkäse?"
  }, {
    "Username" : "gunbuster363",
    "reported_comment" : false,
    "Timestamp" : "2024-11-24 10:28:38",
    "Body" : "How often does unplanned train changing happen with DB? I had several times experience that DB wanted us to get off in a station and change to another one on another platform. e.g: The train is RE31 ( I made it up ) and we get off at Regensburg Hbf platform 1 and then wait for another RE31 on platform 4.  The change is not in the train journey schedule.\n\nThis kind of train change is making me very nervous because I have to pay attention to announcement and cannot just sleep. I am looking at ICE train ticket and I wonder whether it still happens with ICE. Thank you!"
  }, {
    "Username" : "gratitude1",
    "reported_comment" : false,
    "Timestamp" : "2024-11-24 18:26:30",
    "Body" : "Is body worlds worth €19?"
  }, {
    "Username" : "toxiccapitalist1337",
    "reported_comment" : false,
    "Timestamp" : "2024-11-25 13:01:39",
    "Body" : "Hello everyone!\n\nPlease read my situation below:\n\n* I moved to Wunderflats flat for 6 months and paid deposit for it (June 2022)\n* After 6 months, me and landlord signed a bilateral rental agreement for another year (December 2022), where I have explicitly stated that the deposit is already paid (because it was paid as per the first bullet)\n* I have moved out with 2 months notice period as per the contract to the new flat (May 2023)\n* I have asked for my deposit back in June 2023, landlord said that he first needs to find a new tenant etc + I understand that on average it can take up to 6 months to return the deposit\n* During the summer of 2023, I have reminded him about that, he was pushing back like he is still searching for a tenant\n* November 2023, I have (in a bit more ultimatum manner) requested deposit to be returned, after which landlord stopped taking calls/replying to my texts\n* November 2023 - I have sent him a warning post mail in German requesting to return the deposit\n\nI was not a member of Mieterverein back in the day (June 2022/December 2022), thus, as far as I understand I cannot claim this case to them.\n\nIn the meantime, legal counsels are somewhat not willing to help, because the amount is very small (1500 EUR).\n\nI assume this subreddit has already seen tons of such questions and, most probably, has encountered such as well - thus, what would be your line of action here? Because as of now (almost 1.5 years later), still no deposit returned...For the avoidance of doubt, I do not seek legal advice, but rather a friendly heads up/sharing your experiences in similar situations"
  }, {
    "Username" : "reddeviled-egg",
    "reported_comment" : false,
    "Timestamp" : "2024-11-25 15:54:50",
    "Body" : "Left my phone at a concert and its location has moved somewhere else today. I've tried calling but no answer yet and I'll head to a police station to report it.\n\nIs there anything else I can do to try to get it back?"
  }, {
    "Username" : "Sad_Dragonfruit_9037",
    "reported_comment" : false,
    "Timestamp" : "2024-11-25 18:24:45",
    "Body" : "are there any fleamarkets open under the week? I am visiting Monday to Friday this week"
  }, {
    "Username" : "Needs-a-Plan",
    "reported_comment" : false,
    "Timestamp" : "2024-11-25 20:29:09",
    "Body" : "Hi everyone! Can anyone recommend a great hairdresser in Berlin who’s skilled with highlights and knows how to handle curly hair? Looking for a place that’s really good with color and understands curls. Thanks in advance!"
  }, {
    "Username" : "K4bby",
    "reported_comment" : false,
    "Timestamp" : "2024-11-26 10:14:49",
    "Body" : "Hi guys! \n\nI'll be having a 7 hour layover in Berlin on 6-7th of December. While I get from the airport to the Hauptbahnhof, it will probably be around 23:00, and I was thinking of walking to Reichstag and Brandeburg Gate as it's pretty close. Would you say that walking in that area after midnight is safe?"
  }, {
    "Username" : "Relative-Classic-388",
    "reported_comment" : false,
    "Timestamp" : "2024-11-28 11:54:08",
    "Body" : "For people who got married in Denmark, did you require an apostille stamp on the certificate when registering in Berlin?"
  }, {
    "Username" : "Early-Meaning-3637",
    "reported_comment" : false,
    "Timestamp" : "2024-12-01 16:09:17",
    "Body" : "Hi,\n\nI'm a Structural Engineering from Croatia considering moving to Berlin for working there and maybe even a masters in the same field. I have a few questions and would appreciate any insights.\n\n1. For the structural/static engineers here - is my diploma valid to work as a static engineer in Berlin? What's the typical salary range in this field?\n2. Regarding housing - I've heard rent is around 1000€ for a 1 bedroom + living room unfurnished apartment. Is this accurate across all areas? Are there any more affordable neighborhoods?\n3. What are the general living costs and conditions like in Berlin? Any helpful general advice for newcomers?\n\nThanks"
  }, {
    "Username" : "ResponsibleWave5208",
    "reported_comment" : false,
    "Timestamp" : "2024-12-05 10:03:29",
    "Body" : "how to know whether a train/tram/bus stop is in C zone? I'm asking as I'm planning to buy the 29 euro berlin subscription ticket, which will only cover AB zone."
  }, {
    "Username" : "EladioFuentes",
    "reported_comment" : false,
    "Timestamp" : "2024-12-06 19:25:13",
    "Body" : "Hallo, Wohngeldempfänger\\*innen haben ja Anspruch auf das Berlin-Ticket S (Sozialticket). Aber wie verhält es sich, wenn man einen Wohngeldantrag in Beabrbeitung hat, der mehrere Monate dauert? Man kann ja nicht auf seinen Bescheid warten und so lange man auf den Bescheid warten muss, den regulären Tarif zahlen? Erstattet kriegt man das ja im Nachhinein nicht."
  }, {
    "Username" : "Tobobo4899",
    "reported_comment" : false,
    "Timestamp" : "2024-12-08 12:26:24",
    "Body" : "I will be visiting this week woth some friends and we're keen to check out some live music whilst we are here. Looking for small live music venues or open mic style shows on in the next week or so. If you or a friend is in a band and need some people to fill an audience we would love to attend!"
  }, {
    "Username" : "temporary_twig",
    "reported_comment" : false,
    "Timestamp" : "2024-12-08 13:04:57",
    "Body" : "My family are travelling from various places to share 24.12 in Berlin together. \\~10 of us arrive on this day, which means there is limited time to prepare food.\n\nI've looked at dedicated catering companies, but they require 50+ people or 500€+ minimum spend and Uber Eats scheduled delivery is only 7 days in advance.\n\nDoes anyone have experience in getting food delivered on Heiligabend in Berlin? If so, what were they? Was it burgers and fries? Goose & Dumplings? Curry? Thanks"
  }, {
    "Username" : "softlimits",
    "reported_comment" : false,
    "Timestamp" : "2024-12-09 23:04:35",
    "Body" : "Hey guys! Hubby and I are Australian and travelling in Berlin around January 25th 2025. I don't know if anyone knows Triple J's Hottest 100 but it is big in Aus and we listen every year. I know some listening parties happen around the world, but can't find details of one. Would love to be able to do this with others overseas too! Wondering if there are any listening parties happening in Berlin"
  }, {
    "Username" : "Altruistic-Air-5640",
    "reported_comment" : false,
    "Timestamp" : "2024-12-09 23:41:34",
    "Body" : "Is there a reason the S1 sometimes goes as far as Potsdam Hauptbahnhof when the last station is supposed to be Wannsee?"
  }, {
    "Username" : "SucukMustermann",
    "reported_comment" : false,
    "Timestamp" : "2024-12-10 01:09:23",
    "Body" : "🇩🇪Kennt jemand einen kostenlosen oder günstigen Parkplatz in der Nähe des Motel One Berlin Upper West? oder sollte wir das Hotel wechseln?\n\n🏴󠁧󠁢󠁥󠁮󠁧󠁿 Does anyone know a good free or cheap parking lot near the Motel One Berlin Upper West? Or should the solution be Another Hotel?"
  }, {
    "Username" : "argentgrove",
    "reported_comment" : false,
    "Timestamp" : "2024-12-10 22:18:20",
    "Body" : "My partner and I are visiting Berlin and also intend on visiting Potsdam during 25th Dec. to 31st Dec. I plan on getting the 7 day ABC pass: https://www.bvg.de/en/subscriptions-and-tickets/all-tickets/time-tickets/7-day-ticket\n\nJust to really make sure and based on what I understand of this website and public holidays, my partner can take me for free all day on the 25th, 26th, 28th, 29th, and 31st on my ABC pass? \n\nIf so, can I also purchase just the daily pass for myself on the days not covered (27th and 30th?). Thank you!"
  }, {
    "Username" : "Mysterious_03",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 08:23:57",
    "Body" : "Hi everybody! Planning to move to Berlin in April/May,because new job opportunity. As I'm looking around there's not so much of a choice in finding a decent apartment. Any tips where should I look? Around 900 EUR warm there's basically nothing. Found one for 1200 EUR warm is what I say I will live happily there,fully furnished,but I find it a bit too much💶.\n\nOpen for any kind of tips,things that are good to know before moving!\n\nLiebe Grüße"
  }, {
    "Username" : "andynotwendy",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 14:49:31",
    "Body" : "Looking for a nice Christmas Market that's open today- not alex like, more classy"
  }, {
    "Username" : "TheLaw31",
    "reported_comment" : false,
    "Timestamp" : "2024-12-11 11:25:39",
    "Body" : "Hello everyone!\nMe and my girlfriend will be visiting Berlin from December 24th to December 29th, this post is for asking some locals to give us some niche things that are overlooked but the majority of the tourists and that in your opinion are worth seeing!\nGive us some Berlin hidden gems to discover!\nAny suggestion is greatly appreciated!"
  }, {
    "Username" : "Defiant_Big_8928",
    "reported_comment" : false,
    "Timestamp" : "2024-11-21 12:20:26",
    "Body" : "Is neukölln a safe area for 4 girls and a gay guy to be staying in for 5 days?"
  }, {
    "Username" : "Huskelisten",
    "reported_comment" : false,
    "Timestamp" : "2024-11-22 16:34:48",
    "Body" : "Short notice i know. My friends couldn't meet me after all. And I have only today where I can go all out (partying). Anyone in Berlin wanna meet up and have some drinks/party later today?\nM30 (not looking for hook ups)."
  }, {
    "Username" : "wekapipoop",
    "reported_comment" : false,
    "Timestamp" : "2024-11-23 07:51:22",
    "Body" : "I’m going on january!! Any recommendations of cheap places to eat german food? 10€ max if possible <3"
  }, {
    "Username" : "MaliciousOreo",
    "reported_comment" : false,
    "Timestamp" : "2024-11-22 14:02:57",
    "Body" : "Any recommendations for best food places in the city? Going on Monday for Christmas markets. \n\nAny bar recommendations would also be great!"
  }, {
    "Username" : "BillurSomer",
    "reported_comment" : false,
    "Timestamp" : "2024-11-20 16:13:58",
    "Body" : "I'm thinking of staying in Berlin and working remotely btw.10-25 December. I love Berlin but I'm unsure if the weather will be too bad and if the city will not be lively because of the weather. Is December still a good time for partying and eating out?"
  }, {
    "Username" : "MarineKing1337",
    "reported_comment" : false,
    "Timestamp" : "2024-11-20 17:37:00",
    "Body" : "Hi. Any recommendations for technoclubs near Kreuzberg? Just moved"
  }, {
    "Username" : "H3d93h0g",
    "reported_comment" : false,
    "Timestamp" : "2024-11-23 23:40:52",
    "Body" : "I'm going in June - staying at the Premier Inn near Alexanderplatz\nWhen it comes to tourism I like history - mainly Cold War history  - so plenty to offer in that aspect. Is there anywhere you think I should go to?\nI also want to experience my first gay club and gay bar - which are the best and safest to go to?"
  }, {
    "Username" : "eng33",
    "reported_comment" : false,
    "Timestamp" : "2024-11-24 16:25:40",
    "Body" : "I will be visiting around Dec 12th to see christmas markets.  There are so many it is hard to choose.  Which are the best in terms of food?  Which are the best for lighting displays? That way I can prioritize those for when it gets dark and visit the others during the day"
  }, {
    "Username" : "Sorry_Necessary_1385",
    "reported_comment" : false,
    "Timestamp" : "2024-11-24 18:31:50",
    "Body" : "Hello Berliners, hope this message finds ya'll in good health. I am moving to Berlin for a year (and perhaps longer) in mid december, which is why I need a room on rent, for which anmeldung will be possible. If you or anyone you know has a room to rent, please reach out to me. Thanks a lot!"
  }, {
    "Username" : "0k-Extreme-",
    "reported_comment" : false,
    "Timestamp" : "2024-11-29 16:37:27",
    "Body" : "Hey all, \n\nI just arrived in Berlin and will be here for three days. Staying in Kreuzberg.\n\nI’m definitely keen to party while here, any suggestions on a route to go bar hopping?\n\nAlso eager to do a tour as I’ve very interested in the history of this place, but since I’m only here for three days I’m wondering if there are any that are proven to be worthwhile time/money wise. \n\nSuggestions hugely appreciated!"
  }, {
    "Username" : "Unaccompaniedbyminor",
    "reported_comment" : false,
    "Timestamp" : "2024-12-04 16:15:36",
    "Body" : "Are there any subreddits for berlin clubs? Here for the week. Would like to explore as many clubs, meet new people."
  }, {
    "Username" : "Unhappy_Positive5741",
    "reported_comment" : false,
    "Timestamp" : "2024-12-04 20:50:54",
    "Body" : "Hi 😊\n\nWe’re going to be in Berlin on New Year’s Eve.\n\nIt was a bit last minute so I know lots of things will be booked, but we’re taking the risk.\n\nWe want a nice, formal dinner, something special that you wouldn’t do every day. Expensive is ok.\n\nPlease give any suggestions and I’ll check them out!"
  }, {
    "Username" : "Ragnarok3246",
    "reported_comment" : false,
    "Timestamp" : "2024-12-16 22:19:31",
    "Body" : "Hey there! My girlfriend and I would like to fisit berlin from 28th of April until the 2nd of May. \n\nAnyone know cheap parking spots? I cannot for the life of me find any affordable places or any clear sites that tell me where I can park."
  }, {
    "Username" : "Individual-Canary619",
    "reported_comment" : false,
    "Timestamp" : "2024-12-19 22:57:43",
    "Body" : "Hi everyone! My name is Alex an economics student from Italy, and I’ll be in Berlin tomorrow for a week to see how it is to live there bcz im considering Erasmus in Berlin and I’m super excited to explore and would love to make the most of my time there.  I’m really into cultural experiences, art exhibitions, and the techno scene (huge fan of hard techno!). If anyone is down to hang out, show me around, or even hit up some cool spots together, let me know or comment below – I’d love to make new friends during my trip.\n\nAlso, I’d be grateful for any recommendations on:\n\n* Must-visit cultural sites or museums.\n* Interesting art exhibitions currently happening.\n* Techno clubs/events worth checking out.\n* Hidden gems or unique Berlin experiences!"
  }, {
    "Username" : "According-Art4381",
    "reported_comment" : false,
    "Timestamp" : "2024-12-19 15:24:22",
    "Body" : "hello, dear all. can I have your suggestion? I planned to visit Berlin in January, and see couple of live shows and concerts maybe Kehlani, g-eazy, Kamrad,... but I do fear the coldness since I live in a warm zone. Between next January and July I don't have much time like in January. Do you think it's a good idea to travel at that time?"
  }, {
    "Username" : "stevezilla",
    "reported_comment" : false,
    "Timestamp" : "2024-11-19 10:19:33",
    "Body" : "If you have a valid contract, landlords can only kick you out for very exceptional reasons, I wouldn’t worry about that.  Getting a few tiles replaced isn’t a project that would force you to leave an apartment. \n\nFor getting them to do something there are two things I’d recommend:\n\n1. Communicate everything in writing and in German.  If I call my landlord or Hausmeister they either give me the run around or ask me to send an email anyways\n\n2. Mieterverein https://www.berliner-mieterverein.de/"
  }, {
    "Username" : "wet-dreaming",
    "reported_comment" : false,
    "Timestamp" : "2024-11-19 14:33:01",
    "Body" : "there is a thread, mostly in German here as well: [https://www.reddit.com/r/berlin/comments/1gu4agw/slowik\\_rät\\_zur\\_vorsicht\\_in\\_teilen\\_berlins\\_für/](https://www.reddit.com/r/berlin/comments/1gu4agw/slowik_rät_zur_vorsicht_in_teilen_berlins_für/)"
  }, {
    "Username" : "redwoodsz",
    "reported_comment" : false,
    "Timestamp" : "2024-11-24 17:22:58",
    "Body" : "This article is just some propaganda. Police violently arrest people at protests for nothing, and then charge them with antisemitism (many of the protestors also Jewish and queer, see scottmitzvah on Instagram). Germany is trying to cover up the rise of the far right and nazis by blaming foreigners and in particular Arabs."
  }, {
    "Username" : "wet-dreaming",
    "reported_comment" : false,
    "Timestamp" : "2024-11-20 10:16:46",
    "Body" : "Google Fleischerei or Metzger, though the stuff you mentioned is not local, it's from south Germany/Austria most butcher shops will sell it. If you ask for a Leberkässemmel here people will likely not get it, we call it \"Schrippe\". If you want something more local ask for Buletten Schrippe instead (or another one is Kassler Schrippe), with regular spicy mustard of course. You should also try a legendary Mettbrötchen in the morning, if you get the chance ;)"
  }, {
    "Username" : "sweetcinnamonpunch",
    "reported_comment" : false,
    "Timestamp" : "2024-12-13 07:43:33",
    "Body" : "After you set 2 ultimatums with a date (say 14 days), wich it looks like you did. You can do a 'gerichtliches Mahnverfahren' at your local Amtsgericht, doesn't require a lawyer at that point I think.\n\nThe landlord can keep the kaution for up to a year legally though, if there's any outstanding payments for Nebenkosten, wich may be delayed for up to a year. So it's really for after that time period, or if these payments are settled earlier."
  }, {
    "Username" : "redwoodsz",
    "reported_comment" : false,
    "Timestamp" : "2024-11-25 20:21:45",
    "Body" : "Flea markets are typically Sundays only. During the week (often Wednesdays or Fridays) there are some regular markets."
  }, {
    "Username" : "None",
    "reported_comment" : false,
    "Timestamp" : "2024-11-28 07:41:48",
    "Body" : "[removed]"
  }, {
    "Username" : "ICD9CM3020",
    "reported_comment" : false,
    "Timestamp" : "2024-11-28 16:06:08",
    "Body" : "Yes it's fine"
  }, {
    "Username" : "MediocreI_IRespond",
    "reported_comment" : false,
    "Timestamp" : "2024-11-26 12:16:48",
    "Body" : "It's mostly empty at this time of the night."
  }, {
    "Username" : "ICD9CM3020",
    "reported_comment" : false,
    "Timestamp" : "2024-12-02 12:14:15",
    "Body" : "2 rooms for 1000€ warm exist, they're just super hard to get because of the insane competition. Many new contracts will go for more than 1000€. It gets cheaper the further you are from the inner city."
  }, {
    "Username" : "Designer-Reward8754",
    "reported_comment" : false,
    "Timestamp" : "2024-12-05 11:43:59",
    "Body" : "https://www.bvg.de/de/abos-und-tickets/tarifzonen-und-tarifbestimmungen and then click on \"S- und U-Bahnnetz mit Regionalbahn (Tarifbereich ABC)\""
  }, {
    "Username" : "ICD9CM3020",
    "reported_comment" : false,
    "Timestamp" : "2024-12-09 12:54:24",
    "Body" : "A lot of restaurants might be closed on that day so it will be wise to directly confirm with a restaurant whether they will be open. On average restaurants of non-Christian background will be more likely to be open."
  }, {
    "Username" : "redwoodsz",
    "reported_comment" : false,
    "Timestamp" : "2024-12-11 23:31:57",
    "Body" : "Oooooh tough question. Also Aussie. I actually don’t know if there is anywhere here that would do this (plus timezone difference is challenging)."
  }, {
    "Username" : "ICD9CM3020",
    "reported_comment" : false,
    "Timestamp" : "2024-12-10 15:51:53",
    "Body" : "https://fbinter.stadt-berlin.de/fb/index.jsp?loginkey=showMap&mapId=parkraumbewirt@senstadt Also am Zoo direkt wirds nichts aber es gibt ja öffis"
  }, {
    "Username" : "ICD9CM3020",
    "reported_comment" : false,
    "Timestamp" : "2024-12-12 11:41:36",
    "Body" : "You would be correct. This is truly a lifehack for the Christmas time with so many holidays."
  }, {
    "Username" : "JoLeRigolo",
    "reported_comment" : false,
    "Timestamp" : "2024-12-23 09:20:06",
    "Body" : "You must go 2 to 3 metro stations away from the ring if you want a rent of less than 1000 euros/month, or go the flatshare way. Berlin flats have become crazy expensive and it's not slowing down, it's the number one topic people complain about."
  }, {
    "Username" : "bbbberlin",
    "reported_comment" : false,
    "Timestamp" : "2024-12-12 10:34:50",
    "Body" : "You need to be more specific about your interests - honestly I would start with a general tourist guide for Berlin (i.e. see links in post, etc.). Also keep in mind that many things will be closed in the time range you are visiting, and also the city will be rather empty due to holiday travel."
  }, {
    "Username" : "ICD9CM3020",
    "reported_comment" : false,
    "Timestamp" : "2024-12-12 11:40:15",
    "Body" : "I like Teufelsberg (the old Allied spying station) and Viktoriapark (a park with somewhat of a hill, which is rare for Berlin and gives a nice view)"
  }, {
    "Username" : "ICD9CM3020",
    "reported_comment" : false,
    "Timestamp" : "2024-11-22 15:58:23",
    "Body" : "yes"
  }, {
    "Username" : "1disgruntledgoat",
    "reported_comment" : false,
    "Timestamp" : "2024-11-21 18:57:06",
    "Body" : "„a safe area“. neukölln has a size of 45 km2."
  }, {
    "Username" : "Cookie007__",
    "reported_comment" : false,
    "Timestamp" : "2024-11-23 19:52:56",
    "Body" : "Try any curry wurst street food van or anything outdoors. I doubt you can find smtg German under 10€ when it comes to restaurants. Also check the supermarkets, lidl, rewe and such for some cheap food options. I can recommend Kartoffelsalat or any sort of Wurst. You can find vegan options as well."
  }, {
    "Username" : "Cookie007__",
    "reported_comment" : false,
    "Timestamp" : "2024-11-23 19:56:54",
    "Body" : "It depends very much on the cuisine you’re interested in. I’ve just started a Berlin food community maybe try ask here too \n\nhttps://www.reddit.com/r/berlinfoodies/s/XmNglEoNJj"
  }, {
    "Username" : "ICD9CM3020",
    "reported_comment" : false,
    "Timestamp" : "2024-11-22 15:57:32",
    "Body" : "Summer is better, there's no way around it. Weather is kinda bad right now and snow has become rare but at least there will be a lot of Christmas stuff going on. Parties are of course still happening. You can have a great time but I also recommend being there during a proper summer."
  }, {
    "Username" : "wet-dreaming",
    "reported_comment" : false,
    "Timestamp" : "2024-11-21 15:48:18",
    "Body" : "Ritter Butzke or Watergate, easy door tourists."
  }, {
    "Username" : "ICD9CM3020",
    "reported_comment" : false,
    "Timestamp" : "2024-11-22 15:58:49",
    "Body" : "Almost all of them are roughly in that area"
  }, {
    "Username" : "bbbberlin",
    "reported_comment" : false,
    "Timestamp" : "2024-12-06 12:12:12",
    "Body" : "There is a Berghain subreddit, but it's more for meta-discussions rather than meeting people. I would not take it seriously - there is a big difference between the \"always online\" community and the real thing. \n\nJust talk to people at the clubs. It's probably one of the few places in Germany where you can talk to random strangers, outside of like... a dog park."
  }, {
    "Username" : "MediocreI_IRespond",
    "reported_comment" : false,
    "Timestamp" : "2024-12-04 23:22:14",
    "Body" : "Yeah, any place you can get a table."
  }, {
    "Username" : "Designer-Reward8754",
    "reported_comment" : false,
    "Timestamp" : "2024-12-20 15:36:26",
    "Body" : "Just so you know May 1st is a public holiday so everything will be closed down"
  }, {
    "Username" : "Individual-Canary619",
    "reported_comment" : false,
    "Timestamp" : "2024-12-19 22:58:15",
    "Body" : "20th until 27th"
  }, {
    "Username" : "Designer-Reward8754",
    "reported_comment" : false,
    "Timestamp" : "2024-12-20 15:35:51",
    "Body" : "Just wear warm clothes with several layers of clothing. January is usually the coldest month though"
  }, {
    "Username" : "MrMotte",
    "reported_comment" : false,
    "Timestamp" : "2024-11-19 10:24:10",
    "Body" : "Thanks for the info! That takes away some of my fear of having problems myself. \nI wonder if my friend (or his dad) has a vaild contract with the landlord. Seems like the 3rd generation in sub contracts. 😂"
  }, {
    "Username" : "Needs-a-Plan",
    "reported_comment" : false,
    "Timestamp" : "2024-11-28 10:34:37",
    "Body" : "thanks. hope ypu’re well too. Did you have a suggestion?"
  }, {
    "Username" : "Early-Meaning-3637",
    "reported_comment" : false,
    "Timestamp" : "2024-12-06 23:37:23",
    "Body" : "Thanks for the answer. Do you have any recommendations of websites or pages where one would look for flats for rent?"
  }, {
    "Username" : "ResponsibleWave5208",
    "reported_comment" : false,
    "Timestamp" : "2024-12-05 12:55:06",
    "Body" : "I've already seen this, but it's quite difficult to find the stoppage or station name from the map, is there any website or app, where I can just input the name of my stoppage and it's show whether it's in a/b/c zone?"
  }, {
    "Username" : "TheLaw31",
    "reported_comment" : false,
    "Timestamp" : "2024-12-12 12:04:23",
    "Body" : "Hello and thank you for answering!\nI'm big into sport, history and music, my girlfriend really likes art, music and literature. We also like to try something local food wise so whenever we are abroad we are looking to taste what the local cuisine is like.\nThank you for the heads up, we are traveling because we are also on holiday so we can relate"
  }, {
    "Username" : "TheLaw31",
    "reported_comment" : false,
    "Timestamp" : "2024-12-12 12:04:49",
    "Body" : "Much appreciated! Thank you!"
  }, {
    "Username" : "wekapipoop",
    "reported_comment" : false,
    "Timestamp" : "2024-11-23 19:57:10",
    "Body" : "Thanks! And anything for more than 10€ but still cheap? 🫶🏻"
  }, {
    "Username" : "MarineKing1337",
    "reported_comment" : false,
    "Timestamp" : "2024-11-22 19:52:42",
    "Body" : "Do you have good tips?"
  }, {
    "Username" : "Unaccompaniedbyminor",
    "reported_comment" : false,
    "Timestamp" : "2024-12-06 13:11:01",
    "Body" : "I am absolutely doing that. Thanks for the advice. To my absolute surprise got in kitkat on Wednesday. I will just go be myself at berghain. Whatever happens, happens:)"
  }, {
    "Username" : "Designer-Reward8754",
    "reported_comment" : false,
    "Timestamp" : "2024-12-20 15:34:52",
    "Body" : "Over Christmas a lot of things will be closed (so from 24th to 26th)"
  }, {
    "Username" : "According-Art4381",
    "reported_comment" : false,
    "Timestamp" : "2024-12-21 08:55:09",
    "Body" : "thank you"
  }, {
    "Username" : "stevezilla",
    "reported_comment" : false,
    "Timestamp" : "2024-11-19 10:40:14",
    "Body" : "Tell them to join the Mieterverein.  They’ll figure that shit out and help if it your friend is a subcontractor."
  }, {
    "Username" : "MediocreI_IRespond",
    "reported_comment" : false,
    "Timestamp" : "2024-12-08 16:11:33",
    "Body" : "The good news, the contract is very much valid,if you are paying the rent for renting stuff. The bad news, the chain of responsiblity towards the respective tenant and that the original landlord might be in breach of contract with his landlord and might get kicked out and all subsequent tenants in due course as well."
  }, {
    "Username" : "sweetcinnamonpunch",
    "reported_comment" : false,
    "Timestamp" : "2024-12-13 07:37:26",
    "Body" : "immoscout.de\n\nkleinanzeigen.de\n\nwg-gesucht app\n\nThose are some places to look.\n\nnetworking helps immensely, but 1000€ budget makes it easier to find something if you're new to the city.\n\nYes, there are cheaper neighborhoods in the east and north, but they're also not that cheap. Cheapest areas are probably Marzahn-Hellersdorf, Reinickendorf, Lichtenberg and everything that's really far off."
  }, {
    "Username" : "Designer-Reward8754",
    "reported_comment" : false,
    "Timestamp" : "2024-12-05 13:53:48",
    "Body" : "Use the bvg.de site, enter the route you want to take, click on one of the options and then scroll down. There is a text, which shows you what ticket to get, whether AB etc."
  }, {
    "Username" : "Cookie007__",
    "reported_comment" : false,
    "Timestamp" : "2024-11-23 20:05:22",
    "Body" : "Schnitzelei has an option of picking 3 German food choices for 12€ on a mini plate called German tapas. \n\nI’m also running a food group, just started it today. So ask there as well maybe someone knows some more ideas. \n\nhttps://www.reddit.com/r/berlinfoodies/s/XmNglEoNJj"
  }, {
    "Username" : "Cookie007__",
    "reported_comment" : false,
    "Timestamp" : "2024-11-23 20:09:11",
    "Body" : "Also another German pub that came to my mind is Berliner Marcus Bräu right by Alexanderplatz and has very affordable food options around 12-15€ for a dish"
  }, {
    "Username" : "ICD9CM3020",
    "reported_comment" : false,
    "Timestamp" : "2024-11-22 19:56:11",
    "Body" : "If you look up \"good techno clubs for tourists\" and exclude Berghain from that then you actually get a decent selection where you have a chance of getting in"
  }, {
    "Username" : "bbbberlin",
    "reported_comment" : false,
    "Timestamp" : "2024-12-06 14:14:40",
    "Body" : "I used to go somewhat regularly, but not for some years now... if you get rejected Saturday night, try going Sunday during the day, at least in the past it used to be easier then, and Sunday was when the \"locals\" went. Berghain is pretty great... I guess the kids have some new up and coming places probably now, but even back then Berghain was special because it was always consistently good. Hope you get in and enjoy."
  }, {
    "Username" : "ResponsibleWave5208",
    "reported_comment" : false,
    "Timestamp" : "2024-12-05 20:17:10",
    "Body" : "great, thanks a lot"
  } ]
}