{
  "Id" : 50321,
  "Community_name" : "Brussels",
  "Username" : "assymetri",
  "Post_body" : "The (somewhat) failed state of support and assistance of refugees",
  "Timestamp" : "2024-12-22 19:31:02",
  "Num_comment" : 84,
  "reported" : false,
  "Commenti" : [ {
    "Username" : "BE_MORE_DOG",
    "reported" : false,
    "Timestamp" : "2024-12-22 19:33:44",
    "Body" : "The whole refugee/asylum system needs to be seriously rethought in most Western democracies. There are too many low trust countries exploiting the loopholes to immigrate and then refusing to integrate with local society or respect the native cultural values. This isn't just in Belgium. Asylum/refugee status is not for economic migrants, but more and more it's being abused for this purpose."
  }, {
    "Username" : "Thegravija",
    "reported" : false,
    "Timestamp" : "2024-12-22 19:45:54",
    "Body" : "As an Immigrant myself, it's crazy that my stay here in belgium is subject to many restrictions, if I were to ask for help from the government, it will be deducted from my score to ask fir an unlimited work permit or obtain citizenship. Even then I would never put myself in a position like that my previous employer iffered me a ruptyre conventionnel and I took it, I found anither job now, but I will not be asking fro social help in between the time."
  }, {
    "Username" : "Ok-Incident3558",
    "reported" : false,
    "Timestamp" : "2024-12-22 20:36:40",
    "Body" : "I grew up in Germany and my dad was jobless for a few years. But the German state put quite some pressure on him to get a job, so he did a lot of trainings, German language classes etc to qualify him for the job market which after years yielded a result. I have an aunt here in Belgium who has been here for 20 years, complains that her welfare isn’t high enough, worked a total of 2 years, learned some Dutch but that’s it. When I think of how much taxes I pay on my salary to fund lazy asses like my aunt I loose all respect for the Belgian state. And your story somehow confirms, that once you’re accepted in the welfare system, they stop giving a f*** and just hand out money to people who could work and not rely on welfare. Which leaves less for those who’d actually need it."
  }, {
    "Username" : "mokkkko",
    "reported" : false,
    "Timestamp" : "2024-12-22 21:33:08",
    "Body" : "I work for the government and I have seen refugees who have been here for 10+ years that havent worked at all, dont speak any french/dutch and dont get encouraged to work… all while receiving ocmw.\n\nThere should be conditions. Either you get money but pay it back after xx years or you have 1 year to look for a job while following intensive language courses…\n\nBut working is optional in Brussels 🥲"
  }, {
    "Username" : "Fahnuir",
    "reported" : false,
    "Timestamp" : "2024-12-22 20:15:34",
    "Body" : "Manchild was the most relevant word in your text. And like him, a lot of other people who like to be taken care of. This isn't a refugee problem, it's a people problem. Many if presented with someone takes care of them, will let it happen, because navigating the harshness of the world is too hard, and they likely have no concrete ambition beyond having something to eat every day, having a roof, and eventually in summer to have a stick of butter to rub on their bodies to get a nicer tan. If that's all provided for free, they'll go \"Hell yeah!\""
  }, {
    "Username" : "bxl-be1994",
    "reported" : false,
    "Timestamp" : "2024-12-22 20:58:31",
    "Body" : "When I think about how much tax I pay from my salary, it makes me furious that such situations even exist.  \n\nI’m an immigrant myself, and when I moved to this country, I found a job within two weeks. I wasn’t even an economic immigrant—I came here for an unpaid internship in Brussels after finishing my bachelor’s degree. \n\nBut I knew I needed to find a job to survive. I was sending out 50 CVs a day, and after my internship, I walked all over Brussels, handing out my CVs to restaurants/cafes/delivery companies/construction companies what not. \n\nI was doing my 40h of internship then additional 20h in a restaurant per week + French courses twice a week. God I swear I had time for everything! No days off, no excuses, no victim mentality. \n\nI honestly don’t understand some immigrants or refugees who come here expecting that someone else will take care of them. Well let me tell you something- No one cares about your ass. Everyone who was not able to find a job in a year (which is MORE THAN ENOUGH, especially with a support from the government) should be sent back or work for the society in exchange. The world is full of lazy people and they don’t deserve it."
  }, {
    "Username" : "BKacc",
    "reported" : false,
    "Timestamp" : "2024-12-22 20:53:15",
    "Body" : "Honestly it’s pretty sad seeing how certain immigrants live better doing nothing than Belgians who have to work actual jobs, sometimes even 2, just to get by. \n\nSeems like these people are more taken care of than Belgians and long term citizens who actually contribute by paying taxes etc…"
  }, {
    "Username" : "isaurareign",
    "reported" : false,
    "Timestamp" : "2024-12-23 14:13:33",
    "Body" : "Unfortunately Europe is extremely naive when it comes to migrants and it’s to our peril. We have transformed what was a high-trust continent into one of low trust through mass immigration from third countries. We assumed the best in people (that they want to work, contribute, assimilate) but ignore human nature to want to maximise resources for the least effort. Why wouldn’t they take advantage of our system when we let them? \n\nI stand by the belief that the rise of the “right wing” and euroskepticism can be traced back (and solved!) by taking a tough and fair stance on immigration and benefits."
  }, {
    "Username" : "Tasty-Bee8769",
    "reported" : false,
    "Timestamp" : "2024-12-22 19:33:38",
    "Body" : "Same with Muslims refugees, making Brusselstan a thing"
  }, {
    "Username" : "PurposefulMouse",
    "reported" : false,
    "Timestamp" : "2024-12-22 22:26:43",
    "Body" : "The Ukrainian aid comes out of the EU budget."
  }, {
    "Username" : "Hungry_Fee_530",
    "reported" : false,
    "Timestamp" : "2024-12-23 01:11:23",
    "Body" : "Me, being an European national, I’m forced to find a job within 3 months. As my wife, who is not European. Then people wonder why the far right keeps rising."
  }, {
    "Username" : "mountainspawn",
    "reported" : false,
    "Timestamp" : "2024-12-22 20:33:51",
    "Body" : "I thought in Belgium you get into an agreement to receive this monthly money: get paid 1100 euros a month and you have to be going to language courses or any other integration programmes. The ocmw can check if an applicant is doing their part, which aside from things like attending language school is also to attend regular appointments with their supervisor who helps an applicant integrate in Belgium. I've heard that the ocmw can stop giving money if an applicant stops cooperating with the agreed terms."
  }, {
    "Username" : "Quaiche",
    "reported" : false,
    "Timestamp" : "2024-12-22 23:40:26",
    "Body" : "The dude is the problem."
  }, {
    "Username" : "StashRio",
    "reported" : false,
    "Timestamp" : "2024-12-22 19:31:02",
    "Body" : "This!\n\nYou say it as it is!\n\nI find it very difficult to understand why Belgium which has the third highest public debt in all of the EU and Brussels in particular which is frankly on the verge of bankruptcy and spends more on servicing its debt than on its infrastructure, is paying €1100 a month to a Ukrainian refugee who is a young man of military fighting age. \n\nThis man should be forced to repatriate to Ukraine and fight for his country.\n\nI have also met Ukrainian  women earning this kind of income a month who are living in very cheap accommodation that they can afford outside of the main cities, and who are making no effort to move on with their lives and living on some very unrealistic dreams. A great many top up their incomes with prostitution but others are also simply vegetating in their cheap rented apartments in little villages in the middle of nowhere. They have zero intention of ever returning to Ukraine.\n\nFor the record, I hate Putin, part of my work has been in direct support of Ukraine through EU agencies, and I have nothing but respect for the Ukrainians fighting Putin. It is unfortunately a different matter for the millions who have fled the country and use the war as an opportunity to live in the west.."
  }, {
    "Username" : "LeadingGloomy",
    "reported" : false,
    "Timestamp" : "2024-12-23 07:06:52",
    "Body" : "I think there is a basic confusion in the discussion between economic migrants and refugees. \n\n“Refugee” is a temporary status under international law. You are a refugee because it is currently unsafe for you to stay in the place you were living in, so you benefit from international protection in a state that grants it. Once it’s deemed safe for you to go back to your country of origin, you are normally expected to do so (and in some countries, you actually must do so).\n\nAn economic migrant is a person that chooses to move countries in order to better their economic situation - depending on migration rules, a migrant may never be necessarily expected to go back. \n\nThis difference informs the different ways access to employment is handled for these different groups. In some countries, refugees don’t even have a right to work - because governments want to make sure they don’t develop strong ties with the country, don’t settle down and actually go back to their place of origin. In some countries you need a job offer before you even move to the host country as an economic migrant. Refugees have limited access to the job market, sometimes they can’t access employment before a given time frame, and their status is continuously tied to renewal, usually forever. \n\nNow, does this change the fact that your Ukrainian flatmate may be a lazy manchild? No. Refugees are people and you don’t need to be a good person to be a refugee. The support we provide to refugees is an act of solidarity we are offering to a person who is in danger. The support to economic migrant (ie social security, unemployment benefits) is support that is provided to workers. \n\nThis does not change the fact the people abuse the system, or that we should do better to integrate refugees and asylum seekers in our society, job market etc… But refugees are not expected necessarily to work under international law cause that’s not what the status of refugee is about."
  }, {
    "Username" : "Accomplished_Suc6",
    "reported" : false,
    "Timestamp" : "2024-12-22 20:01:09",
    "Body" : "The thing is: is you have a good system for supporting refugees (example: immediatly a house, money to live from, immediatly a somewhat job) what do you think the result will be?\n\nExactly: more and more refugees. Why? Because they immediatly get a house, get money to live from, immediatly get a somewhat job. That is the field of tention in creating a systeem for the support of refugees. Too good a systeem will eventually be its own downfall. Too bad of a systeem and you see what is happening now. \n\nBut the problem is that we just cannot handle all the refugees and immigrants here in Europe. Imagine that close to Monte Mattina in Italy we would create a camp with tents of say 16km2. [https://www.theguardian.com/artanddesign/2017/jan/27/why-ikea-flatpack-refugee-shelter-won-design-of-the-year](https://www.theguardian.com/artanddesign/2017/jan/27/why-ikea-flatpack-refugee-shelter-won-design-of-the-year)\n\nBig fence around it. Have shared toilets. Showers. Create shifts for cleaning. Create field kitchens so everybody has shifts there too (in other words: keep them busy). Few doctors. Couple of police officers. But do not let them out. Because if you let them out unsupervised that is when the shit begins. Look at Brussels. On  big open tent camp. Want to see one? Just go to Congres trainstation in the Pachecolaan. I can still remember they were sleeping in the entrence of Gallery 44. The smell of shit and urine if you walked over there was terrible. \n\nI have and will always plead for deals with Tunesia and Libya to set up camps over there for at least the refugees/immegrants from Africa to create a safe haven. But it must also be very clear to them that Europe is not for them. Like the Australians say to immigrants: Australia will not be your home. Exactly that we have to make clear to Africans: Europe will not be your home. We just cannot take the whole burden of the world on the shoulders of Europe. \n\nSecond, just go around North Station at night. We just have to start with an active resettlement program, meaning deporting people back to Africa. I am certain that nobody really know how many people actually live in Brussels. In The Netherlands everybody has to be registered. No registration? No right to anything including. You will not even be able to get a bankaccount because you have to show prove of residency. The local municipalities have to know exactly where you live. And even in The Netherlands there are illegals. But Brussels, Brussels really has turned it into a big shitshow. Or rather, Belgium.\n\nFailed support and assistance of refugees? No, rather the failed idea of open borders and the idea of mrs. Merkel \"we can do it\". We cannot do it. We simply have to say enough is enough and close for everybody and get our shit in order. And perhaps in 10 years from now,  if we really start to clean up by expelling people, we can perhaps allow people back in."
  }, {
    "Username" : "ScotsDragoon",
    "reported" : false,
    "Timestamp" : "2024-12-22 20:04:44",
    "Body" : "Lmao, taxes in action. Don't forget - they are there forever ad infinitum."
  }, {
    "Username" : "mardegre",
    "reported" : false,
    "Timestamp" : "2024-12-23 10:11:54",
    "Body" : "This is something typical of Ukrainian refugees."
  }, {
    "Username" : "Sherman140824",
    "reported" : false,
    "Timestamp" : "2024-12-23 00:33:51",
    "Body" : "It is even worse for Somali refugees who have been victims of tribal warfare for decades! My heart aches for the women and children and all the young Somalis (most of which speak decent English) who come to Europe and get little support by the state."
  }, {
    "Username" : "idontlikeflamingos",
    "reported" : false,
    "Timestamp" : "2024-12-22 21:05:05",
    "Body" : "As an immigrant myself, 10000%. The refugee/asylum system is a necessity because nobody should be forced to stay in a warzone or live in other life-threatening scenario. But there is also nothing wrong with attaching some strings to it and make sure that those who benefit from it are also giving their share of contribution to society. \n\nHave mandatory integration with language courses, have mandatory employment requirements while also having a government service that facilitates it, have regular checkpoints to renew the status and evaluate the progress. There needs to be something that allows you to separate who wants to make a life there and who is just exploiting the system, and this is not too much to ask."
  }, {
    "Username" : "frugalacademic",
    "reported" : false,
    "Timestamp" : "2024-12-22 20:55:17",
    "Body" : "We should get a system for economic migration where people can genuinely come to work. That is still lacking, resulting in many people taking an inefficient migration route. There are many knelpuntberoepen but they are not properly advertised."
  }, {
    "Username" : "idontlikeflamingos",
    "reported" : false,
    "Timestamp" : "2024-12-22 21:09:40",
    "Body" : "Yup. I have to renew my work visa every year and prove I'm still contributing to society. And yet there are refugees that got here and barely ever looked for a job. \n\nAnd honestly, I don't think it's an issue I have to jump through hoops every year. That's Belgium making sure I'm contributing with my fair share. The issue is the absolute irresponsibility on the other side that just creates an extra burden to everyone else."
  }, {
    "Username" : "SvenAERTS",
    "reported" : false,
    "Timestamp" : "2024-12-23 04:53:19",
    "Body" : "Isn't Belgium regarding migration and integration 3 countries with 3 different applications of the national framework: \"the country of\" Flanders, Brussels, Wallonia?"
  }, {
    "Username" : "walia82",
    "reported" : false,
    "Timestamp" : "2024-12-23 12:27:23",
    "Body" : "\"working for the government\" how many hours of real work do you do per day?"
  }, {
    "Username" : "ravayin",
    "reported" : false,
    "Timestamp" : "2024-12-23 11:37:37",
    "Body" : "Thank you for this burst of sanity. Really wholesome to read one of the only sane reaction here."
  }, {
    "Username" : "assymetri",
    "reported" : false,
    "Timestamp" : "2024-12-23 13:28:43",
    "Body" : "This is both a \"refugee\" and a \"people\" problem, but this post is about the former as my experience stem related to the former. \n\nAnd its not true that most people do not have more ambition beyond safety, everybody has ambitions. The problem is the inability and laziness of the state that do not encourage and incentivize every citizen, including refugees, to participate in the society and create something creative, moving, beautiful, etc. (I do not relate all of this to any sort of capitalist schemes, I have no interest of subject refugees to aimless warehouse work, aka \"not working\" is the least problem of this guy for ex).\n\nBut most people in this thread fail to understand this and and are solely stuck on the money part, so I'll probably just will delete this thread (though I should have expected all of this)"
  }, {
    "Username" : "walia82",
    "reported" : false,
    "Timestamp" : "2024-12-23 12:25:28",
    "Body" : "Indeed not only refugees but maybe even more \"real Belgians\" are just happy parasiting the system."
  }, {
    "Username" : "SvenAERTS",
    "reported" : false,
    "Timestamp" : "2024-12-23 04:59:16",
    "Body" : "This is not correct.  Normal.people, think when you were a child, you want to explore, be entrepreneurial.  It is not normal to get into a schema, where apparently the whole society seems so complicated, so few opportunities that there are not some family members, friends, study mates who call you to ask: things are booming here, I know you'd be good at ghis, we're making good money here, can you come help of course we'll pay you good money.\nAnno end 2024... with so many innovations and breakthroughs? If a society cannot cemented an economy that booms and suck everybody upwards, ... something very bad is going on."
  }, {
    "Username" : "mountainspawn",
    "reported" : false,
    "Timestamp" : "2024-12-22 20:35:23",
    "Body" : "What's that even mean? 3/4 of Brussels isn't even Muslim. And most of the Muslims in Brussels aren't from countries with the -stan suffix. Usually they're from nearby Morocco/Algeria."
  }, {
    "Username" : "andreaglorioso",
    "reported" : false,
    "Timestamp" : "2024-12-23 09:30:40",
    "Body" : "Which comes out to a large extent out of national budgets (https://commission.europa.eu/strategy-and-policy/eu-budget/news-events-and-publications/publications/fact-check-eu-budget_en) so what’s your point exactly?\n\nBut even assuming that the EU budget came entirely from other sources, it would still be more than appropriate for EU citizens to question how it is spent."
  }, {
    "Username" : "Tasty-Bee8769",
    "reported" : false,
    "Timestamp" : "2024-12-23 09:33:06",
    "Body" : "I've been a leftist all my life, but since 2021 approximately it changed. I'm now right wing because of this"
  }, {
    "Username" : "Zw4n",
    "reported" : false,
    "Timestamp" : "2024-12-22 21:04:40",
    "Body" : "Ocmw Anderlecht would like to talk to you."
  }, {
    "Username" : "ravayin",
    "reported" : false,
    "Timestamp" : "2024-12-23 11:42:59",
    "Body" : "![gif](giphy|zKsfeEYZI4Ku4)"
  }, {
    "Username" : "im-sorry-bruv",
    "reported" : false,
    "Timestamp" : "2024-12-22 20:42:53",
    "Body" : "ukrainians shouldnt be forced to die for their country- noone ever should! this is bonkers!"
  }, {
    "Username" : "nicogrimqft",
    "reported" : false,
    "Timestamp" : "2024-12-22 19:34:31",
    "Body" : "Why ?\n\nThis is basic asylum right."
  }, {
    "Username" : "DatGaanWeNietDoenHe",
    "reported" : false,
    "Timestamp" : "2024-12-23 15:12:36",
    "Body" : "And middle eastern as well"
  }, {
    "Username" : "DatGaanWeNietDoenHe",
    "reported" : false,
    "Timestamp" : "2024-12-23 15:15:03",
    "Body" : "Heavily traumatized people don't belong here imo."
  }, {
    "Username" : "distractedbunnybeau",
    "reported" : false,
    "Timestamp" : "2024-12-23 14:33:06",
    "Body" : "I remember at some point in time (around 2021) , Flanders was deliberating on making integration mandatory (integration courses, Dutch until A2 level) unless you are integrated economically (work) or educations (studies, phd, etc). \n\nNot sure if its implemented or Flanders ditched that policy."
  }, {
    "Username" : "Thegravija",
    "reported" : false,
    "Timestamp" : "2024-12-22 22:52:15",
    "Body" : "I agree, to me it only seems fair since I’m not from this country and what immigration has done in terms of abusing the social system, however this country seems to do nothing in the other side of things.\n\nIt’s also similar to how this country makes it extremely hard for you to make money and taxes the shit out of everything, while it rewards people who do nothing…how can this be maintained without it imploding on itself I do not know, even if libertarians come into office this will not change…it’s so intriguing l."
  }, {
    "Username" : "mokkkko",
    "reported" : false,
    "Timestamp" : "2024-12-23 12:51:04",
    "Body" : "8h. Not all of us don’t work, but nice try"
  }, {
    "Username" : "Fahnuir",
    "reported" : false,
    "Timestamp" : "2024-12-23 13:42:08",
    "Body" : "Nowhere did I said \"most people\". I said \"many people\". I agree this goes beyond money, and also isn't just about people being lazy. On the other hand, in a time and place where a \"state\" didn't provide all sorts of solutions, did people just linger and wasted lamenting that they were not being encouraged to participate in their own life? No. People, as I adults, had to get busy or they'd starve. Maybe they'd say a prayer to whatever God to help them out, but those prayers were a lot less efficient than a social security check at the end of the month, so they better have a plan B. Crying with a sad story and stretching a hand to get handouts was something for beggers (or con artists), not something regular people felt entitled to, because they were tired, or depressed just didn't get guidance on how to be an adult.\n\nYou said yourself that the young Ukrainian man you know won't take \"menial jobs\", because *gaps* those are beneath him. Imagine that, his royal highness having to work like a commoner. Who does the world think he is? If he can't do what he thinks he deserves, then he should be sustained by others who actually get up early every morning to go to work. Even those who pay taxes from working those \"menial jobs\" he won't take."
  }, {
    "Username" : "Fahnuir",
    "reported" : false,
    "Timestamp" : "2024-12-23 12:47:29",
    "Body" : "It's a Western society problem in general. If falls into the category of \"this is why we can't have nice things\". For example, the welfare state worked fine in Scandinavia back in the day because it was a trust base system in which people would work hard and were honest to only go seek its support when they really needed. Now even there it's falling apart, because it's abused, as there's not just those who need depending on it, but a whole bunch of freeloaders. Things are created with a certain set of rules for them to function in the way they were meant to. A lot of the rules sets on which modern civilised society was built are not working anymore, because way too many people break the rules. It's a societal problem. Something something about late stage capitalism, the fall of societies and all good things come to an end. Anyway,..  Best wishes for the holiday season to end in a more cheerful tone. 😅\n\nNote : Edited to fix gammer/spelling mistakes done from writing too fast. 😬"
  }, {
    "Username" : "Fahnuir",
    "reported" : false,
    "Timestamp" : "2024-12-23 05:12:03",
    "Body" : "Even in booming thriving societies, and they have existed thru history, parasites exist. Parasitism is a natural occurrence of nature. There may be more or less at a given moment, for many different reasons, but their existence is a fact. 🤷"
  }, {
    "Username" : "Tasty-Bee8769",
    "reported" : false,
    "Timestamp" : "2024-12-22 20:41:46",
    "Body" : "Stan doesn't mean these people come from a country that ends with \"Stan\".\n\nIt's just the way they make Brussels feel like we are in Afghanistan, or Pakistan, for instance by the amount of Muslims there are there. And not the good Muslims, the majority are not integrated, woman you see them wearing full black niqabs or burkas. You see parts of Brussels Molenbeek that don't feel like Europe anymore. \n\nThis shouldn't be the case"
  }, {
    "Username" : "Photosama",
    "reported" : false,
    "Timestamp" : "2024-12-22 20:47:01",
    "Body" : "> What's that even mean?\n\nwhy do you do this? you know exactly what he meant, why do you pretend like nobody knows what this guy is talking about. Christ man."
  }, {
    "Username" : "mountainspawn",
    "reported" : false,
    "Timestamp" : "2024-12-22 21:06:26",
    "Body" : "I didn't know you were a recipient of help from OCMW Anderlecht. "
  }, {
    "Username" : "StashRio",
    "reported" : false,
    "Timestamp" : "2024-12-22 20:45:32",
    "Body" : "Yes, invading your country, forcing you to die defending it,   is bonkers."
  }, {
    "Username" : "StashRio",
    "reported" : false,
    "Timestamp" : "2024-12-22 20:13:28",
    "Body" : "Asking for asylum is a right. Receiving it when you don’t meet the conditions is not. And neither is receiving 1100€ a month for doing nothing as a single, able bodied young man. That’s more than the minimum wage of several EU countries. And it’s equivalent to the pension paid out to large proportion\nof Belgians receiving the state pension."
  }, {
    "Username" : "ScotsDragoon",
    "reported" : false,
    "Timestamp" : "2024-12-22 20:06:40",
    "Body" : "Seeking asylum is a right. Universal access for all weeping applicants isn't."
  }, {
    "Username" : "SvenAERTS",
    "reported" : false,
    "Timestamp" : "2024-12-23 04:52:25",
    "Body" : "Isn't Belgium regarding migration and intégration 3 countries with 3 different application of the national framework: \"the country of\" Flanders, Brussels, Wallonia?"
  }, {
    "Username" : "mountainspawn",
    "reported" : false,
    "Timestamp" : "2024-12-22 20:49:11",
    "Body" : "I've yet to see the full black burqa in Belgium. Most Muslim women in Belgium don't even wear a headscarf at this point. \n\nAnd you bring Pakistan up, full black burqas are not even common amongst most Pakistanis (I grew up around a lot of them). \n\nBrussels is night and day when compared to Afghanistan. Honestly you sound like someone who's been shielded from the outside world with that dumb take. At this point just say you don't want Muslims in Belgium and be straight up with it instead of throwing out exaggerations, lies and stupid caricatures of foreign countries."
  }, {
    "Username" : "10catsinspace",
    "reported" : false,
    "Timestamp" : "2024-12-22 21:36:41",
    "Body" : "Brussels feels nothing like the Muslim world. It’s clear you’ve never traveled there.\n\nedit: got blocked so I can’t reply. What a fragile ego."
  }, {
    "Username" : "frugalacademic",
    "reported" : false,
    "Timestamp" : "2024-12-22 20:57:00",
    "Body" : "I feel that the muslims in Molenbeek are more Belgian than the EU-bubble people. Sure, they have different customs than white Belgians but the current generation speaks fairly well French, whereas the EU-bubble people infest the city with English."
  }, {
    "Username" : "mountainspawn",
    "reported" : false,
    "Timestamp" : "2024-12-22 20:50:03",
    "Body" : "When did I say nobody knows what he's talking about? I don't know why people like you and them do all these cowardly dog whistles. Just speak your minds more openly."
  }, {
    "Username" : "Zw4n",
    "reported" : false,
    "Timestamp" : "2024-12-22 21:20:38",
    "Body" : "You didn't get the joke. Did you?"
  }, {
    "Username" : "wild_wild_wild_tots",
    "reported" : false,
    "Timestamp" : "2024-12-23 11:38:20",
    "Body" : "r/whoosh"
  }, {
    "Username" : "im-sorry-bruv",
    "reported" : false,
    "Timestamp" : "2024-12-22 20:48:05",
    "Body" : "they dont have to fight tho, regardless of what russia does. the people are not the state and they have every right to not put their life on the line for it. a lot of them choose to do it with good reasons, but it should under no circumstances be obligatory."
  }, {
    "Username" : "nicogrimqft",
    "reported" : false,
    "Timestamp" : "2024-12-22 20:30:22",
    "Body" : "Anyone with a legal stay in Belgium can get about 1100€ for doing nothing from CPAS."
  }, {
    "Username" : "Frequentlyaskedquest",
    "reported" : false,
    "Timestamp" : "2024-12-22 20:55:50",
    "Body" : "How many refugee friends do you have ? Because of all the ones close to me (and its a bunch) only the Ukranians are getting things this easy"
  }, {
    "Username" : "Tasty-Bee8769",
    "reported" : false,
    "Timestamp" : "2024-12-22 21:38:38",
    "Body" : "I don't mind Muslims. I mind Muslims that can't integrate into Europe and wear Burqas and Niqabs which I've seen more than the fingers in my hand fyi. \n\nAnd also, I've lived in many countries, and I'm not shielded at all :) I want people in Europe to be integrated into OUR culture. If you move to Saudi Arabia, you would not wear a mini skirt. So why would someone come to Europe wearing their outdated clothing covering their full head"
  }, {
    "Username" : "Tasty-Bee8769",
    "reported" : false,
    "Timestamp" : "2024-12-22 21:41:15",
    "Body" : "Now you're going to say where I've gone and where I haven't 🤣 whatever suits your narrative"
  }, {
    "Username" : "Tasty-Bee8769",
    "reported" : false,
    "Timestamp" : "2024-12-22 21:35:42",
    "Body" : "I'm from the EU bubble, the point is, we act European and we dress European. \n\nIf you were in Saudi Arabia, would you wear a mini skirt ? No.\n\nSo why do this Muslim people wear this clothes in Europe? That's not integrating"
  }, {
    "Username" : "BKacc",
    "reported" : false,
    "Timestamp" : "2024-12-23 01:00:44",
    "Body" : "They might be more “Belgian” but the question is where would you feel safer to walk at night as a 18 year old girl; centre of Molenbeek or wherever the EU-bubble people hang out?"
  }, {
    "Username" : "bluemyeyes",
    "reported" : false,
    "Timestamp" : "2024-12-22 23:14:03",
    "Body" : "They were speaking their minds openly actually, and...you didn't like it."
  }, {
    "Username" : "Zw4n",
    "reported" : false,
    "Timestamp" : "2024-12-22 20:59:02",
    "Body" : "Why? Because people are fucking tired."
  }, {
    "Username" : "Photosama",
    "reported" : false,
    "Timestamp" : "2024-12-22 21:24:16",
    "Body" : "what dogwhistles, what didnt you understand about his comment?"
  }, {
    "Username" : "Frequentlyaskedquest",
    "reported" : false,
    "Timestamp" : "2024-12-22 20:59:06",
    "Body" : "That is false, even EU nationals who havent been able to pay enough taxes beforehand have the same issue...\n\nI was born here but dont have the nationality (family is spanish and moroccan, I only have the spanish papers)... when I started looking for my first job I asked if I could get help from the CPAS to pay for my insulin while searching for a job and I was told I would receive a letter of \"expulsion du territoire\" within 8 months if I tried.."
  }, {
    "Username" : "StashRio",
    "reported" : false,
    "Timestamp" : "2024-12-22 20:38:46",
    "Body" : "And I disagree with that. Such money should only be  given until a person finds work, and that person should be helped / encouraged / forced to look for work like everybody else by being monitored , or face progressive withdrawal of benefits. A war is not an excuse to have it easy."
  }, {
    "Username" : "DatGaanWeNietDoenHe",
    "reported" : false,
    "Timestamp" : "2024-12-23 15:09:50",
    "Body" : "That is a false claim, not so nice of you"
  }, {
    "Username" : "ScotsDragoon",
    "reported" : false,
    "Timestamp" : "2024-12-22 21:01:52",
    "Body" : "My official address/homeland is the UK, thankfully. We have seen enough until the new government."
  }, {
    "Username" : "mountainspawn",
    "reported" : false,
    "Timestamp" : "2024-12-22 21:56:20",
    "Body" : "There are barely any niqabis in Brussels, let alone Belgium. You are making a problem out of nothing."
  }, {
    "Username" : "OmiOmega",
    "reported" : false,
    "Timestamp" : "2024-12-23 08:57:07",
    "Body" : "Wearing a piece of clothing related to their religion is not a sign of not integrating.\n\nYou can be a practicing Muslim /jew /Buddhist /whatever and still be fully integrated.\nIntegration is speaking the language, being involved in the community, contributing to your community etc. Not \"renouncing your faith\""
  }, {
    "Username" : "Adventurenauts",
    "reported" : false,
    "Timestamp" : "2024-12-23 14:53:31",
    "Body" : "Because it's important to them. Same with kippa's for Jews, Buddhist kashayas, sikhs with turbans, you wanna police what people wear? That's not freedom."
  }, {
    "Username" : "Tasty-Bee8769",
    "reported" : false,
    "Timestamp" : "2024-12-23 09:30:31",
    "Body" : "This 100% \n\nI've been to melenbeek 3 times in more than 10 years I've been in Brussels. And it doesn't feel like Europe, there's even shops on the street written in Arabic. Not to mention the booming of the \"halal\" restaurants we've seen since a few years ago"
  }, {
    "Username" : "mountainspawn",
    "reported" : false,
    "Timestamp" : "2024-12-22 23:16:45",
    "Body" : "they werent tho. Otherwise they wouldnt have resorted to dog whistles and nonsense like Brussels feeling like Afghanistan and having women walking around in burqas."
  }, {
    "Username" : "mountainspawn",
    "reported" : false,
    "Timestamp" : "2024-12-22 21:03:09",
    "Body" : "Tired of speaking your minds plainly? I've yet to see that. It's almost always constant cowardly dog whistles. "
  }, {
    "Username" : "mountainspawn",
    "reported" : false,
    "Timestamp" : "2024-12-22 21:56:36",
    "Body" : "don't be daft"
  }, {
    "Username" : "nicogrimqft",
    "reported" : false,
    "Timestamp" : "2024-12-22 21:46:55",
    "Body" : "If you have permanent stay, (e.g. eu national in Belgium for more than 5 years), you can't be deported for being at cpas.\n\nIf you are within the first five years as an eu-national, or a non-permanent visa, you **might** get a letter (that you can contest although the probability of it going through are slim) from the office des étrangers. \n\nBut it really depends on your situation. At the CPAS they are required to tell you that, and to have you sign a paper acknowledging that you got this information, and depending on who receives you you will get different phrasing of this. When I was at CPAS (it lasted 18 months) as an eu national one Belgium for less than 3 years (together with my girlfriend in the same situation), the first person who welcomed at the CPAS told us that we **would**  get deported if we asked for it.\n\nThen we did ask for it, and when I met the counsellor in charge of my file, we discussed this, and he told me in 5 years working there it happened only once to someone he was in charge of. And that in my case it would probably never happen. \n\nAnd indeed, it never happened. \n\nI think it's all down to how temporary they evaluate your situation to be, and it's all to the discretion of the office des étrangers. The law being very imprecise, it makes it a very opaque process that's hard to predict.\n\nBut someone on a refugees visa, is by definition on a temporary situation, and someone that you do not project to send back so it make sense that they get this benefit."
  }, {
    "Username" : "legomosia",
    "reported" : false,
    "Timestamp" : "2024-12-22 20:52:18",
    "Body" : "In no relation to the post (which talks fairly about manbaby parasite who only contributes to bad image of Ukrainians abroad) I absolutely love how you’ve shown all Ukrainian men as slackers and Ukrainian women as prostitutes, great job and you really sound very unbiased."
  }, {
    "Username" : "Tasty-Bee8769",
    "reported" : false,
    "Timestamp" : "2024-12-22 21:58:23",
    "Body" : "The problem is not made by me, but by those who come to Europe and don't integrate. And there are niqabs because I've seen them plenty of times. So please"
  }, {
    "Username" : "StashRio",
    "reported" : false,
    "Timestamp" : "2024-12-22 21:00:27",
    "Body" : "What absolute BS, I never said that! Didn’t they teach you how to read?  majority of Ukrainian men and women are the bravest people in Europe right now. They are let down by large minority who have used the war as an excuse for yet more corruption and to have a life outside Ukraine. The reality of prostitution is not of my doing. This includes many Ukrainian women using easier travel rights to leave places like Odessa and spend several weeks in European capital cities working as prostitutes. ,"
  }, {
    "Username" : "SvenAERTS",
    "reported" : false,
    "Timestamp" : "2024-12-23 05:09:57",
    "Body" : "Me too. Niqabs are an everyday thing. 1/5000? But you see them every day. Chador are 1/1000? Chadors are even in Watermaal-Bosvoorde."
  }, {
    "Username" : "legomosia",
    "reported" : false,
    "Timestamp" : "2024-12-22 21:10:45",
    "Body" : "That, somehow, very closely resembles every take prigozhin’s troll factory employees post you’ll find on twitter.  \nYou say “great many”. Care to be more precise? How come you talk often to these “multiple” women and now their origins? \nOn return to Ukraine: how can you know that other part (not the “great many”), which is “simply vegetating” are not planning to go home when it’s safe? How come you also know that it’s already safe for them to return? \n\nOn a slightly more personal note: I observe you on this subreddit for quite some time, and somehow you’re always anti-everything (immigration, subsidies, Brussels governance, good move, environmentalism). At the same time, I get it you’re not from Belgium/ Brussels originally?"
  }, {
    "Username" : "StashRio",
    "reported" : false,
    "Timestamp" : "2024-12-22 21:26:23",
    "Body" : "I am not anti every thing, I just am pro what you might not agree with. And you might discover you are in agreement with me if you understand what I write. I always make excuses because for many people English is not their native language . But I think I write clearly enough.\n\nI am in favour of environmentalism and good governance to a fanatical degree , but only if effective methods are used, and unlike others I always explain what these alternative methods should be. \n\nAre you expecting me to be pro good move when it has failed just because it happens to be an initiative bracketed under environmentalism? Are you expecting me to be in favour of a Brussels administration which has also in my view failed the city on so many counts? Are you expecting me to be in favour of high taxes that stifle initiative and entrepreneurship?\n\nI am totally against the Russian invasion of Ukraine and fully support the Ukrainians in their fight against Putin. I cannot say the same for the many “refugees” who have left Ukraine. \n\nI know what I know based on my experience , which of course can only be in large part anecdotal. \n\nI am a resident of Brussels and like most residents of Brussels my origins are elsewhere. We sustain this city more than anybody else."
  } ]
}