{
  "_id" : "13f2ced2-8958-417d-99a8-f0e0484bfc6f",
  "community" : "Copenhagen",
  "username" : "NonBinaryAssHere",
  "post" : "Mandatory medical treatment in Copenhagen",
  "timestamp" : "2024-12-22T13:47:20Z",
  "numcomment" : 14,
  "reportedpost" : false,
  "comment" : [ {
    "reportedcomment" : false,
    "_id" : "cee13cfd-5d40-47e5-84d5-d7291a802d66",
    "body" : "Nothing wrong with calling the non-emergency number for the police and asking for a welfare check. I had a neighbor who (apparently?) was into murder-kinks. I called the police and they came by asking them questions, made it stop from that day.",
    "username" : "Qzy",
    "timestamp" : "2024-12-22T13:47:20Z"
  }, {
    "reportedcomment" : false,
    "_id" : "88e62b91-c84d-410f-9d6f-aba1d0412eb7",
    "body" : "It's called tvangsindlæggelse, if they dont want to go but need to: [https://www.sundhed.dk/sundhedsfaglig/laegehaandbogen/psykiatri/tilstande-og-sygdomme/tvangspsykiatri/tvangsindlaeggelse/](https://www.sundhed.dk/sundhedsfaglig/laegehaandbogen/psykiatri/tilstande-og-sygdomme/tvangspsykiatri/tvangsindlaeggelse/)\n\nYou can call 112 if a person is in danger to themself or someone else. the psychiatric emergency units are open 24 hours/day",
    "username" : "ChickEnergy",
    "timestamp" : "2024-12-22T13:48:30Z"
  }, {
    "reportedcomment" : false,
    "_id" : "d753d15a-a707-4519-85c3-20f739bd20b2",
    "body" : "My downstairs neighbour is the same. Yelling, banging in the cabinets, throwing furniture, babbling about god. Only in her apartment though, when you meet her she acts fine. Throughout the years other neighbors have shared concerns to her, but she always says she doesn’t have any idea what they’re talking about.\n\nWe have a small child and are quite scared for her, and if she’ll escalate because kids are noisy. We’ve called the police multiple times, they’ve refused to even do a mental health check. We’ve contacted the building management who didn’t do anything. \n\nSo now we’re still writing every instance down and will contact kommunen next AND continue to call the police if it sounds like she might be banging her head against things or hurting herself",
    "username" : "AmiraLaursen",
    "timestamp" : "2024-12-22T18:15:52Z"
  }, {
    "reportedcomment" : false,
    "_id" : "68ef99ec-04b1-4090-977d-ec869a3f41f3",
    "body" : "Start by documenting the disturbances (times, dates, etc.) & push your building management again with evidence. If they still do nothing, contact your Kommune about mental health concerns. They can send help if needed (I think). If it escalates or feels unsafe, call the police, they can involve psychiatric services.",
    "username" : "Head_Illustrator5510",
    "timestamp" : "2024-12-22T13:49:29Z"
  }, {
    "reportedcomment" : false,
    "_id" : "bee01e36-b303-425b-96b1-bdc4674d8b9b",
    "body" : "Maybe he’s a streaming games.",
    "username" : "Lazybones_17",
    "timestamp" : "2024-12-22T18:01:33Z"
  }, {
    "reportedcomment" : false,
    "_id" : "c2059cbe-e9f8-493c-957a-2d3f26050a06",
    "body" : "He could have severe PTSD, or going through some bad situation in his life, maybe you could consult with the landlord to see what's the best course of action, I know when I was going through a death in my family I was screaming/crying for a week before it happened",
    "username" : "saltylicorice",
    "timestamp" : "2024-12-22T16:54:07Z"
  }, {
    "reportedcomment" : false,
    "_id" : "32f4da1d-bf5f-416d-9180-03f66d20da0d",
    "body" : "I really hope its not me, cuz i do sometimes scream while gaming. Though I rarely scream at nights since usually I am aware about the time",
    "username" : "JohnGalt1133",
    "timestamp" : "2024-12-22T19:22:48Z"
  }, {
    "reportedcomment" : false,
    "_id" : "643966b2-0080-4573-b46c-2a602ad815f5",
    "body" : "Contact either the police or kommunen - maybe they have a social case on him. Police might also contact kommunen if you call them - either way this sounds like a man in pain who needs help, and might be incapable of asking for help himself.",
    "username" : "Hot-Preference-7239",
    "timestamp" : "2024-12-22T19:29:43Z"
  }, {
    "reportedcomment" : false,
    "_id" : "5ecf9947-0a15-4a22-974d-86c57a864c4c",
    "body" : "Maybe this is something for Copenhagen's 'social ambulance'? I can't remember what it's called, but it might just be something like socialbulancen. (?\nAFAIK, they're there for these types of cases when you don't want to call the police on people who might be going through something.",
    "username" : "alicethrough",
    "timestamp" : "2024-12-23T09:24:07Z"
  }, {
    "reportedcomment" : false,
    "_id" : "cf1c79c7-00de-4d88-9616-f61ca0fb31af",
    "body" : "Fucking hell, that might be worse than mine 😦",
    "username" : "NonBinaryAssHere",
    "timestamp" : "2024-12-22T14:46:36Z"
  }, {
    "reportedcomment" : false,
    "_id" : "489de0fe-5e58-413e-836e-11f806e9b2b6",
    "body" : "Agree. This person might be in danger from themselves due to psychosis/delirium. Call 114, they can send police, ambulance (who can call a doctor if necessary) or if in Copenhagen the Sociolance (social ambulance). \nIf this is your concern, I would always recommend calling first then they can take the next steps to help the (possible) patient. \nIf they decide the person is not clinically insane, then you can always document disturbances to your landlord afterwards - as it's annoying for you but not a medical emergency issue. \nHoping for the best for both of you! 🤞",
    "username" : "iSUhr",
    "timestamp" : "2024-12-22T16:08:38Z"
  }, {
    "reportedcomment" : false,
    "_id" : "c598f5a0-b2fa-4b18-aeeb-9d0973447441",
    "body" : "Thank you!!",
    "username" : "NonBinaryAssHere",
    "timestamp" : "2024-12-22T14:46:56Z"
  }, {
    "reportedcomment" : false,
    "_id" : "faad5521-5600-4fce-a2c7-bdc00b3f7a92",
    "body" : "Thank you!! I'll do as you suggested. I've been documenting with audio recordings and videos (not of him, but just to show that I have all windows closed and yet I can still hear him very clearly).",
    "username" : "NonBinaryAssHere",
    "timestamp" : "2024-12-22T14:48:51Z"
  }, {
    "reportedcomment" : false,
    "_id" : "f581c7bb-94a5-4b03-b2ea-d680181f847e",
    "body" : "I don't think so, but if that's how he sounds when he's playing games, he needs to be in a psych ward",
    "username" : "NonBinaryAssHere",
    "timestamp" : "2024-12-22T18:50:03Z"
  } ]
}