{
  "Id" : 50284,
  "Community_name" : "Prague",
  "Username" : "lWanderingl",
  "Post_body" : "So, are there going to be fireworks during this NYE in Prague? If yes, with what intensity?",
  "Timestamp" : "2024-12-23 13:49:48",
  "Num_comment" : 23,
  "reported" : false,
  "Commenti" : [ {
    "Username" : "Vergansa",
    "reported" : false,
    "Timestamp" : "2024-12-23 14:15:32",
    "Body" : "there is a ban, but not enough police to reinforce the ban. \nPeople still do it but there are no fireworks paid with taxpayer money."
  }, {
    "Username" : "DDPJBL",
    "reported" : false,
    "Timestamp" : "2024-12-23 14:03:26",
    "Body" : "There will be sporadic fireworks through the day increasing after dusk from people who want to yeet some before midnight and send their kids to bed early.  \nAs midnight approaches, things calm down, because anyone who hasnt sent their fireworks up yet is waiting for midnight.  \nAt midnigth, pandemonium.  \nAnyone and everyone will be yeeting all sorts of legal and illegal fireworks while drunk and without reading the manual.  \nIts awesome.  \nIf you dont have any fireworks yourself, you can just step outside and look in any direction and see fireworks."
  }, {
    "Username" : "Practical-Mall-5397",
    "reported" : false,
    "Timestamp" : "2024-12-23 15:17:33",
    "Body" : "I don’t care if I’m downvoted for this, but please consider this OP, since you say you love fireworks so much. \n\nThe ban is there for a reason. Each year fireworks kill thousands of birds and other wildlife. Pets get terrified even at home, because it feels like explosions right outside your window. Prague also hosts thousands of Ukrainian refugees, to whom the sound of explosions may be triggering, especially the kids. \n\nA few fireworks right at midnight would’ve been fine, but people are idiots and do it with complete disregard for others. It’s more than a week from NY and already they are exploding every night all over my neighbourhood, and then usually a few days after too. It’s impossible to have a calm fucking walk anytime on the 31st, I try to go out with my dog as early as possible before the night but even from 6 pm it’s already shitshow. Once I was walking him around 3 pm (!) and a petard blew up less than a meter away from us. \n\nWhat used to be my favourite holiday as a kid (not because of fireworks but family time) is now nothing but stress because of assholes who can’t enjoy themselves without getting wasted and exploding stuff. \n\nSo yeah fuck your fireworks. "
  }, {
    "Username" : "joemayopartyguest",
    "reported" : false,
    "Timestamp" : "2024-12-23 14:53:02",
    "Body" : "Go to Riegrovy Sady, it’s the Wild West of firework shows. I’m always shocked nobody gets hurt every year as I’ve seen fireworks being launched directly under tree branches and I’m wondering when there will be a terrible ricochet incident. You can also see fireworks going off in the distance while standing on the hill looking towards the museum."
  }, {
    "Username" : "kitsuko",
    "reported" : false,
    "Timestamp" : "2024-12-23 13:53:07",
    "Body" : "I'm assuming you're a tourist or someone who's not lived here during NYE before. Will there be an official show? No. \n\nWill there be fireworks? Yes! A metric buttload. From around when it gets dark to about when the drunks run out of fireworks and/or fall asleep. The climax of the show is around midnight, as per tradition. I'd say the level of intensity is pretty similar to that of a show paid for by most cities, but the actual fireworks are much smaller and the show lasts hours....so 10/10?\n\nIt's fun in a chaotic way. I've been just outside my flat in the local square, and above the city on a hill near petrin. It's beautiful and cool. \n\nIf you're not into fireworks......get some earplugs, hole up in as inner of a room as you can, and gird your loins."
  }, {
    "Username" : "DommyMommyKarlach",
    "reported" : false,
    "Timestamp" : "2024-12-23 13:49:48",
    "Body" : "There is some sort of ban on fireworks in Prague this year, didnt look into it that much"
  }, {
    "Username" : "kitsuko",
    "reported" : false,
    "Timestamp" : "2024-12-23 14:16:06",
    "Body" : "🤣🤣 it's so true!"
  }, {
    "Username" : "lWanderingl",
    "reported" : false,
    "Timestamp" : "2024-12-23 14:08:54",
    "Body" : "So people will straight up ignore the ban?\n#\nSry if I insist with this question, I just want to make sure I'll have a proper NYE :)"
  }, {
    "Username" : "lWanderingl",
    "reported" : false,
    "Timestamp" : "2024-12-23 13:58:34",
    "Body" : "Nah I'm VERY into fireworks, so much I was about to cancel the idea of coming to Prague if there weren't going to be any.\n#\nI still have a couple of doubts tho: how will people be able to shoot fireworks even with the ban?\n#\nSecond, are \"public\"  fireworks USUALLY (from your experience) like those used in weddings, that don't really go up in the sky? In that case I imagine I'll have to just wander the streets hoping to meet some madlads lighting them up"
  }, {
    "Username" : "DDPJBL",
    "reported" : false,
    "Timestamp" : "2024-12-23 14:22:05",
    "Body" : "1) There isnt a blanket ban. The ban is for areas near to hospitals, nursing homes, water bodies, protected natural sites and the historical city center.  \nHere is a link to a map showing the restricted areas.  \n[https://praha.eu/pyrotechnika](https://praha.eu/pyrotechnika)\n\n2) Yes, people will straight up ignore the ban.\n\n3) If the ban was a blanket ban for the whole Prague, people would ignore that one too."
  }, {
    "Username" : "Leviv8",
    "reported" : false,
    "Timestamp" : "2024-12-23 14:13:10",
    "Body" : "The ban is mostly related to the OLD CENTER area so that the drunk bri'sh lads don't fuck up the area or shove them into their asses in the middle of the square. If you go out from the center area there will be fireworks everywhere except the \"banned areas\""
  }, {
    "Username" : "zennie4",
    "reported" : false,
    "Timestamp" : "2024-12-23 14:27:02",
    "Body" : "\\> how will people be able to shoot fireworks even with the ban? \n\nIn most cases using a lighter, though some people prefer matches."
  }, {
    "Username" : "kitsuko",
    "reported" : false,
    "Timestamp" : "2024-12-23 14:14:54",
    "Body" : "Oh they're banned....but I think aside from directly in the city center there's not much enforcement. I'd say 2y back I watched a man light off some from the window of his flat, while a crowd of others lit them off behind me. \n\nLast year I was on nusle bridge and there were easily 20 groups lighting them off within 100m of us. Plus all the people around the city. Heck, there was a 20 minute display just across our block around 10pm last year. \n\nI'd recommend walking about anyways. If you could get up to the hill around the castle, that would be a nice view. Or nusle bridge. You likely won't have much trouble finding mad lads 😉 \n\nDespite any bans, fireworks are still openly sold."
  }, {
    "Username" : "freddysinger",
    "reported" : false,
    "Timestamp" : "2024-12-23 14:10:26",
    "Body" : "You are not welcome here."
  }, {
    "Username" : "AchajkaTheOriginal",
    "reported" : false,
    "Timestamp" : "2024-12-23 15:01:17",
    "Body" : "From my experience: there are places where it's known that people shoot fireworks from. It's not some underground stuff, for example one of the places is top of Venceslav Square (not sure how current it is, haven't been there since before covid), one is right on the Náměstí Míru (I've been there personally 2021/2022, watched from window year later). \n\nUsually people put the boxes of fireworks in the middle of cleared area and light them. It's all on you to be safe to yourself and to others, don't be stupid and light it until other people clear the immediate area, don't put the boxes too close to others, don't come back in until all current fireworks went off etc. Police does go around and watch out, but generally speaking they will let you be unless you're too drunk, careless, stupid to blatantly light it right before them, or something goes wrong. I saw one of the boxes go wrong, not sure what happend whether it was set too close to other fireworks or just faulty, but it kinda exploded instead of shooting fireworks straight up. Some sparks went into circle of people around the area, no major injuries just slight little burns on few people, barely noticeable. But it did get attention of police and they went closer to investigate. One guy immediately started running and they went after him, no idea what happened if they caught him or if he managed to get into house before they caught him. But the point is - they were right there where people actively shoot the fireworks, they didn't do anything until something went wrong and frankly if the guy haven't started running, they would have no idea who's fireworks did it, since there were 3 separate groups with big fireworks and multiple other people with those small pipes that just shoot sparks. \n\nNo idea if it's still like that though, I've had kids since then and there's no way I'm going out into that hell with little babies."
  }, {
    "Username" : "lWanderingl",
    "reported" : false,
    "Timestamp" : "2024-12-23 14:26:46",
    "Body" : "Lmao, and thanks for the info"
  }, {
    "Username" : "lWanderingl",
    "reported" : false,
    "Timestamp" : "2024-12-23 14:14:13",
    "Body" : "Understood, thanks :)"
  }, {
    "Username" : "lWanderingl",
    "reported" : false,
    "Timestamp" : "2024-12-23 14:27:31",
    "Body" : "No flint and steel? Pffff"
  }, {
    "Username" : "zennie4",
    "reported" : false,
    "Timestamp" : "2024-12-23 14:44:42",
    "Body" : "\\> Despite any bans, fireworks are still openly sold.\n\nBecause sale is not banned."
  }, {
    "Username" : "lWanderingl",
    "reported" : false,
    "Timestamp" : "2024-12-23 14:16:10",
    "Body" : "This is encouraging, thanks!"
  }, {
    "Username" : "lWanderingl",
    "reported" : false,
    "Timestamp" : "2024-12-23 14:10:48",
    "Body" : "Y not"
  }, {
    "Username" : "Leviv8",
    "reported" : false,
    "Timestamp" : "2024-12-23 14:16:32",
    "Body" : "Go up to Strahov maybe , I've seen people light stuff from there and it's also a bit higher than the city area so you may look around. (From higher ground)"
  }, {
    "Username" : "lWanderingl",
    "reported" : false,
    "Timestamp" : "2024-12-23 14:17:01",
    "Body" : "Good idea"
  } ]
}