{
  "_id" : "1c78ce2a-518a-4392-be4c-117e5a1e8df2",
  "community" : "Madrid",
  "username" : "Emmanuel_I",
  "post" : "Madrid consolida la remontada a Cataluña en la economía",
  "timestamp" : "2024-12-22T07:01:38Z",
  "numcomment" : 48,
  "reportedpost" : false,
  "comment" : [ {
    "reportedcomment" : false,
    "_id" : "bc61c345-ca07-4c16-92c5-6ba33c19a1cd",
    "body" : "Se les oye venir con sus insultos a una Comunidad abierta que acoge a media España, Latinoamérica y cada vez más Europa. Sin preguntar raza, idioma, origen o pensamiento político.",
    "username" : "rbopq",
    "timestamp" : "2024-12-22T15:53:32Z"
  }, {
    "reportedcomment" : false,
    "_id" : "87d86f5c-c370-4883-a91c-205178d06dfa",
    "body" : "No es una competencia.  Cuanto mejor vayan más regiones mejor para todos. \n\nY cuanto más diferentes sean los modelos económicos aplicados, mejor, así aprendemos las mejores prácticas.",
    "username" : "Juanindaliano",
    "timestamp" : "2024-12-22T07:01:38Z"
  }, {
    "reportedcomment" : false,
    "_id" : "f1ec87a1-3e87-449b-ac3c-7e6186657b0c",
    "body" : "que bonito es madrid carajo.",
    "username" : "bordalash",
    "timestamp" : "2024-12-22T18:42:01Z"
  }, {
    "reportedcomment" : false,
    "_id" : "459414f3-e8f8-4b5b-be45-764fcad1d777",
    "body" : "Que mejor momento para que Cataluña demuestre que puede ser una nación y no una comunidad subvencionada.",
    "username" : "antrax131",
    "timestamp" : "2024-12-22T08:58:35Z"
  }, {
    "reportedcomment" : false,
    "_id" : "58bdfba2-4ea8-4ed9-9c39-1fe19301ec46",
    "body" : "Cuánto peor le vaya a Cataluña y mejor le vaya a Madrid, más me alegro.\n\nQuizás debían haberlo pensado antes de lanzar el procés.. jajajajajaja",
    "username" : "j1mb",
    "timestamp" : "2024-12-22T08:33:18Z"
  }, {
    "reportedcomment" : false,
    "_id" : "e5816042-81c4-4577-8195-b98e0dd1ba5b",
    "body" : "Como madrileño me acuerdo, ¿recordáis cuando aquí gobernaba el PSOE y Chueca y Malasaña estaban atestadas de yonkis? \n\nEchar al PSOE de Madrid (más de 20 años ya) ha sido lo mejor que hemos hecho los madrileños, y ahora Ayuso esta apuntalando esto. \n\nLo que necesitamos ahora es que salga un Milei de algún lado y que la gente que gana 1000 euros al mes deje de justificar que les sigan subiendo los impuestos.",
    "username" : "rm_enfurecido",
    "timestamp" : "2024-12-22T11:17:45Z"
  }, {
    "reportedcomment" : false,
    "_id" : "a91246c2-588a-4f6d-a870-e570d592be46",
    "body" : "Solo un 0.6% por encima de Cataluña, que lastra con el proces aún. Deberías estar avergonzados madrileños jaja.",
    "username" : "alexx8b",
    "timestamp" : "2024-12-22T13:14:30Z"
  }, {
    "reportedcomment" : false,
    "_id" : "6a80a1f0-803f-4187-b5e4-d53daa27792c",
    "body" : "Bonito Agujero negro. Queda algo en las dos Castillas? o ya estan vacias del todo. Mucha suerte en ser Madrid DF.\n\n![gif](giphy|3rCopM3WyFqmlDqrZs)",
    "username" : "----aeiou----",
    "timestamp" : "2024-12-22T13:05:54Z"
  }, {
    "reportedcomment" : false,
    "_id" : "df89a278-f68b-402f-8c09-cd7052c81936",
    "body" : "Una señora en el metro me acusó de haberle robado la plaza de universidad a su hijo porque estaba hablando con mi acento andaluz",
    "username" : "Javiskii",
    "timestamp" : "2024-12-23T12:39:34Z"
  }, {
    "reportedcomment" : false,
    "_id" : "b5d8525f-ba16-47f6-873b-6a89ad3d17af",
    "body" : "No todos pueden aplicar los mismos modos económicos.\n\nNo todas las regiones tienen acceso a migrantes dispuestos a trabajar por poco, no todas tienen sol todo el año, o playas, o acceso a personas educadas.\n\nNo debería ser una competencia.. pero el dinero y el personal capacitado son recursos escasos.. y al día de hoy son Madrid y Barcelona contra literalmente el resto de España.",
    "username" : "DildoMcHomie",
    "timestamp" : "2024-12-22T08:12:32Z"
  }, {
    "reportedcomment" : false,
    "_id" : "34e4d768-7f66-4cc6-8760-dbcb34265c43",
    "body" : "Como si Madrid no estuviese subvencionada también…",
    "username" : "Aelfgan",
    "timestamp" : "2024-12-22T10:06:47Z"
  }, {
    "reportedcomment" : false,
    "_id" : "bef6e579-e2f3-4625-9e95-11b263987c2d",
    "body" : "Hasta (y si llega a) que Cataluña se independice, cuanto peor vaya peor para ti también porque es parte de tu economia, lumbreras.\n\nSi Cataluña entrase en deuda de mil trillones quien crees que la paga si son parte de España? Tu y yo.",
    "username" : "Ok_Membership_6559",
    "timestamp" : "2024-12-22T10:10:05Z"
  }, {
    "reportedcomment" : false,
    "_id" : "4b06fb06-e219-4320-8980-402af4b06216",
    "body" : "Cuanto peor les vaya mas de tus impuestos van a ir para ellos. \n\nCurioso que si pasase al reves sus impuestos no vendrian para aca... a ver si alguien saca un partido independentista madrileño y nos empezamos a aprovechar del absurdo de tener que dar dinero por 13 escaños.",
    "username" : "CrimsonTie94",
    "timestamp" : "2024-12-22T10:06:44Z"
  }, {
    "reportedcomment" : false,
    "_id" : "b38a56a5-1e99-4a03-90f6-747edb64f1da",
    "body" : "Y luego os llamáis a vosotros mismos \"patriotas\" jajaja de pacotilla",
    "username" : "Historyco",
    "timestamp" : "2024-12-22T10:15:10Z"
  }, {
    "reportedcomment" : false,
    "_id" : "e17b668c-0ff9-4b9f-adb0-210d4e52179b",
    "body" : "Vaya lumbreras estás hecho. Eso sí, luego la pulserita de España que no falte.",
    "username" : "B_mico",
    "timestamp" : "2024-12-22T14:54:16Z"
  }, {
    "reportedcomment" : false,
    "_id" : "742e829a-21f1-4172-be40-c36a708ee985",
    "body" : "Pero si el PP lleva desde hace 30 años gobernando la Comunidad de Madrid, de que hablas?",
    "username" : "TheLastRole",
    "timestamp" : "2024-12-22T13:39:12Z"
  }, {
    "reportedcomment" : false,
    "_id" : "f0a076f0-4dff-4299-a616-656fcd404efb",
    "body" : "Lo de los yonkis no se si se lo podemos simplemente colar al PSOE ya que el problema de drogas en los 80s influye bastante tanto la época (solo había que mirar otros países con esos mismos problemas cuyos gobiernos eran tanto de izquierdas como de derechas) así como la \"reciente\" caída del régimen que provocó un cambio brusco en la sociedad.",
    "username" : "FieraDeidad",
    "timestamp" : "2024-12-22T13:29:51Z"
  }, {
    "reportedcomment" : false,
    "_id" : "9032f0c1-b4e1-437a-b587-6951ff6491b8",
    "body" : "Lo que necesitamos es que nuestros impuestos se queden aqui, como se les permite a otras comunidades.",
    "username" : "CrimsonTie94",
    "timestamp" : "2024-12-22T11:21:46Z"
  }, {
    "reportedcomment" : false,
    "_id" : "5e0c61ce-245a-4805-9ce5-647d9d2037b3",
    "body" : "Me imagino que estas agradecido al colectivo LGTB que hizo posible ese cambio.",
    "username" : "Garbanzo_toscano",
    "timestamp" : "2024-12-22T11:24:10Z"
  }, {
    "reportedcomment" : false,
    "_id" : "7dfe8681-3912-419a-ab44-dc799eed0637",
    "body" : "El partido VOX (gracias al hijo puta yonki Steve Bannon) te lo agradece.",
    "username" : "mikhfarah",
    "timestamp" : "2024-12-22T13:51:42Z"
  }, {
    "reportedcomment" : false,
    "_id" : "af63dc77-1d19-4353-a6bc-6e2fe0cfbc8a",
    "body" : "En tecnología no necesitas el sol ni nada similar, y sin embargo en Asturias las empresas prefieren decirte \"este salario está calculado teniendo en cuenta los salarios de la región\", y dejarte ir. Sin embargo ellos no cobran esos servicios o bienes producidos de acuerdo a la región.\n\nY no pasa nada, porque además subvenciones las cobran igual.\n\nEn Madrid y Barcelona al menos hay competencia y un poco más de sentido común. No el suficiente, pero...",
    "username" : "early_sunshine",
    "timestamp" : "2024-12-22T11:27:57Z"
  }, {
    "reportedcomment" : false,
    "_id" : "7c2d1eaa-f83d-4098-826e-d381122ff400",
    "body" : "Tienes razón todas están subvencionadas pero sólo a Cataluña le condonar la deuda, le hacen un traje fiscal a medida y le llevan inyectando pasta como si no hubiese mañana mucho tiempo",
    "username" : "antrax131",
    "timestamp" : "2024-12-22T10:10:28Z"
  }, {
    "reportedcomment" : false,
    "_id" : "6d9a8769-c8e1-4af4-9110-98c326caae13",
    "body" : "La región que más parasita al resto es precisamente Madrid.",
    "username" : "Garbanzo_toscano",
    "timestamp" : "2024-12-22T11:00:53Z"
  }, {
    "reportedcomment" : false,
    "_id" : "5e6874b0-d035-4033-98aa-df8db9664276",
    "body" : "Es que para esta gente es muy patriota querer que se deje de recaudar una cantidad en cualquier región de España para que se pase a recaudar una cantidad menor en Madrid. Pero esto se soluciona si todo el mundo tuviese su propia hacienda.",
    "username" : "Garbanzo_toscano",
    "timestamp" : "2024-12-22T11:00:04Z"
  }, {
    "reportedcomment" : false,
    "_id" : "ce316e23-3717-44ec-9d6c-d34268d639d5",
    "body" : "Eso es. \n\nLa ministra Montero presume mucho de \"armonizar la fiscalidad\" pero solo usa esa expresión para hablar de subirnos los impuestos a los madrileños. \n\nSi quieren armonizar la fiscalidad que todas las comunidades tengamos las mismas normas, para bien y para mal y punto.",
    "username" : "rm_enfurecido",
    "timestamp" : "2024-12-22T11:25:17Z"
  }, {
    "reportedcomment" : false,
    "_id" : "42d65869-6563-4e9a-9d2f-9941d81fc228",
    "body" : "En tecnología sobre todo necesitas impuestos bajos.. y España no es el sitio para eso.\n\nYa entre regiones hay competencia hasta en esto.",
    "username" : "DildoMcHomie",
    "timestamp" : "2024-12-22T14:58:53Z"
  }, {
    "reportedcomment" : false,
    "_id" : "edfde1e0-57fc-4991-8fc7-30b6ae3cb3e4",
    "body" : "Y al país Vasco ",
    "username" : "krlooss",
    "timestamp" : "2024-12-22T13:49:18Z"
  }, {
    "reportedcomment" : false,
    "_id" : "dc94cbf8-45b9-4733-a470-631bd4219cb0",
    "body" : "Gran parte de las inversiones estatales de industria a lo largo de la historia española se han concentrado en Cataluña, me parece gracioso todo el tema de la independencia...",
    "username" : "Kinocci",
    "timestamp" : "2024-12-22T14:06:45Z"
  }, {
    "reportedcomment" : false,
    "_id" : "24a4a749-913c-4278-870d-0cd9ae765cfd",
    "body" : "Siempre ha sido así desde que Cataluña era Principado de Aragón. Siempre ha tenido un trato especial. Tradición es tradición",
    "username" : "alexx8b",
    "timestamp" : "2024-12-22T13:11:15Z"
  }, {
    "reportedcomment" : false,
    "_id" : "2e4a613d-72c6-408e-8cf1-c17ade0b2301",
    "body" : "Por favor, ilumínanos y aporta datos. No nos dejes con la miel en los labios como en tus comentarios previos, vomitando falacias y repitiendo dogmas.",
    "username" : "jOhNQ-",
    "timestamp" : "2024-12-22T15:17:35Z"
  }, {
    "reportedcomment" : false,
    "_id" : "04d5c06b-e0ee-4b2d-a7c6-c610130579dd",
    "body" : "Los que pensáis que la patria es pagar impuestos estais como una chota.",
    "username" : "rm_enfurecido",
    "timestamp" : "2024-12-22T11:16:00Z"
  }, {
    "reportedcomment" : false,
    "_id" : "570989e6-e849-4151-9a8c-ffa4735df569",
    "body" : "Los que no queréis ver como Cajamadrid acabó esquilmada y en manos de laCaixa no vais a ver que tenéis la carretera más cara de españa, ni que estáis pagando miles de millones en sobrecostes",
    "username" : "Garbanzo_toscano",
    "timestamp" : "2024-12-22T15:48:16Z"
  }, {
    "reportedcomment" : false,
    "_id" : "b836bd82-c695-49b8-877d-ff2925f5bf7b",
    "body" : "Cierto, querer tener los recursos suficientes para que mis compatriotas tengan mejores servicios públicos es estar como una chota. Lo normal es llevar una pulsera con la bandera y votar a los que más nos han robado y nos roban.",
    "username" : "Garbanzo_toscano",
    "timestamp" : "2024-12-22T11:19:20Z"
  }, {
    "reportedcomment" : false,
    "_id" : "4ee14994-1321-413d-8c21-88d07ef87074",
    "body" : "¿Por qué todos tus comentarios son \"los que no queréis ver esto o aquello\" o \"a los que os lavan el cerebro bla bla bla\"? Es simple, aporta datos.\n\nVenga, te voy a ayudar por ser Navidad. Ley LORCA, de 1985, Gobierno del señor Felipe González. A raíz de esa ley se empiezan a regir las cajas de ahorros por el poder político. Ni PP ni PSOE han hecho nada por cambiarlo desde entonces. Caja Madrid se fusiona con varias cajas de ahorros valencianas como la Caja de Ahorros del Mediterráneo, para tapar el pedazo de pufo que tenía el PP en esa comunidad autónoma. De ahí se crea Bankia y después LaCaixa la compra.\n\nAhora, sabiendo esto, por favor aporta datos de por qué Madrid es la que más parasita al resto.\n\nPor cierto, al ver tus comentarios no hace falta ser muy observador para darse cuenta de que tienes cierta animadversión a Madrid. Pero tampoco dejas de nombrarla permanentemente. ¿Estás bien? ¿Necesitas algún tipo de apoyo emocional o es simplemente complejillo de inferioridad?.",
    "username" : "jOhNQ-",
    "timestamp" : "2024-12-22T17:29:26Z"
  }, {
    "reportedcomment" : false,
    "_id" : "598b8058-0f4f-4187-9841-84dd7535e90e",
    "body" : "¿Que servicios públicos muchacho? \n\nQue el PSOE ha gastado mas de 100 millones en regar de dinero a periódicos y medios de comunicación, que las TV públicas nos cuestan 1000 millones de euros al año, que el cine español subvenciona a actores y directores millonarios y cuesta 100 millones al año. \n\nDe que servicios públicos hablas, dejad de justificar que personas que ganan 25.000 euros al año paguen más de 6.000 euros en impuestos, dejar de justificar que una vivienda tenga más de 15.000 euros en IVA en impuestos. \n\nQue te han lavado la cabeza y punto. \n\nDe que servicios públicos me hablas, si hasta matar toros esta subvencionado en este país por culpa de gente como tú.",
    "username" : "rm_enfurecido",
    "timestamp" : "2024-12-22T11:23:26Z"
  }, {
    "reportedcomment" : false,
    "_id" : "4e53cb54-3793-4ba8-860f-63a5b78b4cb9",
    "body" : "Esa ley era la misma para Cajamadrid que para La Caixa, por que una acabó saqueada y la otra se la quedó asumiendo los pufos?\nLa CAM se la quedó el Sabadell, la fusión con Cajamadrid a la cabeza fue pensando que esta iba a soportar el latrocinio en Bancaja y el resto de cajas menores. No habían calculado que aCajamadrid también la habían dejado en los huesos.",
    "username" : "Garbanzo_toscano",
    "timestamp" : "2024-12-22T17:49:00Z"
  }, {
    "reportedcomment" : false,
    "_id" : "cc3c5ea3-a821-4cec-a15e-3d57c4767d79",
    "body" : "Vives en la región donde los políticos más nos han robado, se ve que de lavados de cerebro me puedes dar lecciones a mi y a cualquiera.",
    "username" : "Garbanzo_toscano",
    "timestamp" : "2024-12-22T11:25:36Z"
  }, {
    "reportedcomment" : false,
    "_id" : "89be7b48-20eb-4147-aacc-ef359dfbe6a5",
    "body" : "Totalmente de acuerdo contigo, pero esto es un caso concreto en el que una caja de ahorros ha tenido una pésima gestión y otra que no (incluso entre ladrones hay algunos más aptos que otros supongo). ¿Puedes por favor darnos los datos en los que te basas para afirmar que Madrid es la que más parasita?",
    "username" : "jOhNQ-",
    "timestamp" : "2024-12-22T20:51:30Z"
  }, {
    "reportedcomment" : false,
    "_id" : "81f8c93c-10fb-40f8-90b5-1422d7d2421a",
    "body" : "No, no soy de Andalucía, donde el PSOE gasto el dinero de los parados en prostitutas y cocaína.\n\nPero sabes que?\n\nAquí en Madrid no pagamos tantos impuestos porque no legitimamos a los políticos a eso, a que nos roben descaradamente. La economía mejora y pagamos menos impuestos y no tenemos que andar preocupados en idioteces.\n\nTe cuento una historia, un colega estaba ahorrando para una vivienda en Madrid, tenia 20.000 euros ahorrados, su abuelo de Castilla y León falleció y para heredar la casa tuvieron que pagar el impuesto de sucesiones, mi colega, de familia humilde, pagó 17.000 euros de impuesto de sucesiones para heredar la casa, perdiendo la entrada para el piso de Madrid, y con 30 años sigue viviendo con su madre.\n\nUna amiga de mi novia heredó una casa aquí en Madrid, sabes cuanto pagó? Nada, la visita al notario.\n\nAhora dime, que gobierno crees que ha robado más a quien?\n\nComo te digo, te han lavado el cerebro bien, menos impuestos es menos robo a los ciudadanos.",
    "username" : "rm_enfurecido",
    "timestamp" : "2024-12-22T11:34:19Z"
  }, {
    "reportedcomment" : false,
    "_id" : "e0d05992-4c43-49ee-bb73-048c3e408b1f",
    "body" : "No es ningún caso concreto cuando la práctica totalidad de las cajas en manos de los pepesunos acabaron quebradas tras saquearlas a placer.",
    "username" : "Garbanzo_toscano",
    "timestamp" : "2024-12-23T00:04:01Z"
  }, {
    "reportedcomment" : false,
    "_id" : "b40aba32-b9c7-41ce-a2f9-43e0b505e58a",
    "body" : "Tienes múltiples ejemplos, desde tener al municipio que más dinero recibe de la PAC sin producir nada, donde te crees que va el dinero de la producción eléctrica extremeña?, quien te crees que recauda las 3 cuartas partes de lo producido por las empresas con presencia nacional?,…",
    "username" : "Garbanzo_toscano",
    "timestamp" : "2024-12-22T23:54:47Z"
  }, {
    "reportedcomment" : false,
    "_id" : "c749469a-071f-486f-9157-628f4b80967f",
    "body" : "No he dicho que seas de Andalucia sino que eres de donde los políticos más nos han robado, la comunidad de Madrid. Veo que contigo el lavado de cerebro fue a conciencia.\nLo de los volquetes de putas intuyo que no te suena y que los andaluces montasen un chiringuito para evitar la fiscalización ce unos 700 millones veo que te suena pero obviamente que en Madrid hicieron los mismos para evitar la fiscalización de 3000 millones es algo que por alguna razón que desconozco prefieres ignorar.…\nPor cierto, yo soy partidario de eliminar el impuesto de sucesiones pero algo me dice que no vas a entender lo,que esto supone.",
    "username" : "Garbanzo_toscano",
    "timestamp" : "2024-12-22T11:40:29Z"
  }, {
    "reportedcomment" : false,
    "_id" : "3a77e040-b5d5-4cd3-9ebe-f5db51fbefd3",
    "body" : "Dar una fiscalidad ventajosa a las empresas es parasitar? Qué impide a Cataluña o a Extremadura hacer lo mismo?",
    "username" : "PepeBarrankas",
    "timestamp" : "2024-12-23T01:41:47Z"
  }, {
    "reportedcomment" : false,
    "_id" : "ccc4febc-ce42-44e7-9fd7-c3044e8ae95e",
    "body" : "No te he pedido ejemplos. Te he pedido datos. Fuentes directas que verifiquen lo que dices. Te dedicas a afirmar cosas sin ningún tipo de sustento y pretendes que te las validemos.\n\n¿El dinero de la producción eléctrica extremeña? El sistema es así. Madrid no parasita nada, no tiene nada que ver. Si una empresa con sede en Madrid se beneficia de una tributación más favorable en dicha región, y le interesa pagar impuestos ahí, el problema es que el sistema lo permita. Cada vez que hablas de Madrid lo presentas como si fuera algún tipo de región oscura, fascista y opresiva, cuando es de largo (larguísimo) la comunidad más solidaria con el resto, sin rechistar y entendiendo que es su papel como capital de España y acogiendo con los brazos abiertos a la gente que viene a ganarse la vida.\n\nEn el caso concreto de Extremadura, es la comunidad autónoma con mayor porcentaje de empleados públicos (excluyendo Ceuta y Melilla) siendo también la segunda que más recibe en porcentaje a su aportación, con un 76% de superávit. Creo que con esos datos, Extremadura no puede ser ejemplo de nada económicamente hablando. \n\nTe aporto datos:\n\nhttps://cincodias.elpais.com/economia/2023-08-07/madrid-aporta-tres-veces-mas-que-cataluna-a-la-financiacion-de-las-comunidades-autonomas.html\n\nhttps://www.rrhhdigital.com/secciones/administracion-publica/155662/Tiene-Espana-demasiados-funcionarios-El-dato-sin-duda-te-sorprendera/",
    "username" : "jOhNQ-",
    "timestamp" : "2024-12-23T11:25:25Z"
  }, {
    "reportedcomment" : false,
    "_id" : "b0272fce-9dfc-46df-ad22-86affb039ee2",
    "body" : "No, lo es aprovechar el efecto de ser capital para parasitar la actividad económica de otros territorios, el ejemplo más claro es Extremadura",
    "username" : "Garbanzo_toscano",
    "timestamp" : "2024-12-23T07:31:57Z"
  }, {
    "reportedcomment" : false,
    "_id" : "96797523-dfff-49ad-95cb-f9ec910f976b",
    "body" : "Y los datos son que Madrid es una comunidad parasitaria por mucho que no te guste verlo.solo si la electricidad producida y no consumida en Extremadura tributase en la comunidad está suma mas que lo que facturan las 10 mayores empresas que tributan en la región.",
    "username" : "Garbanzo_toscano",
    "timestamp" : "2024-12-23T13:37:30Z"
  }, {
    "reportedcomment" : false,
    "_id" : "913c9aeb-26be-4611-9a75-a643301e91b7",
    "body" : "Pues desarrollad industria, atraed empresas de Portugal, bajad los impuestos... Capital va a haber siempre, pero eso no impide que os pongáis las pilas de una vez.",
    "username" : "PepeBarrankas",
    "timestamp" : "2024-12-23T10:33:47Z"
  }, {
    "reportedcomment" : false,
    "_id" : "09373de1-f959-4406-a84c-e7a039632102",
    "body" : "Pero los impuestos. Pueden tributar en el lugar donde tiene lugar la actividad económica y no en otra parte.",
    "username" : "Garbanzo_toscano",
    "timestamp" : "2024-12-23T13:56:28Z"
  } ]
}