{
  "id" : 200197,
  "community_name" : "Valencia",
  "username" : "AdLiving6575",
  "post_body" : "Any English-Speaking Vet In Valencia?",
  "timestamp" : "2024-12-23 09:25:14",
  "num_comment" : 17,
  "reported_post" : false,
  "commenti" : [ {
    "reported_comment" : false,
    "body" : "My friend takes her cat here: [https://maps.app.goo.gl/TAJq2Fm8U93RYsz96](https://maps.app.goo.gl/TAJq2Fm8U93RYsz96)  \nThey have English-speaking doctors",
    "username" : "Brilliant_Quote_3313",
    "timestamp" : "2024-12-23 12:19:41"
  }, {
    "reported_comment" : false,
    "body" : "Bolta near arts and sciences the vet Daniel speaks English and is a cat person. He was very kind to my boy when he crossed the rainbow bridge ",
    "username" : "Altruistic-Sorbet968",
    "timestamp" : "2024-12-23 10:01:25"
  }, {
    "reported_comment" : false,
    "body" : "Hi! I am a vet with experience in small animals and a cat owner. If you suspect they have eaten some meds/poison/ batteries/ plants you should seek professional help quite fast because the faster they make them vomit the better the outcome it is and less damage to the organs. If you suspect she has eaten some material an eco/ some radiographs would be helpful before proceeding to any procedure. If is early stage you could use an endoscope to remove and is less invasive than surgical removal.",
    "username" : "Over-Rush6966",
    "timestamp" : "2024-12-23 10:10:35"
  }, {
    "reported_comment" : false,
    "body" : "Upendi in L’Eixample speak great English https://upendiclinicaveterinaria.com/",
    "username" : "InteractionKind80",
    "timestamp" : "2024-12-23 09:25:14"
  }, {
    "reported_comment" : false,
    "body" : "That’s great thank you so much",
    "username" : "AdLiving6575",
    "timestamp" : "2024-12-23 13:17:24"
  }, {
    "reported_comment" : false,
    "body" : "Thank you so much for your answer. And im so sorry to hear that",
    "username" : "AdLiving6575",
    "timestamp" : "2024-12-23 10:11:12"
  }, {
    "reported_comment" : false,
    "body" : "Sorry to hear about your loss",
    "username" : "kowwalski",
    "timestamp" : "2024-12-23 13:09:05"
  }, {
    "reported_comment" : false,
    "body" : "Hi, thank you for your response. I suspect she ate an elastic rope of her toy and my vet from my hometown told me to observe for 24 hours because she shows no signs of distress of any kind. Would you sugget taking a x-ray or even an endoscope as early as possible?",
    "username" : "AdLiving6575",
    "timestamp" : "2024-12-23 10:14:46"
  }, {
    "reported_comment" : false,
    "body" : "From my experience we used with clients google translate. is quite useful and I would not lose any time. Just pick one enough to stabilise your cat. Good luck and fingers crossed to just be a false alarm.",
    "username" : "Over-Rush6966",
    "timestamp" : "2024-12-23 10:12:11"
  }, {
    "reported_comment" : false,
    "body" : "I will look them up, thank you so much.",
    "username" : "AdLiving6575",
    "timestamp" : "2024-12-23 10:09:37"
  }, {
    "reported_comment" : false,
    "body" : "It is not ethical to go over another’s vet job and advise as a vet. Since you are worried and concerned about your cat, being in a foreign country I can understand you. Your vet is not wrong. Now depends how big it is the elastic rope. Here are 3 different things might happen: one, just chewed and lost it in the house, second eaten and it will just poop it 24 h or more( is critical to search for any piece in the stools) and the worst scenario is to get blocked into intestines but that happens in time. In radiography and ecography you could see later signs. Since has no metal piece hard to see anything on xrays And ecography,would be tricky even for a specialist. The best now would be an MRI where you can see small details but the costs involved… up to you and your buget. I can tell you what to do but waiting 24 h and see how it goes could be or just to go and make her vomit is a chance as well as long as is still in the stomach (somewhere in between 30min -1h) if longer than that less changes to throw it up. If passes 24 h since the event I would be really careful monitoring the food intake and water intake as well as the stools. Do not forget what comes in has to come out (+\\~). If she is starting to act strange not eating/pooping/vomiting/sad/abdomen pain etc go to the vet. Hope it helps you. And if you need any other help let me know.",
    "username" : "Over-Rush6966",
    "timestamp" : "2024-12-23 10:26:27"
  }, {
    "reported_comment" : false,
    "body" : "An endoscope implies an anesthesia. So idk how old is your cat or what other health issues she has, body score, how are her bloods as each anesthesia implies a risk  even if they are healthy. And they might not find anything if passed the stomach and fist part of the intestines. Depends how well equipped are they and experience. I would consider first instance vomiting. Is quite easy and least expensive and invasive. Is small bits comes out happy days or even the piece if no… wait and see. But as I said depends when it happened.",
    "username" : "Over-Rush6966",
    "timestamp" : "2024-12-23 10:30:24"
  }, {
    "reported_comment" : false,
    "body" : "She is 1 year old, quite healthy and it happened 7-8 hours ago. Im going to call the suggested vets and other near me but huge thanks for your attention and time, i really appreciate it. Im still trying to find the rope but no luck so far. I just can’t understand why would she eat a 20cm long rope casually.",
    "username" : "AdLiving6575",
    "timestamp" : "2024-12-23 10:44:31"
  }, {
    "reported_comment" : false,
    "body" : "I think you chose wisely. 7-8 h is quite a bit of time, less chances to find it in the stomach if passed it. Are you sure is 20 cm long? Is quite long…. What breed is she? She is really young, exploring the world, getting bored, needs a lot of interaction and stimulation. One year old 😁 that’s why. Is common do not worry she is being what is supposed to be a playful happy cat.",
    "username" : "Over-Rush6966",
    "timestamp" : "2024-12-23 11:06:29"
  }, {
    "reported_comment" : false,
    "body" : "She is a really athletic calisco probably a mixed but I don’t know exactly. And unfortunately yes, it was probably between 15-20cm but she just pooped and no signs of the rope. I will listen to your advise and take here to the vet today. And i know she is just curious but i wished she inspected something else :/",
    "username" : "AdLiving6575",
    "timestamp" : "2024-12-23 11:37:47"
  }, {
    "reported_comment" : false,
    "body" : "😄I hope next time she would choose better toys from the pet shops. 😂 do not worry they love elastics, hair bands, ropes, needles with threads. Better toys choises and under supervision do not forget they are always like kids.❤️ good luck! Let me know the outcome. I am curious! Finger crossed 🤞 to avoid emergency taxes as well",
    "username" : "Over-Rush6966",
    "timestamp" : "2024-12-23 11:44:16"
  }, {
    "reported_comment" : false,
    "body" : "Yes absolutely 🤞",
    "username" : "AdLiving6575",
    "timestamp" : "2024-12-23 13:16:20"
  } ]
}