{
  "id" : 200376,
  "community" : "Reykjavik",
  "username" : "NaiveAd6089",
  "post" : "New Years Eve Reykjavik ",
  "timestamp" : "2024-12-10T08:03:43Z",
  "nomment" : 20,
  "reportedpost" : false,
  "comment" : [ {
    "reported_comment" : false,
    "body" : "Be at Hallgrímskirkja around midnight, many that live downtown go there to shoot up fireworks.",
    "username" : "Shroom1981",
    "timestamp" : "2024-12-10T08:03:43Z"
  }, {
    "reported_comment" : false,
    "body" : "you could try to find a restaurant on [dineout.is](http://dineout.is), but you could also be a bit late to find a place that has any availability. Everything will be dead between 11-11:50, as everyone will be inside watching the new years special. But after that you can expect a great fireworks show, just try and find a good vantage point(Hallgrímskirkja, Arnarhóll etc.) The bars/clubs will be open, but might be packed, it will either be a great time or miserable, depending on weather. I don't think we have any special New Year's celebrations, since most Icelanders eat at home and then watch the new years special and then shoot fireworks at home and most people have a party at home.",
    "username" : "Most_Employ1851",
    "timestamp" : "2024-12-10T10:27:12Z"
  }, {
    "reported_comment" : false,
    "body" : "i was there over NYE 2021-2022. it was amazing. but beware, the entire city shuts down from 9-midnight. every bar. every restaurant. we were running around at 8:30 just trying to find something to take out because every place was jammed with people trying to eat before the break. i guess there is this Icelandic TV show (like Dick Clark) that everyone watches. the bars can't be open until 120:00am, so we just went back to our hotel room to chill. \n\nbut the fireworks were amazing. they put Chicago's 4th of July celebrations to shame.",
    "username" : "mikraas",
    "timestamp" : "2024-12-10T22:21:13Z"
  }, {
    "reported_comment" : false,
    "body" : "Sky Bar in the hotel next to the Central Bank - Ingólfsstræti I think.",
    "username" : "Stokkurinn",
    "timestamp" : "2024-12-10T16:27:40Z"
  }, {
    "reported_comment" : false,
    "body" : "My wife and I will be there too! (30 and 29)",
    "username" : "Prestigious-Virus-15",
    "timestamp" : "2024-12-11T03:30:57Z"
  }, {
    "reported_comment" : false,
    "body" : "My boyfriend and I (31 and 28) will also be there! We decided to splurge and do an early dinner at 6:30pm, catch a neighborhood bonfire around 8:30-9:00, and then bought tickets to a NYE event with a DJ, drinks, and great viewpoint for the fireworks!\n\nhttps://wakeupreykjavik.com/tour/new-years-eve-party-reykjavik",
    "username" : "extrafiresauceplease",
    "timestamp" : "2024-12-18T13:37:46Z"
  }, {
    "reported_comment" : false,
    "body" : "Don't do that unless you want to lose an eye. Go find a vantage point with a decent view of the city.",
    "username" : "Dirac_comb",
    "timestamp" : "2024-12-10T08:12:44Z"
  }, {
    "reported_comment" : false,
    "body" : "one more thing, I can see that OTO has availability on the 31st at 18:00, could not recommend this place enough, the food and drinks are to die for",
    "username" : "Most_Employ1851",
    "timestamp" : "2024-12-10T10:29:09Z"
  }, {
    "reported_comment" : false,
    "body" : "And please wear safety glasses when close to fireworks, we take safety with fireworks very seriously here",
    "username" : "Most_Employ1851",
    "timestamp" : "2024-12-10T10:33:59Z"
  }, {
    "reported_comment" : false,
    "body" : "yeah the tv show in question is called áramótaskaup and it’s tradition to watch, its now been aired with english subs its quite fun!",
    "username" : "Previous_Teach_7089",
    "timestamp" : "2024-12-12T12:22:19Z"
  }, {
    "reported_comment" : false,
    "body" : "We just found out about the race for events during the New Years!",
    "username" : "Prestigious-Virus-15",
    "timestamp" : "2024-12-11T03:32:12Z"
  }, {
    "reported_comment" : false,
    "body" : "Lose an eye? What the fuck are you talking about? Keep on spreading fear and misinformation…",
    "username" : "Shroom1981",
    "timestamp" : "2024-12-10T08:17:39Z"
  }, {
    "reported_comment" : false,
    "body" : "What about, you know, you use one of [these](https://strakar.flugeldar.is/products/flugeldagleraugu-1)?",
    "username" : "Glaesilegur",
    "timestamp" : "2024-12-11T14:57:58Z"
  }, {
    "reported_comment" : false,
    "body" : "Be aware that most of the humour is based on inside jokes related to local news and politics through the passing year. Ergo, not necessarily much fun for an outsider.",
    "username" : "fuckingshadywhore",
    "timestamp" : "2024-12-14T04:26:07Z"
  }, {
    "reported_comment" : false,
    "body" : "Which race of events doch you mean?:) have a nice time!!",
    "username" : "NaiveAd6089",
    "timestamp" : "2024-12-11T21:06:04Z"
  }, {
    "reported_comment" : false,
    "body" : "I used to go there every single new years, since I live downtown. The last time I went was in 2018(?), when fireworks exploded in the crowd. I got knocked in the forehead by a flaming sun that somebody pretty much just aimed at the crowd. Remember that lady that was going to sue Iceland after her new years experience? That was it.",
    "username" : "Dirac_comb",
    "timestamp" : "2024-12-10T08:44:12Z"
  }, {
    "reported_comment" : false,
    "body" : "That can literally happen anywhere on New Year’s Eve….",
    "username" : "Shroom1981",
    "timestamp" : "2024-12-10T09:41:33Z"
  }, {
    "reported_comment" : false,
    "body" : "Hver ætlaði að stefna Íslandi og hvernig færi það fram?",
    "username" : "gunnsi0",
    "timestamp" : "2024-12-10T12:03:02Z"
  }, {
    "reported_comment" : false,
    "body" : "Ég veit það ekki, man bara eftir þessari frétt. Það var semsagt einhver Kani þarna sem sagði farir sínar ekki sléttar af þessari áramótagleði, og fór bara beint í 1. viðbrögð síns lands og talaði um að höfða mál. Það var hlegið dátt í flestum athugasemdakerfum.",
    "username" : "Dirac_comb",
    "timestamp" : "2024-12-10T12:34:34Z"
  }, {
    "reported_comment" : false,
    "body" : "Ef það væri hægt að fara í mál við lönd vegna hegðunar einstaklinga þar, þá væri nú Kanalandið ekki í góðum málum!",
    "username" : "gunnsi0",
    "timestamp" : "2024-12-10T13:43:02Z"
  } ]
}