{
  "postId" : 200258,
  "community" : "Vilnius",
  "username" : "PasDeTout",
  "post" : "Why are all the churches in the centre?",
  "timestamp" : "2024-12-19T20:15:40Z",
  "numcomment" : 22,
  "reportedpost" : false,
  "comment" : [ {
    "reportedcomment" : false,
    "body" : "There are some churches outside of the old town, but the concentration is indeed lower. It's likely because quite a lot of newer districts were developed in soviet times, where practicing the faith wasn't exactly encouraged. Current development is more profit oriented, the newest neighborhoods don't even have enough schools, kindergartens, green areas, so churches sure aren't a priority.",
    "username" : "ibwk",
    "timestamp" : "2024-12-19T20:16:46Z"
  }, {
    "reportedcomment" : false,
    "body" : "Hi! The reason why a lot of the Catholic Churches are in the Centre and in the general area of Vilnius Old Town is because these were mainly the historic areas of Vilnius City, from the time of the dukes. A lot of religious orders settled in Vilnius and a lot of worker guilds wanted to market and promote themselves as well (hence why they donated and helped out in the construction of serveral churches). It sort of made sense to build a lot of these churches close by since again, most of the population lived in a walkable distance to these churches in those days. \n\nThey are churches in the outskirts as well. But for the vast majority of people, they lived in a walkable distance to the centre and the centre generally had better stability and security (owning to the historic wall of Vilnius city, the remains of which can still be seen). It made sense to have these churches inside the area the historic wall covered rather than outside (since these churches contained either a lot of relics, art, statues, conventional riches, books).\n\nVilnius is called Rome of the North (tbf the Lithuanians themselves don't know this, it's a niche informational detail only those well versed in history would know). If you visit Rome, you'll often see many large cathedrals and churches very close to each other. Even the main streets of Rome, have churches built mere minutes away from each other.\n\nThe churches in Vilnius have a Roman influence on them (design wise) not to mention that during the commonwealth area, they were an influex of Italian painters and artists that moved to Vilnius. It's possible this is another reason why a lot of the churches were built close by each other (potential Roman influence + makes logistics a bit more manageable)\n\nApologies for spelling errors or bad formatting, had a tiring day. Hope this answer helps.",
    "username" : "basedchadinc",
    "timestamp" : "2024-12-19T20:18:06Z"
  }, {
    "reportedcomment" : false,
    "body" : "They WERE scattered around town. It's just that the town has grown immensely, especially during the Soviet occupation. And Soviets were not building new churches.",
    "username" : "No_Men_Omen",
    "timestamp" : "2024-12-20T05:02:18Z"
  }, {
    "reportedcomment" : false,
    "body" : "I’m not sure what cities you’re comparing to Vilnius. The reason is historical. Vilnius wasn’t a sprawling city at inception and places of worship were situated accessibly to its adherents, aka in their neighborhoods. At the same time the State’s late acceptance of Christianity pulled churches closer to state and civic buildings and offices. Aka the center of the city.\n\nEdit: Vilnius’ inception in terms of its capital city status.",
    "username" : "nondescriptredditer1",
    "timestamp" : "2024-12-19T20:15:40Z"
  }, {
    "reportedcomment" : false,
    "body" : "A lot of the sprawl happened in soviet times. A lot of the districts were built in the 70's-80's (my mom remembers seeing cows feeding in a lot of places that are now sprawling districts) Soviets were very vehement against religion, heck, they were repurposing the churches that were already built. There were cinemas, swimming pools, sports halls, museums (non religious), archives in the churches. So as you can guess, the new districts were built without a church.\n\nAnd nowadays there aren't as many religious (or practicing) followers to build churches.",
    "username" : "Siukslinis_acc",
    "timestamp" : "2024-12-20T07:35:53Z"
  }, {
    "reportedcomment" : false,
    "body" : "People in the centre are religious whereas outside atheist 🙊🙊\n\nIf you generally look at it… the centre has all the infra and outside neighbourhoods are mostly residential.\n\nI guess they couldn’t make churches inside the malls yet but you never know 👉",
    "username" : "0xPianist",
    "timestamp" : "2024-12-20T09:44:02Z"
  }, {
    "reportedcomment" : false,
    "body" : "I mean, elitism, soviets, but basically, why worry? Vilnius is still a tiny village compared to most cities. Just hop on a bus. No biggie.",
    "username" : "mainhattan",
    "timestamp" : "2024-12-20T10:09:10Z"
  }, {
    "reportedcomment" : false,
    "body" : "This is a great answer to explain the long duree, or change over time, regarding what does and doesn’t remain in Vilnius as well as what was and wasn’t developed in the modern era or even 21st century. Great. ",
    "username" : "nondescriptredditer1",
    "timestamp" : "2024-12-19T20:43:07Z"
  }, {
    "reportedcomment" : false,
    "body" : "This makes a lot of sense.",
    "username" : "PasDeTout",
    "timestamp" : "2024-12-19T20:34:44Z"
  }, {
    "reportedcomment" : false,
    "body" : "But no cities were sprawling when they started. For example, almost any town or city in the UK but the churches are placed so that pretty much everybody is relatively close to a church and doesn’t have to travel into the centre.",
    "username" : "PasDeTout",
    "timestamp" : "2024-12-19T20:34:13Z"
  }, {
    "reportedcomment" : false,
    "body" : "I’m not worried! It’s just something I noticed, is different from most other places, and is not how you usually plan things if you’re trying to ensure access for the widest number of people, so I just decided to see if there was a reason behind it.",
    "username" : "PasDeTout",
    "timestamp" : "2024-12-20T18:12:39Z"
  }, {
    "reportedcomment" : false,
    "body" : "I think you’re overlooking the eras of development for UK cities and towns v that of Vilnius. We’re talking about a millennium of difference. Not to mention the gap in acceptance of Christianity. Lithuania is famously known as one of the oldest sovereignties to accept the religion. The histories of the Cathedral or even the Orthodox churches are terrific reads.",
    "username" : "nondescriptredditer1",
    "timestamp" : "2024-12-19T20:39:26Z"
  }, {
    "reportedcomment" : false,
    "body" : "> the churches are placed so that pretty much everybody is relatively close to a church \n\nThat was also the case here, when those churches were built.\n\nChristianity is on the way out right now, so new ones aren't being built. I'm sure you don't have many churches in new developments either.",
    "username" : "GrynaiTaip",
    "timestamp" : "2024-12-19T21:07:22Z"
  }, {
    "reportedcomment" : false,
    "body" : "The words \"plan\" and \"Vilnius\" don't often occur together...",
    "username" : "mainhattan",
    "timestamp" : "2024-12-20T18:53:03Z"
  }, {
    "reportedcomment" : false,
    "body" : "The timing of Christianisation doesn’t matter: you would still usually want churches dispersed throughout a town rather than mostly in a cluster in one area. I think the comment someone made about Soviet era districts is pretty on the money re this issue.",
    "username" : "PasDeTout",
    "timestamp" : "2024-12-19T21:32:10Z"
  }, {
    "reportedcomment" : false,
    "body" : "To give one example, Milton Keynes is one of the ‘new towns’ that was built in the 1960s. It has churches and they’re fairly evenly scattered around the town.",
    "username" : "PasDeTout",
    "timestamp" : "2024-12-19T21:29:32Z"
  }, {
    "reportedcomment" : false,
    "body" : "Brits might be a lot more religious than we are.\n\nAlso in the 60's we were occupied by russia, catholicism wasn't really a thing during that time.",
    "username" : "GrynaiTaip",
    "timestamp" : "2024-12-19T22:05:25Z"
  }, {
    "reportedcomment" : false,
    "body" : "The UK is one of the more atheistic countries in Europe with one survey putting the number of atheists at more than double the number in Lithuania. So I don’t think simple religiosity is behind it.\n\nDuring Soviet occupation Catholicism was a feature of national identity and rebellion - hence the Hill of Crosses. The Soviets demolished it but the people kept rebuilding it. The diaspora worked hard to help support Lithuanians still in Lithuania practise their religion freely and interestingly, many diasporan priests were primarily motivated by nationalism - being Catholic, an intellectual and a priest was a way of sticking two fingers up at the Russians and their attempts to suppress Lithuanians’ freedom of religion.",
    "username" : "PasDeTout",
    "timestamp" : "2024-12-20T07:54:06Z"
  }, {
    "reportedcomment" : false,
    "body" : "> So I don’t think simple religiosity is behind it.\n\nThen why do you have churches in Milton Keynes, but not in 60's developments in Lithuania? We don't really have churches in them, and nobody cares because what is even the point of a church?",
    "username" : "GrynaiTaip",
    "timestamp" : "2024-12-20T09:55:26Z"
  }, {
    "reportedcomment" : false,
    "body" : "Religion was declining considerably even before the sixties. But in the sixties the UK didn’t have Soviets imposing atheism from above and suppressing freedom of religion.\n\nWhile the UK doesn’t go to church it quite likes its churches simply existing. Like France not being a country of churchgoers but when the Notre Dame burnt down, you bet the French were devastated (as were many non French).",
    "username" : "PasDeTout",
    "timestamp" : "2024-12-20T18:06:28Z"
  }, {
    "reportedcomment" : false,
    "body" : "> when the Notre Dame burnt down\n\nIt's a historic and beautiful building, it doesn't matter if you're religious or not. We treat our historic churches the same way, they are maintained and protected.\n\nAs far as I know, only two new churches were built in Vilnius after we regained independence, simply because the demand is low. Both are ugly as fuck. \n\n[Church of St. Joseph](https://i.imgur.com/aHe7SJB.jpeg)\n\n[Church of St. Jurgis Matulaitis](https://i.imgur.com/gIwz2LP.jpeg)",
    "username" : "GrynaiTaip",
    "timestamp" : "2024-12-20T18:24:58Z"
  }, {
    "reportedcomment" : false,
    "body" : "Jono Bosko in Lazdynai is a newer too, if I'm not mistaken",
    "username" : "RajanasGozlingas",
    "timestamp" : "2024-12-20T21:58:22Z"
  } ]
}