{
  "id" : 200163,
  "community" : "Riga",
  "username" : "pigeon-25",
  "post" : "Day trips from Riga ",
  "timestamp" : "2024-12-13T08:20:11Z",
  "numcomment" : 12,
  "reportedpost" : false,
  "comment" : [ {
    "reportedcomment" : false,
    "body" : "Sigulda is about that distance. Cēsis is a bit further and always my recommendation",
    "username" : "yung_lank",
    "timestamp" : "2024-12-13T08:20:11Z"
  }, {
    "reportedcomment" : false,
    "body" : "Ogre is easily reachable by train. Food+Christmas decorations in the evening.",
    "username" : "koalaboala",
    "timestamp" : "2024-12-13T08:40:53Z"
  }, {
    "reportedcomment" : false,
    "body" : "Sigulda and Saulkrasti would be 1h away. Dubulti is not bad: 35 min by train from Riga. Nothing much to do but chillax. There is a canteen which is not far from station.",
    "username" : "Loopbloc",
    "timestamp" : "2024-12-13T08:30:55Z"
  }, {
    "reportedcomment" : false,
    "body" : "Sigulda or Jurmala  \nOgre can be kept as plan B",
    "username" : "jameslurker3000",
    "timestamp" : "2024-12-13T08:31:04Z"
  }, {
    "reportedcomment" : false,
    "body" : "You could go to Ķemeri. Train takes about an hour.\n\n- Nice recently restored park around an old sanatorium\n- trails going from the edge of the town through dunes, pine forests and swamps. Swamps are quite pretty when frozen\n\n\nA little further in the same direction is Tukums\n- center is quite nice\n- Jaunmoku pils and/or Durbes pils if you like castles\n- Cinevilla if you find a way to get there",
    "username" : "Ok-Anything-3771",
    "timestamp" : "2024-12-13T10:04:38Z"
  }, {
    "reportedcomment" : false,
    "body" : "Jurmala's easily accessible by train. It's a resort town though so pretty quiet once the summer season is over, but still lovely to go for a walk along the beach. There's a sort of public forest/park area near the church end of the high street as well.",
    "username" : "bartread",
    "timestamp" : "2024-12-13T10:28:04Z"
  }, {
    "reportedcomment" : false,
    "body" : "I think Jūrmala is the best choice. It's a resort town that stretches for many kilometers along the sea. You could get off the train in Majori (30 min from Riga central station), as that area will have most cafes and restaurants to choose from. You can go for a stroll on the beach and walk along the little residential streets where you'll see many old beautiful wooden houses/villas; Jūrmala is famous for this type of architecture.",
    "username" : "thisnameissorandom",
    "timestamp" : "2024-12-13T13:44:56Z"
  }, {
    "reportedcomment" : false,
    "body" : "What im about to suggest isnt going to be 40min, closer to 2-3h drive, but Kuldiga and Ventspils are nice places to be in, especiaļy in winter with all the decorations, Ventspils has more things to do, but Kuldiga is a quick trip, go to cafe and enjoy the view. Definetly my go to place",
    "username" : "SeveralAd7979",
    "timestamp" : "2024-12-13T14:06:53Z"
  }, {
    "reportedcomment" : false,
    "body" : "I agree.\n\nFor walking Sigulda, Cēsis are the best cities.\n\nUnfortunately, You are here at the worst time of the year. regarding the weather, but still- these cities are the best.",
    "username" : "EternalSunshiner123",
    "timestamp" : "2024-12-13T08:27:46Z"
  }, {
    "reportedcomment" : false,
    "body" : "\"Dukāts\" [http://dukats.lv/en/](http://dukats.lv/en/)",
    "username" : "EmiliaFromLV",
    "timestamp" : "2024-12-13T08:37:46Z"
  }, {
    "reportedcomment" : false,
    "body" : "Loved this suggestion btw. Was nice to see a side to Latvia that wasn’t Riga. The canteen was great also. Thank you",
    "username" : "pigeon-25",
    "timestamp" : "2024-12-21T21:19:29Z"
  }, {
    "reportedcomment" : false,
    "body" : "Great to hear that! I hope you come back again in the summer.",
    "username" : "Loopbloc",
    "timestamp" : "2024-12-22T07:04:31Z"
  } ]
}