{
  "id" : 200430,
  "community_name" : "Rome",
  "username" : "RomeVacationTips",
  "post_body" : "[MegaThread] Colosseum tickets and visits. Please post here - don't start your own thread",
  "timestamp" : "2024-05-16 13:09:29",
  "num_comment" : 612,
  "reported_post" : false,
  "commenti" : [ {
    "reported_comment" : false,
    "body" : "[Hope my post in ItalyTravel sub helps!](https://www.reddit.com/r/ItalyTravel/comments/1curjbg/colosseum_tickets_info_tips_and_a_question/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)",
    "username" : "Disastrous-Peak-4296",
    "timestamp" : "2024-05-18 09:24:28"
  }, {
    "reported_comment" : false,
    "body" : "These are the times that the tours are offered based on Rome time. Was not readily posted when I was researching.\n\nFull Experience Underground with Arena – Guided Tour (English) - 9:30AM, 10:45AM, 12:15PM, 1:30PM, 3PM, 4:30PM\n\nFull Experience Underground with Arena (no guided tour) - 8:45AM, 9AM, 9:45AM, 10:30AM, 11 AM, 11:30AM, 1PM, 115PM, 2:30PM, 345PM, 4PM, 445 PM , 515PM\n\n  \nFull Experience Attico - 8:50AM, 9:10AM, 9:30AM, and new timeslot every 20 minutes until 5:10PM (8 spots per session)",
    "username" : "Specialist-Lab-8388",
    "timestamp" : "2024-08-03 17:42:39"
  }, {
    "reported_comment" : false,
    "body" : "For anyone still questioning ticket release times on the official website: I have just secured full experience + attic tickets at exactly 30 days out, exact time for time slot. I have been at this for two days now, constantly refreshing and trying to get tickets. They really do sell out within seconds. Milliseconds. Tickets are released every 20 minutes according to time slot- at the :50, :10, and :30 minute mark starting at 8:50 am Rome time. I recommend watching the clock app on your phone and refreshing the page exactly at the :59th second. \n\n\nAfter two days of trying to secure these tickets, it’s now 4am and I am slightly delirious and in disbelief. I’ve had the tickets emailed to me but there is no option to add to wallet or get an official digital copy of the ticket. Can anyone confirm that the pdf version of the tickets will suffice on the day of the tour?",
    "username" : "hurricanecris",
    "timestamp" : "2024-07-31 10:16:16"
  }, {
    "reported_comment" : false,
    "body" : "I managed to obtain Colosseum tickets this morning at 2:45 am EST. Basically I tried getting on the official Parcho Archeologico site beginning at 2:15 am and waited 10 minutes or so before being able  to log onto the site. Then I just kept refreshing until 2:45 am (8 :45 am Rome ) and was able to secure 3 tickets for the FuLL tour including underground. I think it was like 96 euros in total for a 10:45 am slot in June.",
    "username" : "aykarumba123",
    "timestamp" : "2024-05-16 22:51:42"
  }, {
    "reported_comment" : false,
    "body" : "Wanted to add they don't offer any refunds or vouchers. I had a severe injury and had to cancel my whole trip. No help with canceling or changing my tickets. Doesn't make sense since these tickets sell out instantly",
    "username" : "Sublime081",
    "timestamp" : "2024-05-17 00:14:35"
  }, {
    "reported_comment" : false,
    "body" : "I'm coming to you with a little trick, if you want to check the opening hours for tickets that are all sold out (e.g. you are planning to buy undeground), you can check some other day that is already sold out (it's not gonna work on the days that weren't released yet) by adding a date directly to url: [https://ticketing.colosseo.it/en/eventi/full-experience-sotterranei-e-arena/?t=2024-09-25](https://ticketing.colosseo.it/en/eventi/full-experience-sotterranei-e-arena/?t=2024-09-25) . You just need to add ?t={date} in the end. You could also check all of them for a month in inspect element -> sources, but the first method is much easier.",
    "username" : "Careful-Age-4945",
    "timestamp" : "2024-09-04 08:19:13"
  }, {
    "reported_comment" : false,
    "body" : "Got 2 adult tickets for general admission, traveling with 2 kids under 18 that are entitled to free tickets.  Not able to reserve for kids online.  I'm trying to get clarity on WHERE and HOW to pick-up tickets for children?  Do we stay in general ticketing line or go straight to security line? \nContacted help desk about it and got a generic answer that did not make it any easier to understand.  \n\n\"Children under 18 do not pay but must have a ticket. \nIf you choose the \"24h Colosseum, Roman Forum, Palatine\" ticket, you don't need to book but you can collect your ticket after entry.\nIf you book \"Full Experience\" tickets, you will be able to reserve the free ticket.\"\n\nThat \"collect your ticket after entry\" is confusing 😕 me.  Just looking for more details on where to go and where do we pick-up.   Anyone with experience traveling to Colosseum with small children (age 9), any advice will be appreciated!",
    "username" : "Lumpy-Ad-3325",
    "timestamp" : "2024-05-16 16:29:48"
  }, {
    "reported_comment" : false,
    "body" : "How do you get full experience tickets - we are traveling the end of June but I did a test run this week and was on the site early morning watching ticket time slots come on and none were avail - we are 2 adults and 4 kids - the most I could find were 2 tickets - do the kids need times tickets too? Or do they walk in free ?",
    "username" : "Lulu1074",
    "timestamp" : "2024-05-17 02:19:29"
  }, {
    "reported_comment" : false,
    "body" : "Dumb question: is the guided tour full experience with under group include a guide (actual person) through the entire colosseum and the rest of the areas?",
    "username" : "Internal_Parsnip_726",
    "timestamp" : "2024-05-17 06:30:57"
  }, {
    "reported_comment" : false,
    "body" : "FYI they just released a new type of ticket. Guided visit to Colosseum and access for 24h. Basically a full experience for one day instead of two. 26 euros. There was some availability even for the next days on the official website!",
    "username" : "None",
    "timestamp" : "2024-05-18 14:17:15"
  }, {
    "reported_comment" : false,
    "body" : "**Q: Timed Entry Helping Crowds?**  -  It's my understanding that the timed entry of individual tickets (as opposed to just tours) is somewhat new. (Please correct me if I'm wrong.) Have any repeat visitors to the Colosseum found that this has helped control the size of the overwhelming crowds? Every single post/article/question (including many of my own) seem to be about \"beating the lines\" and \"avoiding the crowds\" and so I was just wondering what people thought. For my own family, we direct booked an 8:30 am entry on a weekday and I'm hoping that minimizes some waiting and density. Thanks!",
    "username" : "merkinfuzz",
    "timestamp" : "2024-05-19 14:24:54"
  }, {
    "reported_comment" : false,
    "body" : "Where can I get tickets? [https://colosseo.it/](https://colosseo.it/) doesnt work and [https://www.coopculture.it/](https://www.coopculture.it/) just 404's",
    "username" : "Sammeeeeeee",
    "timestamp" : "2024-05-21 21:50:23"
  }, {
    "reported_comment" : false,
    "body" : "Has anyone successfully transferred their tickets to someone else? I would like to know details of that process in case I go that route. Thanks!",
    "username" : "Lost_Animator_5880",
    "timestamp" : "2024-05-24 14:46:35"
  }, {
    "reported_comment" : false,
    "body" : "Woo who else here is ready at 2:30am? Let’s do this 💪\n\nUpdate: Finally got tickets at 10:45am local time. [This post was helpful for me to get tickets, so I added details of my own experience to it!](https://www.reddit.com/r/ItalyTravel/comments/1curjbg/comment/l5mnz9m/)",
    "username" : "Lost_Animator_5880",
    "timestamp" : "2024-05-25 08:38:07"
  }, {
    "reported_comment" : false,
    "body" : "Hi I wanted to know if anyone has taken the official colosseum tour like the one that they offer not a 3rd party. I just want to know any info of what the tour is like and all the details that aren’t really anywhere else. Thank you!",
    "username" : "ptsy12",
    "timestamp" : "2024-05-28 14:55:43"
  }, {
    "reported_comment" : false,
    "body" : "\nHi! We purchased tickets for the full experience underground, but had a lot of difficulties checking out since 4 AM this morning. We ended up with  2 adult tickets , but are missing 2 tickets for our kids - for the full experience underground do kids need a reserved ticket - does anyone know? We had  them all in our cart several times but every time we went to check out it just said unable to check out at this time and the tickets would end up expiring.",
    "username" : "Lulu1074",
    "timestamp" : "2024-05-30 15:40:46"
  }, {
    "reported_comment" : false,
    "body" : "Actually insane that it's gotten this hard to get tickets to Colosseum.",
    "username" : "Reisewiki",
    "timestamp" : "2024-05-31 20:07:16"
  }, {
    "reported_comment" : false,
    "body" : "For sale: 1 Jul 2024, 09:50am, Full Experience with Attic Entry. 2 tickets.\n\nIt was very stressful trying to get the underground tickets just now, and I managed to get these 2 attic tickets as backup. Then some underground tour tickets opened up and I got them (tho I’ll have to join an Italian tour with 0 Italian proficiency), so I’m looking to sell the 2 attic tickets.\n\nAttic tickets are as difficult to buy as the underground ones, and the attic gives a great panoramic view of the colosseum!\n\nHappy to sell the tix at original price. Payment by UK bank transfer / HK bank transfer / HK PayMe etc. Based in HK so I’m happy to meet in person in HK too!",
    "username" : "pepsidash",
    "timestamp" : "2024-06-01 11:07:58"
  }, {
    "reported_comment" : false,
    "body" : "Anyone know why underground and arena tickets ain’t available for 8th and 9th of July yet??",
    "username" : "AdAstra3830",
    "timestamp" : "2024-06-09 13:31:21"
  }, {
    "reported_comment" : false,
    "body" : "I have 5, 24 Hr Arena Only tickets for 6/21 at 6pm  to sell.  18 euro each.  Message me if interested.   \n\nI bought them by mistake in my frenzy to get tickets 30 days out and now that I realize that \"Arena only\" is arena only ;-) we would prefer to see more.  Otherwise, does anyone know if you can \"add on\" to Arena Only tickets if there's availability at the gate?",
    "username" : "nattieo99",
    "timestamp" : "2024-06-14 07:56:58"
  }, {
    "reported_comment" : false,
    "body" : "What time do tickets go on sale? I know it is not at midnight as previously posted. Thank you.",
    "username" : "Exciting_Buffalo3738",
    "timestamp" : "2024-06-15 07:48:38"
  }, {
    "reported_comment" : false,
    "body" : "Is it a new thing that the [“Full experience with entry to the arena of the colosseum”](https://ticketing.colosseo.it/en/eventi/full-experience/?t=2024-06-23T06%3A30%3A00Z) tickets are now selling 1 week in advance rather than 1 month? These look like the ones I’d prefer to get, but was expecting to be able to get them 30 days out.",
    "username" : "adp5x7",
    "timestamp" : "2024-06-16 14:47:04"
  }, {
    "reported_comment" : false,
    "body" : "This is impossible. Also FYI, the timer on your cart means absolutely nothing.",
    "username" : "GirlyButScrappy",
    "timestamp" : "2024-08-04 16:24:54"
  }, {
    "reported_comment" : false,
    "body" : "HELLO HELLO  \nQuestion about: \"***FULL EXPERIENCE TICKET WITH ENTRY TO THE ARENA OF THE COLOSSEUM***\"\n\nSo being unlucky and trying for a few days now, I wasn't able to get underground/attic colosseum tickets.  \nI am now planning to buy \"***FULL EXPERIENCE TICKET WITH ENTRY TO THE ARENA OF THE COLOSSEUM***\".  \nbut upon checking, they only provide tickets within the 7 days for online and the other ones were blocked as \"Not Available Online\".\n\nFor this specific ticket, do they really provide tickets online only for 7 days in advance? As I thought they should be released 30 days in advance but I can't book for September first week. \n\nI don't want to risk buying last minute (atleast 1 week in before my trip to Rome) if this is the case. And really want to buy ahead of time and not line up for hours during the day of the trip to the colosseum.\n\nDoes anybody have any experience with this? Appreciate all the help. Thank you!",
    "username" : "tsikennuggets",
    "timestamp" : "2024-08-07 22:42:42"
  }, {
    "reported_comment" : false,
    "body" : "Selling 3 Tickets for Colosseum, 10:15 AM on August 24th. Bought the wrong dates, so just attempting to sell :)",
    "username" : "ilovestephencurry123",
    "timestamp" : "2024-08-19 20:23:17"
  }, {
    "reported_comment" : false,
    "body" : "We double booked by mistake, have an 1 extra FULL EXPERIENCE – UNDERGROUND LEVELS AND ARENA ticket for 9:00 am for 17 Sept 2024... hmu if interested",
    "username" : "cc-is-real-act-now",
    "timestamp" : "2024-08-21 14:19:35"
  }, {
    "reported_comment" : false,
    "body" : "I still have full experience + underground and arena guided tickets (italian) for the 3rd of september at 14:15! https://www.ticketswap.nl/listing/colosseum/13579357/accf7e40ea",
    "username" : "Fastjur",
    "timestamp" : "2024-08-22 16:03:41"
  }, {
    "reported_comment" : false,
    "body" : "Selling 2 Colosseum tickets for Monday 9/23 at 9am. Willing to sell at a discount!",
    "username" : "shitty_vegetarian",
    "timestamp" : "2024-08-24 10:43:07"
  }, {
    "reported_comment" : false,
    "body" : "Looking to buy 1x colosseum ticket for 22/23/24 of September",
    "username" : "x13132x",
    "timestamp" : "2024-08-25 23:15:11"
  }, {
    "reported_comment" : false,
    "body" : "Hi there! I have ONE ticket for English Full Experience (I believe that means Underground and the Arena) for Thursday August 5 at 10:45 am. I believe I would need to change the name on the ticket by Thursday, August 29 (so, in 2 days). I don’t want the ticket to go to waste!",
    "username" : "Due_Fold837",
    "timestamp" : "2024-08-27 16:24:53"
  }, {
    "reported_comment" : false,
    "body" : "I have 2 Full Experience with Attico Experience 9/25/2024 tickets for sale. The times are 12:50pm & 13:30pm. If anyone is interested. I paid $24 Euros each.",
    "username" : "AdAble1507",
    "timestamp" : "2024-08-27 23:43:14"
  }, {
    "reported_comment" : false,
    "body" : "I ended up buying 2 tickets together for the individual underground full experience for 26th September on the official website! \n\nWhat i did was I kept on checking for slots every 30 min since 10:30 in the morning and different tickets appeared after every 30 min for 15 min e.g 1:45pm to 2pm then 2:15pm to 2:30pm then 2:45 till 3pm and so on. I ended up buying mine at 3pm after trying a multiple times as you have to be very quick and it depends on luck cause they sell out in seconds and shows error.\n\nJust make sure you only refresh the page in that specific time of 15 min and by that i mean not vigorously or you’ll get blocked by the website, do it in a controlled manner after every 1 min and you will find maybe atleast 1 option during this time.\n\nAlso, if you want to increase your chances of finding them, you have to work like a pro and open your laptop along with your phone with different internet connections and then refresh the page on both devices for those 15min\n\nIt’s also better to log in to the official website before doing all this. \n\nWhat shocked me was when i refreshed the page at 3pm, it showed me 1 availability for 1pm on 26th September but since i needed 2 tickets, i randomly and hopelessly clicked on the option and added 2 tickets and to my surprise it suddenly took me to the checkout page with 2 tickets for 1pm. I quickly bought them. Loll\n\nThis system is weird af but I wish this helps you guys!",
    "username" : "Designer_Objective88",
    "timestamp" : "2024-08-29 22:07:09"
  }, {
    "reported_comment" : false,
    "body" : "I still have a ticket available for the 3rd of September, at 14:15. This is the full experience + underground + arena ticket, with a guided tour in italian. I paid 32 euro's total. With ticketswap fees it's 32,75 if you want to buy them: https://www.ticketswap.nl/listing/colosseum/13579357/accf7e40ea\n\nI can put your name on the ticket, I think this should be done a couple of days beforehand so if you want it, get it now!",
    "username" : "Fastjur",
    "timestamp" : "2024-08-30 16:15:32"
  }, {
    "reported_comment" : false,
    "body" : "I have two sets of full-experience tickets for the Colosseum on 9/27/2024 asking only the face value of tickets + ticket swap fees.\n\n2x Underground Full Experience Guided Tour + Arena in Italian Tickets at 2:15pm (14:15).\n\nIf you don't speak Italian - my boyfriend & I planned to use the My Colosseum app with headphones and follow the included audio tour in English as it automatically goes off based on where you are in the Colosseum at any given time.\n\n[https://www.ticketswap.com/listing/colosseum/13837831/e9a0121643?utm\\_campaign=publishedListingShare&utm\\_source=ticketswap&utm\\_medium=manualshare](https://www.ticketswap.com/listing/colosseum/13837831/e9a0121643?utm_campaign=publishedListingShare&utm_source=ticketswap&utm_medium=manualshare)\n\n2x Attic Full Experience tickets at 4:10pm (16:10).\n\n[https://www.ticketswap.com/listing/colosseum/13837728/e95d00a575?utm\\_campaign=publishedListingShare&utm\\_source=ticketswap&utm\\_medium=manualshare](https://www.ticketswap.com/listing/colosseum/13837728/e95d00a575?utm_campaign=publishedListingShare&utm_source=ticketswap&utm_medium=manualshare)\n\nJust so you know - I only bought these tickets on the 27th as we couldn't score them on the 25th and 26th (travel dates the 25-28) and we had already bought evening Vatican tickets for the 27th. When I saw Colosseum tickets on the 27th I bought them anyway in case I couldn't get them for the 28th with plans to forfeit Vatican tickets and get ones at a less desirable entry time another day. However, I did score both sets for the 28th somehow (I guess after 3 days of dealing with the system I figured out how to not get locked out of the site/when to reload/what to look for lol).\n\nAnyway, let me know if you have any questions!",
    "username" : "pastelmewnicorn",
    "timestamp" : "2024-08-31 17:53:45"
  }, {
    "reported_comment" : false,
    "body" : "Selling two full experience + underground tickets with guided tours for Sept 6.  One is for the Italian tour at 10:00, the other is for the English tour at 10:45. Asking face value plus any fee to transfer them to you!",
    "username" : "TheNotoriousRBF",
    "timestamp" : "2024-08-31 21:20:33"
  }, {
    "reported_comment" : false,
    "body" : "I’m looking for 2x tickets for FULL EXPERIENCE TICKET WITH ENTRY TO THE ATTIC OF THE COLOSSEUM for 9/22-9/25 please!",
    "username" : "Federal-Night6651",
    "timestamp" : "2024-09-06 09:05:11"
  }, {
    "reported_comment" : false,
    "body" : "Followed the tips on u/Disastrous-Peak-4296 post linked in a comment above, and managed to get my tickets after 30 mins of perseverance for the Full experience (underground, arena) guided tour in October…..except that the tour is in Italian💀 Said that the English tours were sold out/closed so I didn’t want to take the risk of not having any ticket and so got the Italian one. Guess I got a month left to grind on Duolingo.\n\nI’d like to add that refreshing the page was indeed NOT my friend. Few attempts (5 ish mins?) of doing so ended up getting me kicked out of the website with a tiny “Forbidden” message in the upper left hand corner. Luckily disconnecting from WiFi, and connecting through mobile data hotspot allowed me to get back in and continue trying.\n\nA pro tip that I found on Reddit when panicking after getting forbidden was to click back and forth through months on the calendar, as it updates every 1-2 mins. That helped me stay on the page and still update it without having to refresh the whole page and make the website think I’m a bot. Annoying but atleast it worked!\n\nGoodluck to everyone else fighting against the website to get their tickets!",
    "username" : "Agile_27",
    "timestamp" : "2024-09-11 11:14:05"
  }, {
    "reported_comment" : false,
    "body" : "Does anyone know what it means when it says on the website “Tickets not available online”?\n\nI’m trying to go on the 3rd of November or the 4th of November.",
    "username" : "rubetues",
    "timestamp" : "2024-10-29 15:25:28"
  }, {
    "reported_comment" : false,
    "body" : "Is the colosseum ticket website down? It said “unable to retrieve dates available for purchase” and couldn’t load the calendar no matter what type of tickets I selected.",
    "username" : "Chemical-Suspect9917",
    "timestamp" : "2024-10-31 10:16:45"
  }, {
    "reported_comment" : false,
    "body" : "From Ireland. Visiting Rome from c. 19 Nov for a few days with my wife. Seems to be a few different Colosseum tours, but if you do the main tour - you seem to miss the attic & underground tour? Any recommendations for Colosseum, Forum etc and Vatican, St Peters & Sistine?\n\nAny other sightseeing recommendations?",
    "username" : "jamesmksmith88",
    "timestamp" : "2024-11-01 21:48:18"
  }, {
    "reported_comment" : false,
    "body" : "Posting here in case anyone else is trying to go to colosseum on a “free” day:\n\nWe arrived bang on 08:30 when the ticket office starts and the queue was already at the Roman forum, which was around 5-6 minutes walk to get to (meaning this was how long it took to get to the end of the queue)\n\nWe queued for 1.75h and managed to get tickets at 10:15 to go in for 10:20. Be aware there will be people trying to sneak in the queue. One family kept on trying and people had to be a bit forceful with them but I saw that a couple further down the queue just let them in. This didn’t affect us but imo is really inconsiderate of the people behind the couple who have been queuing for almost 2 hours to get in. I had to tell a man trying to squeeze in beside me the end of the queue is a lot further back and he seemed to take it well. \n\nAs we were leaving around 12:00, the end of queue looked much much shorter. I’m not sure if I would recommend trying later in the day as I didn’t want to take the chance and be told they have tickets. But perhaps might be worth trying if you couldn’t get up early to join it before 08:30",
    "username" : "rubetues",
    "timestamp" : "2024-11-03 14:46:28"
  }, {
    "reported_comment" : false,
    "body" : "Hey guys. I have two official tickets for Colosseum (full experience, guided visit to underground) on May 28th that I am trying to resell, face value. I have up to a week before to change names. If someone is interested, hmu",
    "username" : "None",
    "timestamp" : "2024-05-16 13:09:29"
  }, {
    "reported_comment" : false,
    "body" : "I had to buy the 24H colosseum ticket instead of a full experience and wanted to add the 24H arena ticket on top of it. \n\nDoes anyone know 1) if I have to exit and go back through the security line and 2) if my colosseum entry is at 9am what’s a good time to plan for the arena entry? Thanks!",
    "username" : "user122313093",
    "timestamp" : "2024-05-16 18:08:43"
  }, {
    "reported_comment" : false,
    "body" : "I have one extra ticket for 9:30am on Sunday May 26. Accidentally purchased 7 instead of 6. Hard to keep track of when you buy everything separate and sometimes 30 mins apart and at 3am. I’ll sell at face value. 26$usd or 24Eur. Venmo is preferred",
    "username" : "vichina",
    "timestamp" : "2024-05-17 09:54:50"
  }, {
    "reported_comment" : false,
    "body" : "Is the night tour worth it? Where should I book? And do you get to see everything that you would in a day tour?",
    "username" : "Upstairs_Bison_1339",
    "timestamp" : "2024-05-17 21:11:26"
  }, {
    "reported_comment" : false,
    "body" : "Out of FOMO, I booked  2 two tickets for the FULL EXPERIENCE - ATTICO for the 29th of May at 12:30\n(Later managed to get the tickets I really wanted for the Underground the next day)\nAnyone interested in the tickets for the ATTICO?\nThe tickets have names but they can be changed once and only up to MAY 22 (7 days before)\nLooking to sell them at face value (24 euros each).",
    "username" : "rick_s_g",
    "timestamp" : "2024-05-17 21:50:43"
  }, {
    "reported_comment" : false,
    "body" : "Has anyone been able to purchase any Full Experience Arena tickets for June in the past few weeks?  Or even seen the time slots pop-up?",
    "username" : "Lumpy-Ad-3325",
    "timestamp" : "2024-05-18 16:29:35"
  }, {
    "reported_comment" : false,
    "body" : "u/romevacationtips, what's the difference between the [Colosseum Arena tour with Forum and Palatine Hill](https://romevacationtips.com/colosseum-arena-tour-with-forum-and-palatine-hill/) tour and the [Rome Vacation Tips tour of the Colosseum, Forum, and Palatine Hill](https://romevacationtips.com/rome-vacation-tips-tour-of-the-colosseum-forum-and-palatine-hill/) tour?",
    "username" : "stimak",
    "timestamp" : "2024-05-18 19:21:20"
  }, {
    "reported_comment" : false,
    "body" : "Like many others, I’m selling my tickets to the Colosseum due to a mistake when selecting the date. I had asked to see if I could change the date but they refused. I have the 2 standard COLOSSEO-FORO ROMANO PALATINO 24H tickets for entrance on May 24th, 12:15pm. I’m selling them each for 12 euros instead of 18, but I can receive the converted in CAD or USD.",
    "username" : "FinesseMaster19",
    "timestamp" : "2024-05-20 01:44:52"
  }, {
    "reported_comment" : false,
    "body" : "I ordered two tickets for the Colosseum through \"Tiqets\" for 10th June at 9:15 and 9:30 because they were the last tickets and had to be taken separately. Unfortunately, in a panic that someone else might buy them, I did not change my name to my sister's when buying the second ticket.\n\nI asked support and was told that it is not possible to change the name on the ticket, so I came here to ask will we have a problem at the entrance to the Colosseum?\n\nMy plan is that for the first appointment at 9:15  sister will enter in with me being present so I can show the document to the security that will confirm that I am the ticket holder who gives her the ticket, then I would enter at 9:30. \n\nI hope it won't cause a problem because why would anyone take two tickets in their name 15 minutes apart, and we both have the same last name which could be a mitigating circumstance that could confirm that I made an honest mistake when buying the ticket.",
    "username" : "Cuuli70",
    "timestamp" : "2024-05-20 13:04:17"
  }, {
    "reported_comment" : false,
    "body" : "Where exactly do you go to meet your group at the assigned time?  I have Underground tix - it’s seems vague and it will be crazy with people so I’d appreciate any advice.",
    "username" : "FearManach_1836",
    "timestamp" : "2024-05-21 03:36:30"
  }, {
    "reported_comment" : false,
    "body" : "Im seeing colosseum and forum tickets are sold out for the couple of days I’ll be there in the end of June. Is it possible they will release more tickets ? Any ideas ?",
    "username" : "Minimum-Ad631",
    "timestamp" : "2024-05-21 07:07:11"
  }, {
    "reported_comment" : false,
    "body" : "Hi! I’m selling 4 tickets on 6/19 at 415pm. I had a miscommunication with our guide and ended up booking the wrong date. Happy to sell for face value and transfer via email.",
    "username" : "delaneh13",
    "timestamp" : "2024-05-22 22:43:23"
  }, {
    "reported_comment" : false,
    "body" : "Selling 2 Full Experience Attic tickets.  1 Adult and 1 child 18- for 06/22/2024 10:50am.  €24 total",
    "username" : "Lumpy-Ad-3325",
    "timestamp" : "2024-05-23 19:10:45"
  }, {
    "reported_comment" : false,
    "body" : "May 22/24 experience buying colosseum tickets: \n\nI was not successful in obtaining the Individual Full Experience Underground tickets for 5 people that I wanted to get.\n\nI was on the website, logged in before 8:45 am Rome time (12:45 am MST) but tickets were not released as expected at 8:45 am. After constant refreshing of the web page for 2 hours, amidst heavy web traffic, I gave up and went to bed to discover in the morning that tickets were being released by time slot but sold out immediately. Several times, I was able to get 3 tickets in my cart - 2 shy of what I needed. I tried every subsequent time slot and refreshed between times to see if any tickets were released from carts by customers who didn't get what they were looking for.\n\nIn the end, I got 5 tickets for the 24H ONLY ARENA (but can't actually see how they are any different from the 24h – COLOSSEUM, ROMAN FORUM, PALATINE tickets which are more plentiful, but the same price).\n\nOne thing I noticed on the tickets sent by email is that we are to use is the Stern Entrance which may or may not have a shorter wait time. All in all, it was a frustrating process but I do have basic tickets which I am still grateful for. I do recommend trial runs on the days before so that you can make your selections fast and press <CONTINUE>. Once tickets are in your cart, you'll have breathing room to add names to tickets and check out. Best of luck!",
    "username" : "nattieo99",
    "timestamp" : "2024-05-24 06:47:25"
  }, {
    "reported_comment" : false,
    "body" : "Hello everyone,\n\nI wish to visit the undergrounds of the Colosseum on June 23rd, but I cannot find any available tickets. This morning, as soon as the tickets went on sale, they were already sold out. What do you recommend I do to avoid paying exorbitant prices on GetYourGuide?\n\nThank you in advance for your advice.",
    "username" : "ABET9497",
    "timestamp" : "2024-05-24 09:52:06"
  }, {
    "reported_comment" : false,
    "body" : "Selling 2 tickets for the underground colosseum on Sunday 6/23\n\n9am - underground access no tour (1 ticket) $40\n9:30am - underground tour in English (1 ticket) $55\n\nWas able to get 4 tickets together at a later time so no longer need these tickets! \n\nVenmo only, message if interested!",
    "username" : "walnuts758",
    "timestamp" : "2024-05-24 16:19:15"
  }, {
    "reported_comment" : false,
    "body" : "Hi there, does anyone know what the Italy circle icon means on the booking types? \n\nhttps://imgur.com/a/pkR7SlV\n\nNoticed it is present on the Colloseum and Domus Aurea bookings. I have tried searching and can't find any info.",
    "username" : "floralfox",
    "timestamp" : "2024-05-25 07:54:29"
  }, {
    "reported_comment" : false,
    "body" : "How long are the official guided tours?",
    "username" : "Lost_Animator_5880",
    "timestamp" : "2024-05-25 15:02:04"
  }, {
    "reported_comment" : false,
    "body" : "Hello\n\nI was able to get two guided tour tickets today for underground, but it is Italian guide because that was the only one I was able to cart. Would that be a problem? Because I don’t know any Italian",
    "username" : "Summuklubocek",
    "timestamp" : "2024-05-25 17:35:12"
  }, {
    "reported_comment" : false,
    "body" : "I am selling tickets for Monday 6/24.\n\n9:45am - underground access (2 adult)\n\n10am - underground access with Italian guide (1 adult and 1 child) (of course you can just ignore the guide as I intended to)\n\nI bought them from official site and can transfer names ONCE.\n\nVenmo only, message if interested!",
    "username" : "Waianaes",
    "timestamp" : "2024-05-25 18:34:19"
  }, {
    "reported_comment" : false,
    "body" : "ISO two tickets for June 6. The Viator site I used says that they can’t run their tour on that date anymore so I’m scrambling a bit.",
    "username" : "royal_air",
    "timestamp" : "2024-05-27 17:47:09"
  }, {
    "reported_comment" : false,
    "body" : "Hoping someone with recent experience can explain how we would go in with children?  I cannot figure out how to get tickets for the kids with us and it sounds like either we go to the ticket booth to get their tickets or we can get them inside after security at some booth inside.  I am confused and do not want to wait in a security line only to find out I should have gone to the booth first.  Can anyone help share any recent experience going I with kids?",
    "username" : "Snaky_Pompano_07",
    "timestamp" : "2024-05-27 18:11:57"
  }, {
    "reported_comment" : false,
    "body" : "Colosseum tickets for 06/15\n\nI have a couple of tickets to visit Colosseum in the afternoon of 06/15 and I can change the name to yours up until 8th June. DM me if interested.",
    "username" : "trumpb",
    "timestamp" : "2024-05-27 19:13:20"
  }, {
    "reported_comment" : false,
    "body" : "Does the new ticket system release a batch of tickets 7 days before like the old site does? Also interested in to buy tickets for sometime June 20-22 for full experience arena or underground!",
    "username" : "Jhueller",
    "timestamp" : "2024-05-28 00:06:49"
  }, {
    "reported_comment" : false,
    "body" : "Full experience tickets are sold out for June 12. Is there any way to buy them in person? If not, is the general admission tickets worth it?\n\nAlso if anyone is selling full experience June 12 tickets please feel free to DM me!",
    "username" : "allusernamestakenrip",
    "timestamp" : "2024-05-28 05:50:37"
  }, {
    "reported_comment" : false,
    "body" : "Is [Headout.com](http://Headout.com) Legit???? Has anyone booked shit from there???",
    "username" : "bangalang12334",
    "timestamp" : "2024-05-28 15:31:35"
  }, {
    "reported_comment" : false,
    "body" : "How long should we plan to stay at the Colosseum/palatine/forum? We are going in early July and are worried about the heat (we will be starting at the 8:30 slot)\n\nLike I do want to see the forum but I'm not super into history so I don't mind cutting that part short if it gets too hot.",
    "username" : "iamdefinitelynotayam",
    "timestamp" : "2024-05-29 02:35:35"
  }, {
    "reported_comment" : false,
    "body" : "I have 2 official Colosseum Full Experience (Underground) tickets for June 9th, at 12:30 available, looking just to recoup face value, as a buddy wasn’t able to get leave.\n\nAlso have 2 Vatican Museum tickets for the earliest 8:00am entrance on June 10th.",
    "username" : "Silmefaron",
    "timestamp" : "2024-05-29 08:22:38"
  }, {
    "reported_comment" : false,
    "body" : "I only want FULL EXPERIENCE TICKET WITH ENTRY TO THE ARENA but it looks like it is only sold 7 days in advance. Is there a reason for this? Why isn't it available 30 days before like all the other tickets? On the old site it was available 30 days before",
    "username" : "EmotionalDream2747",
    "timestamp" : "2024-05-29 08:53:44"
  }, {
    "reported_comment" : false,
    "body" : "I will be going back to Rome for a 4th time this August. I have visited the Colosseum three times (standard tour/visit) so I was hoping to do something a little different this time around. I would love to do the nighttime tour, but unfortunately it looks like those are only on Saturdays and I won’t be there during the weekend. But I have never done the daytime underground tour before and am wondering if it is worth it. I’m seeing tours ranging from about $160-$180. Would love some input/suggestions about this. Thanks!",
    "username" : "boo_you_whore",
    "timestamp" : "2024-05-29 23:15:06"
  }, {
    "reported_comment" : false,
    "body" : "I will be in Rome on June 19 and can’t for the life of me find any tours for the colosseum online as they are all sold out. If I went with a group of 7 could I purchase tickets at the Colosseum or do I need to do so ahead of time?",
    "username" : "ConsiderationOk4983",
    "timestamp" : "2024-05-31 05:09:54"
  }, {
    "reported_comment" : false,
    "body" : "Selling 2 Colosseum Underground access tickets June 20th, 11am. \"Parco archeologico del Colosseo for the activity Ingresso Sotterranei.\" \n\nSelling for face value, no markup. 24 Euro per ticket, $52 USD for both. Venmo/PayPal/AppleCash/Zelle. \n\nYou have to be there 30 minutes prior for the underground entry. Hope to get someone these tickets to enjoy the underground! It's a beast to get them. DM if interested.\n\nThanks",
    "username" : "hbkrem",
    "timestamp" : "2024-05-31 22:17:22"
  }, {
    "reported_comment" : false,
    "body" : "Hello! I have 2 standard COLOSSEO-FORO ROMANO PALATINO 24H tickets for entrance on June 6th. Selling each for 14 euros instead of the original 18!",
    "username" : "ExpertMaybe2980",
    "timestamp" : "2024-06-01 00:52:06"
  }, {
    "reported_comment" : false,
    "body" : "SELLING OFFICIAL COLOSSEUM UNDERGROUND ARENA GUIDED TICKETS. Due to a family communication error we accidentally booked multiple tickets for the same day. Selling for face value:\n\n6/28: 3 tour tickets in Italian at 12:00pm \n6/28: 2 tickets in English at 12:15pm\n\nPlease let me know if you’re interested as I can transfer the name on the ticket one time.",
    "username" : "Tasty_Construction44",
    "timestamp" : "2024-06-01 14:58:14"
  }, {
    "reported_comment" : false,
    "body" : "I'm looking for Colosseum ticket for 5 people on June 29 or 30. I could not get any as everywhere it is unavailable. If anyone planning to sell please do let me know. Thanks in advance",
    "username" : "kya-karoge",
    "timestamp" : "2024-06-01 19:58:27"
  }, {
    "reported_comment" : false,
    "body" : "Anyone have any tickets for tomorrow? (June 2nd) tour or otherwise?",
    "username" : "umichbball1",
    "timestamp" : "2024-06-02 00:17:55"
  }, {
    "reported_comment" : false,
    "body" : "If you buy the \"FULL EXPERIENCE - UNDERGROUND LEVELS AND ARENA - GUIDED TOUR\" from [colosseo.it](http://colosseo.it), are you only provided a guided tour of the Colosseum Underground levels, or does your guided tour cover the entire Colosseum, the Forum, and Palatine Hill?",
    "username" : "A_Rag_Man_",
    "timestamp" : "2024-06-02 19:52:17"
  }, {
    "reported_comment" : false,
    "body" : "Hi, I have an extra ticket for the colosseum (FULL EXPERIENCE – UNDERGROUND LEVELS AND ARENA) for the 9:45AM entry on the 23rd of june. Looking for someone to take it off my hands",
    "username" : "level5iceberg",
    "timestamp" : "2024-06-02 22:43:56"
  }, {
    "reported_comment" : false,
    "body" : "Anyone have tickets for June 4th or 5th for two?",
    "username" : "bobabeeb",
    "timestamp" : "2024-06-03 09:28:53"
  }, {
    "reported_comment" : false,
    "body" : "How long is the line to get past security typically? Early July - let's say I get a 10am Underground tour, when should we get in line? Or do timed tours let you skip the line?",
    "username" : "BiscuitAnger",
    "timestamp" : "2024-06-04 17:20:55"
  }, {
    "reported_comment" : false,
    "body" : "Hey, we've just landed in Rome, and I feel like an idiot for not researching things beforehand... we're 2 adults and a baby here untill the 8th if anyone has tickets available!",
    "username" : "romangeezer",
    "timestamp" : "2024-06-04 22:21:26"
  }, {
    "reported_comment" : false,
    "body" : "Hi everyone - If I purchase an \"individual ticket\" for 24H ARENA ONLY for the Colosseum (July 5), Does anyone know if they will let you in if you're 10-15 mins late of your time slot? For example, I'm thinking of booking 12PM but I won't arrive there until 12:10pm - 12:15pm.  If anyone has experience of being late of your time slot, your info is appreciated! I'm trying to avoid booking the next available timeslot which is 1:20pm",
    "username" : "tranceORtronce",
    "timestamp" : "2024-06-05 19:09:43"
  }, {
    "reported_comment" : false,
    "body" : "Has anyone bought the Family annual membership? I wonder if that would give you access only the main floor? How reduced is the Domus Aurea ticket, it doesn't specify?",
    "username" : "Safe_Organization592",
    "timestamp" : "2024-06-05 23:14:27"
  }, {
    "reported_comment" : false,
    "body" : "Hello, I have an extra pair of Colosseum Full Experience Attico tickets for Wednesday, July 3rd, 9:30am. Please let me know if anyone is interested!",
    "username" : "JB-360",
    "timestamp" : "2024-06-06 03:39:42"
  }, {
    "reported_comment" : false,
    "body" : "We are going to Rome for the first time on August 28 - September 2. 4 adults and a 4 year old. We are getting a headache trying to find tickets. Where do you recommend buying tickets from and what kind of tickets? Thanks in advance! 🙏",
    "username" : "deiviuxs",
    "timestamp" : "2024-06-08 00:48:51"
  }, {
    "reported_comment" : false,
    "body" : "Does anyone know why the full guided tour on 8 July is not available online while 9 July is already fully sold out on the official website? [https://ticketing.colosseo.it/en/eventi/full-experience-sotterranei-e-arena-visita-guidata/](https://ticketing.colosseo.it/en/eventi/full-experience-sotterranei-e-arena-visita-guidata/)",
    "username" : "Electronic_Heat_4618",
    "timestamp" : "2024-06-09 10:27:02"
  }, {
    "reported_comment" : false,
    "body" : "June 15th 1:30am Colosseum entry and arena - 2 tickets selling for $40 total",
    "username" : "DarkRoomFlowerBloom",
    "timestamp" : "2024-06-09 13:08:35"
  }, {
    "reported_comment" : false,
    "body" : "Urgent help needed!\n\nI bought previously two tickets via third party “Tiqets” for Colosseum, Roman Forum and Palatine Hill (all in one included). Schedule for both of them is tomorrow with 15 minutes entry difference. Catch is that I made honest mistake when ordering because I named myself ticket holder for both of them instead naming my sister for one of them. It’s so clearly  honest mistake beacuse why would anyone buy two tickets for themself on the same day with 15 minutes difference in beetwen and sister and I have last name. I asked guy in some yellow shirt at the first entry point and he told me that he can let her in, but rest of security check or whatsoever not gonna let her go and that we need to wait in line tommorow to buy new ticket. I’m so nervous right now and mad to be honest beacuse it’s such a clear situation and I see no reason for slight tolerance in our case. Whats your opionion, is there still a posibility that they will let us both in? Is there some info or complaint desk or something similar or some staff with higher authority then those guys at the entry point that I can go to to explain myself and potentionally get permsion for sister to go in? Any advice will be much desirable..",
    "username" : "Cuuli70",
    "timestamp" : "2024-06-09 21:11:02"
  }, {
    "reported_comment" : false,
    "body" : "Hi all!\n\nI have been trying to get a ticket “FULL EXPERIENCE – UNDERGROUND LEVELS AND ARENA” from the official website. \n\nhttps://ticketing.colosseo.it/en/eventi/full-experience-sotterranei-e-arena/\n\nAnyone has any idea why there is no tickets from 7 July to 10 July? Not that they ran out of stock, they are actually not on sale online. Why is that?? I’m desperate, please.",
    "username" : "Competitive-Sink-861",
    "timestamp" : "2024-06-10 09:34:24"
  }, {
    "reported_comment" : false,
    "body" : "I want to buy tickets for Colosseum, Pantheon, Forum and Vatican and visit in period of 3 days (16th - 18th June). What is the best site to buy tickets from?  I would be able to wait in line for Colosseum and Vatican (for chraper price ofcourse)",
    "username" : "mcurlinoski",
    "timestamp" : "2024-06-10 19:18:08"
  }, {
    "reported_comment" : false,
    "body" : "I have 2 ticket for the colosseum (FULL EXPERIENCE – UNDERGROUND LEVELS AND ARENA) for the 9:45AM entry on the 6/24. Message me if interested. ",
    "username" : "Waianaes",
    "timestamp" : "2024-06-11 00:11:02"
  }, {
    "reported_comment" : false,
    "body" : "[removed]",
    "username" : "None",
    "timestamp" : "2024-06-12 06:57:49"
  }, {
    "reported_comment" : false,
    "body" : "Help needed to manage under 18yo tickets\n\nHi\nIf I buy ONE REGULAR entry with a timed slot to colosseum online in advance for myself. Do I go through security simply with my 2 kids then obtain free entry for my kids on the other side? \n\nIs that how I secure a specific timing for all of us 3 without paying full price for 3? Or they could say that there is no more availability?\n\nI intend to start with Roman forum or palatin and finish with colosseum. Can I obtain the free tickets there?\n\nThank you",
    "username" : "ckinn",
    "timestamp" : "2024-06-12 21:32:23"
  }, {
    "reported_comment" : false,
    "body" : "Hello! I'm going to Rome in August with my family and looking to buying tickets for the colosseum. I would like to know which ticket option would be best. Thank you!",
    "username" : "Interesting_Long_413",
    "timestamp" : "2024-06-13 09:31:35"
  }, {
    "reported_comment" : false,
    "body" : "The ticketing process seems much more complicated than I was expecting.  I'm looking for tix for 4 people (incl. two kids) for July 2.   There's nothing on the official site, so now I have to go to a reseller on Expedia?",
    "username" : "atgreen",
    "timestamp" : "2024-06-14 20:21:14"
  }, {
    "reported_comment" : false,
    "body" : "I have two 24h Colosseum/Forum/Palatine tickets for 3rd July, 2024 at 9:30am.  Double booked.  I can change the names on the tickets once at least a week before the scheduled time.  €15 each.",
    "username" : "Impossible_Side8561",
    "timestamp" : "2024-06-15 17:15:58"
  }, {
    "reported_comment" : false,
    "body" : "Looking to buy 1x Colosseum tickets for 1 July any timing:\n\nFull experience - attic\nFull experience- underground\n\nPlease let me know if you are looking to sell, thank you!",
    "username" : "East_Advisor_8582",
    "timestamp" : "2024-06-16 10:02:22"
  }, {
    "reported_comment" : false,
    "body" : "Selling 4 x 24H Colosseum, Palantine hill and Forum tickets for July 8th (Colosseum entrance booked for 8.30am)\n\nCost = 18 euros per ticket\n\nPlease reach out if interested. I can get the names changed.",
    "username" : "One_Crow6520",
    "timestamp" : "2024-06-18 13:44:52"
  }, {
    "reported_comment" : false,
    "body" : "[deleted]",
    "username" : "None",
    "timestamp" : "2024-06-22 06:13:53"
  }, {
    "reported_comment" : false,
    "body" : "Visiting the colosseum and I have a question about tickets.  Just for confirmation really that I can actually do what I’m planning?  If I buy the Full Experience ticket with entry to the attic from the official website I have 2 days to use the tickets including access to the forum and supersites etc.  Let’s say I book the ticket visit date as Saturday 17th August 9am can I use those tickets to visit the Roman forum 2 days before ie the morning of Thursday 15th August? Then use them to visit the colosseum on the ticket date of 17th?",
    "username" : "spurious_poster",
    "timestamp" : "2024-06-23 18:35:58"
  }, {
    "reported_comment" : false,
    "body" : "Hello! My father bought 4 tickets from this site https:// ticketing.colosseo.it/en/customer/#reservation-history-\nanchor but he chose them for the wrong month ( and only noticed after paying them ( it was 6 am:)) ) Do you know if we can cancel them or contact them to ta k about this issue?Or anything we can do?!",
    "username" : "lacatisiulia12",
    "timestamp" : "2024-06-25 07:48:52"
  }, {
    "reported_comment" : false,
    "body" : "https://preview.redd.it/oc60cs6h4o8d1.jpeg?width=1080&format=pjpg&auto=webp&s=1c20ab132aeb171f8f7e34a3e24001dbee668d73\n\nI’m selling 2 tickets for tomorrow at the price of one! I got the wrong date by mistake :(",
    "username" : "lacatisiulia12",
    "timestamp" : "2024-06-25 09:13:52"
  }, {
    "reported_comment" : false,
    "body" : "I'm looking to purchase the full experience tickets for August 31. The website https://ticketing.colosseo.it/en/eventi/full-experience-sotterranei-e-arena-visita-guidata/\ndoesn't have those dates open. Anyone know how far in advance they open the dates for purchase?",
    "username" : "GodotNeverCame",
    "timestamp" : "2024-06-25 17:51:11"
  }, {
    "reported_comment" : false,
    "body" : "Looking to BUY 2 colloseo tickets (FULL EXPERIENCE – UNDERGROUND LEVELS AND ARENA – GUIDED TOUR) for any time for any of these days: 07/20, 07/21 or 07/24. Tour language is preferred to be english",
    "username" : "Zhirnis",
    "timestamp" : "2024-06-25 20:33:02"
  }, {
    "reported_comment" : false,
    "body" : "Looking to buy 2 Colosseum full experience guided tour tickets (English). For any time between 02.07-06.07.",
    "username" : "vinyliraptor",
    "timestamp" : "2024-06-26 15:07:10"
  }, {
    "reported_comment" : false,
    "body" : "Hello!\nI would be visiting Rome with my family in two weeks, it was very last minute and we couldn’t get tickets for the Colosseum and the Vatican since they were already sould out. \nCan we get the tickets there on the same day? We don’t mind queuing since we’ll be in Rome for 15 days.",
    "username" : "coneyisland1989",
    "timestamp" : "2024-06-26 15:33:46"
  }, {
    "reported_comment" : false,
    "body" : "I gave in after having trouble for 2 days trying to get underground full experience tickets and ended up getting the underground guided tour in Italian.  None of my family speaks Italian and wanted to see what others experiences are going on this tour.  We are visiting from the United States and this was the only tickets we can get.  Will we be okay on the tour?  Traveling with a few kids too.",
    "username" : "Snaky_Pompano_07",
    "timestamp" : "2024-06-27 04:21:18"
  }, {
    "reported_comment" : false,
    "body" : "Reposting my questions here as directed by the  Mods:\n\nMy brain is not functioning 100% at the moment (allergies are bad where I am) and I'm so very confused with the different ticket options on the website.\nWe have been planning our itinerary, we will be there in August (bringing personal fans to keep as cool as possible). Can someone please explain the \"full experience\" ticket like I'm a child lol. Also, because the page won't load for me, what are the \"Super Sites\"?\nDo we have to buy separate tickets for the Domus Aurea? Is it worth going to?",
    "username" : "Acceptable_Mud_",
    "timestamp" : "2024-06-27 08:18:26"
  }, {
    "reported_comment" : false,
    "body" : "BUYING:\n\n# FULL EXPERIENCE TICKET WITH ENTRY TO THE ATTIC OF THE COLOSSEUM  OR UNDERGROUND for JULY 8th OR JULY 20th. Please let me know if you are selling the ticket!",
    "username" : "LetsWorkTogetherAll",
    "timestamp" : "2024-06-27 17:10:30"
  }, {
    "reported_comment" : false,
    "body" : "Could someone please explain how to use the Full Expiernace ticket?  \nIf I book a time for the Colosseum visit, could I use the same ticket to visit the other parks BEFORE my scheduled visit to the Colosseum?   \nFor example, could I visit the other places included in the ticket on 7/19 and then come to my Colosseum ticket on 7/20? Or do I need to first visit the Colosseum? Thank you so much in advance for any guiadance.",
    "username" : "LuvLeeStasia",
    "timestamp" : "2024-06-29 04:17:04"
  }, {
    "reported_comment" : false,
    "body" : "Selling 4 collosseum tickets July 8th - 8.30am\n\n-  4 collosseum tickets (includes palatine hill & forum for 24 hrs) \n - Colloseum access time: 8.30am\n- Selling because we managed to purchase underground tickets instead.\n- Cost: 18 euros per ticket\n- Name change possible until June 30th midnight",
    "username" : "One_Crow6520",
    "timestamp" : "2024-06-29 20:55:07"
  }, {
    "reported_comment" : false,
    "body" : "Got 2 tickets on July 4 at 8:30am\n\n# 24h – COLOSSEUM, ROMAN FORUM, PALATINE\n\nLet me know if you would like these",
    "username" : "kidtron123",
    "timestamp" : "2024-06-30 08:03:39"
  }, {
    "reported_comment" : false,
    "body" : "[removed]",
    "username" : "None",
    "timestamp" : "2024-06-30 13:47:08"
  }, {
    "reported_comment" : false,
    "body" : "Buying: 15. of July \n2 X adults and 1 9yo child, looking for tickets to Colosseum, would be great if we could get acces to the attic.",
    "username" : "tomzaw83",
    "timestamp" : "2024-07-03 21:25:40"
  }, {
    "reported_comment" : false,
    "body" : "I need to sell 2 [UNDERGROUND entrance tickets](https://ticketing.colosseo.it/en/eventi/full-experience-sotterranei-e-arena/)  due to not being able to secure enough for my entire family. Details:  \n  \nDate: 18 July, 2024  \nEntrance time: 08:45am  \nCost: $50 for both (less than face value)",
    "username" : "adp5x7",
    "timestamp" : "2024-07-08 17:06:16"
  }, {
    "reported_comment" : false,
    "body" : "BUYING: Hello would like to buy 2 tickets to the colosseum for August 11. Any kind of ticket that gives entry to the colosseum is fine :)",
    "username" : "pranavlavanya",
    "timestamp" : "2024-07-12 09:40:24"
  }, {
    "reported_comment" : false,
    "body" : "BUYING:   \nFirst time in Italy for me and my girlfriend. Arriving with plane 11 the 24. of july and want to a guided tour on the Colosseum the same day. As I understand from here it is hopeless to go in the day, but we are only in Rome for a couple of days, so planning to do Colosseum the first and the Vatican the next.",
    "username" : "None",
    "timestamp" : "2024-07-13 22:19:43"
  }, {
    "reported_comment" : false,
    "body" : "Colosseo regular “admission ticket” - what does it include?\n\nAt first I thought it was the Arena ticket, \n\nhttps://ticketing.colosseo.it/en/eventi/24h-colosseo-foro-romano-palatino/\n\nbut then I found out there is a specific ticket for that \n\nhttps://ticketing.colosseo.it/en/eventi/24h-only-arena/\n\nAnd there is a third option that seems to combines both \n\nhttps://ticketing.colosseo.it/en/eventi/full-experience/\n\nDoes anyone know what does the first one include ?",
    "username" : "MaxPower1987x",
    "timestamp" : "2024-07-14 08:49:29"
  }, {
    "reported_comment" : false,
    "body" : "Hi all. I purchased the wrong date for the regular admission to the regular colosseum/forum/palatine entry (18€). I have 4 tickets for 7/29 @8:45am if anyone is interested. Open to offers.",
    "username" : "No_Week_7004",
    "timestamp" : "2024-07-14 09:20:48"
  }, {
    "reported_comment" : false,
    "body" : "Looking to buy 2 tickets of any type, any day 7/15-17, please DM 🙏🏻",
    "username" : "newy66",
    "timestamp" : "2024-07-14 17:44:02"
  }, {
    "reported_comment" : false,
    "body" : "giving away: 1 ticket for \"COLOSSEO-FORO ROMANO PALATINO 24H\" for 7/17 (Wednesday)",
    "username" : "desantanasf",
    "timestamp" : "2024-07-15 13:16:49"
  }, {
    "reported_comment" : false,
    "body" : "**2 Tickets For Sale August 10th**\n\n2 tickets - Tickets for Colosseum, Gladiators Arena, Roman Forum & Palatine Hill: Guided Tour.\n\nFULL EXPERIENCE - UNDERGROUND LEVELS AND ARENA - GUIDED TOUR - Italian* - 10th Aug - 10:00am Selling as we managed to get the English tour. I will change the name on the ticket once it is purchased.\nThese tickets are valid on Aug 10.\n\nPlease DM me or reply here if you need more info. Also you can check the same tickets we have added on TicketSwap https://www.ticketswap.com/listing/colosseum/13297205/729837c0e6",
    "username" : "cnf271",
    "timestamp" : "2024-07-16 02:53:36"
  }, {
    "reported_comment" : false,
    "body" : "Buying: 1st of August or 2nd of August 1X adult,   \n  \nLooking for tickets to access the attic or underground levels. Please DM if looking to sell, Thanks!",
    "username" : "sir_hairy_man",
    "timestamp" : "2024-07-16 08:02:43"
  }, {
    "reported_comment" : false,
    "body" : "Hello. I have read all the threads, posts, directions from everyone about getting Colosseum tickets. Today, I did a trial run just to see how the actual purchasing works for getting basic tickets into the site--nothing fancy, just basic individual access tickets. I chose random July dates even though my trip is not until next month. For any day, at any time, even though the time slot was open, I get a 'couldn't update quantity' error code--even for purchasing one ticket. What am I doing wrong? In two days, I need to set my alarms and try and get some tickets, but this seems almost impossible. Any help or tips would be appreciated.",
    "username" : "Winter-Welcome7681",
    "timestamp" : "2024-07-16 19:36:05"
  }, {
    "reported_comment" : false,
    "body" : "Giving away 5 tickets for 18/7 at 8:30 am - free",
    "username" : "CheeseLover420",
    "timestamp" : "2024-07-17 01:34:05"
  }, {
    "reported_comment" : false,
    "body" : "hi all! is it possible to buy an 11AM and an 11:15AM full entry ticket with access to the arena, and just one of us go in at 11 and wait for the other to enter?",
    "username" : "peacefulhoax",
    "timestamp" : "2024-07-17 02:07:14"
  }, {
    "reported_comment" : false,
    "body" : "**Selling 2 FULL EXPERIENCE Tickets for August 16, 2024**\n  \n\nFULL EXPERIENCE - UNDERGROUND LEVELS AND ARENA - GUIDED TOUR - *Italian* - August 16, 2024 at Noon!  \n\n\nI managed to get the English tour at a later time, so I no longer need these tickets. I’m selling at face value (the price I paid) to help a fellow Redditor. I will change the name on the tickets to your name once purchased. \n  \n\nPlease DM me or reply here if interested. Have a great trip!",
    "username" : "NotNikki",
    "timestamp" : "2024-07-17 16:47:59"
  }, {
    "reported_comment" : false,
    "body" : "Selling 4 FULL EXPERIENCE Tickets for August 16, 2024, also have 3 under 18 Full Experience tickets if interested \n\n4 adult/3 under 18 FULL EXPERIENCE - UNDERGROUND LEVELS AND ARENA - GUIDED TOUR - Italian - August 16, 2024 at 2:15!\n\nI managed to get the English tour at a later time, so I no longer need these tickets. I’m selling at face value (the price I paid) to help a fellow Redditor. I will change the name on the tickets to your name once purchased.\n\nPlease DM me or reply here if interested. Have a great trip!",
    "username" : "Traditional-Cable478",
    "timestamp" : "2024-07-17 19:06:35"
  }, {
    "reported_comment" : false,
    "body" : "Anyone can please explain me what exactly can we see in this ticket at the Colosseum, considering it doesn't have access to the Arena, Attic, or Underground? [https://ticketing.colosseo.it/en/eventi/24h-colosseo-foro-romano-palatino/](https://ticketing.colosseo.it/en/eventi/24h-colosseo-foro-romano-palatino/)",
    "username" : "MaxPower1987x",
    "timestamp" : "2024-07-18 10:20:08"
  }, {
    "reported_comment" : false,
    "body" : "I bought the Attic tickets. I have seen comments about people being able to get into the Arena with these tickets. Is this still the case? If so, what's the process? Trip is in August. Thanks!",
    "username" : "rute_bier",
    "timestamp" : "2024-07-19 00:51:48"
  }, {
    "reported_comment" : false,
    "body" : "I'm interested in three tickets for the full experience any day from 11-13 August. Thanks!",
    "username" : "donnydraws",
    "timestamp" : "2024-07-19 21:52:37"
  }, {
    "reported_comment" : false,
    "body" : "FULL EXPERIENCE TICKET WITH ENTRY TO\nTHE ATTIC - 08/17 9:30AM - 2 full price tickets available from the official site. DM me or comment if you’re interested. I will change the name on the tickets once purchased. ",
    "username" : "Relative-Ganache-891",
    "timestamp" : "2024-07-19 23:29:09"
  }, {
    "reported_comment" : false,
    "body" : "Full experience ticket with entry to the Attic of the Colosseum for August 7, 2024 at 9:30am.\n\nSeeing if anyone is interested as we ended up with an extra ticket.\n\nCan sell at the purchased price of €24.00",
    "username" : "Middle-Crab3184",
    "timestamp" : "2024-07-20 21:25:34"
  }, {
    "reported_comment" : false,
    "body" : "Anyone have extra/ spare full expereience tickets for August 5/6. Thank you.",
    "username" : "Large_Examination654",
    "timestamp" : "2024-07-25 18:55:15"
  }, {
    "reported_comment" : false,
    "body" : "Selling 2 Colosseum Tickets August 25 (8/25) FULL EXPERIENCE – UNDERGROUND LEVELS AND ARENA – GUIDED TOUR in Italian at Original Price (booked the wrong time on the official website). Please message me so I can change the tickets to your name. You can also buy them on ticket swap if you feel more comfortable doing that. (Or you can do it yourself through this link: https://ticketing.colosseo.it/ticket?mtref=confpren)\n\n[https://www.ticketswap.com/listing/colosseum-full-experience/13500158/6b15bc9973?utm\\_campaign=publishedListingShare&utm\\_source=ticketswap&utm\\_medium=manualshare](https://www.ticketswap.com/listing/colosseum-full-experience/13500158/6b15bc9973?utm_campaign=publishedListingShare&utm_source=ticketswap&utm_medium=manualshare)",
    "username" : "Logical_Bowl1247",
    "timestamp" : "2024-07-27 17:37:07"
  }, {
    "reported_comment" : false,
    "body" : "Can one buy and successfully use this combo of tickets:\n\n\"24H ONLY ARENA\" & \"24h – COLOSSEUM, ROMAN FORUM, PALATINE24h – COLOSSEUM, ROMAN FORUM, PALATINE\" in order to access the arena floor, as well as other parts of the colosseum? Having never been there before, I don't quite understand if we show up to enter at the appropriate time at the Arena, can we then access the rest of the colosseum with our other ticket or do we have to exit and reenter (which we would not want to do for obvious reasons)?\n\nStruggling to get the FULL EXPERIENCE tickets, but seeing that these are available (and yes, I'm aware they would cost more total).",
    "username" : "stremyd",
    "timestamp" : "2024-07-28 16:23:52"
  }, {
    "reported_comment" : false,
    "body" : "I bought \"FULL EXPERIENCE - ATTICO\" tickets.  I'm assuming this doesn't give access to the Arena floor.  If my wife and I wanted to go onto the floor, would we have to also purchase 24hr Only Arena tickets or is there an add on option available?",
    "username" : "bladeofdeath3",
    "timestamp" : "2024-07-29 09:22:04"
  }, {
    "reported_comment" : false,
    "body" : "Buying 2x Full Experience tickets for 25 th or 26 th of August",
    "username" : "Trexaty92",
    "timestamp" : "2024-07-30 03:28:32"
  }, {
    "reported_comment" : false,
    "body" : "Selling 2 tickets for the 1st of August with the full experience in the Colosseum with the underground and arena, at 10:30.  \nSelling at 24€ (buying price).",
    "username" : "HugoFigas",
    "timestamp" : "2024-07-30 19:19:25"
  }, {
    "reported_comment" : false,
    "body" : "What time did y’all buy the official Full Experience guided tour tickets? I emailed the official site folks, and they said the tickets go out at 8:30 Rome time 30 days before the day of interest. However, when I went on at this time today just as a trial run, there were no tickets even though I waited for 15 extra minutes. Some hours later, I woke up again and the tickets were sold out. ",
    "username" : "iamacloudofpanic",
    "timestamp" : "2024-07-30 20:28:54"
  }, {
    "reported_comment" : false,
    "body" : "I’d like to sell my two underground tour tickets for the colosseum for Monday, August 5th. They are for a 3:30 slot and the tour is in Spanish. We decided to go with a different level tour. Tickets were purchased directly from the official website so they were relatively cheap. Total of €64. \n\nOnly catch is that the ticket office told me I can only change the names within 7 days before the reservation. Today is the 8th day however, when I attempt to edit the name, it looks like the system might allow me. Today might be the last day that that’s possible though. So , I am willing to give it a try",
    "username" : "boo_you_whore",
    "timestamp" : "2024-07-30 23:29:02"
  }, {
    "reported_comment" : false,
    "body" : "Selling 2 Colosseum Tickets Guided in English August 26, 2024 10:30 am. COLOSSEUM – GUIDED TOUR in ENGLISH at Original Price (booked the wrong time on the official website). Please message me so I can change the tickets to your name. You can also buy them on ticket swap if you feel more comfortable doing that. (Or you can do it yourself through this link: https://ticketing.colosseo.it/ticket?mtref=confpren)\n\nhttps://www.ticketswap.com/listing/colosseum-guided-tour-english/13525220/0a3d4f9402?utm_campaign=publishedListingShare&utm_source=ticketswap&utm_medium=manualshare",
    "username" : "solewashed83",
    "timestamp" : "2024-07-31 02:57:23"
  }, {
    "reported_comment" : false,
    "body" : "Buying colosseum full experience tickets ( 2x) between 19th and 25th of August ",
    "username" : "Both-Natural-8804",
    "timestamp" : "2024-07-31 14:39:15"
  }, {
    "reported_comment" : false,
    "body" : "  \nbuying full experience tickets between Aug 28th and Aug 31. Doesnt matter if its guided Spanish",
    "username" : "Ok-Bag6241",
    "timestamp" : "2024-08-01 08:54:04"
  }, {
    "reported_comment" : false,
    "body" : "So if anyone is curious, I was able to get 2 full experience Attico tickets. I was hoping for underground and arena tickets but I didn’t have any luck seeing any pop up. I had my iPad w/ the guided option open and a laptop with the non guided option open. I toggled with the calendar to refresh my screen but nothing for either. So I decided to download the app on my phone and have the Attico page open. I eventually got a forbidden error on my iPad and clearing my history and cookies didn’t help. When the Attico tickets on the app appeared I decided to not risk not getting any full experience tickets and booked them. Not sure if the app working was just a coincidence but it’s definitely worth downloading. Good luck!",
    "username" : "Beach_Gyrl",
    "timestamp" : "2024-08-02 02:03:19"
  }, {
    "reported_comment" : false,
    "body" : "I'm looking to sell 2 Full Experience - Attico tickets for August 31 at 11:10. We bought them and later managed to snag underground tickets and would prefer to do that. I'm selling them at cost with no markup. ",
    "username" : "MushroomMix",
    "timestamp" : "2024-08-02 12:36:50"
  }, {
    "reported_comment" : false,
    "body" : "Does the Colosseum have night time tickets? Looking to visit between 9/2-9/9.",
    "username" : "GirlyButScrappy",
    "timestamp" : "2024-08-02 21:18:36"
  }, {
    "reported_comment" : false,
    "body" : "I just bought two Full Experience tickets for 10 August at 8.30. The website threw some errors at first but it worked eventually.",
    "username" : "benediktleb",
    "timestamp" : "2024-08-03 08:37:39"
  }, {
    "reported_comment" : false,
    "body" : "Does anyone know when the September tickets will be released? Been at it for two days and nothing is coming out for the guided tour ones Either September 2nd or 3rd I want to snag",
    "username" : "Intrascopix",
    "timestamp" : "2024-08-03 09:02:00"
  }, {
    "reported_comment" : false,
    "body" : "Trying to get tickets for Sunday September 1st, just noticed that on the website there're tickets for 2nd while 1st still shows not available online (not sold out)... Anyone know why?",
    "username" : "Snoo_245",
    "timestamp" : "2024-08-03 17:40:12"
  }, {
    "reported_comment" : false,
    "body" : "I’m interested in full experience tickets for 2 on 9th of August. Thanks in advance!",
    "username" : "Separate_Influence33",
    "timestamp" : "2024-08-04 08:47:08"
  }, {
    "reported_comment" : false,
    "body" : "I am selling two full experience tickets + guided tour of the underground for the 3rd of september at 14:15.\nI am selling them as I was able to grab these and just got them, even though I don't speak italian. But today, I was luckily able to grab tickets for the english tour at the 4th of september.\nSelling them as close to the original price as possible, unfortunately ticketswap adds a fee! https://www.ticketswap.nl/listing/colosseum-full-experience-underground-levels-and-arena-guided-tour-italian/13579357/accf7e40ea?utm_campaign=publishedListingShare&utm_source=ticketswap&utm_medium=manualshare\n\nNinja edit: I am able to change the names on the tickets, if you buy them, drop your name to me (idk if that is possible via ticket swap, otherwise here), then I can change the name on the ticket!",
    "username" : "Fastjur",
    "timestamp" : "2024-08-05 13:52:30"
  }, {
    "reported_comment" : false,
    "body" : "Anyone selling underground guided tour in English for September 4th 3pm or 4:30pm? Thanks!",
    "username" : "According_Sir_8703",
    "timestamp" : "2024-08-05 16:54:02"
  }, {
    "reported_comment" : false,
    "body" : "Selling 2 Full experience tickets with Italian tour of the underground on Aug 16th at 2:15pm. Only a few days left to change the name!",
    "username" : "Traditional-Cable478",
    "timestamp" : "2024-08-07 18:28:28"
  }, {
    "reported_comment" : false,
    "body" : "Looking for 2 underground guided tour tickets in English for September 4th",
    "username" : "PlacingABid",
    "timestamp" : "2024-08-09 11:16:04"
  }, {
    "reported_comment" : false,
    "body" : "\\*\\*NAME YOUR PRICE FULL EXPERIENCE TICKETS\\*\\*\n\nSelling 2 Colosseum Tickets August 25 (8/25) FULL EXPERIENCE – UNDERGROUND LEVELS AND ARENA – GUIDED TOUR in Italian @ 2:15 (booked the wrong time on the official website). Please message me so I can change the tickets to your name. You can also buy them on ticket swap if you feel more comfortable doing that. (Or you can do it yourself through this link: [https://ticketing.colosseo.it/ticket?mtref=confpren](https://ticketing.colosseo.it/ticket?mtref=confpren))\n\nJust message me if interested, I am very flexible with price!!\n\n[https://www.ticketswap.com/listing/colosseum-full-experience/13500158/6b15bc9973?utm\\_campaign=publishedListingShare&utm\\_source=ticketswap&utm\\_medium=manualshare](https://www.ticketswap.com/listing/colosseum-full-experience/13500158/6b15bc9973?utm_campaign=publishedListingShare&utm_source=ticketswap&utm_medium=manualshare)",
    "username" : "Logical_Bowl1247",
    "timestamp" : "2024-08-09 16:06:28"
  }, {
    "reported_comment" : false,
    "body" : "Selling x2 FULL EXPERIENCE – UNDERGROUND LEVELS AND ARENA – GUIDED TOUR (ITALIAN) - Face value.\nTour time: 12:00 on Sunday 8th September. You can edit the names on the tickets until 11:59pm on 1st September.\n\nhttps://www.ticketswap.com/listing/colosseum/13617045/25f613d080?utm_campaign=publishedListingShare&utm_source=ticketswap&utm_medium=manualshare",
    "username" : "ChibiThala",
    "timestamp" : "2024-08-09 17:49:30"
  }, {
    "reported_comment" : false,
    "body" : "Selling 2 tix for 24H ONLY ARENA for 8/19 at 8:40 am. You can have both tix for the price of 1 — 18€/20USD. DM if interested. I have until tomorrow (8/12) to change the names.",
    "username" : "Narrow_Ad3965",
    "timestamp" : "2024-08-11 08:48:24"
  }, {
    "reported_comment" : false,
    "body" : "Buying 3 colosseum full experience tickets. Can be in spanish or english. For sept 11th or 25th",
    "username" : "hanaxrose",
    "timestamp" : "2024-08-12 21:24:50"
  }, {
    "reported_comment" : false,
    "body" : "I feel dumb. Feel free to call me out if I truly am being dumb.\n\nTrying to get Colosseum + Roman Forum + Palatine Hill tickets for August 28. I know I'm way too late to get the \"Full experience + underground\" tickets.\n\nPlease explain the difference between the \"FULL EXPERIENCE TICKET WITH ENTRY TO THE ARENA OF THE COLOSSEUM\" ticket versus the other tickets? I understand that the \"full experience\" ticket includes the arena along with the first two floors of the Colosseum + Palatine Hill + Roman Forum for 48 hours, which sounds like the second-best option to the underground tickets.\n\nTherefore, my questions are:\n\n1. Why does it release only a week in advance as opposed to the other tickets which are released 30 days in advance?\n2. why is there so much more availability for this full experience ticket compared to the other tickets if it seems to be the better deal? Even the 24hour Arena only ticket is more sold out than this one.\n\nI feel like it's too good to be true and I'm getting duped! I don't want to wait a week before when I want to get tickets and then realize was missing something and then not be able to get another ticket due to them all being sold out!\n\nEDIT: I just read a few comments below someone asked a similar question. Oops. But Question 2 still stands.",
    "username" : "poppyroll",
    "timestamp" : "2024-08-13 16:24:19"
  }, {
    "reported_comment" : false,
    "body" : "Just tested the site today in preparation for my dates and wow...it sold out on the dot of the time of release.\n\nFirst \"not yet available\", and when i refreshed the page it already changed to \"sold out\".\n\nHow the hell are people supposed to buy tickets??",
    "username" : "groggyhouse",
    "timestamp" : "2024-08-14 09:03:31"
  }, {
    "reported_comment" : false,
    "body" : "How does the guided underground tour compare with the underground entry ticket? Is the tour preferable to just getting the ticket and touring on your own with an audio guide? I got an underground ticket, but wonder if it’s worth getting a guided tour.",
    "username" : "seacity36",
    "timestamp" : "2024-08-14 11:05:17"
  }, {
    "reported_comment" : false,
    "body" : "I have two different experience tickets for the Colosseum next week: an attic pass and an English underground tour. (I bought the attic tickets first in case all the tours sold out for the day). I've read the Colosseum has a set route to follow so would it be possible to see *both* the attic and underground in one visit?",
    "username" : "asadprofessorplum",
    "timestamp" : "2024-08-14 13:45:09"
  }, {
    "reported_comment" : false,
    "body" : "anyone selling full experience with guided tour tickets in english any days from august 20th-august 24th",
    "username" : "Puzzled-Vermicelli27",
    "timestamp" : "2024-08-14 21:04:22"
  }, {
    "reported_comment" : false,
    "body" : "Selling 2 colosseum tickets for face value (18 euros) per ticket for August 18th 10:15 am time slot. I bought the wrong time slot!",
    "username" : "Sea-Fig9923",
    "timestamp" : "2024-08-16 11:44:11"
  }, {
    "reported_comment" : false,
    "body" : "I bought 2 Colosseum tickets w/ Attic access for September. If I had wanted to do a guided tour, would I just need to buy tickets from a third party? It was almost impossible to get on the official website.",
    "username" : "loco4burrito",
    "timestamp" : "2024-08-16 19:34:58"
  }, {
    "reported_comment" : false,
    "body" : "Anyone know somewhere, where I can sell my guided tour experience of the colosseum? No longer need the ticket. It’s on September 8th if anyone knows anyone who is interested?",
    "username" : "ChibiThala",
    "timestamp" : "2024-08-17 01:42:13"
  }, {
    "reported_comment" : false,
    "body" : "Does anybody know how to reserve a Colosseum tour on September 1st when it's apparently free for everyone? I'm on the official ticketing site and that day is blocked off. We'd love to see the coliseum but that's the only day we can tour it.",
    "username" : "GodotNeverCame",
    "timestamp" : "2024-08-17 22:19:23"
  }, {
    "reported_comment" : false,
    "body" : "Anyone selling tickets for the Full Experience Guided Tour (English) on September 18 for the 9:30am or 10:45am tour?",
    "username" : "smylethegreat",
    "timestamp" : "2024-08-19 14:09:02"
  }, {
    "reported_comment" : false,
    "body" : "I have 4 tickets available, 9:50 am on September 16th, full experience attico.",
    "username" : "mperry381",
    "timestamp" : "2024-08-19 15:46:59"
  }, {
    "reported_comment" : false,
    "body" : "[removed]",
    "username" : "None",
    "timestamp" : "2024-08-20 16:35:01"
  }, {
    "reported_comment" : false,
    "body" : "Can someone please confirm that my understanding is correct:\n\nIf I purchased 24H ONLY ARENA tickets for 12:00pm on September 9, 2024, I can access the Roman Forum and Imperial Fora any time until 12:00pm on September 10, 2024?\n\nThanks!",
    "username" : "Illustrious_Mess_368",
    "timestamp" : "2024-08-20 22:45:35"
  }, {
    "reported_comment" : false,
    "body" : "Looking for 2 guided or individual full experience underground ticket for Sep 9/10.",
    "username" : "Sea_Most5253",
    "timestamp" : "2024-08-21 16:20:52"
  }, {
    "reported_comment" : false,
    "body" : "Looking for 2 tickets for individual full experience including underground for Sept 2nd! Thank you :)",
    "username" : "DeexKK",
    "timestamp" : "2024-08-21 17:00:21"
  }, {
    "reported_comment" : false,
    "body" : "Still looking to sell 4 Full Experience Attico tickets, Sept 16, 9:50 am https://www.ticketswap.com/listing/colosseum-attico-tickets/13741021/e8bb3ef8c8",
    "username" : "mperry381",
    "timestamp" : "2024-08-23 22:46:59"
  }, {
    "reported_comment" : false,
    "body" : "Selling 2 full experience tickets for august 31 at 8:45",
    "username" : "the_lovely_penguin",
    "timestamp" : "2024-08-24 11:28:35"
  }, {
    "reported_comment" : false,
    "body" : "Still looking for 2 tickets, full experience + underground, on September 18th. Thanks in advance!",
    "username" : "smylethegreat",
    "timestamp" : "2024-08-25 01:32:52"
  }, {
    "reported_comment" : false,
    "body" : "Looking for 4 tickets of colosseum (including arena) + (underground if possible) for 4 adults on 15th or 16th September morning.",
    "username" : "encryptedme",
    "timestamp" : "2024-08-25 12:40:25"
  }, {
    "reported_comment" : false,
    "body" : "Looking for 2x full experience tickets with (preferably with attico or underground access) on 12th, 13th or 15th September",
    "username" : "sonicandfffan",
    "timestamp" : "2024-08-27 02:27:12"
  }, {
    "reported_comment" : false,
    "body" : "Is the colosseum closed during 26 September? Tickets should be open for purchase now no? Looking at the 24 hour pass (not full experience)",
    "username" : "MalaysianPF",
    "timestamp" : "2024-08-27 03:32:48"
  }, {
    "reported_comment" : false,
    "body" : "I'm looking to buy 2 full experience guided tours for 2/3/4/5 of September! thank you!",
    "username" : "frogfartingaflamingo",
    "timestamp" : "2024-08-27 04:55:41"
  }, {
    "reported_comment" : false,
    "body" : "looking for 2 full experience underground and arena tickets, preferably with guide  for 16th or 17th September!!",
    "username" : "mohairhalo",
    "timestamp" : "2024-08-27 06:33:26"
  }, {
    "reported_comment" : false,
    "body" : "Looking for 2 Full Experience Underground & Arena tickets (guided or unguided both okay) for Sep 26th or Sep 27th!",
    "username" : "isungthat",
    "timestamp" : "2024-08-27 09:49:11"
  }, {
    "reported_comment" : false,
    "body" : "I have 2 full experience attico tickets for Sept 22 at 12:50. Looking to see at face value (24 € each)",
    "username" : "RacheltheGreat7",
    "timestamp" : "2024-08-27 23:24:47"
  }, {
    "reported_comment" : false,
    "body" : "[deleted]",
    "username" : "None",
    "timestamp" : "2024-08-29 03:42:21"
  }, {
    "reported_comment" : false,
    "body" : "Looking to purchase 2 tickets, full experience + underground, on September 20th. Thanks in advance!",
    "username" : "rewoodard99",
    "timestamp" : "2024-08-29 16:30:54"
  }, {
    "reported_comment" : false,
    "body" : "Hi, looking to purchase full experience (attic if possible) for any time between Sept 9-12.",
    "username" : "AY88",
    "timestamp" : "2024-08-30 17:35:04"
  }, {
    "reported_comment" : false,
    "body" : "Could someone please tell me when tickets become available? i am so confused!",
    "username" : "chloborose21",
    "timestamp" : "2024-09-01 08:53:32"
  }, {
    "reported_comment" : false,
    "body" : "I'm constantly refreshing, and attic tickets are sold out instantly. I refresh too much and it \"forbidden\"s my wifi. :'(\n\n**edit** - finally got tickets. 2 tickets at 11:30, and 2 at 12:10. You guys think they'll let the first 2 stay that long so we can all be up there together?",
    "username" : "bobothedragon",
    "timestamp" : "2024-09-02 10:00:27"
  }, {
    "reported_comment" : false,
    "body" : "I have 2 tickets for for the “COLOSSEUM - GUIDED TOUR” experience in English on Sep 18th 2024 at 12:00. I’m selling for the face value.",
    "username" : "l_taffa",
    "timestamp" : "2024-09-02 14:31:50"
  }, {
    "reported_comment" : false,
    "body" : "I'm just learning about how to try for Attic/Arena/Underground/Full Experience tickets for Oct 16. I can't find an option to buy 2 tickets for all the locations. I do not want a guided tour, just entrance to all. Also I'm confused when I should set my alarm to buy tickets for the 720 hours - I\"m in Los Angeles. Thank you for any help you can provide. In order to get both the Attic and the Arena, do I have to buy a Full Experience including the Arena and a separate Full Experience including the Attic?",
    "username" : "ambercatttt",
    "timestamp" : "2024-09-03 01:26:22"
  }, {
    "reported_comment" : false,
    "body" : "Last chance for a full experience plus it audio tour ticket for today, 3 sept at 14:15. I’ve dropped the price to 20 euros, I don’t want them to go to waste!\n\nhttps://www.ticketswap.com/listing/colosseum/13579357/accf7e40ea?utm_campaign=publishedListingShare&utm_source=ticketswap&utm_medium=manualshare",
    "username" : "Fastjur",
    "timestamp" : "2024-09-03 09:53:22"
  }, {
    "reported_comment" : false,
    "body" : "I have two tickets for september 13th! 11:00 entrance. Names can be changed (:\n\nAlso available through ticketswap. Willing to sell for 14 euros each.\n\nhttps://www.ticketswap.com/listing/colosseum/13859367/d30bd2bb27?utm_campaign=publishedListingShare&utm_source=ticketswap&utm_medium=manualshare",
    "username" : "doggo24-7",
    "timestamp" : "2024-09-03 10:11:11"
  }, {
    "reported_comment" : false,
    "body" : "2 Full Experience w/Attico \nSept 25 - 1:30pm \nSep 25 - 12:50am \nPurchased them for me and my husband. Entry time is for the attico, once you're in there you can tour the rest of the Colosseum at your own pace.",
    "username" : "AdAble1507",
    "timestamp" : "2024-09-03 16:51:24"
  }, {
    "reported_comment" : false,
    "body" : "If i want to see underground arena and attic same day do i have to buy two seperate tickets?",
    "username" : "SoliloquyXChaos",
    "timestamp" : "2024-09-03 17:49:03"
  }, {
    "reported_comment" : false,
    "body" : "Looking to buy two \"FULL EXPERIENCE - UNDERGROUND LEVELS AND ARENA - GUIDED TOUR\" preferably in English for either Sept 9, 10th, or 11th at any time!",
    "username" : "NYGiants1532",
    "timestamp" : "2024-09-04 01:21:21"
  }, {
    "reported_comment" : false,
    "body" : "Need 1 ticket to Full experience underground levels - Sept 16 - anyone?",
    "username" : "Big-Judge196",
    "timestamp" : "2024-09-04 09:29:38"
  }, {
    "reported_comment" : false,
    "body" : "I’m looking for two tickets (doesn’t matter what kind) for September 15,16, or 17! Message me with whatever you have!",
    "username" : "FunFirefighter708",
    "timestamp" : "2024-09-04 15:00:02"
  }, {
    "reported_comment" : false,
    "body" : "I'm reading that if you refresh your screen too much while trying to get tickets, you'll get locked out.  What experience have you all had with this?  Is it best to use 2 browsers (say Chrome and Safari) to prevent getting locked out or is this not a thing?",
    "username" : "ambercatttt",
    "timestamp" : "2024-09-04 17:32:52"
  }, {
    "reported_comment" : false,
    "body" : "Hi! I'm looking for tickets (preferably with underground but it doesn't matter) for September 19/20 or September 22/23, 2024. Please let me know and thank you!!",
    "username" : "des6829",
    "timestamp" : "2024-09-05 02:25:07"
  }, {
    "reported_comment" : false,
    "body" : "Searching for 2 tickets for FULL EXPERIENCE TICKET WITH ENTRY TO THE ATTIC OF THE COLOSSEUM for 9/19 or 9/20.",
    "username" : "Ancient-Durian-5518",
    "timestamp" : "2024-09-05 06:44:19"
  }, {
    "reported_comment" : false,
    "body" : "I’m looking for 2 tickets full experience including underground for October 3,4… tried for three nights to book",
    "username" : "No-Hat-386",
    "timestamp" : "2024-09-05 07:14:05"
  }, {
    "reported_comment" : false,
    "body" : "Looking for 2 tickets for FULL EXPERIENCE - UNDERGROUND LEVELS AND ARENA - GUIDED TOUR. Would appreciate any help!",
    "username" : "Difficult_Bluejay_24",
    "timestamp" : "2024-09-05 14:12:27"
  }, {
    "reported_comment" : false,
    "body" : "What website do people resell tickets to the Colosseum? Is it ticket swap?",
    "username" : "yosefsbeard",
    "timestamp" : "2024-09-06 04:06:01"
  }, {
    "reported_comment" : false,
    "body" : "I have 2 tickets (24h – Colosseum, Roman Forum and Palatine) for the 16th September 8:45am. I meant to buy different ones but can't get a refund. If anyone wants these for a discounted price, let me know. I only have until the end of this week to change the names on them.",
    "username" : "SwearingAtChildren",
    "timestamp" : "2024-09-06 14:10:34"
  }, {
    "reported_comment" : false,
    "body" : "Hello, I bought 2 tickets to the Night Tour(Italian) On 09/12 @ 9:10 by mistake. If anyone's interested in them please let me know.",
    "username" : "sheetmetalbrakeman",
    "timestamp" : "2024-09-07 04:24:12"
  }, {
    "reported_comment" : false,
    "body" : "Any advice on what time and where to go for the official website 1030am English guided tour? Thank you in advance!",
    "username" : "dyl1dyl",
    "timestamp" : "2024-09-07 10:43:56"
  }, {
    "reported_comment" : false,
    "body" : "I have two full experience tickets with attic access available for September 29th at 10:10am. Asking what I paid.",
    "username" : "Captguy77",
    "timestamp" : "2024-09-07 16:11:09"
  }, {
    "reported_comment" : false,
    "body" : "I have 1 Full Experience Attico ticket left, Sept 16, 9:50 am. Last day to change the name on the ticket is tomorrow, Sept 8.",
    "username" : "mperry381",
    "timestamp" : "2024-09-07 17:26:29"
  }, {
    "reported_comment" : false,
    "body" : "SUCCESS! The Underground Experience tickets are definitely not released all at once. They are released by entrance times. Waking up at 2:30-4:30 am did no good because not once did we see an available ticket. After we went back to sleep and got up at our regular time, I just kept checking every few minutes, and finally saw a time slot with 4 available. In my first attempt, I made it to check-out (on my phone) and signed into my Par-C account because I kept receiving an error. I pulled it up on my laptop, signed into my Par-C account, it showed the two tickets in my cart, so I proceeded to check-out and it worked. But to my disappointment, somehow it purchased two regular full experience tickets for tomorrow... My husband was watching and did confirm that I had the correct Underground Tickets and the correct date in the cart, so I don't know what happened. I kept checking back though, and was finally able to get 2 of the correct Underground tickets. I just paid twice as much for them I suppose. I had to do the transaction on my laptop because it never seemed to work on my phone.",
    "username" : "Current-Chipmunk5197",
    "timestamp" : "2024-09-08 14:56:37"
  }, {
    "reported_comment" : false,
    "body" : "EXTRA TICKETS AVAILABLE **October 8** (see previous post for how I obtained these. The company kindly changed the date for me, but would not give me a refund). \n\n**Two Full Experience with Entry to Arena tickets** (no attic, no underground)- October 8 with arena entry @ 1:15 pm Rome-time. \n\nWill sell via Venmo for heavily discounted price.",
    "username" : "Current-Chipmunk5197",
    "timestamp" : "2024-09-08 17:27:56"
  }, {
    "reported_comment" : false,
    "body" : "TWO TICKETS AVAILABLE at Face Value Price.\nBoth are for the Full Experience + Underground Guided Tour (English). Both are for September 18th. One ticket is for the 9:30am tour, the other ticket is for the 10:45am tour. One day remaining to transfer tickets to a new name!",
    "username" : "smylethegreat",
    "timestamp" : "2024-09-10 02:48:09"
  }, {
    "reported_comment" : false,
    "body" : "Looking for 2 full experience tickets, preferably underground, on 27th (after 2pm) or 28th September!",
    "username" : "ryalism13",
    "timestamp" : "2024-09-10 23:47:27"
  }, {
    "reported_comment" : false,
    "body" : "When do the tickets to book the attic/colosseum tickets go available? And does this include the arena floor at 24 euros? We plan to go on the 15th October\n\nIf we can book the basic tickets for 18 euros without the attic or basement, does this include the arena floor too? These appear the easier ones to get.\n\nWe’d rather have the basic tickets booked a month in advance and pay extra for the ones we wanted if they go up 7 days before. Rather see the colosseum in some way than not at all",
    "username" : "FeltzMusic",
    "timestamp" : "2024-09-11 10:34:38"
  }, {
    "reported_comment" : false,
    "body" : "Looking for 2 guided tour tickets of the Colosseum (either full experience, or simple guided tour) on the 21st of September",
    "username" : "Knyght2",
    "timestamp" : "2024-09-11 18:17:17"
  }, {
    "reported_comment" : false,
    "body" : "Looking for 2 guided colosseum tickets full experience underground levels and arena tour (English) for either 10/10, 10/11, or 10/12.  Flexible with times!",
    "username" : "Hungry_Ad_6332",
    "timestamp" : "2024-09-13 00:11:55"
  }, {
    "reported_comment" : false,
    "body" : "Looking for 2 tickets for Oct 13 for either the underground levels (guided or individual) or attic",
    "username" : "qzswxs123",
    "timestamp" : "2024-09-13 16:01:19"
  }, {
    "reported_comment" : false,
    "body" : "Looking to buy 1 ticket at face value - Full Experience in English.  Any slot between 27-29 September.",
    "username" : "GarbageEducational38",
    "timestamp" : "2024-09-15 09:41:42"
  }, {
    "reported_comment" : false,
    "body" : "I was unsuccessful at buying underground / attic tickets 30 days out.  I briefly grabbed 4 online but they disappeared by the time I moved the mouse to continue.\n\nLooking for 2 or 4 underground / attic tix for 5 October (preferably in English / flex on time).  My girls are excited to see it so we will take even 2 for just them.  Thanks!",
    "username" : "am1118",
    "timestamp" : "2024-09-15 16:28:37"
  }, {
    "reported_comment" : false,
    "body" : "Looking for just one Colosseum full experience ticket (non-guided) anytime between 10/11-10/15 ticket to purchase for",
    "username" : "IoGza",
    "timestamp" : "2024-09-15 19:34:05"
  }, {
    "reported_comment" : false,
    "body" : "Has anyone done the tour through the official site in a language they don’t speak? Wondering if worth it to at least get access to additional areas and just break off from the tour/ not listen.",
    "username" : "Winter_of",
    "timestamp" : "2024-09-16 17:05:37"
  }, {
    "reported_comment" : false,
    "body" : "tickets for colosseum/forum\n\nhi all! i booked the wrong date for my Colosseum/Roman Forum tickets and since they’re non-refundable I now have 2 sought-after tickets going to waste :/\n\nIf anyone has been struggling to find tickets for September 20, I have 2 I’m selling for face value, so pls DM me :) (if there is a better community/sub/place to post this pls let me know)",
    "username" : "katwhitley",
    "timestamp" : "2024-09-16 21:30:17"
  }, {
    "reported_comment" : false,
    "body" : "Looking for 2 underground/attic 10/9 tickets, flexible on times!",
    "username" : "Crafty-Membership183",
    "timestamp" : "2024-09-17 03:57:58"
  }, {
    "reported_comment" : false,
    "body" : "Looking for 2 tickets for Colosseum on Sun Sept 29th or Wed Oct 2nd (flexible on times) in English\n\n- Looking for Attic/Underground or Night time",
    "username" : "OneConstruction5344",
    "timestamp" : "2024-09-17 04:26:15"
  }, {
    "reported_comment" : false,
    "body" : "Looking for full tour tickets. If you're selling let me know! Will plan around it! Thank you!",
    "username" : "k1ngstan23",
    "timestamp" : "2024-09-17 23:12:47"
  }, {
    "reported_comment" : false,
    "body" : "Hello! Has anyone had any luck using a Roma Pass to book timed entry tickets for the Colosseum/Forum/Palatine Hill? The Colosseum [booking links](https://www.romapass.it/en/museums/) listed on the [https://www.romapass.it/en/museums/](https://www.romapass.it/en/museums/) page all seem to be out of date – they're pointed at web servers that seem to no longer be functioning at all. And the Colosseum's [ticketing site](https://ticketing.colosseo.it/en/) makes no mention of the Roma Pass. Any guidance would be most appreciated. Thanks in advance!",
    "username" : "bilf",
    "timestamp" : "2024-09-18 06:09:21"
  }, {
    "reported_comment" : false,
    "body" : "I have tickets I bought for \n\nSeptember 29, 2024 at 10:45 AM\n\n[https://www.getyourguide.com/rome-l33/rome-skip-the-line-colosseum-arena-group-tour-t84141/?ranking\\_uuid=672aa23e-60c9-44d9-8c9e-5db29043ebd9](https://www.getyourguide.com/rome-l33/rome-skip-the-line-colosseum-arena-group-tour-t84141/?ranking_uuid=672aa23e-60c9-44d9-8c9e-5db29043ebd9)\n\nI won't be needing them, so hoping someone is interested and I would be willing to take a hit on the cost",
    "username" : "OneConstruction5344",
    "timestamp" : "2024-09-18 16:16:27"
  }, {
    "reported_comment" : false,
    "body" : "Looking for two colosseum tickets for October 4, but can be somewhat flexible between October 3-5!",
    "username" : "Spirited_Square_9110",
    "timestamp" : "2024-09-18 21:55:00"
  }, {
    "reported_comment" : false,
    "body" : "Looking for 1x guided tour colosseum ticket with underground and/or attic, any date between 24-27 September",
    "username" : "not_special_K",
    "timestamp" : "2024-09-18 23:48:09"
  }, {
    "reported_comment" : false,
    "body" : "I was attempting to purchase 8:30 am entry tickets for Saturday the 19th of October to the Colosseum/Forum/Palatine this morning and I accidentally bought a pair of 9 am, 24-hour tickets. I realized my mistake but they are non refundable, though I can change the names on the tickets. (I did purchase my 8:30 am tickets successfully once I noticed.)\n\nIf anyone is going to be in Rome that day and wants to buy the 9 am entry tickets, I will gladly transfer them for face value (€36 or $40 USD total for two tickets). I’m in the USA so can accept Venmo or PayPal.",
    "username" : "discocupcake",
    "timestamp" : "2024-09-19 17:04:01"
  }, {
    "reported_comment" : false,
    "body" : "Looking for underground access tickets on Friday, October 11 or Sunday, October 13.",
    "username" : "Ca876",
    "timestamp" : "2024-09-20 03:56:40"
  }, {
    "reported_comment" : false,
    "body" : "Experience with booking this morning for Full experience Arena + Underground ticket: at 8:45, it's not available. At 8:50, all tickets are sold.  \nIs it only me to find this hardly believable?\n\nhttps://preview.redd.it/ph07w5jv44qd1.png?width=659&format=png&auto=webp&s=9db5b4826d39840985f4b8fed1c933d37f3a7632",
    "username" : "YUNeedUniqUserName",
    "timestamp" : "2024-09-21 09:16:05"
  }, {
    "reported_comment" : false,
    "body" : "looking for 2 arena floor tickets for tomorrow - Sept. 22 - last minute change of plans. I know it is late but just checking :)",
    "username" : "M_M_17_",
    "timestamp" : "2024-09-21 11:12:01"
  }, {
    "reported_comment" : false,
    "body" : "Looking for 4 underground guided tour or nonguided tickets for a day between Oct 18-22. Spent hours and hours on the website and have seen zero availability at all, even just one ticket. Unbelievable.",
    "username" : "SDkahlua",
    "timestamp" : "2024-09-22 20:23:23"
  }, {
    "reported_comment" : false,
    "body" : "Looking for 2 full experience underground + arena tickets, guided or individual for Oct 23. Thank you!",
    "username" : "obnoxiouslemur",
    "timestamp" : "2024-09-23 13:37:19"
  }, {
    "reported_comment" : false,
    "body" : "Not buying or selling, but questions -\n\nI managed to get two tickets, 1 for 1:15 and 1 for 2:30 on the same day. Am I allowed to show up late for the 1:15 so I can go with my partner and just lose an hour or do we both have to strictly go in when our blocks are to meet up inside?\n\nThey’re also both 48-hour consecutive tickets for a Wednesday, so does that mean I can come in twice Tuesday-Wednesday or Wednesday-Thursday?",
    "username" : "Ancient_Surprise",
    "timestamp" : "2024-09-23 18:25:08"
  }, {
    "reported_comment" : false,
    "body" : "Looking for 1 full experience + underground with guided tour on 10/23 @ 12:15pm in English. Thanks!\n\nEdit: Got a different tour that accommodates the number of people in my group, now selling a ticket to the 10/23 @ 12:15pm tour in English. Will sell at face value + taxes/fees",
    "username" : "baconcheesescone",
    "timestamp" : "2024-09-23 19:03:00"
  }, {
    "reported_comment" : false,
    "body" : "Looking for 2 full experience guided tours in english on Sunday, October 6. Preferred underground, but open to other options as well!\n\nAnyone have recommendations for non-official sources or tour groups as an alternative?",
    "username" : "NotFrmStateFarm",
    "timestamp" : "2024-09-23 19:08:22"
  }, {
    "reported_comment" : false,
    "body" : "Selling one full experience underground and arena guided tour ticket for Sunday October 13th 2024 at 15:30. In Spanish.\n\nEn venta un boleto para el tour completo guiado underground y arena el Domingo 13 de Octubre 2024 a las 15:30. Es en español.",
    "username" : "Lysistrata1989",
    "timestamp" : "2024-09-23 20:23:28"
  }, {
    "reported_comment" : false,
    "body" : "Managed to snag a couple of guided tour tickets to the Colosseum underground. However, these are in Italian which neither my wife nor I speak. It's been really hard to find individual or guided tickets for the dates we are in Rome, so when I saw these available I just grabbed them. Are these going to be worth it? My idea is to treat it as an unguided tour or hopefully try and make sense of a few words here and there.",
    "username" : "obnoxiouslemur",
    "timestamp" : "2024-09-23 20:28:46"
  }, {
    "reported_comment" : false,
    "body" : "Selling 2x attic tickets for 24th October",
    "username" : "rookiereddit",
    "timestamp" : "2024-09-25 12:18:33"
  }, {
    "reported_comment" : false,
    "body" : "I have (4) Full Experience Attic tickets available on 10/24 at FACE VALUE. I would prefer to sell each time slot available as a pair!\n\n(2) are for 12:10pm on Thursday, 10/24                        (2) are for 1:30pm on Thursday, 10/24\n\nI was aiming for the 1:30 pm on 10/24 as our Plan B to our preferred Plan A on 10/25. The 1:30pm 10/24 tickets became available and I wanted to get 2 for us in the event we couldn’t get any for Friday, 10/25. I somehow ended up with an additional (2) at 12:10pm. Our preferred day was 10/25 which I was able to secure this morning so I now have no need for the 10/24 tickets.\n\nI’m not a reseller by any means so both Full Experience Attic pairs of tickets for 10/24 are available at face value plus any taxes/fees.\n\nName changes on the tickets are only allowed once from what I read. If interested in either pairs or both, please comment below or message me. Thanks!",
    "username" : "Purdue474",
    "timestamp" : "2024-09-25 13:03:45"
  }, {
    "reported_comment" : false,
    "body" : "Anyone has tickets for either sept 26/27/28\n\nNeed 3 for the collosseum, lookin for the one where I can just walk myself and see \n\nWill take your guided ones if that’s the only one available",
    "username" : "dr_visitor",
    "timestamp" : "2024-09-25 22:31:43"
  }, {
    "reported_comment" : false,
    "body" : "I feel like I must be an idiot. I thought it was 30 days ahead of time and I got on at 8:45 Rome Time (1:45 am my time) and the ones for the next day (27th) said they were no longer available on underground, not guided. Looked at guided and it says for the 26th is sold out, but it was sold out PRIOR to even opening... which makes no sense to me but I know not a lot of it makes sense. Then for the guided on the 26th it says \"not available online.\" but I am 30 days out. \n\nCan someone make sense of this to me? Thank you! I refreshed too much on the computer and now have to use data. I am ready to just spend way more on the overpriced tickets haha. \n\nAlso, does my infant need a ticket?",
    "username" : "Kalexn",
    "timestamp" : "2024-09-26 09:15:53"
  }, {
    "reported_comment" : false,
    "body" : "Looking for 2 tickets for any date and time Oct 25-27 for full experience underground but open to other options as well. Thank you!",
    "username" : "InstrumentGuy",
    "timestamp" : "2024-09-26 14:03:07"
  }, {
    "reported_comment" : false,
    "body" : "Have 2 x Full Experience Attic tickets for sale Sunday 10/27/2024 at 0900 AM. Completely blanked that I had another tour scheduled at that time. Just selling at face value, PM if interested!",
    "username" : "w0lf3h",
    "timestamp" : "2024-09-27 09:57:15"
  }, {
    "reported_comment" : false,
    "body" : "Only managed to get 4:30pm ticket for full experience including arena. Is 2 hours enough time to see the main things at the colosseum and forum?",
    "username" : "Beautiful_Ad_4573",
    "timestamp" : "2024-09-28 10:18:43"
  }, {
    "reported_comment" : false,
    "body" : "The 10/17 10:30am slot for self-guided underground keeps showing availability (and has for several days now), even though every other time on every other date is sold out. Is this likely a bug? I've managed to get tix in my cart but haven't been able to get to the payment screen.",
    "username" : "dorynickel",
    "timestamp" : "2024-09-29 04:05:46"
  }, {
    "reported_comment" : false,
    "body" : "Looking to sell 2x attic tickets for 24th October, happy to sell at face value",
    "username" : "rookiereddit",
    "timestamp" : "2024-09-30 10:38:58"
  }, {
    "reported_comment" : false,
    "body" : "Looking to sell 2x full experience underground tickets at face value.\nThey are for 25th October, 12:00, Italian guide\n\nEDIT: As of 03/Oct, tickets still available",
    "username" : "cassio_plz",
    "timestamp" : "2024-09-30 21:51:07"
  }, {
    "reported_comment" : false,
    "body" : "Posting this again. If not allowed mods, please delete.\n\nI have (4) Full Experience Attic tickets available on 10/24 at FACE VALUE. I would prefer to sell each time slot available as a pair!\n\n(2) are for 12:10pm on Thursday, 10/24                        (2) are for 1:30pm on Thursday, 10/24\n\nI was aiming for the 1:30 pm on 10/24 as our Plan B to our preferred Plan A on 10/25. The 1:30pm 10/24 tickets became available and I wanted to get 2 for us in the event we couldn’t get any for Friday, 10/25. I somehow ended up with an additional (2) at 12:10pm. Our preferred day was 10/25 which I was able to secure this morning so I now have no need for the 10/24 tickets.\n\nI’m not a reseller by any means so both Full Experience Attic pairs of tickets for 10/24 are available at face value plus any taxes/fees.\n\nName changes on the tickets are only allowed once from what I read. If interested in either pairs or both, please comment below or message me. Thanks!",
    "username" : "Purdue474",
    "timestamp" : "2024-09-30 22:17:15"
  }, {
    "reported_comment" : false,
    "body" : "Looking for x2 full experience tickets early in the morning on 24/10/2024 please.",
    "username" : "None",
    "timestamp" : "2024-10-01 09:06:11"
  }, {
    "reported_comment" : false,
    "body" : "Looking for x2 full experience tickets early in the morning on 24/10/2024 please.",
    "username" : "None",
    "timestamp" : "2024-10-01 15:05:15"
  }, {
    "reported_comment" : false,
    "body" : "Selling 2  tickets for colosseum guided tour for 10/28/24 for 12 PM slot in English. Preferred Venmo (price what I paid).",
    "username" : "krans4u",
    "timestamp" : "2024-10-02 08:50:12"
  }, {
    "reported_comment" : false,
    "body" : "Looking for 2 full experience guided tour English tickets for 11/1/24. Flexible on time.",
    "username" : "beeyore",
    "timestamp" : "2024-10-02 09:32:56"
  }, {
    "reported_comment" : false,
    "body" : "Full Experience Tickets query\n\nMe and my partner have booked the full experience tickets with underground access for the colosseum at 5.15pm on Wednesday 8th October. It wasn’t my first choice of time, but all the others were taken.\n\nMy query is, it says 2 days on the ticket but since the colosseum shuts at 6.30pm, am I able to visit sites included in my ticket earlier in the day, so long as I’m at the colosseum entrance before my allocated time slot? Or will they not let me in anywhere at all until my time slot because the ticket won’t have been activated?\n\nI know I can visit most of the sites the day after but my stress is that 75 minutes isn’t enough time to do the arena, underground and main building, so I’m just trying to plan! 🤦🏻‍♀️😣\n\nHas anyone had the same issue? Or found that the 75 minutes is plenty of time?",
    "username" : "Civil-Spirit2942",
    "timestamp" : "2024-10-02 15:29:01"
  }, {
    "reported_comment" : false,
    "body" : "Hello, just trying to find my tickets to access the Colosseum today. I have only an invoice to say one paid and the money has come out of my account However I do not have a PDF of the ticket like I have with other attractions. Does anyone know what to do about this ?",
    "username" : "chloborose21",
    "timestamp" : "2024-10-03 07:34:48"
  }, {
    "reported_comment" : false,
    "body" : "Hello everyone, my gf and I have tickets for the coliseum + roman forum + palatin hill 24h entry on thursday 10th of October 2024, bought directly on the official website. We would like to swap them for the 12th or the 13th of October, or possibly sell them if we don't find a swap",
    "username" : "Sirias7",
    "timestamp" : "2024-10-03 09:38:57"
  }, {
    "reported_comment" : false,
    "body" : "I’m looking for Nov 2 guided full experience tickets (English)\n\nJust stayed up from 3am-7am trying to get one of the earlier tickets & the bots got them all :/ advice? Thoughts?",
    "username" : "nbalover14",
    "timestamp" : "2024-10-03 14:38:54"
  }, {
    "reported_comment" : false,
    "body" : "Looking for 2 tickets for Full experience between these dates 29-30-31 Oct. Either guided (english) or not, doesn't matter.",
    "username" : "DMarkhu",
    "timestamp" : "2024-10-03 20:32:48"
  }, {
    "reported_comment" : false,
    "body" : "Looking for 2 tickets (standard or underground) for October 5th or 6th. DM me if you would be willing to sell for either of those dates!",
    "username" : "taa120",
    "timestamp" : "2024-10-04 12:19:07"
  }, {
    "reported_comment" : false,
    "body" : "I have 2 extra Full Experience Tickets on **October 8**. Arena entry @ 1:15 pm.\n\nI would love to transfer them to someone for less than face value!",
    "username" : "Current-Chipmunk5197",
    "timestamp" : "2024-10-04 14:15:17"
  }, {
    "reported_comment" : false,
    "body" : "Selling 2 tickets for the COLOSSEO-FORO ROMANO PALATINO 24H on Thu 10/10 at 3PM. Plans changed and the times no longer work for us. Bought on the official website ",
    "username" : "chennyboy2002",
    "timestamp" : "2024-10-05 14:51:34"
  }, {
    "reported_comment" : false,
    "body" : "Does anyone have two tickets for the underground experience on November 3rd or 4th? time does not matter.",
    "username" : "Ratchetal16",
    "timestamp" : "2024-10-06 09:30:38"
  }, {
    "reported_comment" : false,
    "body" : "Looking to swap Colosseum Full Experience with Underground guided tour for 10am on 10/28/24 (October 28th, 2024) … in Italian, for earlier time slot or 4pm and later same day. No language preference.",
    "username" : "Nodgarb",
    "timestamp" : "2024-10-07 05:03:55"
  }, {
    "reported_comment" : false,
    "body" : "Hi Everyone, I'm looking for 2 full experience (with or without the underground) tickets with access somewhere between October 31th and November 3rd :)",
    "username" : "xSuperwaffe",
    "timestamp" : "2024-10-08 00:34:32"
  }, {
    "reported_comment" : false,
    "body" : "[deleted]",
    "username" : "None",
    "timestamp" : "2024-10-08 19:33:45"
  }, {
    "reported_comment" : false,
    "body" : "I still have 3 full experience with attic tickets available. We were able to get tickets for our preferred day and time, so I have no need for these. I purchased them from the official sight and asking what I paid for them ($27 USD per). The dates are:\n\nOctober 24th, 2024 @ 12:10 (2 available).                 October 24th, 2024 @ 1:30pm (1 available) \n\nI would prefer to sell the 12:10pm time slot as a pair. These are legitimate tickets from the official site. I’ve sold one ticket for the 1:30pm time slot to someone on here already without issues and you can ask them about it if you are leery for whatever reason. Please respond here and/or dm me if interested. Name changes on tickets have to be made 7 days prior to entry day and time, so the last day I can make changes is October 17th.",
    "username" : "Purdue474",
    "timestamp" : "2024-10-10 15:31:17"
  }, {
    "reported_comment" : false,
    "body" : "Anyone have two morning tickets for the underground full experience on Sunday, November 10? Can be guided or not. Thanks!",
    "username" : "alohio12",
    "timestamp" : "2024-10-11 09:58:14"
  }, {
    "reported_comment" : false,
    "body" : "Hi, what is legit site to buy colosseum guided tour or audio guided tour?",
    "username" : "Diplomatic_doughnut",
    "timestamp" : "2024-10-11 14:39:22"
  }, {
    "reported_comment" : false,
    "body" : "Anyone have two tickets for the underground full experience or attic on October 28th? Can be guided or not. Thanks a lot!",
    "username" : "Necessary-Emu-812",
    "timestamp" : "2024-10-13 20:36:40"
  }, {
    "reported_comment" : false,
    "body" : "Looking for x2 full experience tickets early in the morning on 24/10/2024 please",
    "username" : "None",
    "timestamp" : "2024-10-14 15:46:12"
  }, {
    "reported_comment" : false,
    "body" : "Likelihood of buying Colosseo underground and arena tickets on the day of?\n\nManaged to get only the 24H tickets for the 26th of this month, but I've been reading online that sometimes all other ticket types are available on-site for purchase (or to add on to our current ticket). We really want to see the underground so I'm considering just splurging on joining a group but the actual price is giving me pause.\n\nIs it true that underground and arena tickets are available on the day of? Does this include Saturdays and Sundays?\n\nIf our booking is for the afternoon would you recommend is going in the morning to see if we can add on those extra experiences or should we just go at our booked time slot?\n\nThanks!",
    "username" : "myumpteenthrowaway",
    "timestamp" : "2024-10-15 16:27:44"
  }, {
    "reported_comment" : false,
    "body" : "Looking for 2 full experience (underground/arena) tickets Oct. 26-27 if anyone isntrying to get rid of theirs!",
    "username" : "myumpteenthrowaway",
    "timestamp" : "2024-10-15 16:31:03"
  }, {
    "reported_comment" : false,
    "body" : "\nHi All,\n\nAt what time of the day ticket bookings slots open in [https://colosseo.it/](https://colosseo.it/) ?\n\nI see dates get enabled but tickets are sold out.",
    "username" : "Diplomatic_doughnut",
    "timestamp" : "2024-10-17 12:22:12"
  }, {
    "reported_comment" : false,
    "body" : "https://preview.redd.it/nf0wlgypyevd1.png?width=3374&format=png&auto=webp&s=9bbfe4f721024ab2a87e6745e9d631d1761420fc\n\nDoes anyone know whats up with this website? Nothing is available online for a night at the colosseum. It doesnt even say closed or sold out. I've been checking all day starting at opening time (8 pm in Italy)",
    "username" : "stephenschneider10",
    "timestamp" : "2024-10-18 03:01:18"
  }, {
    "reported_comment" : false,
    "body" : "Anyone know where to buy or selling tickets for either the 5th, 6th, or 7th of November? Main site is sold out",
    "username" : "AirWalker31",
    "timestamp" : "2024-10-19 15:20:25"
  }, {
    "reported_comment" : false,
    "body" : "Looking to sell 2x full experience underground tickets at face value. They are for 25th October, 12:00, Italian guide",
    "username" : "cassio_plz",
    "timestamp" : "2024-10-21 12:00:58"
  }, {
    "reported_comment" : false,
    "body" : "Seeing the website to buy tickets has been unavailable all morning- just me? Any insight?",
    "username" : "Old_Audience_8875",
    "timestamp" : "2024-10-21 15:58:19"
  }, {
    "reported_comment" : false,
    "body" : "I'm looking to sell 2 Full experience tickets for 25/10, will be impossible for me to attend due flight cancelation and it's not possible to change de dates. DM me if interested",
    "username" : "highsagan",
    "timestamp" : "2024-10-24 17:33:27"
  }, {
    "reported_comment" : false,
    "body" : "Looking to sell 2 full experience attic tickets for 25/10. We fell sick, so wont be able to make it.",
    "username" : "Puzzleheaded-Row1084",
    "timestamp" : "2024-10-25 00:28:16"
  }, {
    "reported_comment" : false,
    "body" : "Looking to buy 2 tickets for Underground full experience (guided or not) on November 17th 2024",
    "username" : "ProfessionalOk5813",
    "timestamp" : "2024-10-25 06:27:33"
  }, {
    "reported_comment" : false,
    "body" : "I'm Looking to purchase 2 tickets for the Underground Full Experience (guided or non-guided) on November 8th 2024. Please contact me if available!",
    "username" : "ExcuseBitter6847",
    "timestamp" : "2024-10-27 09:08:15"
  }, {
    "reported_comment" : false,
    "body" : "I am confused by the ticket purchasing process. I am trying to get the mythical arena + underground tickets. If i go on the main page, it shows the entire November as unavailable. If i go to the \"tourist guide slots\" link, there's an available slot for the \"full experience ticket\". What is the difference, do they refer to the same tour or not? (by name it looks the same, but I don't understand why one is available and one not).\n\nIf I choose 10am, is that the time where the whole Colosseum tour starts, or just the underground tour? At what time should I actually be there?\n\nI have to choose in the group carrier section between Guide pass and Tourist guide full experience. I can't find details on what each thing means. Why does it have to be so freaking complicated to buy tickets?",
    "username" : "black_dizzy",
    "timestamp" : "2024-10-27 10:05:22"
  }, {
    "reported_comment" : false,
    "body" : "Looking for 2 full experience (underground/arena) tickets any day between Nov 11-14",
    "username" : "tweb321",
    "timestamp" : "2024-10-30 17:01:51"
  }, {
    "reported_comment" : false,
    "body" : "It seems most tours are for smaller groups, but we are traveling with our extended family and I'm trying to set up a Colosseum tour for our group of 20-25 people (about half kids and half adults), but I can't seem to find a tour that accommodates that many people. Any recommendations? Looking specifically for underground plus forum/hill if possible.\n\n  \nThanks",
    "username" : "jeeden_1",
    "timestamp" : "2024-10-30 20:58:30"
  }, {
    "reported_comment" : false,
    "body" : "I have one ticket for guided underground full experience on Nov 14, 2024 at 1:30pm.\n\nI am looking to buy one more or sell this one. DM me if interested",
    "username" : "Glad_Ask_4997",
    "timestamp" : "2024-10-31 02:52:03"
  }, {
    "reported_comment" : false,
    "body" : "I found so many websites selling tickets for the colosseum that I'm confused: which one is the official?",
    "username" : "Odd-Internet-7372",
    "timestamp" : "2024-10-31 14:46:16"
  }, {
    "reported_comment" : false,
    "body" : "Looking for 6 full experience tickets for anytime Saturday Nov 16th - 17th. The website is giving me an “unable to retrieve dates available to purchase” error on multiple browsers/devices, any idea what to do?",
    "username" : "heckofagoodboy",
    "timestamp" : "2024-10-31 16:43:02"
  }, {
    "reported_comment" : false,
    "body" : "The ticketing website is busted 😭 looking for 2 full experience + arena tickets for Nov 7",
    "username" : "batboobies",
    "timestamp" : "2024-10-31 19:07:59"
  }, {
    "reported_comment" : false,
    "body" : "Anyone have 3 tickets for 22 Nov or 23 Nov? I have 2 attic tickets for 23 Nov at 2:10pm but added another person to the trip. Willing to swap/sell/buy so that all 3 of us can go together.",
    "username" : "SprinklesAdditional",
    "timestamp" : "2024-11-01 16:49:25"
  }, {
    "reported_comment" : false,
    "body" : "I've got two COLOSSEO-FORO ROMANO PALATINO 24H tickets for 5/11 11:30. Bought each for 18€.\nPlease DM if you're interested",
    "username" : "Upstairs_Hope_9310",
    "timestamp" : "2024-11-03 12:31:00"
  }, {
    "reported_comment" : false,
    "body" : "Looking for 2 tickets with underground access - any time from 27 November to 29 November.",
    "username" : "One_more_username",
    "timestamp" : "2024-11-03 18:06:19"
  }, {
    "reported_comment" : false,
    "body" : "Got a little overexcited and bought 2 full experience attic tickets for Nov 26 at 10:10, not realizing I actually needed the 27th. All has been settled on the latter, but now I have these 2 extra tickets for the 26th. Happy to transfer them to some nice strangers!\n\nEdit: these have been claimed :)",
    "username" : "jmha245",
    "timestamp" : "2024-11-05 05:15:01"
  }, {
    "reported_comment" : false,
    "body" : "I have a ticket to the Colosseum night tour this Thursday, 11/2. Can I access the Archaeological area 24 hours before?  \nI know it works that way for daytime full-experience tickets, but I'm not sure if it's the same for the night tours.",
    "username" : "Commercial-Loss-6005",
    "timestamp" : "2024-11-05 07:48:03"
  }, {
    "reported_comment" : false,
    "body" : "I have two colosseum full experience tickets for resell. 8:50 am on 11/13/24. I can’t go for personal reason. They cost 24 euro each. If you need them I can sell them to you and transfer name to yours. These tickets are sold out on official website.",
    "username" : "3EaglesDad",
    "timestamp" : "2024-11-05 18:30:07"
  }, {
    "reported_comment" : false,
    "body" : "I have two attic full experience tickets for 11/17/24 if anyone wants. Selling for price I got them for (24 euros each).",
    "username" : "ProfessionalOk5813",
    "timestamp" : "2024-11-05 21:23:51"
  }, {
    "reported_comment" : false,
    "body" : "Looking for nov 9 or 10 colosseum underground or top level tickets. Please message directly if possible ",
    "username" : "starynight888",
    "timestamp" : "2024-11-08 23:21:18"
  }, {
    "reported_comment" : false,
    "body" : "I have 5 colosseum full experience tickets for resell for 12pm on 24th Nov. They cost 32 euro each from official website. I can transfer name to yours. Our plan changed and we can’t go on 24th, if you are interested message me.",
    "username" : "chad_adus24",
    "timestamp" : "2024-11-09 07:54:49"
  }, {
    "reported_comment" : false,
    "body" : "Hello :). Im looking for attic tickets for around the 20th-30th if anyone wants to sell them",
    "username" : "Cichiel",
    "timestamp" : "2024-11-09 11:55:58"
  }, {
    "reported_comment" : false,
    "body" : "Looking to buy 2x full experience underground tickets (english guided or not!) for 16th-19th November if anyone is selling some. Thank you!",
    "username" : "satans_ladyfriend",
    "timestamp" : "2024-11-11 14:07:48"
  }, {
    "reported_comment" : false,
    "body" : "Looking to buy 2x full experience underground tickets (guided or not!) for 17th November if anyone is selling some. Thank you!",
    "username" : "nat12345567888",
    "timestamp" : "2024-11-12 13:35:04"
  }, {
    "reported_comment" : false,
    "body" : "TWO \"FULL EXPERIENCE TICKET WITH ENTRY TO THE ATTIC OF THE COLOSSEUM\" at 8:50 AM Wednesday 11/13 is available on official website. Good luck!\n\n [https://ticketing.colosseo.it/en/eventi/full-experience-attico/?t=2024-11-13](https://ticketing.colosseo.it/en/eventi/full-experience-attico/?t=2024-11-13)",
    "username" : "3EaglesDad",
    "timestamp" : "2024-11-12 17:46:23"
  }, {
    "reported_comment" : false,
    "body" : "I am a bit confused. I'm trying to book some tickets, our date would be for late Jan so it might be a bit too early, but there are NO dates available ever. Every day is either sold out or \"not available online\". Is this normal? Is it possible to get tickets?",
    "username" : "Earyx",
    "timestamp" : "2024-11-13 14:08:35"
  }, {
    "reported_comment" : false,
    "body" : "looking for 4 full experience tickets between Nov 25-27. please dm if you have anything :)",
    "username" : "pupdogmom",
    "timestamp" : "2024-11-14 01:33:53"
  }, {
    "reported_comment" : false,
    "body" : "Looking for 2 underground full experience tickets for 12/15. English please!!",
    "username" : "spichless",
    "timestamp" : "2024-11-15 11:09:45"
  }, {
    "reported_comment" : false,
    "body" : "[PatriciaDC](/user/PatriciaDC/)•[2d ago](/r/rome/comments/1ct96gm/comment/lx66sa0/)•\n\nWe have 4 Full Experience Attic tickets for Wednesday, Nov 27 at 11:10 am, if interested.",
    "username" : "PatriciaDC",
    "timestamp" : "2024-11-16 18:29:43"
  }, {
    "reported_comment" : false,
    "body" : "Looking for 2 underground experience tickets or attic tickets for either the 18th after 3pm or the 19th , 20th before midday. \n\nPreferably English guided tour but open to ideas.",
    "username" : "DrDizzler",
    "timestamp" : "2024-11-17 20:54:08"
  }, {
    "reported_comment" : false,
    "body" : "Looking for 4 underground experience tickets or attic tickets for either the 29th or the 30th or December 2.",
    "username" : "lchen2014",
    "timestamp" : "2024-11-17 22:44:44"
  }, {
    "reported_comment" : false,
    "body" : "Looking for 4 underground or attic experience tickets on the 11/29 or 11/30",
    "username" : "Smart-Rich-5517",
    "timestamp" : "2024-11-18 19:51:36"
  }, {
    "reported_comment" : false,
    "body" : "Looking to buy 3 tickets for basically any time between now and Sunday, Dec 1!",
    "username" : "DoctorW0rm",
    "timestamp" : "2024-11-27 11:55:54"
  }, {
    "reported_comment" : false,
    "body" : "Looking for 5 tickets for full experience to arena or attic. 28th December anytime",
    "username" : "alevelslai",
    "timestamp" : "2024-11-28 09:25:02"
  }, {
    "reported_comment" : false,
    "body" : "Looking for 2 tickets, anywhere from the 26-29th of December, underground tickets individual or guided English!",
    "username" : "Fencer300",
    "timestamp" : "2024-11-29 10:59:42"
  }, {
    "reported_comment" : false,
    "body" : "I need 2 tickets between 29 nov 3 dec. english",
    "username" : "Strict_Cow_4626",
    "timestamp" : "2024-11-29 16:22:36"
  }, {
    "reported_comment" : false,
    "body" : "ISO: 2 tickets (preferably underground) on December 22nd - any time available",
    "username" : "wsouloa",
    "timestamp" : "2024-11-30 22:57:32"
  }, {
    "reported_comment" : false,
    "body" : "Selling 4 tickets for the full experience + attic, Dec 21st at 1:50 PM!",
    "username" : "Surb111",
    "timestamp" : "2024-12-13 23:15:30"
  }, {
    "reported_comment" : false,
    "body" : "If I book the 24H Colosseum Ticket for 8:30AM am I only allowed to stay inside for a limited time?\n\nhttps://ticketing.colosseo.it/en/eventi/24h-colosseo-foro-romano-palatino/\n\nThanks!",
    "username" : "honey_park77",
    "timestamp" : "2024-12-15 23:15:32"
  }, {
    "reported_comment" : false,
    "body" : "Can I leave and come back to the Colosseum? Thinking of heading out for lunch",
    "username" : "shespams",
    "timestamp" : "2024-12-16 20:24:03"
  }, {
    "reported_comment" : false,
    "body" : "Looking for 2 Full Experience Underground tickets for Colosseum either 28 or 29",
    "username" : "jlkirbee",
    "timestamp" : "2024-12-19 02:30:57"
  }, {
    "reported_comment" : false,
    "body" : "Can you get colosseum/forum tickets day of this time of year? please let me know!",
    "username" : "Blondiegurl13",
    "timestamp" : "2024-05-25 21:49:35"
  }, {
    "reported_comment" : false,
    "body" : "Caution. I am posting this from our experience yesterday in order to help someone else.  *Do not buy the official underground guided tour in Italian for the Colosseum - unless you understand Italian!*  I got fed up waking up at 2:00 a.m. for a few days to try and get the English underground guided tour so I thought I was being clever by buying the tour in Italian. I was learning a little Italian. It was a complete waste and also in the underground guided tour there is nothing much to see really; just a few passageways and the lifts that are reconstructed to lift the animals up. The official guide stopped the tour when we reached the arena. Whereas I noticed for the third party tours their guide took them through all the exhibits. It is actually better to use the official free audio guide and buy regular tickets but for some reason I was unable to download it on my phone.",
    "username" : "likejudo",
    "timestamp" : "2024-05-27 07:11:40"
  }, {
    "reported_comment" : false,
    "body" : "Does it say specifically the tours are in English? I’m going the last week of Sept and would love to try and get tickets to the underground",
    "username" : "Global-Composer-1173",
    "timestamp" : "2024-08-15 05:36:31"
  }, {
    "reported_comment" : false,
    "body" : "Yes the PDF is good enough.\n\nI also printed the ticket and held in my hand. Same for my tickets to Vatican Museums and Galleria Borghese. I find that there are friendly people will direct you to the correct queue/entrance when they can see that you have a ticket.",
    "username" : "Needacurefordementia",
    "timestamp" : "2024-08-01 09:07:16"
  }, {
    "reported_comment" : false,
    "body" : "Congrats on getting tickets! So for clarification if I want a guided tour at 9:30 it will be released at 9:30, or will the first time slot(9:30) be released at 8:50? Thanks.",
    "username" : "Beach_Gyrl",
    "timestamp" : "2024-07-31 13:14:04"
  }, {
    "reported_comment" : false,
    "body" : "u/aykarumba123  , my undestanding is ticket get released exactly 30 days in advance . How could you have booked a ticket for 10h45 Rome time ? You should only have been able to book the 10h45AM CEST slot at 4h45EST or am I missing something ?",
    "username" : "theflavorlab1",
    "timestamp" : "2024-05-17 14:58:33"
  }, {
    "reported_comment" : false,
    "body" : "I stayed up all night last night to get same ticket but no tickets were open yet at 2:15am (8:45am Rome time)",
    "username" : "Libra_bb5721",
    "timestamp" : "2024-06-06 16:53:29"
  }, {
    "reported_comment" : false,
    "body" : "You can change name on tickets one time. Hope you find someone and get your money back. Wishing you the best for your injury!",
    "username" : "None",
    "timestamp" : "2024-05-18 18:15:05"
  }, {
    "reported_comment" : false,
    "body" : "I saw this on the website earlier today when I was researching for tickets. \n\n“Children under the age of 18 will be allowed to enter together with paying adults on the same date and at the same time indicated on the ticket; they will be able to collect their free ticket after passing the security checks, directly at the ticket office inside the Colosseum.” \n\nNot sure if this helps?",
    "username" : "haleysaversion",
    "timestamp" : "2024-05-16 18:34:24"
  }, {
    "reported_comment" : false,
    "body" : "once you get past security (i.e the massive line outside the actual Colosseum), there is a ticket booth, much like at a major sporting event...just stop in there after passing security, nbd",
    "username" : "salvadordaliparton69",
    "timestamp" : "2024-05-17 00:31:30"
  }, {
    "reported_comment" : false,
    "body" : "I thought kids under 18 get in for free and according to the website it sounds like you just need 2 adult tickets and then to visit the ticket booth the day of your tickets to get the free kids tickets. \n\nI was able to get tickets for mid jun. I was up and online 30 minutes before tickets went on sale. I had multiple phones, computers, Google chrome seemed to work the fastest. Make sure to make an account way before buying tickets. Use an auto fill chrome extension for names/credit card info. Keep moving the calendar from May to June and back and forth when tickets get released to keep the ticket times refreshed. As soon as they go on sale pick the time you want and hit continue then wait for until it loads. Once you get to the next step you should be good just have your info ready. \n\nYou should already be sitting in the full experience ticket buying page before tickets are released. All you have to do is move the calendar once it hits release time to show the available times. ",
    "username" : "Internal_Parsnip_726",
    "timestamp" : "2024-05-17 06:29:18"
  }, {
    "reported_comment" : false,
    "body" : "Coopcuk\nCoopculture is dead. Use ticketing.colosseo.it.",
    "username" : "RomeVacationTips",
    "timestamp" : "2024-05-22 08:07:41"
  }, {
    "reported_comment" : false,
    "body" : "Got mine at 12:45 am. Unsure if it's in Italian or English. Got the full underground experience.",
    "username" : "JPWRana",
    "timestamp" : "2024-05-25 15:35:15"
  }, {
    "reported_comment" : false,
    "body" : "Wondering the same please if anyone has any idea why",
    "username" : "Sombre_Rambo",
    "timestamp" : "2024-06-09 14:44:05"
  }, {
    "reported_comment" : false,
    "body" : "+1",
    "username" : "Electronic_Heat_4618",
    "timestamp" : "2024-06-10 02:28:23"
  }, {
    "reported_comment" : false,
    "body" : "Here to locate the same info! It's not midnight PST",
    "username" : "Even-Possible0",
    "timestamp" : "2024-06-19 09:27:56"
  }, {
    "reported_comment" : false,
    "body" : "There have been posts about Colosseum's ticketing website varying its ticketing pages now and then.\n\nThis is what I did to get my tickets. Two days prior to the date and time of release of my desired visit dates and times, I went into the ticketing webpage to see their release patterns to verify if the website did indeed release the tickets at 720 hours prior to the visit date and time.\n\nSo I would suggest that you visit and view the Arena ticketing website (click on the timing but don't add the ticket to your cart in case the ticketing website lock your access for your real purchasing date) and see if they did release the tickets 168 hours to the dot.",
    "username" : "Needacurefordementia",
    "timestamp" : "2024-08-08 11:47:16"
  }, {
    "reported_comment" : false,
    "body" : "still available",
    "username" : "cc-is-real-act-now",
    "timestamp" : "2024-08-25 08:29:48"
  }, {
    "reported_comment" : false,
    "body" : "Actually, would like to give these away for free! Please message me if you want them. I just don't want them to go to waste, and cannot go at that time. I can transfer the tickets into your name.",
    "username" : "shitty_vegetarian",
    "timestamp" : "2024-08-24 16:55:01"
  }, {
    "reported_comment" : false,
    "body" : "Hi there! I am totally interested in buying one. Do you still have the ticket available??",
    "username" : "Lucky-Violinist-9213",
    "timestamp" : "2024-09-13 15:38:04"
  }, {
    "reported_comment" : false,
    "body" : "Those are Free Sunday and State Holiday dapts…no online tickets are sold on those days.",
    "username" : "PatriciaDC",
    "timestamp" : "2024-11-02 18:40:09"
  }, {
    "reported_comment" : false,
    "body" : "https://preview.redd.it/sk607628k2yd1.jpeg?width=463&format=pjpg&auto=webp&s=66a5b2916c2fd7888b3db6bda739b05969524dea",
    "username" : "Chemical-Suspect9917",
    "timestamp" : "2024-10-31 11:30:11"
  }, {
    "reported_comment" : false,
    "body" : "I wish. I am looking for May 31. So close",
    "username" : "Training-Ad-6460",
    "timestamp" : "2024-05-16 15:26:32"
  }, {
    "reported_comment" : false,
    "body" : "Don’t make my mistake and make sure to enter the colosseum at 9am. Even though the tick says “Coloseo 24h,” you have to enter at the time indicated on the ticket. The 24 hours permits entry to the Roman Forum and Palatine Hill for 24 hours.",
    "username" : "HateLaw_LoveLifting",
    "timestamp" : "2024-05-16 21:29:03"
  }, {
    "reported_comment" : false,
    "body" : "I don't think they are doing that anymore, I haven't seen it on the new ticket site.",
    "username" : "Safe_Organization592",
    "timestamp" : "2024-06-05 23:09:04"
  }, {
    "reported_comment" : false,
    "body" : "yes we purchase 3 tickets a few days ago for the full experience for a morning slot in June",
    "username" : "aykarumba123",
    "timestamp" : "2024-05-21 02:51:54"
  }, {
    "reported_comment" : false,
    "body" : "The first one is the standard tour but also allows you to stand on the arena floor of the Colosseum (the part of the floor that has been reconstructed in wood) while the second mentioned is the standard tour.",
    "username" : "RomeVacationTips",
    "timestamp" : "2024-05-18 19:24:22"
  }, {
    "reported_comment" : false,
    "body" : "Tickets for end of June havent been released yet. They get released 30 days in advance so have only been released to 21 June as of today.",
    "username" : "bdmske",
    "timestamp" : "2024-05-22 13:12:19"
  }, {
    "reported_comment" : false,
    "body" : "Hi please can I ask what is the official website for the tickets? I have been trying to find where to buy them but there are so many different ones on google",
    "username" : "createdbypheebs",
    "timestamp" : "2024-05-24 16:05:45"
  }, {
    "reported_comment" : false,
    "body" : "What do you mean released by time slot?",
    "username" : "JPWRana",
    "timestamp" : "2024-05-24 21:48:37"
  }, {
    "reported_comment" : false,
    "body" : "Your Soo close. I need them for 6/24.",
    "username" : "JPWRana",
    "timestamp" : "2024-05-24 21:53:42"
  }, {
    "reported_comment" : false,
    "body" : "That's meant to be the language of the guide. Since there is no guide on that ticket I assume it's an error.",
    "username" : "RomeVacationTips",
    "timestamp" : "2024-05-25 08:17:49"
  }, {
    "reported_comment" : false,
    "body" : "I'm on the same boat as you.. I have no idea what to expect. I got Italian because there was nothing else.\n\n For underground as well",
    "username" : "JPWRana",
    "timestamp" : "2024-05-26 06:53:30"
  }, {
    "reported_comment" : false,
    "body" : "How did it go? Did the guide only do Underground and the rest like Arena and Colosseum you were on your own? Thanks",
    "username" : "backtoexpat",
    "timestamp" : "2024-06-03 16:57:27"
  }, {
    "reported_comment" : false,
    "body" : "Waste of money from our experience yesterday. Please see my post above",
    "username" : "likejudo",
    "timestamp" : "2024-05-27 07:16:31"
  }, {
    "reported_comment" : false,
    "body" : "What price?",
    "username" : "JPWRana",
    "timestamp" : "2024-05-26 06:52:47"
  }, {
    "reported_comment" : false,
    "body" : "Hi, can you tell me more info?",
    "username" : "steeefyyy",
    "timestamp" : "2024-05-29 00:59:32"
  }, {
    "reported_comment" : false,
    "body" : "I’m right there with you almost same exact dates. Let me know what you find out!",
    "username" : "FormVoltron1",
    "timestamp" : "2024-05-28 03:04:16"
  }, {
    "reported_comment" : false,
    "body" : "I have 2 underground tickets to sell for June 20th, 11am",
    "username" : "hbkrem",
    "timestamp" : "2024-05-31 22:19:31"
  }, {
    "reported_comment" : false,
    "body" : "Any info on buying in person by queueing up? Thanks",
    "username" : "backtoexpat",
    "timestamp" : "2024-06-03 21:28:18"
  }, {
    "reported_comment" : false,
    "body" : "Do you know the details of the night time tickets on Saturdays and what it includes ? I will be there on a Saturday but I haven’t seen anything on the official website about one. Are they only sold to private tour guides?",
    "username" : "Beach_Gyrl",
    "timestamp" : "2024-06-18 02:49:44"
  }, {
    "reported_comment" : false,
    "body" : "[https://ticketing.colosseo.it/en/eventi/24h-colosseo-foro-romano-palatino/?t=2024-06-19](https://ticketing.colosseo.it/en/eventi/24h-colosseo-foro-romano-palatino/?t=2024-06-19)\n\nOfficial site (I think?) has tickets available on the 19th for you",
    "username" : "buckyman0",
    "timestamp" : "2024-06-02 04:44:46"
  }, {
    "reported_comment" : false,
    "body" : "May I ask how many days in advance did you buy tickets?",
    "username" : "Even-Possible0",
    "timestamp" : "2024-06-19 09:31:24"
  }, {
    "reported_comment" : false,
    "body" : "A person replied below with a review. Guide is only for the Underground part",
    "username" : "backtoexpat",
    "timestamp" : "2024-06-03 15:44:45"
  }, {
    "reported_comment" : false,
    "body" : "Do you still have the ticket? I'm interested.",
    "username" : "opinionavigator",
    "timestamp" : "2024-06-04 21:50:24"
  }, {
    "reported_comment" : false,
    "body" : "Yep didn’t go on sale when they were meant to and now they are all sold out",
    "username" : "AdAstra3830",
    "timestamp" : "2024-06-10 17:24:00"
  }, {
    "reported_comment" : false,
    "body" : "We also noticed they didn't go on sale when it seemed like they were supposed to. I got lucky and they happened to release a batch for July 8 and 9 around 9:57 AM Rome time, seemingly completely random. I would try again tonight and see if they happen to do the same thing again for the 10th.",
    "username" : "Independent-Fig-1131",
    "timestamp" : "2024-06-10 23:57:42"
  }, {
    "reported_comment" : false,
    "body" : "I can guarantee you that it's not worth it. Especially the underground part. Since the Colosseum floor is long gone you will see the underground either way, just from slightly above instead.\n\n\nI paid a lot extra for the \"full experience\" but in hindsight it was not worth it. \n\n\nBut try to get Colosseum tickets that include entry to Forum +hills area, that was worth it.",
    "username" : "LoneWolf_McQuade",
    "timestamp" : "2024-06-12 10:38:58"
  }, {
    "reported_comment" : false,
    "body" : "Buy the 24 Hr Colosseum, Palatine and Forum tix. There are a fair number of time slots left and you'll save a bundle  [https://ticketing.colosseo.it/en/eventi/24h-colosseo-foro-romano-palatino/?t=2024-07-02](https://ticketing.colosseo.it/en/eventi/24h-colosseo-foro-romano-palatino/?t=2024-07-02)",
    "username" : "nattieo99",
    "timestamp" : "2024-06-15 01:51:00"
  }, {
    "reported_comment" : false,
    "body" : "[deleted]",
    "username" : "None",
    "timestamp" : "2024-06-25 18:52:52"
  }, {
    "reported_comment" : false,
    "body" : "The 2-Day Ticket is really only valid for 2 consecutive days (**Il biglietto è valido due giorni consecutivi**. - https://colosseo.it/biglietti/full-experience/). 17 August is one day, so one more consecutive day will be the day before or the day after 17 August, being either 16 August or 18 August.",
    "username" : "Needacurefordementia",
    "timestamp" : "2024-06-25 06:24:18"
  }, {
    "reported_comment" : false,
    "body" : "From what I've read, they release 30 days before your chosen date. I just bought mine today for the 10th August!",
    "username" : "nguyenviviiana",
    "timestamp" : "2024-07-11 17:20:44"
  }, {
    "reported_comment" : false,
    "body" : "I have 4 tickets of full experience underground in Italian for 7/12 at 2:15pm\nAnd 4 tickets of domus aurea guided tour for 7/12 at noon (see the post below)",
    "username" : "Only_Woodpecker6002",
    "timestamp" : "2024-06-26 23:56:26"
  }, {
    "reported_comment" : false,
    "body" : "Ticketing website is [https://ticketing.colosseo.it/en/](https://ticketing.colosseo.it/en/)\n\nFull Experience is just a fancy word to distinguish the add-on tickets from the pure admission tickets.\n\nThere are 3 Full Experience Tickets (by order of difficulty in purchases due to limited numbers of tickets)\n\n- Full Experience Underground and Arena = Pure Admission + Access to Underground and Arena\n\n- Full Experience Attic = Pure Admission + Access to Attic\n\n- Full Experience Arena = Pure Admission + Access to Arena\n\nSo, Full Experience does not really mean you can explore the entire Colosseum. I bought Full Experience Attic + Full Experience Underground **Guided** Tour + Arena for the real full experience.\n\nSuper Sites are enclosed sites within the Palatine Hill (mostly houses, like House of Augustus, Palatine Museum etc, click \"Read all\" on the Full Experience Arena Ticket webpage for a list of Super Sites and operational timing).\n\nYou need separate tickets for Domus Aurea.",
    "username" : "Needacurefordementia",
    "timestamp" : "2024-06-27 11:51:13"
  }, {
    "reported_comment" : false,
    "body" : "if you have the underground + arena ticket also for the same date, please let me know also.",
    "username" : "LetsWorkTogetherAll",
    "timestamp" : "2024-06-27 17:11:00"
  }, {
    "reported_comment" : false,
    "body" : "I have previously responded to another redditor here\n\n[https://www.reddit.com/r/rome/comments/1ct96gm/comment/la6n2h0/?utm\\_source=share&utm\\_medium=web3x&utm\\_name=web3xcss&utm\\_term=1&utm\\_content=share\\_button](https://www.reddit.com/r/rome/comments/1ct96gm/comment/la6n2h0/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)",
    "username" : "Needacurefordementia",
    "timestamp" : "2024-07-01 10:04:01"
  }, {
    "reported_comment" : false,
    "body" : "If you go [here](https://ticketing.colosseo.it/en/) they are selling for Aug 11 today, just got mine for the underground tour",
    "username" : "Acceptable_Mud_",
    "timestamp" : "2024-07-12 10:22:38"
  }, {
    "reported_comment" : false,
    "body" : "Well, you still can see the Arena, Attic and the Underground from a distance on the two floors which you'll have access with the said ticket but you can't step foot on the Arena, the upper floors designated as Attic and the lower ground floors designated as Underground.",
    "username" : "Needacurefordementia",
    "timestamp" : "2024-07-18 13:24:13"
  }, {
    "reported_comment" : false,
    "body" : "https://www.ticketswap.com/listing/colosseum-guided-tour-english/13525220/0a3d4f9402?utm_campaign=publishedListingShare&utm_source=ticketswap&utm_medium=manualshare",
    "username" : "solewashed83",
    "timestamp" : "2024-07-31 03:03:30"
  }, {
    "reported_comment" : false,
    "body" : "[Quick Entry: Get In And Out Of The Colosseum In Just 20 Minutes! - YouTube](https://www.youtube.com/watch?v=STmtoKagL1M)\n\nLooking at this recent video, I notice that there is no security scanner at the STERN entrance for the 24H Only Arena ticket holders.\n\nThere are security scanners (like at an airport) after the VALADIER entrance for the other Colosseum ticket holders.\n\nThe youtuber mentioned that those who purchased the full experience tickets were given a green sticker to access the Arena which is how the staff differentiate the 24H Only Arena ticket holders from the rest.\n\nThe good thing is, the entrance is staffed. If your ticket timing is not far apart and you are not carrying any big bags or bags which require scanning, the staff might just use his/her discretion to let you in.\n\nWorst case if the staff refuses to let you in, the VALADIER entrance (for the 24H normal ticket on the opposite side of the STERN entrance) is less than 400m apart from the STERN entrance (for the 24H Only Arena ticket). We got through the security line at the VALADIER entrance in less than 20 minutes.",
    "username" : "Needacurefordementia",
    "timestamp" : "2024-08-08 12:25:54"
  }, {
    "reported_comment" : false,
    "body" : "[Quick Entry: Get In And Out Of The Colosseum In Just 20 Minutes! - YouTube](https://www.youtube.com/watch?v=STmtoKagL1M)\n\nThis youtuber says you can try to ask the ticket office inside the Colosseum about Arena access with your Attico tickets. Video's quite recent, uploaded on 2 June 2024.",
    "username" : "Needacurefordementia",
    "timestamp" : "2024-08-08 11:57:16"
  }, {
    "reported_comment" : false,
    "body" : "https://www.ticketswap.com/listing/colosseum-guided-tour-english/13525220/0a3d4f9402?utm_campaign=publishedListingShare&utm_source=ticketswap&utm_medium=manualshare",
    "username" : "solewashed83",
    "timestamp" : "2024-07-31 02:59:18"
  }, {
    "reported_comment" : false,
    "body" : "Hi, I have 2x full experience tickets for the 25th. Will sell them for original price!",
    "username" : "Logical_Bowl1247",
    "timestamp" : "2024-08-01 17:54:31"
  }, {
    "reported_comment" : false,
    "body" : "https://www.ticketswap.com/listing/colosseum-guided-tour-english/13525220/0a3d4f9402?utm_campaign=publishedListingShare&utm_source=ticketswap&utm_medium=manualshare",
    "username" : "solewashed83",
    "timestamp" : "2024-07-31 03:03:07"
  }, {
    "reported_comment" : false,
    "body" : "Hi, I have 2x full experience tickets for the 25th. Will sell them for original price!",
    "username" : "Logical_Bowl1247",
    "timestamp" : "2024-08-01 17:51:42"
  }, {
    "reported_comment" : false,
    "body" : "didnt the tickets for the 31st just drop today>?",
    "username" : "maxamillion17",
    "timestamp" : "2024-08-01 09:00:50"
  }, {
    "reported_comment" : false,
    "body" : "Sorry I know you’ve already gotten your tickets but did you ever get unblocked from the website? I got kicked out from my home wifi while trying to practice getting tickets for mid September. So frustrating!",
    "username" : "CityxLightsx",
    "timestamp" : "2024-08-08 10:17:03"
  }, {
    "reported_comment" : false,
    "body" : "Only guided night tours on Thursdays.\n\n[A NIGHT AT THE COLOSSEUM – Parco Archeologico del Colosseo](https://ticketing.colosseo.it/en/eventi/una-notte-al-colosseo/)",
    "username" : "Needacurefordementia",
    "timestamp" : "2024-08-08 11:51:09"
  }, {
    "reported_comment" : false,
    "body" : "I have two guided tour full experience (underground and arena) for September 2nd at 12PM if you’re interested. Just trying to get face value back (32€ each).",
    "username" : "ADPeris",
    "timestamp" : "2024-08-04 13:33:03"
  }, {
    "reported_comment" : false,
    "body" : "I believe the first Sunday of the month is a free day, so they won't sell tickets that day.",
    "username" : "histoiredamourx",
    "timestamp" : "2024-08-04 09:19:16"
  }, {
    "reported_comment" : false,
    "body" : "How did you manage to grab tickets for English? Any tips? Feels impossible. I don't see the option for the time slot I want and then when I refresh, it shows up but sold out.",
    "username" : "According_Sir_8703",
    "timestamp" : "2024-08-05 15:15:51"
  }, {
    "reported_comment" : false,
    "body" : "Hey, my friend bought one ticket from you via ticket swap. Can you please write me, so we can change the name on the ticket",
    "username" : "zuioop",
    "timestamp" : "2024-08-09 11:13:41"
  }, {
    "reported_comment" : false,
    "body" : "https://www.ticketswap.com/listing/colosseum/13509904/6b265a5916?utm_campaign=publishedListingShare&utm_source=ticketswap&utm_medium=manualshare",
    "username" : "Traditional-Cable478",
    "timestamp" : "2024-08-07 18:29:13"
  }, {
    "reported_comment" : false,
    "body" : "Hello! I was the one who asked the same question with yours and I have the same exact thoughts as you have. Some say just to wait it out but still I don’t want to risk not getting any waiting for the last minute for the tickets to be released so instead, (this is what I did:)\n\nI bought the most “basic” one. (18€) The Colosseum, Roman Forum and Palatine Hill tickets instead. Based on my research, You can access the floors which I think is already suitable for us. Paying extra for the Arena didn’t seem quite worth it for ME (plus the risk of waiting a week before ticket release) the more I research about the difference between the two. \n\nI guess the Full Experience will benefit you if you need the 48 hours and of course the Arena itself. The Arena will be the platform you see in the recent colosseum photos. Which you can have an almost 360 view unlike when you’re in just the floors itself. Also the Roman Forum and Palatine Hill is I believe huge in size and it might take more hours to explore thats where you’ll need the 48 hours if you have time. \n\nPs. I haven’t been yet. Will be travelling on September. Just sharing my own thoughts on the matter. :)\n\nI hope I did help in some way(?) or someone else who needs a little info. 🙂 Have a safe travel!",
    "username" : "tsikennuggets",
    "timestamp" : "2024-08-13 19:30:37"
  }, {
    "reported_comment" : false,
    "body" : "If I am bringing my elderlies , I would purchase the 24H Only Arena ticket because it does not involve any stairs and entry is separate from the rest without long queues. My elderlies are also not interested in the gift shop inside the Colosseum. Plus they don't walk far and upslope so 24H is enough for me to bring them to key sites in Roman Forum.\n\nOn the other hand, I am a slow explorer so I like the Full Experience tickets which give me 2 days for Colosseum, Roman Forum and Palatine Hill.",
    "username" : "Needacurefordementia",
    "timestamp" : "2024-08-14 10:11:57"
  }, {
    "reported_comment" : false,
    "body" : "I just got one an hour ago. Entry ticket to the underground and arena. I am not sure if using vpn and connecting from Italy helped. I went to the page 1 minute prior to tix release slot and was refreshing often. Then I had a problem at the checkout, kept trying to checkout and refreshing. Took a lot of patience not to quit. Going to get some sleep now as I am on the East Coast.",
    "username" : "seacity36",
    "timestamp" : "2024-08-14 11:16:40"
  }, {
    "reported_comment" : false,
    "body" : "Is the entry time far apart?\n\nI did the Attic first and took my time at the Attic then took the same lift down to the common passageway (don't know what is the correct name but I am referring to the common area after the security checks with ticket office, toilets, lifts, various queue poles for different ticket holders etc) to get to the waiting area for my underground guided tour. However, the guided underground tour is only 45 minutes and the Arena platform is only the size of 3 basketball courts. You don't really need an hour to take all angles on the Arena platform. So if your entry time is far apart, there is nothing much to do at the common passageway.\n\nFrom what I experienced, as long as you don't take the stairs up to the second floor of the Colosseum open to all ticket holders (except Arena only ticket holders), you can still make your way back to the common passageway. But once you take the stairs up to the second floor, you can only follow the one-way route to the final exit (which does not bring you back to the common passageway).",
    "username" : "Needacurefordementia",
    "timestamp" : "2024-08-15 06:59:18"
  }, {
    "reported_comment" : false,
    "body" : "[https://www.youtube.com/watch?v=sF\\_BXvNdFHg](https://www.youtube.com/watch?v=sF_BXvNdFHg)\n\nThis recent video should be helpful.\n\n2:57 minutes into the video is the waiting area for the guided underground tour. \n\n7:23 minutes into the video is the manned access to the lift to the attic.\n\n7:38 minutes into the video, on the left before the staircase is the manned access to the arena and underground area. \n\n7:45 minutes into the video whether the two persons went up is the staircase to the general area of the colosseum opens to all ticket holders (except 24H Only Arena ticket holders). Then you follow the youtuber route to the end to exit (which is opposite the big cross in the colosseum shown at 3:53 minutes into the video).",
    "username" : "Needacurefordementia",
    "timestamp" : "2024-08-22 09:45:27"
  }, {
    "reported_comment" : false,
    "body" : "How many tickets and at what time?",
    "username" : "Sea_Most5253",
    "timestamp" : "2024-08-21 16:22:44"
  }, {
    "reported_comment" : false,
    "body" : "Hey I’m interested in 2",
    "username" : "Fun_Ad_428",
    "timestamp" : "2024-08-29 20:09:50"
  }, {
    "reported_comment" : false,
    "body" : "You can't reserve any ticket through the official site for free Sunday. You can either go very early to queue to enter or try your luck with a private tour. Good luck.",
    "username" : "Needacurefordementia",
    "timestamp" : "2024-08-18 15:02:55"
  }, {
    "reported_comment" : false,
    "body" : "I have full experience attico tickets (individual, not guided) on Sept 16th at 9:50am, 4 tickets, in case these would work in your itinerary.",
    "username" : "mperry381",
    "timestamp" : "2024-08-19 16:01:01"
  }, {
    "reported_comment" : false,
    "body" : "I am interested",
    "username" : "nautyvarun",
    "timestamp" : "2024-08-23 20:37:27"
  }, {
    "reported_comment" : false,
    "body" : "Still available :)",
    "username" : "l_taffa",
    "timestamp" : "2024-08-26 15:16:55"
  }, {
    "reported_comment" : false,
    "body" : "You can choose either to \n\n(a) enter Roman Forum after 12 noon on September 8, 2024; or\n\n(b) enter Roman Forum before 12 noon on September 10, 2024. Once you are in, the staff won't be able to identify you from the rest so you can stay until the closing time of the forum.",
    "username" : "Needacurefordementia",
    "timestamp" : "2024-08-22 05:22:49"
  }, {
    "reported_comment" : false,
    "body" : "I still have full experience + underground and arena guided tickets (italian) for the 3rd of september at 14:15! https://www.ticketswap.nl/listing/colosseum/13579357/accf7e40ea",
    "username" : "Fastjur",
    "timestamp" : "2024-08-22 16:04:08"
  }, {
    "reported_comment" : false,
    "body" : "I don’t have arena or underground, but I have 4 Full Experience Attico tickets available, September 16th at 9:50am. I can send you the link on ticketswap if you are interested.\nEdit to say, you could combine these with 24 hr Arena tickets, which are still available on the website for your dates.",
    "username" : "mperry381",
    "timestamp" : "2024-08-25 14:53:39"
  }, {
    "reported_comment" : false,
    "body" : "I have Full Experience Attico tickets available, Sept 16 at 9:50 am",
    "username" : "mperry381",
    "timestamp" : "2024-08-27 18:18:54"
  }, {
    "reported_comment" : false,
    "body" : "It is 720 hours in advance. August has 31 days. If you are in Malaysia, check later today at 2:30 pm Malaysia time and you can see Italy 8:30 am's tickets for 26 Sep, then check at 2:45 pm Malaysia time for Italy 8:45 am tickets and so on and so forth.",
    "username" : "Needacurefordementia",
    "timestamp" : "2024-08-27 06:19:46"
  }, {
    "reported_comment" : false,
    "body" : "Hi. I have ONE ticket, full experience, guided tour including underground and arena floor for 9/5 at 10:45 am, English. Face value (32 euro) I just dont want it to go to waste and only have a few days left to change the name!",
    "username" : "Due_Fold837",
    "timestamp" : "2024-08-27 16:31:36"
  }, {
    "reported_comment" : false,
    "body" : "I still have a ticket available for the 3rd of September, at 14:15. This is the full experience + underground + arena ticket, with a guided tour in italian. I paid 32 euro's total. With ticketswap fees it's 32,75 if you want to buy them: https://www.ticketswap.nl/listing/colosseum/13579357/accf7e40ea\n\nI can put your name on the ticket, I think this should be done a couple of days beforehand so if you want it, get it now!",
    "username" : "Fastjur",
    "timestamp" : "2024-08-30 16:16:35"
  }, {
    "reported_comment" : false,
    "body" : "I have Full Experience Attico tickets available if you can’t find the underground ones. Sept 16 at 9:50 am.",
    "username" : "mperry381",
    "timestamp" : "2024-08-27 18:18:07"
  }, {
    "reported_comment" : false,
    "body" : "Hi! I have two guided tickets (in Italian) on the 27th at 2:15pm (14:15)!\n\n[https://www.ticketswap.com/listing/colosseum/13837831/e9a0121643?utm\\_campaign=publishedListingShare&utm\\_source=ticketswap&utm\\_medium=manualshare](https://www.ticketswap.com/listing/colosseum/13837831/e9a0121643?utm_campaign=publishedListingShare&utm_source=ticketswap&utm_medium=manualshare)\n\nWe ended up scoring on the 28th (preferred day but last day of our trip so I bought these when I saw them just in case).\n\nWe planned to use the My Colosseum app with headphones and follow the English audio tour once the guide let us down there at our time.",
    "username" : "pastelmewnicorn",
    "timestamp" : "2024-08-31 17:48:32"
  }, {
    "reported_comment" : false,
    "body" : "Messaged you!",
    "username" : "uniqueyeris",
    "timestamp" : "2024-08-28 04:06:25"
  }, {
    "reported_comment" : false,
    "body" : "Still available",
    "username" : "RacheltheGreat7",
    "timestamp" : "2024-09-14 04:28:53"
  }, {
    "reported_comment" : false,
    "body" : "Could you do the 16th? I do have Attico tickets available on that day.",
    "username" : "mperry381",
    "timestamp" : "2024-08-29 16:09:16"
  }, {
    "reported_comment" : false,
    "body" : "Hello! \n\nGetting tickets from the official site is a pure exercise in frustration - especially if you are set on a specific date, time, and-or experience.  I'll still take it over f-ing TicketMaster/Live Nation any day!\n\nThe majority of Colosseum Tickets become available 720 hours Roma time ahead of time and go extreeemmeeellyyy fast. I'm not sure if time slots are the same each day of the week, but the weekday and weekend slots were different when I was booking.   \n\nThere are two ticket types that go on sale one week ahead of time - this self-guided option [https://ticketing.colosseo.it/en/eventi/full-experience/](https://ticketing.colosseo.it/en/eventi/full-experience/) : and the Moonlight guided tour [https://ticketing.colosseo.it/en/eventi/una-notte-al-colosseo/](https://ticketing.colosseo.it/en/eventi/una-notte-al-colosseo/) .  \n\nStart tooling around the Ticketing Homepage  [https://ticketing.colosseo.it/en/](https://ticketing.colosseo.it/en/) until you know what you want to do, and then set your alarm to get into the site right before the ticketing opens for that day.  The slots open at each time, they don't open all slots at once.  I was able to get tickets on my second day of trying, but damn, what a process.",
    "username" : "dreschuth",
    "timestamp" : "2024-09-01 19:28:23"
  }, {
    "reported_comment" : false,
    "body" : "No matter what timezone you are in, when you know you wait for let's say Oct 16 from 10.00AM (ticket on website), you need to calculate what time it will be 720 hours before but Italian timezone. For Los Angeles, you are 9 hours behind Italy timezone, so you need to be there at 01.00AM your time not 10.00AM and exactly 30 days before the desired date. So to get 10.00AM ticket at Oct 16, it's gonna be released Sep 16 at 10.00AM Italy time, so Sep 16 at 01.00AM Los Angeles time.",
    "username" : "Careful-Age-4945",
    "timestamp" : "2024-09-03 21:30:11"
  }, {
    "reported_comment" : false,
    "body" : "Hi there! I will be in Rome the 25th. Do you still have these tickets available? I would like to purchase asap.",
    "username" : "Lucky-Violinist-9213",
    "timestamp" : "2024-09-13 15:39:49"
  }, {
    "reported_comment" : false,
    "body" : "Yes, you would have to buy full experience + underground and arena (or guided), and then seperately full experience + attic. But that's quite a tricky thing to do",
    "username" : "Careful-Age-4945",
    "timestamp" : "2024-09-04 08:14:12"
  }, {
    "reported_comment" : false,
    "body" : "I have Full Experience Attico tickets available on the 16th if you are interested.",
    "username" : "mperry381",
    "timestamp" : "2024-09-04 16:34:04"
  }, {
    "reported_comment" : false,
    "body" : "Hello I have messaged you, I have Full Experience Attico tickets available on the 16th.",
    "username" : "mperry381",
    "timestamp" : "2024-09-04 16:33:20"
  }, {
    "reported_comment" : false,
    "body" : "From my experience two browsers on the same device don't make a difference. You shouldn't refresh it more than once a minute if you don't want to be kicked out and don't refresh before the planned time (the tickets won't be there earlier). Better use computer and phone (if they kick you out on the phone, you can always switch from wifi to mobile data).",
    "username" : "Careful-Age-4945",
    "timestamp" : "2024-09-04 18:09:09"
  }, {
    "reported_comment" : false,
    "body" : "Hi I'm Interested in this !",
    "username" : "OneConstruction5344",
    "timestamp" : "2024-09-17 04:27:36"
  }, {
    "reported_comment" : false,
    "body" : "Didn't use Roma Pass but saw the link is in Roma Pass FAQ page [https://www.romapass.it/en/FAQ/#faqq38](https://www.romapass.it/en/FAQ/#faqq38)\n\n[https://ticketing.colosseo.it/en/eventi/24h-colosseo-foro-romano-palatino-roma-pass/](https://ticketing.colosseo.it/en/eventi/24h-colosseo-foro-romano-palatino-roma-pass/)\n\nDo note that this link is only for free access with Roma Pass (first two sites for 72H Roma Pass and first site for 48H Roma Pass).\n\nHere is another link ([24h – COLOSSEUM, ROMAN FORUM, PALATINE – Parco Archeologico del Colosseo](https://ticketing.colosseo.it/en/eventi/24h-colosseo-foro-romano-palatino/)) for reduced fare with Roma Pass. The category will appear after you choose the date and time.",
    "username" : "Needacurefordementia",
    "timestamp" : "2024-09-18 17:05:30"
  }, {
    "reported_comment" : false,
    "body" : "Selling x1 ticket for guided underground tour for the 25.9.24 12:00 in Italian",
    "username" : "omridomi",
    "timestamp" : "2024-09-20 00:00:09"
  }, {
    "reported_comment" : false,
    "body" : "What are the 24hr tix? It’s possible I may be interested in your tix. I’m trying for Oct 21 so I’ll message you in a couple days if needed!",
    "username" : "SDkahlua",
    "timestamp" : "2024-09-20 22:06:14"
  }, {
    "reported_comment" : false,
    "body" : "I find them sold out within seconds every time",
    "username" : "Zealousideal-Ant9548",
    "timestamp" : "2024-09-25 05:09:54"
  }, {
    "reported_comment" : false,
    "body" : "that's exactly what happened to us (2 of us trying on different IP addresses) but even sooner.  One screen refresh said N/A the next screen refresh said sold out",
    "username" : "ambercatttt",
    "timestamp" : "2024-09-27 23:46:43"
  }, {
    "reported_comment" : false,
    "body" : "Hello. Please keep me updated if you find something. I am also looking for this exact date preferably last minute, but 7 - 11 is okay too. I don't know why only 6 Oct is \"not available online\" on the calendar...",
    "username" : "RealisticWasabi6343",
    "timestamp" : "2024-09-28 22:41:09"
  }, {
    "reported_comment" : false,
    "body" : "[removed]",
    "username" : "None",
    "timestamp" : "2024-09-25 17:42:58"
  }, {
    "reported_comment" : false,
    "body" : "Idk if it's a bug but a bunch of timeslots in October for the Underground tours just dropped for some reason",
    "username" : "Ancient_Surprise",
    "timestamp" : "2024-10-01 16:48:43"
  }, {
    "reported_comment" : false,
    "body" : "I know you said October 25 - 27, but if you have any flexibility I have (2) 1:30pm full experience + attic tickets on 10/24 available at face value. I already made a post here, but the long and short of it is that October 25th was our plan A for tickets we wanted and October 24th was plan B. The 10/24 tickets were available so I went ahead and bought them in case we couldn’t get tickets for 10/25 but I was able to get 10/25 tickets so I have no need for the 10/24 tickets at 1:30pm.",
    "username" : "Purdue474",
    "timestamp" : "2024-09-26 19:47:27"
  }, {
    "reported_comment" : false,
    "body" : "Have 2x Attic tickets for Oct 27 at 0900 if you're interested. :) ",
    "username" : "w0lf3h",
    "timestamp" : "2024-09-27 18:45:25"
  }, {
    "reported_comment" : false,
    "body" : "Hi, still available?",
    "username" : "Matthias7575",
    "timestamp" : "2024-10-05 16:16:05"
  }, {
    "reported_comment" : false,
    "body" : "I think it’s a bug. It was doing the same for me last week.",
    "username" : "Purdue474",
    "timestamp" : "2024-09-30 22:16:39"
  }, {
    "reported_comment" : false,
    "body" : "What time is the slots?",
    "username" : "None",
    "timestamp" : "2024-10-01 09:03:38"
  }, {
    "reported_comment" : false,
    "body" : "Hi are they still available?",
    "username" : "None",
    "timestamp" : "2024-10-02 11:48:57"
  }, {
    "reported_comment" : false,
    "body" : "Not sure how much flexibility you have on time, but I have 2 full experience + attic tickets available on October 24th at 12:10pm for face value. We ended up getting tickets for our preferred date of October 25th so I have no use for the October 24th tickets.",
    "username" : "Purdue474",
    "timestamp" : "2024-10-01 15:18:16"
  }, {
    "reported_comment" : false,
    "body" : "Hi still available? I sent you a DM",
    "username" : "Necessary-Emu-812",
    "timestamp" : "2024-10-14 17:29:22"
  }, {
    "reported_comment" : false,
    "body" : "Hi - what time are your tickets for on 10/10?",
    "username" : "chennyboy2002",
    "timestamp" : "2024-10-05 14:50:12"
  }, {
    "reported_comment" : false,
    "body" : "Yo he comprado dos para el dia 2 de noviembre (en italiano) hoy a las 10:30. Tienes que ir actualizando y lo vas a conseguir",
    "username" : "Beautiful_Spray_2129",
    "timestamp" : "2024-10-03 15:01:43"
  }, {
    "reported_comment" : false,
    "body" : "Did you happen to get those? I am looking for them too",
    "username" : "johnvpaul",
    "timestamp" : "2024-10-06 08:33:40"
  }, {
    "reported_comment" : false,
    "body" : "How much for them? 😊",
    "username" : "Immediate-Aspect-394",
    "timestamp" : "2024-10-06 13:07:02"
  }, {
    "reported_comment" : false,
    "body" : "are these still for sale?",
    "username" : "wofeichanglei",
    "timestamp" : "2024-10-07 08:24:53"
  }, {
    "reported_comment" : false,
    "body" : "Willing to sell them at ~$10 USD discount -> $30 for 2 tickets total incl taxes and fees ",
    "username" : "chennyboy2002",
    "timestamp" : "2024-10-05 15:44:47"
  }, {
    "reported_comment" : false,
    "body" : "If anyone knows how to change the entry time with the ticket office, please let me know...but seems unlikely",
    "username" : "chennyboy2002",
    "timestamp" : "2024-10-05 15:45:25"
  }, {
    "reported_comment" : false,
    "body" : "It seems like they are closed for special access on those days. I just called them and got the info.",
    "username" : "Dipti_1999",
    "timestamp" : "2024-10-06 09:36:24"
  }, {
    "reported_comment" : false,
    "body" : "dm'ed",
    "username" : "ForsakenVolume",
    "timestamp" : "2024-10-10 10:01:44"
  }, {
    "reported_comment" : false,
    "body" : "I learned from reaching out to support that it was canceled on the 24th. I guess this is what a cancelation looks like.",
    "username" : "stephenschneider10",
    "timestamp" : "2024-10-18 21:03:16"
  }, {
    "reported_comment" : false,
    "body" : "https://colosseo.it/en/opening-times-and-tickets/",
    "username" : "RomeVacationTips",
    "timestamp" : "2024-10-31 14:56:35"
  }, {
    "reported_comment" : false,
    "body" : "I have 2 attic tickets for November 17, let me know if you’re interested",
    "username" : "ProfessionalOk5813",
    "timestamp" : "2024-11-05 21:20:51"
  }, {
    "reported_comment" : false,
    "body" : "It's now working",
    "username" : "yosergio64",
    "timestamp" : "2024-11-01 16:49:02"
  }, {
    "reported_comment" : false,
    "body" : "sent you a message!",
    "username" : "nkk8",
    "timestamp" : "2024-11-08 16:01:45"
  }, {
    "reported_comment" : false,
    "body" : "check DM pls",
    "username" : "thejabbarzadeh",
    "timestamp" : "2024-11-11 16:44:58"
  }, {
    "reported_comment" : false,
    "body" : "I have 5 tickets for 24th Nov full experience. If you are interested message me.",
    "username" : "chad_adus24",
    "timestamp" : "2024-11-09 14:06:00"
  }, {
    "reported_comment" : false,
    "body" : "I am looking for Full Experience Attic or Underground tickets for 11/21 or 11/22. Total of two needed. PM me.  Thank you.",
    "username" : "Professional-Oil6950",
    "timestamp" : "2024-11-13 09:33:41"
  }, {
    "reported_comment" : false,
    "body" : "Any idea what time of day they refresh the cancellation tickets?",
    "username" : "DrDizzler",
    "timestamp" : "2024-11-17 20:54:41"
  }, {
    "reported_comment" : false,
    "body" : "Coliseum tickets go on sale either 30 days or 7 days in advance, depending on the type of ticket you want.\n\nWhat kind of ticket are you hoping to purchase?",
    "username" : "PatriciaDC",
    "timestamp" : "2024-11-13 15:42:01"
  }, {
    "reported_comment" : false,
    "body" : "We have 4 Full Experience Attic tickets for Wednesday, Nov 27 at 11:10 am, if interested.",
    "username" : "PatriciaDC",
    "timestamp" : "2024-11-15 00:32:33"
  }, {
    "reported_comment" : false,
    "body" : "Just sold",
    "username" : "PatriciaDC",
    "timestamp" : "2024-11-17 16:54:21"
  }, {
    "reported_comment" : false,
    "body" : "I do not think you can 4 days before.  Coliseum tickets are nominative.  You can change the names on the tickets, but only up to 7 days before.",
    "username" : "PatriciaDC",
    "timestamp" : "2024-11-27 22:12:31"
  }, {
    "reported_comment" : false,
    "body" : "Unfortunately not. Your ticket is good for one entry to the Forum save Colosseum only. You can however leave the Colosseum, go for lunch, and enter the Forum, or vice versa.",
    "username" : "RomeVacationTips",
    "timestamp" : "2024-12-17 12:40:57"
  }, {
    "reported_comment" : false,
    "body" : "I’ve been to the colosseum 3x so this time I’m interested in doing the underground tour. A couple of questions…1) I didn’t know there was an “official” underground tour. I don’t see it on their site and many have told me you can only go with 3rd party tour guides. Where did you purchase the tickets? 2) The 3rd party tours I’ve seen are $160-180 a person so I’m wondering if it’s worth it.  From your experience it sounds like it’s not but I read you saw other groups taking other routes. Did it seem like it was worth it for them ?",
    "username" : "boo_you_whore",
    "timestamp" : "2024-05-30 00:36:15"
  }, {
    "reported_comment" : false,
    "body" : "Yes it does specify language, which are English, Spanish, or Italian. I believe the non- guided underground tour says it’s in Italian but not sure why that matters if it’s not a tour. ",
    "username" : "Specialist-Lab-8388",
    "timestamp" : "2024-08-15 06:05:08"
  }, {
    "reported_comment" : false,
    "body" : "Thank you! Yes- If you want a timeslot at 930, it will be released at exactly 9:30 (Rome time). The first time slot is actually 8:50, followed by 9:10, then 9:30. \n\nThis is specifically for the Attico tickets. I haven’t tried to purchase any others, but I believe tickets for the underground guided tour follow the same process.",
    "username" : "hurricanecris",
    "timestamp" : "2024-07-31 17:39:10"
  }, {
    "reported_comment" : false,
    "body" : "That is incorrect. The ticketing begins for ALL time slots at 8:45 am, so you can select a t10:45 am ticket or an afternoon ticket until they are all gone beginning at 8:45 am Rome time.",
    "username" : "aykarumba123",
    "timestamp" : "2024-05-17 21:16:48"
  }, {
    "reported_comment" : false,
    "body" : "Does this also apply to the guided tour tickets?",
    "username" : "nevrar",
    "timestamp" : "2024-05-21 07:38:03"
  }, {
    "reported_comment" : false,
    "body" : "At what time do they go on sale? I have read that at 8 am local time in Italy.",
    "username" : "Izhkar",
    "timestamp" : "2024-05-17 09:49:34"
  }, {
    "reported_comment" : false,
    "body" : "Thanks! So if I get 2 tix full experience for adults do you think our kids can go for free with us? It’s so unclear since even if you indicate child on the site it shows a charge for their ticket",
    "username" : "Lulu1074",
    "timestamp" : "2024-05-17 18:52:34"
  }, {
    "reported_comment" : false,
    "body" : "How did you create an account? I've been on the website multiple times and I've never seen that? Is it on the main page or the ticketing purchase page?",
    "username" : "Tudbee",
    "timestamp" : "2024-05-23 01:54:28"
  }, {
    "reported_comment" : false,
    "body" : "I found it to be 11:45 PST (usa/west coast time) but I still couldn't get underground tickets. Or 8:45am Rome time.",
    "username" : "Exciting_Buffalo3738",
    "timestamp" : "2024-06-19 14:37:56"
  }, {
    "reported_comment" : false,
    "body" : "would've been perfect but need another for my daughter :(",
    "username" : "mohairhalo",
    "timestamp" : "2024-08-27 06:46:50"
  }, {
    "reported_comment" : false,
    "body" : "Hi! I’m interested if you haven’t given them to anyone yet!",
    "username" : "Kipstewmi",
    "timestamp" : "2024-08-24 17:12:39"
  }, {
    "reported_comment" : false,
    "body" : "I'm having the same problem",
    "username" : "Odd-Internet-7372",
    "timestamp" : "2024-10-31 14:45:27"
  }, {
    "reported_comment" : false,
    "body" : "Can you visit the Forum/Palatine Hill \\*before\\* your Colosseum entry time? I'm hoping to get a late time (6pm), but would love to be able to use it for the Forum earlier in the day. I leave Rome the day after so I wouldn't be able to use it otherwise",
    "username" : "Lost_Animator_5880",
    "timestamp" : "2024-05-25 06:43:23"
  }, {
    "reported_comment" : false,
    "body" : "Aha good deal. Thanks!!! While I have you, the website is informative and helpful! Thanks for all you do in putting that information together. I'm actively going through and replacing our \"tripadvisor\" tours with the ones from your website.",
    "username" : "stimak",
    "timestamp" : "2024-05-18 19:26:29"
  }, {
    "reported_comment" : false,
    "body" : "Do you offer any tours that also have underground access at the colosseum? I heard access has been somewhat restricted...?",
    "username" : "Flermy",
    "timestamp" : "2024-05-18 20:34:10"
  }, {
    "reported_comment" : false,
    "body" : "Thank you!!’ I was thinking this may be the case. I was able to get reasonably priced entry tickets for colosseum and i think my family prefers that and then I’ll look for Vatican again in a couple days",
    "username" : "Minimum-Ad631",
    "timestamp" : "2024-05-22 15:26:52"
  }, {
    "reported_comment" : false,
    "body" : "Sorry for the delayed reply.  The tickets get released 30 days to the hour.  If you want tickets at 2:00 pm then tickets for that time slot will be released at 2:00 pm 30 days prior.",
    "username" : "nattieo99",
    "timestamp" : "2024-06-15 02:05:34"
  }, {
    "reported_comment" : false,
    "body" : "Goodluck! It was a nightmare trying to get the tickets at 3am.",
    "username" : "walnuts758",
    "timestamp" : "2024-05-25 05:13:08"
  }, {
    "reported_comment" : false,
    "body" : "How did it go? Did the guide only do Underground and the rest like Arena and Colosseum you were on your own? Thanks",
    "username" : "backtoexpat",
    "timestamp" : "2024-06-03 16:57:42"
  }, {
    "reported_comment" : false,
    "body" : "Please see my post on our experience",
    "username" : "likejudo",
    "timestamp" : "2024-05-27 07:16:02"
  }, {
    "reported_comment" : false,
    "body" : "FYI they originally posted prices with a markup saying it was because of the time they put into getting them. They’ve since edited the comment",
    "username" : "Lost_Animator_5880",
    "timestamp" : "2024-05-26 15:56:23"
  }, {
    "reported_comment" : false,
    "body" : "Tbh I can’t find anywhere to sell these things despite knowing how in demand they are. I’ll sell them at face value so 24 euros for each of the 2 underground ones and 32 euros (24 plus 8 for the guide) for the guided underground and 8 for the child (0 plus 8 for the guide).  ",
    "username" : "Waianaes",
    "timestamp" : "2024-05-26 16:37:24"
  }, {
    "reported_comment" : false,
    "body" : "Please DM me if you are still interested. I was traveling and didn’t see your reply until now.",
    "username" : "trumpb",
    "timestamp" : "2024-06-07 02:04:38"
  }, {
    "reported_comment" : false,
    "body" : "No sorry I just decided to buy Gen admission:(",
    "username" : "allusernamestakenrip",
    "timestamp" : "2024-06-03 22:24:55"
  }, {
    "reported_comment" : false,
    "body" : "This week I heard a rumor that they had paused it. I had the official website handy but I lost the link unfortunately. Someone said that they release tix 30 days in advance",
    "username" : "boo_you_whore",
    "timestamp" : "2024-06-18 03:29:50"
  }, {
    "reported_comment" : false,
    "body" : "That’s great thank you",
    "username" : "ConsiderationOk4983",
    "timestamp" : "2024-06-02 17:47:18"
  }, {
    "reported_comment" : false,
    "body" : "I purchased 30 days prior on the colosseum website",
    "username" : "hbkrem",
    "timestamp" : "2024-06-19 10:20:09"
  }, {
    "reported_comment" : false,
    "body" : "Thanks, it doesn’t specifically say consecutive on the attic ticket info page.  As long as they are consecutive then no reason why we can’t do Roman forum first day then colosseum second?",
    "username" : "spurious_poster",
    "timestamp" : "2024-06-25 11:28:37"
  }, {
    "reported_comment" : false,
    "body" : "So none of the August dates show available... Did you buy from colosseo.it?",
    "username" : "GodotNeverCame",
    "timestamp" : "2024-07-11 18:30:11"
  }, {
    "reported_comment" : false,
    "body" : "Grazie Mille!\n\nDo you recommend going to Domus Aurea?",
    "username" : "Acceptable_Mud_",
    "timestamp" : "2024-06-27 15:19:40"
  }, {
    "reported_comment" : false,
    "body" : "Why is Full Experience Arena = Pure Admission + Access to Arena the same price as Full Experience Underground and Arena = Pure Admission + Access to Underground and Arena but it doesn't include the underground??",
    "username" : "LetsWorkTogetherAll",
    "timestamp" : "2024-06-27 17:09:25"
  }, {
    "reported_comment" : false,
    "body" : "Thank you so much!",
    "username" : "LuvLeeStasia",
    "timestamp" : "2024-07-01 21:25:11"
  }, {
    "reported_comment" : false,
    "body" : "Unfortunately just available for one, thanks for the heads up :)",
    "username" : "pranavlavanya",
    "timestamp" : "2024-07-12 10:24:13"
  }, {
    "reported_comment" : false,
    "body" : "Wow you got the underground tour ticket? Any special tricks you did or you just entered the site right at 8:30am (local)?",
    "username" : "groggyhouse",
    "timestamp" : "2024-08-13 18:41:25"
  }, {
    "reported_comment" : false,
    "body" : "Exactly what I was looking for!  Thanks for the info.  We're also going to try and get the night tour so we'll see how that goes",
    "username" : "bladeofdeath3",
    "timestamp" : "2024-08-08 17:25:24"
  }, {
    "reported_comment" : false,
    "body" : "Couldnt get one, it never gave me an option to select even date",
    "username" : "Ok-Bag6241",
    "timestamp" : "2024-08-01 09:04:10"
  }, {
    "reported_comment" : false,
    "body" : "That device remained blocked. I saw another post saying you get blocked for an hour if they suspect you are a bot. I ended up getting my tickets on the app on my phone and I believe I was on cell service. Good luck.",
    "username" : "Beach_Gyrl",
    "timestamp" : "2024-08-08 19:41:39"
  }, {
    "reported_comment" : false,
    "body" : "Hey! If they're not interested, we'd love to buy them from you.",
    "username" : "histoiredamourx",
    "timestamp" : "2024-08-04 15:11:32"
  }, {
    "reported_comment" : false,
    "body" : "Hey! If these are available, i'll buy them off you!",
    "username" : "DeexKK",
    "timestamp" : "2024-08-21 17:03:57"
  }, {
    "reported_comment" : false,
    "body" : "Just got lucky, refresh exactly at the time they open and then occasionally refresh every 15s, don't do it too often or you'll be blocked for an hour. Just luck and keeping going honestly.\n\nEdit: I must say, it took me 2 days of setting alarms at the times just before they open, and having it all open on my second screen during work. It took a lot of time to get them haha. Honestly, we would've gone with the italian tour tickets, that's still the full experience but for 16 euro's extra. That is still leagues cheaper than via 3rd party sellers. And then you can either choose to go with the tour or just not and explore yourself with an audio tour or info on your phone.",
    "username" : "Fastjur",
    "timestamp" : "2024-08-06 13:55:13"
  }, {
    "reported_comment" : false,
    "body" : "DMed you!",
    "username" : "Fastjur",
    "timestamp" : "2024-08-22 16:07:36"
  }, {
    "reported_comment" : false,
    "body" : "Thank you so much for your input! That's a great idea, I might just purchase the same tickets you did.  \nEnjoy Rome when you visit!!",
    "username" : "poppyroll",
    "timestamp" : "2024-08-14 14:32:46"
  }, {
    "reported_comment" : false,
    "body" : "Wow lucky! It's for Sep 13 right? So you never saw it say sold out? I was there 8:45 Rome time... I kept refreshing for the next 15 mins and when it still said sold out, I gave up and thought all tickets must be sold out (I'm on a similar timezone as you so had to sleep as well).",
    "username" : "groggyhouse",
    "timestamp" : "2024-08-14 16:38:53"
  }, {
    "reported_comment" : false,
    "body" : "Did you buy separate tickets from the official website for attic and underground? I don't see a way to buy them together",
    "username" : "vanvalec",
    "timestamp" : "2024-08-21 13:27:31"
  }, {
    "reported_comment" : false,
    "body" : "How long did you spend at the attic before making your way to the area for your scheduled underground tour? We would like to spend as much time in the attic as we can before the start of our solo underground entry, but I don’t know when to start heading down to line up for this excursion. Do you need to line up a bit early to go underground if you’re already inside the colosseum?",
    "username" : "livia20",
    "timestamp" : "2024-09-10 18:22:01"
  }, {
    "reported_comment" : false,
    "body" : "I’ve DM’ed you the details",
    "username" : "ChibiThala",
    "timestamp" : "2024-08-21 17:20:10"
  }, {
    "reported_comment" : false,
    "body" : "Unfortunately they’ve both been sold now. Ticket swap do have other tickets available I believe",
    "username" : "ChibiThala",
    "timestamp" : "2024-08-30 09:14:20"
  }, {
    "reported_comment" : false,
    "body" : "Sept 18th is the only time we have unfortunately. But thanks for checking!",
    "username" : "smylethegreat",
    "timestamp" : "2024-08-19 16:08:06"
  }, {
    "reported_comment" : false,
    "body" : "Tickets can be purchased on ticketswap for everyone’s safety: https://www.ticketswap.com/listing/colosseum-attico-tickets/13741021/e8bb3ef8c8",
    "username" : "mperry381",
    "timestamp" : "2024-08-23 22:45:15"
  }, {
    "reported_comment" : false,
    "body" : "Thank you!!",
    "username" : "Illustrious_Mess_368",
    "timestamp" : "2024-08-22 17:09:28"
  }, {
    "reported_comment" : false,
    "body" : "Unfortunately, I leave Rome on the night of the 2nd. Thank you for messaging!",
    "username" : "DeexKK",
    "timestamp" : "2024-08-29 20:40:35"
  }, {
    "reported_comment" : false,
    "body" : "Thank you, can you share the link?\nAlso how would the name change work on tickets? Since it has to be on the person visiting name?",
    "username" : "encryptedme",
    "timestamp" : "2024-08-26 08:00:59"
  }, {
    "reported_comment" : false,
    "body" : "Thanks! Didn't realize it's so specific, was checking for Italy midnight time.",
    "username" : "MalaysianPF",
    "timestamp" : "2024-08-27 06:22:01"
  }, {
    "reported_comment" : false,
    "body" : "Hi there do you have these available? I will be in Rome during this time",
    "username" : "Lucky-Violinist-9213",
    "timestamp" : "2024-09-13 15:35:59"
  }, {
    "reported_comment" : false,
    "body" : "Sent you a message. ",
    "username" : "pavanparikh",
    "timestamp" : "2024-09-15 07:52:54"
  }, {
    "reported_comment" : false,
    "body" : "I'm just learning about how to try for Attic/Arena/Underground/Full Experience tickets for Oct 16.  I can't find an option to buy 2 tickets for all the locations.  I do not want a guided tour, just entrance to all.  Also I'm confused when I should set my alarm to buy tickets for the 720 hours - I\"m in Los Angeles.  Thank you for any help you can provide.  In order to get both the Attic and the Arena, do I have to buy a Full Experience including the Arena and a separate Full Experience including the Attic?",
    "username" : "ambercatttt",
    "timestamp" : "2024-09-03 01:23:18"
  }, {
    "reported_comment" : false,
    "body" : "I do have the tickets available if you are still interested.",
    "username" : "AdAble1507",
    "timestamp" : "2024-09-13 21:07:02"
  }, {
    "reported_comment" : false,
    "body" : "Shizzle",
    "username" : "SoliloquyXChaos",
    "timestamp" : "2024-09-04 12:22:28"
  }, {
    "reported_comment" : false,
    "body" : "Hi! I want it. Sent you a inbox.",
    "username" : "Big-Judge196",
    "timestamp" : "2024-09-05 13:57:41"
  }, {
    "reported_comment" : false,
    "body" : "Thank you!",
    "username" : "ambercatttt",
    "timestamp" : "2024-09-04 18:34:08"
  }, {
    "reported_comment" : false,
    "body" : "Thank you for your help!",
    "username" : "bilf",
    "timestamp" : "2024-09-18 17:46:59"
  }, {
    "reported_comment" : false,
    "body" : "They are regular, basic tickets that are good for 24 hours and I don’t believe are part of a tour nor do they allow for arena floor access. It’s the first option on this page: [https://ticketing.colosseo.it/en/categorie/singoli-1-8-persone/](https://ticketing.colosseo.it/en/categorie/singoli-1-8-persone/)",
    "username" : "discocupcake",
    "timestamp" : "2024-09-22 02:18:02"
  }, {
    "reported_comment" : false,
    "body" : "Hi, thanks for reaching out. Please send me a message as I cannot seem to do so on my end.",
    "username" : "Purdue474",
    "timestamp" : "2024-09-26 19:44:29"
  }, {
    "reported_comment" : false,
    "body" : "Sorry the 24th does not work for me but thank you",
    "username" : "InstrumentGuy",
    "timestamp" : "2024-09-26 20:23:11"
  }, {
    "reported_comment" : false,
    "body" : "I ended up buying an Italian underground tour 😂 but thank you",
    "username" : "InstrumentGuy",
    "timestamp" : "2024-09-27 22:17:40"
  }, {
    "reported_comment" : false,
    "body" : "Not sure if you just purchased one of mine on ticket swap 🤣 just one left! ",
    "username" : "w0lf3h",
    "timestamp" : "2024-10-05 17:42:27"
  }, {
    "reported_comment" : false,
    "body" : "12:30",
    "username" : "rookiereddit",
    "timestamp" : "2024-10-01 09:44:53"
  }, {
    "reported_comment" : false,
    "body" : "Yup, messaged You :)",
    "username" : "cassio_plz",
    "timestamp" : "2024-10-02 11:59:11"
  }, {
    "reported_comment" : false,
    "body" : "ah that would be a bit late for me I prefer early in the morning. On another note I am reselling x2 business class return tickets from Rome to Florence at EUR 80 if you are interested.",
    "username" : "None",
    "timestamp" : "2024-10-01 16:13:47"
  }, {
    "reported_comment" : false,
    "body" : "Hi are these still available?",
    "username" : "Matthias7575",
    "timestamp" : "2024-10-05 16:12:50"
  }, {
    "reported_comment" : false,
    "body" : "Yes, dm me.",
    "username" : "krans4u",
    "timestamp" : "2024-10-15 14:36:15"
  }, {
    "reported_comment" : false,
    "body" : "Hello, the tickets are for a 14h entry",
    "username" : "Sirias7",
    "timestamp" : "2024-10-05 19:15:36"
  }, {
    "reported_comment" : false,
    "body" : "yo trató actualizando y los billetes agotado en segundos :/",
    "username" : "nbalover14",
    "timestamp" : "2024-10-03 15:13:18"
  }, {
    "reported_comment" : false,
    "body" : "Oh man that's unlucky I'm only there those days 😒😭",
    "username" : "Ratchetal16",
    "timestamp" : "2024-10-06 10:40:01"
  }, {
    "reported_comment" : false,
    "body" : "thanks",
    "username" : "Odd-Internet-7372",
    "timestamp" : "2024-10-31 19:22:52"
  }, {
    "reported_comment" : false,
    "body" : "Literally it’s random. Whenever they process cancelled tickets, they will make it available. I guess it would be local working hours LOL",
    "username" : "3EaglesDad",
    "timestamp" : "2024-11-18 02:03:52"
  }, {
    "reported_comment" : false,
    "body" : "Hopefully the full one with arena and the underground area",
    "username" : "Earyx",
    "timestamp" : "2024-11-13 17:34:03"
  }, {
    "reported_comment" : false,
    "body" : "Which site did you look at and were unable to find the underground tour?",
    "username" : "likejudo",
    "timestamp" : "2024-05-30 11:24:28"
  }, {
    "reported_comment" : false,
    "body" : "How did you figure out the time slots? keep seeing different answers about when tickets are released",
    "username" : "maxamillion17",
    "timestamp" : "2024-08-01 09:28:42"
  }, {
    "reported_comment" : false,
    "body" : "So if i want to buy tickets for 9/1, they will be dropping later today right?",
    "username" : "maxamillion17",
    "timestamp" : "2024-08-01 09:42:30"
  }, {
    "reported_comment" : false,
    "body" : "Yep just coming here to agree that all time slots are released at the same 845 time",
    "username" : "a2b2021",
    "timestamp" : "2024-05-17 21:22:24"
  }, {
    "reported_comment" : false,
    "body" : "I dont think this is correct. I just tried at 13h00 Italy time and outside 13h00, all other timeslot gave the message : \"Insufficient availability for the selected time\"",
    "username" : "theflavorlab1",
    "timestamp" : "2024-05-18 13:01:38"
  }, {
    "reported_comment" : false,
    "body" : "8:45 am local time italy",
    "username" : "aykarumba123",
    "timestamp" : "2024-05-21 02:53:12"
  }, {
    "reported_comment" : false,
    "body" : "Yes, I think the post below gives more detail on the kids tickets but if you get 2 adult tickets all the kids under 18 just need an ID and to go to the ticket booth with you on the day of your tickets to get their kids tickets for free. Not sure how long the line gets so I would show up early enough if there is some weight but it does mention on the website kids under 18 are free. ",
    "username" : "Internal_Parsnip_726",
    "timestamp" : "2024-05-17 20:20:43"
  }, {
    "reported_comment" : false,
    "body" : "Just tried to message you! Not sure if it went through",
    "username" : "shitty_vegetarian",
    "timestamp" : "2024-08-24 17:56:22"
  }, {
    "reported_comment" : false,
    "body" : "Thank you very much, it's appreciated.",
    "username" : "RomeVacationTips",
    "timestamp" : "2024-05-20 19:32:20"
  }, {
    "reported_comment" : false,
    "body" : "No problem. Just had my tour today. Apparently... The language doesnt matter. Most of my group chose the English option. That was good.",
    "username" : "JPWRana",
    "timestamp" : "2024-06-24 22:54:18"
  }, {
    "reported_comment" : false,
    "body" : "My 830am starts at midnight 🥲",
    "username" : "JPWRana",
    "timestamp" : "2024-05-25 06:40:56"
  }, {
    "reported_comment" : false,
    "body" : "I go in late June.",
    "username" : "JPWRana",
    "timestamp" : "2024-06-06 00:02:15"
  }, {
    "reported_comment" : false,
    "body" : "Thanks",
    "username" : "JPWRana",
    "timestamp" : "2024-05-26 15:57:50"
  }, {
    "reported_comment" : false,
    "body" : "What language?",
    "username" : "JPWRana",
    "timestamp" : "2024-05-27 19:00:03"
  }, {
    "reported_comment" : false,
    "body" : "Thanks. Seems I will need to do the same",
    "username" : "backtoexpat",
    "timestamp" : "2024-06-03 23:12:42"
  }, {
    "reported_comment" : false,
    "body" : "That is correct. In the same paragraph as the above from the same webpage \"Puoi prenotare l'orario di ingresso al Colosseo e **decidere se visitare il Foro Romano, il Palatino e i Fori Imperiali prima o dopo**.\" which in English means you can decide whether to visit the Roman Forum and Palatine Hill before or after your timed Colosseum entrance.",
    "username" : "Needacurefordementia",
    "timestamp" : "2024-06-25 12:00:19"
  }, {
    "reported_comment" : false,
    "body" : "Yep I did! It's kinda annoying tho they show as sold out / unavailable but you just have to keep refreshing until you get some. I bought four tickets but made three separate purchases cos I could only manage to get 1 or 2 at one time.",
    "username" : "nguyenviviiana",
    "timestamp" : "2024-07-16 06:48:22"
  }, {
    "reported_comment" : false,
    "body" : "Can't help with this as we didn't manage to get the tickets for Domus Aurea.",
    "username" : "Needacurefordementia",
    "timestamp" : "2024-06-27 17:48:14"
  }, {
    "reported_comment" : false,
    "body" : "No idea. That's why we didnt even consider buying it. Which is perhaps why the Full Experience Arena ticket is the easiest Full Experience ticket to buy.",
    "username" : "Needacurefordementia",
    "timestamp" : "2024-06-27 17:50:00"
  }, {
    "reported_comment" : false,
    "body" : "Keep trying throughout the day, they will release more times. 🙂",
    "username" : "Acceptable_Mud_",
    "timestamp" : "2024-07-12 10:56:49"
  }, {
    "reported_comment" : false,
    "body" : "Hi! Yes just kept refreshing right before 9:30 am Rome time and used both my phone and laptop with my account signed in to make purchasing easier. \n\nMy phone first obtained the tickets I required, but was coming up with errors and couldn't purchase, had to wait out the timer and crossed my fingers that I could get them on my laptop, and I luckily was able to. \n\nMy goal was to try all day if I had to. We needed the tickets for the day we went.",
    "username" : "Acceptable_Mud_",
    "timestamp" : "2024-08-13 21:48:13"
  }, {
    "reported_comment" : false,
    "body" : "They're going live right now? The tickets for Sept. 1st go live tomorrow right?",
    "username" : "maxamillion17",
    "timestamp" : "2024-08-01 09:40:55"
  }, {
    "reported_comment" : false,
    "body" : "Yes I got blocked for an hour and then it seemed to work again thankfully! Glad you managed to get your tickets!",
    "username" : "CityxLightsx",
    "timestamp" : "2024-08-10 03:38:41"
  }, {
    "reported_comment" : false,
    "body" : "Yes, 9/13, 9:45 am Rome time. It did say sold out for 8:45, 9:00 and 9:45 slots, but then miraculously 1 ticket for 9:45 came up around 10:00 am Rome time (guess somebody released it from their basket). I grabbed it, had some problems getting through to checkout for about 5 minutes, then was able to checkout. Good luck!",
    "username" : "seacity36",
    "timestamp" : "2024-08-14 16:53:36"
  }, {
    "reported_comment" : false,
    "body" : "You won't be able to buy them together in a single transaction. I waited for the 8:50 am attic slot but didn't get it so I waited for 9:10 am attic slot but still didn't get it. Then while I waited for 9:30 am attic slot, the 8:50 am attic slots suddenly had availability so I quickly put in cart and paid for them as the cart only holds tickets for 15 minutes.\n\nThen at around 10:30 am, I went to the guided tour webpage to wait for the 10:45 am guided underground tour and got it when I refreshed at 10:45 am.",
    "username" : "Needacurefordementia",
    "timestamp" : "2024-08-22 05:17:14"
  }, {
    "reported_comment" : false,
    "body" : "I only need 2 btw does that work?",
    "username" : "nautyvarun",
    "timestamp" : "2024-08-24 03:35:06"
  }, {
    "reported_comment" : false,
    "body" : "No problem!",
    "username" : "Fastjur",
    "timestamp" : "2024-08-30 16:12:47"
  }, {
    "reported_comment" : false,
    "body" : "Once you buy the tickets I can change the names, I can do it outside of ticketswap or maybe we can ask ticketswap to re-issue the tickets once I have been able to change the names. I just think ticketswap is needed in case we are not in the same country and the transfer of funds is therefore more complicated. \nhttps://www.ticketswap.com/listing/colosseum-attico-tickets/13741021/e8bb3ef8c8",
    "username" : "mperry381",
    "timestamp" : "2024-08-26 13:32:54"
  }, {
    "reported_comment" : false,
    "body" : "Hi! The tickets were already purchased by another user.",
    "username" : "pastelmewnicorn",
    "timestamp" : "2024-09-13 23:51:04"
  }, {
    "reported_comment" : false,
    "body" : "Hi!  Nope, no need to purchase both, just the Attic experience, and without the guide you'll find that here [https://ticketing.colosseo.it/en/eventi/full-experience-attico/](https://ticketing.colosseo.it/en/eventi/full-experience-attico/)\n\nRome is 9 hours ahead of Los Angeles - so, you'll need to be logged in by 11:30pm.",
    "username" : "dreschuth",
    "timestamp" : "2024-09-03 19:50:51"
  }, {
    "reported_comment" : false,
    "body" : "Hi I would like to purchase one if that's okay with you.",
    "username" : "Lucky-Violinist-9213",
    "timestamp" : "2024-09-14 00:42:06"
  }, {
    "reported_comment" : false,
    "body" : "Are you interested in selling them? I'm interested in one. I wanted to finalize everything for my plans this week. Please let me know thanks.",
    "username" : "Lucky-Violinist-9213",
    "timestamp" : "2024-09-15 21:30:25"
  }, {
    "reported_comment" : false,
    "body" : "Appreciate the reply and good luck!",
    "username" : "Purdue474",
    "timestamp" : "2024-09-26 21:43:14"
  }, {
    "reported_comment" : false,
    "body" : "Can u come in DM! :)",
    "username" : "Matthias7575",
    "timestamp" : "2024-10-05 17:57:58"
  }, {
    "reported_comment" : false,
    "body" : "ah we would like to buy early morning slots, sorry",
    "username" : "None",
    "timestamp" : "2024-10-01 10:20:12"
  }, {
    "reported_comment" : false,
    "body" : "Message sent",
    "username" : "Purdue474",
    "timestamp" : "2024-10-05 22:30:44"
  }, {
    "reported_comment" : false,
    "body" : "Those tickets go on sale 30 days in advance and usually sell out within seconds/minutes.",
    "username" : "PatriciaDC",
    "timestamp" : "2024-11-13 17:49:29"
  }, {
    "reported_comment" : false,
    "body" : "https://colosseo.it/",
    "username" : "boo_you_whore",
    "timestamp" : "2024-06-06 02:47:45"
  }, {
    "reported_comment" : false,
    "body" : "9/1 is free Sunday. No tickets sold. Must wait in line same day for entry.",
    "username" : "Beach_Gyrl",
    "timestamp" : "2024-08-01 18:38:18"
  }, {
    "reported_comment" : false,
    "body" : "I am sorry I don't think you know what you are doing or understand the ticketing process. That is why you keep failing to obtain tickets.  Perhaps you need to go to the official website and read the instructions a few times. Good luck!",
    "username" : "aykarumba123",
    "timestamp" : "2024-05-18 18:41:36"
  }, {
    "reported_comment" : false,
    "body" : "Italian",
    "username" : "Waianaes",
    "timestamp" : "2024-05-27 20:44:58"
  }, {
    "reported_comment" : false,
    "body" : "Everytime I do a trial run on purchasing tickets I get an error code of quantity. No matter how many, what day, what time slot. Do you know what I need to do?",
    "username" : "Winter-Welcome7681",
    "timestamp" : "2024-07-16 19:38:16"
  }, {
    "reported_comment" : false,
    "body" : "Ok, thank you so much! It's very appreciated!",
    "username" : "Acceptable_Mud_",
    "timestamp" : "2024-06-27 19:35:58"
  }, {
    "reported_comment" : false,
    "body" : "I'm trying to buy a ticket for either July 8th or July 20th. Do you know any way to get the attic or underground tickets?",
    "username" : "LetsWorkTogetherAll",
    "timestamp" : "2024-06-27 17:52:00"
  }, {
    "reported_comment" : false,
    "body" : "Ahh nice. \n\n>had to wait out the timer\n\nWhat timer is that?",
    "username" : "groggyhouse",
    "timestamp" : "2024-08-13 21:54:48"
  }, {
    "reported_comment" : false,
    "body" : "Ahh so I guess I need to keep trying for several hours even if it says sold out. I need 2 tix so would be more difficult.\n\nThanks!",
    "username" : "groggyhouse",
    "timestamp" : "2024-08-14 17:18:00"
  }, {
    "reported_comment" : false,
    "body" : "Ah perfect thanks so much. In case I can't get both, did you have a preference between the 2 at all?",
    "username" : "vanvalec",
    "timestamp" : "2024-08-22 05:58:23"
  }, {
    "reported_comment" : false,
    "body" : "Did you have to leave and come back for the underground tour or could you stay inside the colloseum",
    "username" : "greensmoothieee",
    "timestamp" : "2024-10-12 07:38:16"
  }, {
    "reported_comment" : false,
    "body" : "You can select only 2 I think, on the website.",
    "username" : "mperry381",
    "timestamp" : "2024-08-24 03:54:30"
  }, {
    "reported_comment" : false,
    "body" : "Thank you!  This is the link I had but I wasn't sure b/c it says \"guided tour\".  So if I only purchase the Attic Experience, I get the Underground and the Arena?",
    "username" : "ambercatttt",
    "timestamp" : "2024-09-04 00:35:07"
  }, {
    "reported_comment" : false,
    "body" : "Thank you!  This is the link I had but I wasn't sure b/c it says \"guided tour\".  So if I only purchase the Attic Experience, I get the Underground and the Arena?",
    "username" : "ambercatttt",
    "timestamp" : "2024-09-04 00:35:21"
  }, {
    "reported_comment" : false,
    "body" : "Yes I cam sell you the ticket. I need your information could you email me your name so I can change the ticket. Do you have zelle or venmo?",
    "username" : "AdAble1507",
    "timestamp" : "2024-09-15 22:37:28"
  }, {
    "reported_comment" : false,
    "body" : "Don't have access to Reddit chat on my phone. Shoot me a PM! ",
    "username" : "w0lf3h",
    "timestamp" : "2024-10-05 19:13:17"
  }, {
    "reported_comment" : false,
    "body" : "No worries",
    "username" : "rookiereddit",
    "timestamp" : "2024-10-01 10:20:31"
  }, {
    "reported_comment" : false,
    "body" : "Damn..im screwed. Might have to do Vatican and colosseum on the same day then",
    "username" : "maxamillion17",
    "timestamp" : "2024-08-01 19:06:23"
  }, {
    "reported_comment" : false,
    "body" : "I just had my Underground tour today. You get grouped in either English or Italian. I was in the English group ....along with the majority of my group.",
    "username" : "JPWRana",
    "timestamp" : "2024-06-24 22:56:38"
  }, {
    "reported_comment" : false,
    "body" : "You know when certain site have x amount of time in your cart before it's removed? That's what I meant.\n\nSorry it's been a very long exhausting day at the Vatican museum.",
    "username" : "Acceptable_Mud_",
    "timestamp" : "2024-08-13 21:59:36"
  }, {
    "reported_comment" : false,
    "body" : "You are welcome. My next option was to buy the Underground and arena tour in Italian or Spanish, these seem to be slightly easier to get than the tour in English or the entry ticket. And then to download an audio guide and just walk with that tour group listening to my audio guide. Tix with the attic visit are also slightly easier to get, but they do not include arena and underground.",
    "username" : "seacity36",
    "timestamp" : "2024-08-14 17:35:51"
  }, {
    "reported_comment" : false,
    "body" : "I like both. But if you are only going to visit one, I would choose the attic because it is so easy to take good photos without anyone standing next to you. Plus the staff didn't enforce any time limit on us.\n\nI would probably try to buy the underground tickets again for my next trip as we only had 45 minutes in one visit.",
    "username" : "Needacurefordementia",
    "timestamp" : "2024-08-22 09:48:00"
  }, {
    "reported_comment" : false,
    "body" : "I don't understand your question but I will repeat my answers above with time for clarity.\n\nI did the 8:50 am Attic first and took my time at the Attic then at 10 am+ took the same lift down to the common passageway (don't know what is the correct name but I am referring to the common area after the security checks with ticket office, toilets, lifts, various queue poles for different ticket holders etc, all of which are inside the colosseum) to get to the waiting area at around 1015 am for my 1045 am underground guided tour.",
    "username" : "Needacurefordementia",
    "timestamp" : "2024-10-14 06:41:40"
  }, {
    "reported_comment" : false,
    "body" : "Hi there!  Sorry about the delay.  The Attic Experience does not include Underground but from what I've read DOES give access to the Arena but I read you need to go to Gate 12 when you arrive to get a sep sticker.  That was a few months ago, not sure if the process changed when they moved away from COOP Culture to Colosseo.it.  The Attic option (unguided) is found on the Individuals tab here [https://ticketing.colosseo.it/en/categorie/singoli-1-8-persone/rom](https://ticketing.colosseo.it/en/categorie/singoli-1-8-persone/rom) .\n\n  \nThe Underground option (unguided) is found here [https://ticketing.colosseo.it/en/eventi/full-experience-sotterranei-e-arena/](https://ticketing.colosseo.it/en/eventi/full-experience-sotterranei-e-arena/)\n\nThe Underground **Guided** option is here [https://ticketing.colosseo.it/en/eventi/full-experience-sotterranei-e-arena-visita-guidata/](https://ticketing.colosseo.it/en/eventi/full-experience-sotterranei-e-arena-visita-guidata/) , it's part of the Guided options tab [https://ticketing.colosseo.it/en/categorie/visite-guidate/](https://ticketing.colosseo.it/en/categorie/visite-guidate/) I don't see a *Guided* option for the Attico experience.  It's crazy confusing.",
    "username" : "dreschuth",
    "timestamp" : "2024-09-05 19:58:22"
  }, {
    "reported_comment" : false,
    "body" : "I'll dm you",
    "username" : "Lucky-Violinist-9213",
    "timestamp" : "2024-09-15 22:38:06"
  }, {
    "reported_comment" : false,
    "body" : "Ahh got it, so you needed the tickets on your cart to be released so you can buy them from the laptop.\n\nOoh so you're still in Rome?? Have fun! Hope you're having a great time!",
    "username" : "groggyhouse",
    "timestamp" : "2024-08-13 22:06:01"
  }, {
    "reported_comment" : false,
    "body" : "I checked everything - underground, attic, guided tours and all showed \"sold out\"...I wonder if I'm doing something wrong.😑\n\nOh also...does that mean the release of tickets are staggered? Meaning they release the tickets every 15 mins corresponding to the timed entry? Because I was thinking at 8:45 that they released all tickets for that day.\n\nEdit: just checked and there are a few tickets left for attic, though only 1 per timeslot.",
    "username" : "groggyhouse",
    "timestamp" : "2024-08-14 17:46:53"
  }, {
    "reported_comment" : false,
    "body" : "You've been super helpful thank you so much!",
    "username" : "vanvalec",
    "timestamp" : "2024-08-22 10:06:53"
  }, {
    "reported_comment" : false,
    "body" : "Thank you so much!  All of this is new and helpful info!  I don’t know if I could pull off 2 tickets timed closely together enough. I wonder if the Underground would be cooler to see rather than the attic which seems to be a higher view. Do you know what the timed entrance intervals are?  I’ve been reading that you can’t refresh your screen too fast/much or you’ll be locked out and that tickets don’t appear until the next timeslot anyway but I don’t know what that interval is.",
    "username" : "ambercatttt",
    "timestamp" : "2024-09-05 22:13:49"
  }, {
    "reported_comment" : false,
    "body" : "Exactly.\n\nYes, for a few more days, it's incredibly hot at the moment but enjoying every moment.",
    "username" : "Acceptable_Mud_",
    "timestamp" : "2024-08-13 22:27:27"
  }, {
    "reported_comment" : false,
    "body" : "Yes, the are staggered. Underground tix drop at 8:45, 9:00,9:45,10:30,11:00,11:30,1:00pm,1:15, 2:30,3:45,4:00,4:45,5:15. English language underground tour at 9:30,10:45,11:45,12:15,1:30pm,3:00 and 4:30pm. Attic tix at 8:50, then every 20 minutes, last tix for the day at 5:10pm. All times are Rome. Hope this helps!",
    "username" : "seacity36",
    "timestamp" : "2024-08-14 17:54:02"
  }, {
    "reported_comment" : false,
    "body" : "I've seen one post (can't find it!!) that lists the time slots for each experience - the slots aren't all at the same time and I'm sorry to say I can't remember their interval.  If I can find it - OR someone else could link it for us ;) - I'll put it in this thread , that list would be very helpful!!  Yes, you'll get locked out, for an hour it seemed?? - if you refresh too frequently.  I got locked out once on both days of trying tickets.  Were I to do it over again I'd have a device open for each experience I was trying to get.  One on wifi and one using Data if you're data's fast.  I was able to get two tickets but it was a real PITA.",
    "username" : "dreschuth",
    "timestamp" : "2024-09-06 14:07:59"
  }, {
    "reported_comment" : false,
    "body" : "I see...I have to stay up all night then and just hope to snag 2 tix at some point haha. Thanks for the help!!",
    "username" : "groggyhouse",
    "timestamp" : "2024-08-14 17:57:44"
  }, {
    "reported_comment" : false,
    "body" : "Thank you!!!!",
    "username" : "ambercatttt",
    "timestamp" : "2024-09-06 16:03:15"
  }, {
    "reported_comment" : false,
    "body" : "You are welcome!",
    "username" : "seacity36",
    "timestamp" : "2024-08-14 18:06:30"
  } ]
}