{
  "id" : 200166,
  "community" : "Travel",
  "username" : "Former-Bison1865",
  "post" : "Roadtrip Norway",
  "timestamp" : "2024-12-23T12:09:39Z",
  "nomment" : 5,
  "reportedpost" : false,
  "comment" : [ {
    "reported_comment" : false,
    "body" : "**Notice:** Are you asking for travel advice about Norway?\n\nRead what redditors had to say in the **[weekly destination thread for Norway](http://redd.it/3ebvsa)**  \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/travel) if you have any questions or concerns.*",
    "username" : "AutoModerator",
    "timestamp" : "2024-12-23T12:09:39Z"
  }, {
    "reported_comment" : false,
    "body" : "Why would a van and tent not work?",
    "username" : "leonme21",
    "timestamp" : "2024-12-23T12:17:42Z"
  }, {
    "reported_comment" : false,
    "body" : "June and early september it should be fine, as long as you have good sleeping bags, and some wool to put on if it should get cold at night. Weather could be wet, but temperatures should be alright. Late september is more risky.  I would recommend late june or early september, but early june and late september is also good, but more of a risk temperature wise. \n\nYou can tent in the wild, and also rent cheap tent plots in campgrounds. \n\nSo it is absolutely doable! We have the right to roam, so you can camp almost everywhere in the wild (Woods, Mountains, most beaches) note that fields for crops, or grass fields close to farms is not for camping\n\nEnjoy your trip!",
    "username" : "Outrageous_Shoe4620",
    "timestamp" : "2024-12-23T12:25:26Z"
  }, {
    "reported_comment" : false,
    "body" : "I guess i'm asking for a comparison in \"luxury\". For example in the camper van we had heating on fuel. We won't have that in the normal van. Same with fridge, shower and toilet. I know that a tent is totally possible but I assume there are a lot of \"downsides\". I would like to know which ones. We are not experienced campers.",
    "username" : "Former-Bison1865",
    "timestamp" : "2024-12-23T12:27:22Z"
  }, {
    "reported_comment" : false,
    "body" : "I never needed a heated area. Norway during June and September won't be cold. It is a different story when going later and crossing into the north of Sweden or Finland. When it would be really unmanageable: we always succeeded finding a hotel or apartment or hut on [booking.com](http://booking.com) (check the option \"pet friendly\", making the reservations until 21:00 for the same night. That seems easy, but is sometimes challenging when you are up north, where there are not a lot of towns. We had three hunting dogs by the way.\n\nRegarding renting: I always found a RV way too expensive, so I never did. Just my own car and a tent. But: my car has the wheel on the left side, not sure if the roads with a lot of curves are unmanageable with the wheel on the \"wrong\" side of the car.\n\nGetting children: it doesn't always work that way, I hope the two of you are lucky to have two healthy kids in the future.",
    "username" : "Regular-Highlight246",
    "timestamp" : "2024-12-23T13:32:38Z"
  } ]
}