{
  "Community_name" : "Fcintermilan",
  "Username" : "SalGentile6",
  "Post_body" : "[via @tuttosport] 🚨 Inter is 'very' interested in Nico Paz. Tactically, the club believes the 20-year-old could be shaped into Inzaghi's 'new Luis Alberto'. A mezzala with a knack for goals and assists, continuing the legacy of Henrikh Mkhitaryan. 🇦🇷",
  "Timestamp" : "2024-12-23 03:46:26",
  "Num_comment" : 11,
  "reported" : false,
  "Commenti" : [ {
    "Username" : "FCInterMilan",
    "reported" : false,
    "Timestamp" : "2024-12-23 08:09:52",
    "Body" : "🤖 *This post contains transfer market news. Make sure to check out our wiki article Transfer News Reliability Tier List [HERE](https://www.reddit.com/r/FCInterMilan/wiki/transfer-news-reliability-guide).*\n\n---\n\n^(I am a bot. If you would like to know more about me, you can visit our wiki article Inter Bot Commands) ^[HERE](https://www.reddit.com/r/FCInterMilan/wiki/bot-commands). ^(If you think there was a mistake, please contact us using Mod Mail. Thank you!)"
  }, {
    "Username" : "SalGentile6",
    "reported" : false,
    "Timestamp" : "2024-12-23 03:46:26",
    "Body" : "Yes ts is a 💩source full of rube 🤡 but this is also come from Daniele Mari:\n\n🚨 Inter’s market strategy is set to change drastically. Less signings older than 30- no more Dzeko’s, or Mkhitaryan’s, or Acerbi’s. More young profiles like Nico Paz or Santi Castro. Players who may cost a bit, but may be worth double in the future. ⚫️🔵"
  }, {
    "Username" : "vik1980",
    "reported" : false,
    "Timestamp" : "2024-12-23 06:40:58",
    "Body" : "- Inzy answered a question about Paz in the press con. That itself is confirmation that we're serious. He said he's been told his *personality & character* is quite good. That means the *technical* consideration & evaluation has already been approved.\n\n- His big quality is dribbling, which Inzy has (in the past) said our squad currently lacks. \n\n- His father is quite friendly with JZ4 (a subtle shot/ confirmation vis-a-vis Samar).\n\n- A report said Real are unlikely to buy him back cause they're already filled in that dept. Another said they've *already* exercised it to take him back next summer. Yet another said we'll use a Brahim-Milan style deal (long term option to buy back etc.).\n\n- Marotta said (and I paraphrase) \"we'll not make any deals in Jan. unless it's for a young talent we like, and the economic conditions are on our terms.  \n\nAll-in-all, we seem really serious, but it's probably for the summer."
  }, {
    "Username" : "yesimforeign",
    "reported" : false,
    "Timestamp" : "2024-12-23 09:25:24",
    "Body" : "Really want him now, but don't mind waiting until the summer. I fear his value will only keep going up the more he plays, though."
  }, {
    "Username" : "gnineb",
    "reported" : false,
    "Timestamp" : "2024-12-23 08:23:48",
    "Body" : "Looks a good prospect"
  }, {
    "Username" : "Capable-Dragonfly-96",
    "reported" : false,
    "Timestamp" : "2024-12-23 10:58:59",
    "Body" : "What if they’re playing mind games? They may be not interested in Nico Paz but want to gather attention of other clubs around him in order to generate a sort of competition among the top 5 that will distract Directors of other clubs, while our focus is on someone else"
  }, {
    "Username" : "Progresschmogress",
    "reported" : false,
    "Timestamp" : "2024-12-23 10:07:19",
    "Body" : "Madrid have a long history of triggering buyback clauses on their former academy players and selling them right away for profit"
  }, {
    "Username" : "Real-Aide7146",
    "reported" : false,
    "Timestamp" : "2024-12-23 09:52:52",
    "Body" : "Probably no point getting him now since it would be a bit more expensive signing mid season and Piotr is already getting no minutes as is so adding another player in that posiion wouldn't be useful."
  }, {
    "Username" : "Kyari888th",
    "reported" : false,
    "Timestamp" : "2024-12-23 11:14:34",
    "Body" : "Did we do this in the past?"
  }, {
    "Username" : "pazzopazzini77",
    "reported" : false,
    "Timestamp" : "2024-12-23 12:05:47",
    "Body" : "Beppe Marotta might look like him, but he’s not Varys in real life also I’m sure he’s a eunuch"
  }, {
    "Username" : "akutyafajatneki",
    "reported" : false,
    "Timestamp" : "2024-12-23 15:01:18",
    "Body" : "Hakimi for example."
  } ]
}