{
  "Community_name" : "Birmingham",
  "Username" : "savoryreflex",
  "Post_body" : "[OC] US states and clean electricity: Who's pulling their weight?",
  "Timestamp" : "2024-12-23 02:38:06",
  "Num_comment" : 44,
  "reported" : false,
  "Commenti" : [ {
    "Username" : "Elegant_Category_684",
    "reported" : false,
    "Timestamp" : "2024-12-23 03:08:06",
    "Body" : "Alabama’s always around fifth in the nation for hydroelectric production!  Alabama Power has significant resources on the Coosa, Tallapoosa, and Warrior Rivers, and TVA on the Tennessee."
  }, {
    "Username" : "JeffeyRider",
    "reported" : false,
    "Timestamp" : "2024-12-23 02:38:06",
    "Body" : "Must be all the hydroelectric.  Thank you, TVA!"
  }, {
    "Username" : "Nezerin",
    "reported" : false,
    "Timestamp" : "2024-12-23 06:27:37",
    "Body" : "I'm doubting this graphic. [Alabama Power only lists their clean energy supply at 35%](https://www.alabamapower.com/content/dam/alabama-power/pdfs-docs/company/fact-card.pdf) and it's true that TVA does supply power to the northern portion of the state, and there are electric cooperatives that supply other areas, but Alabama Power is the largest across the state so the math isn't mathing for me for AL to be 62%."
  }, {
    "Username" : "savoryreflex",
    "reported" : false,
    "Timestamp" : "2024-12-23 09:35:43",
    "Body" : "They bury me"
  }, {
    "Username" : "nine_of_swords",
    "reported" : false,
    "Timestamp" : "2024-12-23 07:41:50",
    "Body" : "Alabama's the Pennsylvania of the South when it comes to electricity. It's generally an exporter selling to the likes of Georgia and Florida. That means the all the excess sold off is pretty much coal/gas. Since Southern Power out of Atlanta owns Alabama Power, that dynamics going to stay a while (cheap electricity is a big part of Georgia's business attractiveness)."
  }, {
    "Username" : "Upset_Dragonfly8303",
    "reported" : false,
    "Timestamp" : "2024-12-23 06:04:35",
    "Body" : "I feel like hydro shouldn’t be considered clean due to the damage it can cause to river systems but I may be one of the few people that believe that."
  }, {
    "Username" : "savoryreflex",
    "reported" : false,
    "Timestamp" : "2024-12-23 08:34:46",
    "Body" : "Mods are a fucking disgrace. Quit painting your picture. Chronological is only fair."
  }, {
    "Username" : "SonUnforseenByFrodo",
    "reported" : false,
    "Timestamp" : "2024-12-23 03:23:47",
    "Body" : "Also nuclear reactors which is as clean as it gets"
  }, {
    "Username" : "savoryreflex",
    "reported" : false,
    "Timestamp" : "2024-12-23 03:12:27",
    "Body" : "You saved me some time tonight. Thanks!"
  }, {
    "Username" : "drunkenmagnum24",
    "reported" : false,
    "Timestamp" : "2024-12-23 13:47:18",
    "Body" : "We also have the dirtiest plant in the entire nation, Plant Miller."
  }, {
    "Username" : "savoryreflex",
    "reported" : false,
    "Timestamp" : "2024-12-23 02:40:19",
    "Body" : "I need to look into it. We also have nuclear. But it surprised me that we are a leader in this category."
  }, {
    "Username" : "KreiiKreii",
    "reported" : false,
    "Timestamp" : "2024-12-23 13:45:06",
    "Body" : "I know it’s fun to hate on them but Alabama Power also has a ton of hydroelectric."
  }, {
    "Username" : "savoryreflex",
    "reported" : false,
    "Timestamp" : "2024-12-23 06:31:40",
    "Body" : "Deep dive it and let me know."
  }, {
    "Username" : "aphromagic",
    "reported" : false,
    "Timestamp" : "2024-12-23 06:53:15",
    "Body" : "As an Alabamian, APCO can eat my whole ass. Any power they generate off of hydro is absolutely offset by the most polluting coal fire plant (for like the past 30 years) just northwest of Birmingham. \n\nAlso our hydro power fucks our biodiversity in the worst kind of ways."
  }, {
    "Username" : "savoryreflex",
    "reported" : false,
    "Timestamp" : "2024-12-23 07:44:34",
    "Body" : "Sources. If true, it seems like an easy node to adress, should it be illegal or nefarious."
  }, {
    "Username" : "DingerSinger2016",
    "reported" : false,
    "Timestamp" : "2024-12-23 07:27:43",
    "Body" : "Hydro is considered clean bc it doesn't effect us *immediately.*"
  }, {
    "Username" : "savoryreflex",
    "reported" : false,
    "Timestamp" : "2024-12-23 06:29:23",
    "Body" : "I don't disagree.  It is low carbon but it's effects are felt elsewhere. We got sun and we got waves and we got wind. We gotta do something. The clock is ticking"
  }, {
    "Username" : "NotFlameRetardant",
    "reported" : false,
    "Timestamp" : "2024-12-23 09:08:32",
    "Body" : "What do you mean by this? Posts are sorted by \"hot\" (determined by reddit's algorithm) by default, unless you personally switch how your feed is sorted. As far as comment threads go, there isn't a default for this subreddit specifically, which falls back to \"best\" (also determined by reddit's algorithm).\n\nIf you want to change the sort order to chronological for posts & comments in specific subreddits, you have to change your personal settings under Profile -> Feed Settings -> Community Content Sort (check \"new\" if you want that behavior to affect all subreddits, otherwise go to the next step) -> Check \"Remember per community\", which means it'll remain globally the same except for specific subreddit overrides, where it'll retain your setting as \"new\" for those specific subreddits once you change one comment thread to that setting."
  }, {
    "Username" : "Elegant_Category_684",
    "reported" : false,
    "Timestamp" : "2024-12-23 03:38:08",
    "Body" : "For sure, solid baseload from nuclear plays a big role in driving these percentages up in Alabama"
  }, {
    "Username" : "aphromagic",
    "reported" : false,
    "Timestamp" : "2024-12-23 06:49:42",
    "Body" : "I’m proud being clean due to hydro, but it really fucks with native fish populations (I’m an angler).\n\nAlso we only have 2 nuclear plants, so not anything crazy."
  }, {
    "Username" : "Jaded-Run-3084",
    "reported" : false,
    "Timestamp" : "2024-12-23 03:45:34",
    "Body" : "If you don’t count the risk of long term contamination due to the half-life if fissionable materials. Then “clean” might mean something different."
  }, {
    "Username" : "JeffeyRider",
    "reported" : false,
    "Timestamp" : "2024-12-23 02:58:12",
    "Body" : "I tend to forget about the nuclear.  I’ve seen some fields id solar panels as well, but I’m not sure how much they contribute in the state level.  I’m glad to see we’re better than 50%."
  }, {
    "Username" : "NotFlameRetardant",
    "reported" : false,
    "Timestamp" : "2024-12-23 08:13:38",
    "Body" : "Hard agree on all of that. Also, coal isn't just polluting in a typical emissions sense - it's also the worst energy source from a radiation perspective, The byproducts released from coal burning plants accounts for more environmental radiation than all nuclear disasters combined given coal is naturally radioactive.\n\nFukushima was less than 15 years ago so the long-long term cancer rate data is still yet TBD, but for deaths in that timeframe - 1 person died from cancer 4 years later (51 deaths occurred as a result of the evacuation of 164,000 surrounding the plant), and 6 were suspected to have gotten cancer/leukemia as a result of their exposure. The WHO found In 2013, that \"residents of the area who were evacuated were exposed to so little radiation that radiation induced health impacts are likely to be below detectable levels\".\n\nCompare that to rural Kentucky, where residents who are close to coal mines or plants having cancer rates about 50% higher than rural Kentucky residents who are not near coal mines/plants.\n\nCoal production is extremely fucking dirty."
  }, {
    "Username" : "savoryreflex",
    "reported" : false,
    "Timestamp" : "2024-12-23 07:22:52",
    "Body" : "Do tell"
  }, {
    "Username" : "savoryreflex",
    "reported" : false,
    "Timestamp" : "2024-12-23 07:25:58",
    "Body" : "Do you have solutions?. I think we all want fish, water, and  nature for our children and us. We also need electricity.  We also need livelihoods.  Have you an answer?"
  }, {
    "Username" : "nine_of_swords",
    "reported" : false,
    "Timestamp" : "2024-12-23 08:38:21",
    "Body" : "In terms of being a net exporter: [here](https://archive.ph/Rnwg7).\n\nFor Georgia's industrial electricity rate being one of the important factors for attracting business: [here](https://www.areadevelopment.com/Top-States-for-Doing-Business/q3-2024/top-states-for-doing-business-in-2024-a-continued-legacy-of-excellence.shtml) (Energy Availability & Costs section)\n\n[How Southern Company interacts with Alabama Power](https://littlesis.org/news/alabama-power-and-the-corporate-utility-power-structure/). I don't think there's necessarily a directive demanding Alabama Power to sell to Georgia, but it helps out the bottom line to both subsidiaries. Looking at the top level workings of Southern Company just tends to give a lot of corruption vibes, though."
  }, {
    "Username" : "savoryreflex",
    "reported" : false,
    "Timestamp" : "2024-12-23 07:36:25",
    "Body" : "For every action, there is an equal and opposite reaction"
  }, {
    "Username" : "savoryreflex",
    "reported" : false,
    "Timestamp" : "2024-12-23 09:10:03",
    "Body" : "Well that is a simple way to deliver how comments arrive in time"
  }, {
    "Username" : "savoryreflex",
    "reported" : false,
    "Timestamp" : "2024-12-23 07:12:33",
    "Body" : "Angler man, please do tell of your experiences.  I want to get into fishing trout and hear we have a beautiful trout stocked river thanks to, gulp, Tennessee, which is not far."
  }, {
    "Username" : "savoryreflex",
    "reported" : false,
    "Timestamp" : "2024-12-23 04:18:47",
    "Body" : "I share your concerns.  There are also national security implications at play. However, the exhaust is clean steam. The storage can be problematic. We also must curb fossil fuel idiocy, because it will kill us sooner."
  }, {
    "Username" : "savoryreflex",
    "reported" : false,
    "Timestamp" : "2024-12-23 09:41:17",
    "Body" : "We posted this first yet ..."
  }, {
    "Username" : "savoryreflex",
    "reported" : false,
    "Timestamp" : "2024-12-23 08:20:21",
    "Body" : "Couldn't agree more. Pathway forward is the task at hand."
  }, {
    "Username" : "savoryreflex",
    "reported" : false,
    "Timestamp" : "2024-12-23 08:41:16",
    "Body" : "Dig in. You might have a story. Thanks"
  }, {
    "Username" : "savoryreflex",
    "reported" : false,
    "Timestamp" : "2024-12-23 08:44:31",
    "Body" : "So we export our filth?"
  }, {
    "Username" : "NotFlameRetardant",
    "reported" : false,
    "Timestamp" : "2024-12-23 09:26:38",
    "Body" : "That works well for more linear chat systems like forums or discord, but for something that's highly threaded\\* like reddit, something like hot or best suits the structure better.\n\n\\* As a fun sidenote, I've been on reddit since the late 2000-aughts and have seen a lot of weird phases. In (my opinion) the golden era of reddit during the Great Digg Migration, there were subreddits where we just kept making child comments to count out the maximum depth of comment trees and we reached tens of thousands comments deep (not total comments in a thread, but 10k+ children to a 10kn-great-grandparent) before it started causing sitewide issues and the admins had to step in and stop that lmaoooo"
  }, {
    "Username" : "GeneralBS",
    "reported" : false,
    "Timestamp" : "2024-12-23 09:59:01",
    "Body" : "I wouldn't eat anything that comes out of that river. I basically live on it."
  }, {
    "Username" : "Elegant_Category_684",
    "reported" : false,
    "Timestamp" : "2024-12-23 14:26:31",
    "Body" : "FYI - trout also stocked on the Sipsey Fork of the Black Warrior River below Smith Dam.  Some of the cleanest water in the state right there"
  }, {
    "Username" : "Jaded-Run-3084",
    "reported" : false,
    "Timestamp" : "2024-12-23 04:23:59",
    "Body" : "Perhaps solar policies that are not punitive and tilted toward power companies’ interests would be a start. I don’t expect it as the power companies have the state and regulators in their back pocket."
  }, {
    "Username" : "NotFlameRetardant",
    "reported" : false,
    "Timestamp" : "2024-12-23 09:12:02",
    "Body" : "I will say the one drawback of nuclear is that it takes a handful of years to get a plant constructed, taking up to a decade on the slowest end. There is a pro - I suppose - in that slow progression, in that it's a result of tons of regulation and safety measures, especially with post-Fukushima designs being taken into account."
  }, {
    "Username" : "savoryreflex",
    "reported" : false,
    "Timestamp" : "2024-12-23 09:35:03",
    "Body" : "Oxygen suckers, redirecters, fakers"
  }, {
    "Username" : "savoryreflex",
    "reported" : false,
    "Timestamp" : "2024-12-23 10:06:33",
    "Body" : "And you are?"
  }, {
    "Username" : "aphromagic",
    "reported" : false,
    "Timestamp" : "2024-12-23 15:01:07",
    "Body" : "Also stocked at Black Creek in Gadsden."
  }, {
    "Username" : "savoryreflex",
    "reported" : false,
    "Timestamp" : "2024-12-23 04:26:13",
    "Body" : "A ton of sun in our state"
  }, {
    "Username" : "savoryreflex",
    "reported" : false,
    "Timestamp" : "2024-12-23 09:16:39",
    "Body" : "And the concrete. Sheesh it is so hard to find solutions. I think if we employ many strategies we are better off for the future."
  } ]
}