{
  "Community_name" : "London",
  "Username" : "Lazergun_Nun",
  "Post_body" : "‘It’s an absolute crisis’ Someone falls into homelessness in London every seven and a half minutes",
  "Timestamp" : "2024-12-23 12:40:45",
  "Num_comment" : 26,
  "reported" : false,
  "Commenti" : [ {
    "Username" : "SlashRModFail",
    "reported" : false,
    "Timestamp" : "2024-12-23 12:40:45",
    "Body" : "This country is getting fucked by billionaires who are doubling/tripling their net worth.\n\nWhilst the country can barely afford to provide the basics.\n\nHealthcare\nEducation \nSecurity\nSocial nets \nAnd basic human dignity\n\nThe UK is getting sold to the highest bidder - Arab oil magnates, Chinese politicians, Russian oligarchs, and Elon musk giving the far right dick Farage hundreds of millions for campaign.\n\nAnd the people in this country are too dumb to realize the UK is not theirs anymore."
  }, {
    "Username" : "Angry_Wizzard",
    "reported" : false,
    "Timestamp" : "2024-12-23 13:01:50",
    "Body" : "I totally understand why a bacon butty / glass of wine  costs more in London.... what makes me angry is the unemployed allowance isn't weighted.  Economics students are familiar with buying power of  currency it is why you outdouce your service desk to a department in India. \n\nBut the government the ruling body of the British people our voice in the noise of world affairs still think that £340 ish. Will go as far in the most expensive city as it will in a tiny village in wales. \n\nI know everyone in England hates London but normal decent human beings are being thrown into the street because land Lords can do what they want. And the local councils sold off all the cheap housing I  the 80s and 90\n\nWe have no safety net in London and no one to stop land Lords jacking  up prices till people are ruined."
  }, {
    "Username" : "RoddyPooper",
    "reported" : false,
    "Timestamp" : "2024-12-23 14:42:54",
    "Body" : "It’s a wonder that American healthcare CEOs are the only ones who have faced any kind of trouble. I wonder if we are going to see something more serious and widespread in my life time."
  }, {
    "Username" : "LondonHomelessInfo",
    "reported" : false,
    "Timestamp" : "2024-12-23 14:23:17",
    "Body" : "Big Issue exploit vendors, for all intent and purposes they are the employer, yet have been breaching national minimum wage, holiday pay and sick pay legislation for decades.\n\nFor anybody who is homeless in London, here is how to get temporary accommodation from your council and rehoused. Most homeless people are priority need homeless who can get temporary accommodation and rehoused by the council but homeless charities such as Single Homeless Project (SHP) in the Big Issue article deliberately don’t inform them to coerce them into the hostels they run to profit from housing benefit.\n\n[https://www.reddit.com/r/Homeless\\_in\\_London/comments/1eliuhr/homeless\\_in\\_london\\_how\\_to\\_get\\_rehoused\\_by\\_the/](https://www.reddit.com/r/Homeless_in_London/comments/1eliuhr/homeless_in_london_how_to_get_rehoused_by_the/)\n\nThis is a list of places where you can get free meals and shower at Christmas and New Year when all the homeless day centres and soup kitchens are closed:\n\n[https://www.reddit.com/r/Homeless\\_in\\_London/comments/1hb3e4b/christmas\\_2024\\_and\\_new\\_year\\_2025\\_opening\\_times\\_of](https://www.reddit.com/r/Homeless_in_London/comments/1hb3e4b/christmas_2024_and_new_year_2025_opening_times_of)\n\nSubreddit for homeless in London r/Homeless_in_London"
  }, {
    "Username" : "Gboy_Italia",
    "reported" : false,
    "Timestamp" : "2024-12-23 14:18:04",
    "Body" : "Too many lazy people in this country."
  }, {
    "Username" : "Kaiisim",
    "reported" : false,
    "Timestamp" : "2024-12-23 13:26:17",
    "Body" : "But the billionaires told me other poor foreigners are stealing my money! Why would they lie to me?"
  }, {
    "Username" : "Angry_Wizzard",
    "reported" : false,
    "Timestamp" : "2024-12-23 14:49:43",
    "Body" : "No no no! this is a factor but an unimportant one. \n\nThe problem is rent against mortgages. \n\nIf you asked a university graduate in the 80s or before what their plan was for life it would be move out of parents place rent for a while then earn enough to put a mortgage on a property then in 40 years time that would be theirs and they owned it all payments done and dusted.\n\nNone of that is true now but all the powers  that be still think this is true.\n\nRenting in London has no legal frame work other than market forces. So if an area that you live gets a new underground station and you were paying a certain amount there is nothing stopping the land Lord from raising the rent. From what I understand there is almost nothing that you as a renter can sign that will keep rent at x for y months. \n\nLand Lords therefore can buy a giant tower block from the local council on the cheep and fill them with human beings to cover a government mandate . Then renovate the empty ones so they are now spangly high end flats that no one in the building can afford. As such you can legit claim that the area has a higher average rent so you can bump up the original residents payments.\n\nThis has been going on in London  since the 80s and while the twats making all the money might speak a different language. This is not new and we as citizens have let this happen. To Mrs filtrop up stairs she didn't realise that who she.voted for in the 80s would allow organisations to kick her out 2024. But if she did she wouldn't have \n\nThat it is foreign money is so easy to demonise, but the reality is Poplar harca et all have been destroying affordable housing and bumping rents making your fellow country men homeless since the 80s with British people and British money.\n\nThat it is foreign money is not the problem it's our institutions that we rely on to play with a straight bat being cooped by that's with big check books.\n\nHow do we fix it ?...vote I don't care who for but vote if the voters turn out is less than 90% it's not a mandate of the people."
  }, {
    "Username" : "Gboy_Italia",
    "reported" : false,
    "Timestamp" : "2024-12-23 14:17:39",
    "Body" : "Billionaires have nothing to do with this.\nPeople not wanting to work and expecting the state to wipe their arse is the issue."
  }, {
    "Username" : "emshaq",
    "reported" : false,
    "Timestamp" : "2024-12-23 14:10:09",
    "Body" : "Perfectly put. 👍🏽"
  }, {
    "Username" : "m_s_m_2",
    "reported" : false,
    "Timestamp" : "2024-12-23 15:27:57",
    "Body" : "Whilst unemployed allowance isn't weighted, other things - like Local Housing Allowance.\n\nAlso increased demand-side subsidies will jack up rents, supply being the same. If you give vast swathes of Londoners more subsidies to pay their rent, you empower landlords to increase rents - because the demand is now there. \n\nLandlords absolutely cannot \"do what they want\". They charge as much as they can, renters pay as little as they can - this is how a market works. Supply and demand is what sets the market price. \n\nThe UK spends more on housing benefit than any other country in the OECD - 1.5% of our entire GDP. It's especially generous in London due to the aforementioned Local Housing Allowance. We also have some of the highest levels of social housing of any city in the OECD - approaching 40% in many central boroughs. In some boroughs like Tower Hamlets, 60% of all housing is subsidised. Has any of that made renting in London cheap?\n\n\nThe only way to broaden the safety net is to build more housing."
  }, {
    "Username" : "Angry_Wizzard",
    "reported" : false,
    "Timestamp" : "2024-12-23 13:18:15",
    "Body" : "Wow down voted in it sucks to be poor in london thread don't stamp on my face just kick me in the goolies"
  }, {
    "Username" : "Secure_Tip2163",
    "reported" : false,
    "Timestamp" : "2024-12-23 14:42:28",
    "Body" : "Like Andrew? or his inbred family? Or maybe you?"
  }, {
    "Username" : "Secure_Tip2163",
    "reported" : false,
    "Timestamp" : "2024-12-23 14:38:01",
    "Body" : "Have you also noticed modern billionaire barons are also \"experts\" in all sorts of things like: immigration, physics, predicting the future, politics, religion, Biology/evolution etc etc.\n\n\nThey are more knowledgeable than the anyone else on the planet because they are rich you see. Being rich= being extremely intelligent."
  }, {
    "Username" : "None",
    "reported" : false,
    "Timestamp" : "2024-12-23 14:10:24",
    "Body" : "[removed]"
  }, {
    "Username" : "Angry_Wizzard",
    "reported" : false,
    "Timestamp" : "2024-12-23 14:53:17",
    "Body" : "Lol no one will see this but it's all true"
  }, {
    "Username" : "vesthis15",
    "reported" : false,
    "Timestamp" : "2024-12-23 14:40:30",
    "Body" : "lmfao i wish i had your brain. life must be so nice"
  }, {
    "Username" : "Secure_Tip2163",
    "reported" : false,
    "Timestamp" : "2024-12-23 14:41:33",
    "Body" : "aka \"I know my place\".\n\n\nYou don't have to defend billionaires, they really don't need you."
  }, {
    "Username" : "According-Annual-586",
    "reported" : false,
    "Timestamp" : "2024-12-23 14:50:01",
    "Body" : "Sure\n\nA couple of thousand greedy fuckers owning more wealth than literally billions of other people is nothing to do with it\n\nBut some people not wanting to work for a wage that doesn’t offer them even a meagre quality of life are the problem"
  }, {
    "Username" : "Angry_Wizzard",
    "reported" : false,
    "Timestamp" : "2024-12-23 14:12:57",
    "Body" : "Unless you live it no one would belive it"
  }, {
    "Username" : "None",
    "reported" : false,
    "Timestamp" : "2024-12-23 14:39:50",
    "Body" : "[removed]"
  }, {
    "Username" : "Angry_Wizzard",
    "reported" : false,
    "Timestamp" : "2024-12-23 14:55:53",
    "Body" : "The monsters under the stairs ruining Britain arnt from overseas they were voted into government in the 80s"
  }, {
    "Username" : "emshaq",
    "reported" : false,
    "Timestamp" : "2024-12-23 14:41:19",
    "Body" : "Exactly. I’m living it and want better for my children. It’s just a downward spiral."
  }, {
    "Username" : "None",
    "reported" : false,
    "Timestamp" : "2024-12-23 14:42:50",
    "Body" : "[removed]"
  }, {
    "Username" : "Angry_Wizzard",
    "reported" : false,
    "Timestamp" : "2024-12-23 15:08:35",
    "Body" : "As i am in the same boat find where your local council is based. go there in person and explain with all the details what your situation is. And ask them what they can do to help you. You would be amazed what your local council can do if you speak to anyone who actually knows. These heros live in the council office thou. Always face to face and always write everything down. They cannot hide if you have it on paper"
  }, {
    "Username" : "None",
    "reported" : false,
    "Timestamp" : "2024-12-23 14:46:19",
    "Body" : "[removed]"
  }, {
    "Username" : "None",
    "reported" : false,
    "Timestamp" : "2024-12-23 14:48:17",
    "Body" : "[removed]"
  } ]
}