{
  "Community_name" : "Krakow",
  "Username" : "DirtPsychological455",
  "Post_body" : "Co jest nie tak ze Strefą Czystego Transportu w Krakowie",
  "Timestamp" : "2024-12-23 10:22:00",
  "Num_comment" : 49,
  "reported" : false,
  "Commenti" : [ {
    "Username" : "Snejks",
    "reported" : false,
    "Timestamp" : "2024-12-23 10:54:11",
    "Body" : "Co do norm emisji spalin to to wszystko jest od dupy strony robione. Wg raportów NIK benzyny (nawet te później Euro1)  przyczyniają się do zanieczyszczenia powietrza w sposób znikomy. Badania teledetekcji, które zresztą robiło samo ZTP jako głównych trucicieli wskazało Diesle poniżej Euro 3 i przede wszystkim prywatne busy, które jak szarańcza jeżdżą tam i z powrotem ATW. Co robi zatem ZTP? Euro4 dla benzyny i Euro6 dla diesla. Biorąc pod uwagę średni wiek samochodu w Polsce (16 lat) do strefy nie wjedzie grubo ponad 50% samochodów. To są wymagania na poziomie ULEZ w Londynie gdzie średni wiek samochodu to 8 lat. A ULEZ to skrót od ultra low emission zone. \nDruga sprawa, że w Kopenhadze i Berlinie gdzie znów flota jest o wiele młodszą normy są o wiele łagodniejsze. W Kopenhadze SCT obejmuje tylko diesle, benzyny w ogóle nie, a w Berlinie normy to Euro 1 dla benzyny i Euro 3 dla diesla. \nKolejna sprawa to raporty i badania w których jasno widać, że bardzo mocno do zanieczyszczenia przyczyniają się taksówki i ubery. O prywatnych Brusach już w wspominałem dodam tylko, że w Krakowie jest więcej taksówek w przeliczeniu na mieszkańca niż w Nowym Jorku, który ma 13 milionów mieszkańców. W Krakowie jedna taksa przypada na 200 mieszkańców, w nowym Jorku na 600. \nObszar strefy to kolejna piramidalna bzdura bo na podstawie przekroczonych odczytów z jednego miejsca zamyka się całe miasto. O odcięciu ludzi od instytucji o zasięgu wojewódzkim czy regionalnym już nie wspominam (sądy, urzędy, szpitale). Już widzę jak moja matka jedzie do szpitala onkologicznego na kontrolę tramwajem. A za to, że parkingi P+R są w granicach strefy to ktoś powinien odpowiedzieć karnie. \nJest jeszcze mnóstwo absurdów, chociażby cały proces konsultacji nie zabezpieczony nawet captcha dzięki czemu wszystko da się ustawić botem, ale najważniejsze jest to, że ktoś tu się na poważnie z chujem na łby pozamieniał."
  }, {
    "Username" : "Lumornys",
    "reported" : false,
    "Timestamp" : "2024-12-23 10:36:07",
    "Body" : ">mieszkając w dużym mieście nie potrzebujesz samochodu.\n\nMieszkając w dużym mieście możesz mieć rodzinę w mniejszym mieście, albo na wsi.\n\nA PKS-y leżą i kwiczą."
  }, {
    "Username" : "st4lz2",
    "reported" : false,
    "Timestamp" : "2024-12-23 10:32:51",
    "Body" : "Te przepisy nie są tylko na rękę producentom samochodów, to jest też zgodne z interesem grup korzystających ze wzrostu cen nieruchomości. Jeśli koszty dojazdu do pracy z okolic podmiejskich rosną i stają się coraz mniej dostępne - zwiększa się popyt na wynajem w mieście."
  }, {
    "Username" : "trodaire_98",
    "reported" : false,
    "Timestamp" : "2024-12-23 11:07:50",
    "Body" : "To może ja też się wypowiem.\nPróbowałem dojeżdżać do pracy autobusem ale nie jestem w stanie, dojazd od pracy to 1.5-2h. \nW ciągu dnia to w dobrym wypadku 3h psu w dupę. Tymczasem autem w szczycie to maks 40 minut. W dobre dni albo jak wyjadę wcześniej nawet 20 minut. \nZ racji tego że jeżdżę do pracy 3 razy w tygodniu karta miejska wychodzi mi niewiele taniej niż tankowanie. Nie wspominając o biletach. To jest jakiś absurd. \nKomunikacja w krk jest niesprawna. Jeśli chcesz się gdzieś dostać musisz jechać do centrum, dopiero potem się przesiadasz na kolejne tramwaje autobusy. W centrum są korki. Powoduje to niebotyczne opóźnienia. \n Mam według tej nomenklatury starego diesla. Rocznik 2008. Pali w ruchu miejskim średnio 5 litrów. W trasie jeszcze mniej. Co warto dodać przez chwilę miał zepsuty zawór EGR i zdarzało mu się za dymić. I wiecie co. Wtedy nie było problemu z przeglądem. \nWięcej na czym się wywalam? Na jebanym numerze Vin który jest pod podłogą pasażera. Co roku muszę go szlifować bo pod dywanikiem to chwyta lekko korozją. \nKraków to miasto absurdów. Nie stać miasto na rondo na skrzyżowaniu Borkowska zawiła a będą budować tramwaj na Kliny."
  }, {
    "Username" : "Tough-Adagio5527",
    "reported" : false,
    "Timestamp" : "2024-12-23 10:53:00",
    "Body" : "Dobra krytyka, mam nadzieje, że ten projekt wejdzie w życie po gruntownych zmianach na przyklad tych wymienionach przez OPa. Najważniejszym punktem dla mnie jest zdecydowanie ten o poprawieniu jakości transportu publicznego. Jak z tramwajami jest bardzo dobrze, to autobusy z dluga trasa to tragedia. Nie można na nich polegać, gdy regularnie jeżdżą nieregularnie. Wiadomo, to nie wina kierowcow. Natomiast jestem pewien, że da się poprawić obecny stan komunikacji miejskiej. Tylko prosze, niech nikt mi nie pierdoli o żadnym projekcie metro, bo jest to żalosne. Kraków w żadnym wypadku nie potrzebuje metro. Gdyby choć część ilości pieniądzy cytowanej w projektach metro zainwestować w ulepszenie obecnej komunikacji miejskiej (w tym SKA), to dopiero wtedy można by pomyśleć o bardziej agresywnym zakazie wjazdu samochodów do szeroko pojętego centrum Krakowa.\nCzęść tych pieniędzy również warto by zainwestować w infrastrukturę związaną z transportem przy pomocy roweru.\nKraków nie jest najgorszy pod tym względem, ale jest wiele miejsc, gdzie udaje, że jest bike friendly (namalowana, cienka i nieodgrodzona ścieżka na drodze z intensywnym ruchem samochodowym to nie infrastruktura).\n\nUważam, że bilety okresowe wcale nie są bardzo drogie i wychodzą dużo taniej niż wszystkie koszty związane z posiadaniem samochodu, jednak jak OP napisał - nadchodzą podwyżki."
  }, {
    "Username" : "kkoyot__",
    "reported" : false,
    "Timestamp" : "2024-12-23 10:24:05",
    "Body" : "Bardzo dobre podsumowanie i zgadzam się z każdym punktem.\n\nSzkoda tylko, że takie oczywistości trzeba spisywać i siłą tłuc do łba radnym na konsultacjach, organizować pikiety i niemal kłaść się pod ratuszem, bo najchętniej to by skubali każdego za sam fakt jeżdżenia czymkolwiek po Krakowie. A najwięcej do powiedzenia jak zwykle mają aktywiści i osoby bez aut, którzy wychodzą z domu tylko do okolicznej żabki i nie mają bladego pojęcia w jakim stanie jest infrastruktura i transport miejski\n\nCzym to jest podyktowane? Lobby? Pieniądze z KPO? Pustka w miejskim skarbcu? A może po prostu czysta pazerność? Znając życie, wszystko po trochu"
  }, {
    "Username" : "Mental-Weather3945",
    "reported" : false,
    "Timestamp" : "2024-12-23 10:22:00",
    "Body" : "Mi to wisi, jak mam byc szczera. To miasto jest jednym wielkim korkiem. Tutaj najlepiej isc pieszo, rowerem, hulajka, albo tramwajem. Wszystko inne to frustracja i ciagle spoznienia. \nPoza tym powietrze dalej pozostawia wiele do zyczenia. Ja mam napady dusznosci co zime. Niestety praca mnie trzyma. "
  }, {
    "Username" : "Nytalith",
    "reported" : false,
    "Timestamp" : "2024-12-23 10:57:50",
    "Body" : "Odnośnie punktu 1 to jaką alternatywę byś widział? Przecież nie zrobią badań technicznych każdego wjeżdżającego samochodu. Normy emisji to najprostszy sposób i zapewne jedyny możliwy do wyegzekwowania. \n\nPodobnie z LPG - co z tego że auto ma instalacje jeśli nie wiadomo czy jest używana? \n\nI jeszcze uwaga odnośnie fachowców i ludzi którzy potrzebują auta do pracy - tak szczerze to mam to gdzieś. Jeszcze nie tak dawno temu starczyło postać na alejach koło przystanku wszystkich busiarzy - człowiek się dosłownie dusił od tych starych diesli. Wolę stać koło 5 nowych suvow niż jednego pełnoletniego busa naprawianego przez Mietka za domem. \n\nCo do reszty to zgoda, zwłaszcza odnośnie rozmiarów strefy."
  }, {
    "Username" : "Galwadan",
    "reported" : false,
    "Timestamp" : "2024-12-23 12:53:30",
    "Body" : "Rozumiem, że te wymagania dotyczą też pojazdów komunikacji miejskiej, samochodów serwisowych których właścicielem jest miasto itp?\nJeśli tak to super. Czas na podwyżki cen biletów miejskich. Jeśli nie to super. Czas na podwyżki biletów miejskich."
  }, {
    "Username" : "Smart-Comfortable887",
    "reported" : false,
    "Timestamp" : "2024-12-23 13:25:49",
    "Body" : "Cena biletów nie absolutnie żadnego wpływu na to, czy ktoś rezygnuje z samochodu, czy też nie. Nawet grat wychodzi drożej od komunikacji miejskiej, a ludzie kierują się zupełnie innymi czynnikami niż cena - czas przejazdu i jego stabilność, komfort itd."
  }, {
    "Username" : "Graalf",
    "reported" : false,
    "Timestamp" : "2024-12-23 12:00:55",
    "Body" : "To samo zauważyłem w Berlinie"
  }, {
    "Username" : "Mountain_Low151",
    "reported" : false,
    "Timestamp" : "2024-12-23 11:00:20",
    "Body" : "Dla mnie SCT jest niemoralna po prostu, a wszystko inne jest drugorzędne"
  }, {
    "Username" : "vanKlompf",
    "reported" : false,
    "Timestamp" : "2024-12-23 12:53:23",
    "Body" : "16 lat średnia to bzdura. Niestety brak sensownych danych a w cepik jest dużo trupów którymi nikt nie jeździ\nPoza tym sporo racji masz. Szczególnie z P+R w strefie "
  }, {
    "Username" : "DirtPsychological455",
    "reported" : false,
    "Timestamp" : "2024-12-23 10:39:56",
    "Body" : "O, to to. Moja rodzina mieszka na wsi w Podkarpackim, gdzie autobusów... nie ma. Należy iść do najbliższego miasteczka, w którym autobusy kursują, albo próbować złapać okazję. Większość moich kolegów ze szkoły mając 14-15 lat jeździła już na motorynkach (bez uprawnień), zaś wszyscy bez wyjątku zaraz po 18 robili prawo jazdy. Tutaj bez samochodu, czy chociażby skutera nie da się żyć."
  }, {
    "Username" : "v3anz-",
    "reported" : false,
    "Timestamp" : "2024-12-23 12:22:03",
    "Body" : "Nie trzeba mieć rodziny poza miastem. Wystarczy mieć małe dziecko i już bez auta wszystko zajmuje 2-3 czasu. Autem na podrzucenie syna do szkoły i dojazd do pracy poświęcam ~45 min. Komunikacją 1,5h. Nie stać mnie na takie marnotrastwo czasu.\nJakiekolwiek duże zakupy na więcej niż 2 dni wymagają auta."
  }, {
    "Username" : "Sprucedude",
    "reported" : false,
    "Timestamp" : "2024-12-23 11:52:37",
    "Body" : "Wynajem auta okazjonalnie tanie wychodzi niż zakup i utrzymanie."
  }, {
    "Username" : "vanKlompf",
    "reported" : false,
    "Timestamp" : "2024-12-23 12:56:01",
    "Body" : "No akurat masowe dojazdy samochodem z obwarzanka to nie jest coś na czym komukolwiek zależy. Nie tak powinny wyglądać miasta. To nie Teksas."
  }, {
    "Username" : "vanKlompf",
    "reported" : false,
    "Timestamp" : "2024-12-23 12:59:10",
    "Body" : "Co zlego w tramwaju na Kliny?"
  }, {
    "Username" : "DirtPsychological455",
    "reported" : false,
    "Timestamp" : "2024-12-23 14:26:55",
    "Body" : "> (namalowana, cienka i nieodgrodzona ścieżka na drodze z intensywnym ruchem samochodowym to nie infrastruktura).\n\nOsobnik który to zatwierdził na pewno nie porusza się na rowerze. Zresztą podobnie jak \"ścieżka rowerowa\" poprowadzona na środku torów tramwajowych. Projektował to chyba ktoś z uszkodzonym mózgiem, to pomysł tak skrajnie głupi i niebezpieczny że ręce opadają."
  }, {
    "Username" : "NoisySampleOfOne",
    "reported" : false,
    "Timestamp" : "2024-12-23 10:56:51",
    "Body" : "Najwięcej do powiedzenia mają ludzie z poza Krakowa, którzy ani płacą w Krakowie podatków ani nie wąchają na codzień tego smrodu."
  }, {
    "Username" : "Aggravating-Entry711",
    "reported" : false,
    "Timestamp" : "2024-12-23 13:46:37",
    "Body" : "Jak mieszkałem przy przystanku tramwajowym, to i owszem samochód do codziennego życia był zbędny. Gdy teraz mieszkam kawałek poza Krakowem, to niestety bez samochodu się nie da. W jakimś sensie też mi to wisi, bo mam nowe auto, natomiast trudno się nie zgodzić, że koncepcja krakowskiego SCT jest absurdalna."
  }, {
    "Username" : "MiFcioAgain",
    "reported" : false,
    "Timestamp" : "2024-12-23 14:10:03",
    "Body" : "Tobie to wisi a innym nie, i koło życia dalej się toczy."
  }, {
    "Username" : "bannedByTencent",
    "reported" : false,
    "Timestamp" : "2024-12-23 11:41:51",
    "Body" : "Busy to rak, pełna zgoda. I nie tylko z uwagi na ich smród."
  }, {
    "Username" : "DirtPsychological455",
    "reported" : false,
    "Timestamp" : "2024-12-23 12:21:44",
    "Body" : ">Odnośnie punktu 1 to jaką alternatywę byś widział?\n\nKażda z tych norm emisji obliguje do spełniania konkretnych parametrów. Gdyby obowiązkowo mierzyć te normy na przeglądach technicznych, to mielibyśmy jasną informację - konkretny samochód o konkretnym numerze VIN wydziela taką ilość CO2, taką ilość NOx, taką ilość innych zanieczyszczeń, wobec tego kwalifikuje się na taką normę emisji spalin. Uzależnianie normy emisji od roku produkcji jest bez sensu, bo wiadomo że auto wyprodukowane np. w 2004 ma normę Euro 3, bo Euro 4 wtedy jeszcze nie było, to jaką mieli wpisać? Kiedy to sprawdzić, może się okazać że auto w rzeczywistości spokojnie spełnia normę wyższą lub odwrotnie - mimo że teoretycznie spełnia normę wyższą, to wyniki badania zanieczyszczeń tego nie potwierdzają. Powtórzę - to dało się zrobić, bo ustawę podpisano w 2018 roku, zas samochody przechodzą przegląd co roku. \n\n> Podobnie z LPG - co z tego że auto ma instalacje jeśli nie wiadomo czy jest używana? \n\nTechnicznie byłoby to trudne do udowodnienia, natomiast patrząc na ceny paliw to naprawdę mało który właściciel samochodu na LPG będzie jeździć na benzynie, to się po prostu nie opłaca.\n\nOdnośnie busów, to pełna zgoda. Tutaj tym bardziej należy uszczelnić badania techniczne, bo takimi busami dziennie podróżują setki czy tysiące osób, a czasami są w stanie agonalnym."
  }, {
    "Username" : "Aggravating-Entry711",
    "reported" : false,
    "Timestamp" : "2024-12-23 14:04:59",
    "Body" : "To prawda, niemniej cena też ma znaczenie. Może nie dla mnie, może nie dla ciebie, ale wiele ludzi, którzy mają mniejszy budżet przelicza każdą złotówkę. Dla mnie absurdem jest, że przejazd samochodem w pojedynkę często jest tańszy niż przejazd komunikacją miejską. Zakładając jednocześnie, że przejazd samochodem jest bardziej komfortowy, szybszy, nie trzeba iść i stać na przystanku itp. Jeżeli miasto chce zachęcać do komunikacji miejskiej, to cena i jakość usług musi iść w parze. Kraków ma bardzo drogie bilety i niestety mówi się, że od nowego roku będzie kolejna podwyżka."
  }, {
    "Username" : "MiFcioAgain",
    "reported" : false,
    "Timestamp" : "2024-12-23 14:13:10",
    "Body" : "Czego nie rozumiesz w tym, że nie wszędzie dojeżdża komunikacja miejska?"
  }, {
    "Username" : "vanKlompf",
    "reported" : false,
    "Timestamp" : "2024-12-23 12:59:27",
    "Body" : "Aha. A co takiego niemoralnego jest w SCT?"
  }, {
    "Username" : "DirtPsychological455",
    "reported" : false,
    "Timestamp" : "2024-12-23 12:59:26",
    "Body" : "Te 16 lat to wynik już po odliczeniu trupów widniejących w cepiku. [źródło](https://www.money.pl/gospodarka/przybywa-leciwych-aut-w-polsce-srednia-wieku-idzie-w-gore-7008255431125888a.html)"
  }, {
    "Username" : "Snejks",
    "reported" : false,
    "Timestamp" : "2024-12-23 13:10:31",
    "Body" : "Po pierwsze te 16 lat to już po odliczeniu martwych dusz z CEPIKu.a po drugie ta wartość ta wartość rośnie więc Polacy jeżdżą coraz starszymi autami. Czy dlatego, że lubią klasyki? Nie sądzę."
  }, {
    "Username" : "Snejks",
    "reported" : false,
    "Timestamp" : "2024-12-23 12:15:10",
    "Body" : "Najtańszy traficar to 2,09 zł za km. Kupno małego auta na gaz daje ci spokojnie niższe koszty za kilometr więc chuja się opłaca."
  }, {
    "Username" : "Lumornys",
    "reported" : false,
    "Timestamp" : "2024-12-23 12:05:50",
    "Body" : "Tylko że jak już mam, to wsiadam i jadę, bez rozważania za każdym razem czy \"opłaca\" mi się w danym momencie najmować samochód."
  }, {
    "Username" : "DirtPsychological455",
    "reported" : false,
    "Timestamp" : "2024-12-23 12:06:50",
    "Body" : "Na wsi potrzebujesz auta codziennie, nie okazjonalnie. Poza tym, przy małym aucie które jeździ na gaz... Kłóciłbym się."
  }, {
    "Username" : "st4lz2",
    "reported" : false,
    "Timestamp" : "2024-12-23 13:05:45",
    "Body" : "Myślę, że sporadyczne dojazdy do pracy wszystkich pracujących zdalnie, hybrydowo, prowadzących różnego typu działalności niewymagające stałej obecności w mieście, ludzi pracujących poza standardowymi godzinami pracy i przeniesienie ich codziennej aktywności z centrum na peryferia, powinno być celem planowania urbanistycznego. Po to są drogi - żeby z nich korzystać.\n\nWłaśnie Kraków to w mniemaniu niektórych jakaś metropolia, a to jest miasto które można przejechać w 30 min z jednego końca na drugi jak drogi są puste. 10-15 km od centrum miasta są pola, na których rośnie kukurydza, natomiast celem urbanistyki wydaje się być zatkanie miasta od zewnątrz i upchanie wszystkich w ciasnych klatkach. Otóż Kraków to jest dużo bardziej Teksas, niż Nowy Jork."
  }, {
    "Username" : "DirtPsychological455",
    "reported" : false,
    "Timestamp" : "2024-12-23 14:33:17",
    "Body" : "Tylko nie dziwię się ludziom, którzy woleli pobudować się na wsi w rozsądnej odległości od miasta, zamiast kupować \"apartament\" 40m2 i gnieździć się na osiedlu zamkniętym. Może wolnostojący dom ma swoje ograniczenia i obowiązki, ale przynajmniej jesteś na swoim. Linię kolejową można doprowadzić do najbliższego miasteczka, skąd ludzie mogliby wygodnie podjechać autem na stację, stamtąd szybko dostać się do Krakowa. Problemem staje się bardzo mocno rozrzucona zabudowa. Ci którzy mają już domy, nie przeniosą ich bliżej istniejących stacji, zaś gmina nie jest w stanie doprowadzić każdemu stacji kolejowej pod nos. Szczerze mówiąć, to nie widzę rozwiązania tego problemu."
  }, {
    "Username" : "trodaire_98",
    "reported" : false,
    "Timestamp" : "2024-12-23 13:08:28",
    "Body" : "Sama idea jest zbawienna. Problem jak zwykle tkwi w szczegółach. \nPo pierwsze planowana data 2035 - kupa czasu \nPo drugie finanse Krakowa. Wydajemy miliony na fazy koncepcyjne. Tymczasem ciężko wyjechać z osiedla. Wzdłuż ulicy zawiłej były planowane 3 ronda. Z nowo budowana droga, z Borkowska i z komuny paryskiej. Nie będzie żadnego. Oznacza to że dalej z Borkowskiej będzie ciężko wyjechać. A na dodatek dojdzie nowa droga wychodząca wzdłuż obozowej. Na krótkim odcinku będą więc 3 skrzyżowania o bardzo dużym natężeniu ruchu jednocześnie będąc bardzo małymi. Tylko i wyłącznie na komuny paryskiej są dedykowane pasy do skrętu. \nUlica Borkowska też jest w opłakanym stanie gdyż przyjmuje na siebie większość ruchu technologicznego ( ciężkiego - pojazdy budowy i MPK).\nWarto dodać że skoro planowany jest tramwaj miasto planuje kolejne bloki na klinach i w okolicach. Widać już ruchy na osiedlu za Fortem i Anny Szwed. Utworzony użytek ekologiczny obejmuje tylko fragment terenu za szkołą do obwodnicy. \nReasumując. Mamy w cholerę wąskich gardeł i planowane nowe bloki. W zamian może będziemy mieć tramwaj. Za 10 lat."
  }, {
    "Username" : "kkoyot__",
    "reported" : false,
    "Timestamp" : "2024-12-23 11:22:26",
    "Body" : "Duża część mieszkańców gmin pracuje w Krakowie, więc jak najbardziej powinni mieć głos w tej sprawie. \nPoza tym, jedynym de facto zanieczyszczeniem, za które głównie odpowiadają auta to tlenki azotu. Pm 2,5 i 10 to wina okolicznych gmin, co można było zobaczyć w praktyce podczas covidu"
  }, {
    "Username" : "zRywii",
    "reported" : false,
    "Timestamp" : "2024-12-23 11:49:23",
    "Body" : "Nie żyłeś w czasach Bolesława Chrobrego to się nie wypowiadaj na temat rządów Bolesława. Taka logika"
  }, {
    "Username" : "Martin_router",
    "reported" : false,
    "Timestamp" : "2024-12-23 12:50:00",
    "Body" : "Czy obowiązkowe mierzenie na przeglądach technicznych jest technicznie do zrobienia?"
  }, {
    "Username" : "Nytalith",
    "reported" : false,
    "Timestamp" : "2024-12-23 13:14:37",
    "Body" : "System o którym mówisz ma 2 wady - po pierwsze jest bardzo skomplikowany, bo zamiast sprawdzać 1 linijkę w dowodzie sprawdzamy indywidualnie każdy pojazd pod kątem czegoś co się zmienia. Po drugie czynnik ludzki - jeszcze nie tak dawno temu dało się załatwić przegląd za flaszkę. Teraz pewnie jest już trudniej. Ale w przypadku badania bardzo łatwo o „niedokładne” wykonanie - np. Sondę włożyć nieco za blisko, dać za niskie obroty etc. Tak by wyszło jak ma wyjść. \n\nSystem używający „fabrycznej” normy emisji jest o wiele prostszy i AFAIK takie jest używane wszędzie gdzie istnieją sct. \nA te normy powinny być egzekwowane na przeglądach, a nie że pierwsze co się robi po kupnie diesla to wywalenie dpf i egr…\n\nOdnośnie LPG to jest ono modyfikacja samochodu i może ktoś używa a może nie. Albo wręcz ktoś by mógł sobie fikcyjnie wbić niesprawne. Przeglądy wiele droższe nie są, a sprawdzają tam tylko legalizację i szczelność zbiornika… \n\nNiestety przepisy muszą być możliwie proste i ogólne - uzależnienie wjazdu od normy euro, którą każdy ma napisaną w dowodzie rejestracyjnym jest najprostsze i osiąga 90% efektu. \nA że wychodzą dziwne rzeczy typu seicento nie wjedzie a 7l dodge ram tak… no cóż. \n\nZaczniemy kombinować to wyjdzie jak z przepisem, że przy parkowaniu na chodniku można mieć max dmc 2,5t. Myślisz, że ktokolwiek to egzekwuje? Nie. Pewnie w dużej mierze dlatego, że w czasach wprowadzania przepisu takie dmc to miały dostawczaki. A dziś co większy suv, nie mówiąc o elektrykach. Jest przepis i jest w zasadzie martwy."
  }, {
    "Username" : "Smart-Comfortable887",
    "reported" : false,
    "Timestamp" : "2024-12-23 14:44:08",
    "Body" : "Eksperymenty z darmowym transportem publicznym dowiodły, że jest to tak marginalna grupa, że można ją pominąć w rozważaniach o promocji transportu zbiorowego"
  }, {
    "Username" : "Smart-Comfortable887",
    "reported" : false,
    "Timestamp" : "2024-12-23 14:41:21",
    "Body" : "A ty czego nie rozumiesz w tym komentarzu, że rzucasz jakimś argumentem z dupy? Jak to ma się do tego co napisałem XD"
  }, {
    "Username" : "dancingForestSting",
    "reported" : false,
    "Timestamp" : "2024-12-23 13:17:14",
    "Body" : "I bez szukania gdzie stoi najblizszy, czy jest sprawny, nie zastawiony, czy jakis ch..j nie wstawill go na zamkniety parking, czy ma paliwo, i czy rozmiarowo ci starczy jak cos musisz przewiezc.\n\nJuz pomijam sytuacje gdzie raz traficar mi sje zdazyl z wyrwanym fotelem kierowcy XD"
  }, {
    "Username" : "vanKlompf",
    "reported" : false,
    "Timestamp" : "2024-12-23 13:09:29",
    "Body" : "Sporadycznie to jasne, ale takich ludzi jest mniejszosc. A budowa na odległych przedmieściach bez komunikacji, bo \"działaczka widokowa\" a potem pakowanie dziesiątek tysięcy samochodów do miasta to nie jest dobra urbanistyka. \n\n\nPotem kończy się tym że mieszkańcy Sułkowic żądają autostrady do samego centrum i jeszcze więcej parkingów (za darmo!), bo nie mają jak dojechać. "
  }, {
    "Username" : "vanKlompf",
    "reported" : false,
    "Timestamp" : "2024-12-23 15:14:13",
    "Body" : "Miejska zabudowa, nawet jednorodzinna jest ok. Ale mieszkam na Podkarpaciu i tutaj ludzie budują się na totalnych zadupiach bo \"działeczka widokowa\" a potem oczekują setek milionów inwestycji w drogi i parkingi bo \"dej\".\n\n\nRozwiązania są, planowanie i urbanistyka. Ale w Polsce nie przejdzie "
  }, {
    "Username" : "trodaire_98",
    "reported" : false,
    "Timestamp" : "2024-12-23 13:11:07",
    "Body" : "I żeby było jasne, jestem za tramwajem. Ale sposób w jaki miasto prowadzi ta inwestycję jest żenujący. Miasto z jakiego powodu odrzuciło najwygodniejsze rozwiania. Wzdłuż nowej drogi w ciągu obozowej."
  }, {
    "Username" : "Smart-Comfortable887",
    "reported" : false,
    "Timestamp" : "2024-12-23 13:38:56",
    "Body" : "Nie, miasto ma dbać o swoich mieszkańców, a o gmin ościennych tylko jeśli jest to w jego interesie"
  }, {
    "Username" : "vanKlompf",
    "reported" : false,
    "Timestamp" : "2024-12-23 12:57:58",
    "Body" : "Jest. Są kraje które tak robią.\nAle Polska to kraj z tektury, a prawo do wycinania DPF jest wpisane w konstytucję więc nie przejdzie "
  }, {
    "Username" : "MiFcioAgain",
    "reported" : false,
    "Timestamp" : "2024-12-23 14:03:14",
    "Body" : "To chcesz aby ludzie kupowiali mieszkanie w centrum? Ciekawe za co."
  }, {
    "Username" : "MiFcioAgain",
    "reported" : false,
    "Timestamp" : "2024-12-23 14:06:38",
    "Body" : "Ale to mieszkańcy z gmin ościennych napędzają w dużej mierze gospodarkę miasta, więc dosłownie miasto zakłada sobie samo pętlę na szyję."
  } ]
}