{
  "Community_name" : "Travel",
  "Username" : "National-Actuary-547",
  "Post_body" : "A roadtrip through Namibia. An out of this world experience for nature and wildlife lovers.",
  "Timestamp" : "2024-12-22 18:21:53",
  "Num_comment" : 48,
  "reported" : false,
  "Commenti" : [ {
    "Username" : "National-Actuary-547",
    "reported" : false,
    "Timestamp" : "2024-12-22 18:41:21",
    "Body" : "Did a self-drive trip across Namibia from Windhoek to the far south and back up north again. The landscapes are simply out of this world as is the wildlife.\n\nThe pictures don't do the country justice as there is so much more to see and do than what can be seen in the slideshow. I didn't even include a picture of all the lions that I have spotted in Etosha park. Neither is there a picture of the cozy beachside town Swakopmund which is a great starting point for desert tours. And don't get me started on the amazing Spitzkoppe mountain and the cavemen paintings at the Brandberg.\n\nThe landscapes in Namibia seem so unreal, you'd think that you are on a different planet. And the best thing: it's a very affordable country. To do a safari there is incredibly cheap compared to Eastern Africa. The park entrance fees are just a few dollars a day and there is plenty of wildlife even though it's less than in Kenya or Tanzania. One month is barely enough to scratch the surface. I could've easily kept myself entertained there for months to go."
  }, {
    "Username" : "Cruisn06",
    "reported" : false,
    "Timestamp" : "2024-12-22 20:03:24",
    "Body" : "Your dikdik photo looks like he has just finished his 10th pint and his mate asked if he is okay.. lol\n\nSeriously though, great photos. namibia has a special place in my heart, I loved it."
  }, {
    "Username" : "segacs2",
    "reported" : false,
    "Timestamp" : "2024-12-22 21:11:30",
    "Body" : "Thanks for sharing your fabulous photos. Brings back great memories of my trip to Namibia about a decade ago.\n\nWhat camera / photography equipment did you bring?"
  }, {
    "Username" : "zoumbou7",
    "reported" : false,
    "Timestamp" : "2024-12-22 19:03:55",
    "Body" : "Fantastic photos. Any tips for gotchas? Are the roads OK? Gas/petrol stations frequent enough? Any other dangers?"
  }, {
    "Username" : "corrector300",
    "reported" : false,
    "Timestamp" : "2024-12-22 20:29:45",
    "Body" : "that zebra pic is intense, it really captures a sense of the texture of the zebra skin, which isn't usually the case. the reflective skin, the scrunched nose..."
  }, {
    "Username" : "balloontrap",
    "reported" : false,
    "Timestamp" : "2024-12-22 21:18:12",
    "Body" : "How safe was it"
  }, {
    "Username" : "yzerman88",
    "reported" : false,
    "Timestamp" : "2024-12-22 19:23:41",
    "Body" : "Great photos! How are the accommodations?"
  }, {
    "Username" : "strawberryandromeda",
    "reported" : false,
    "Timestamp" : "2024-12-22 19:36:53",
    "Body" : "Wow stunning"
  }, {
    "Username" : "LostBaz",
    "reported" : false,
    "Timestamp" : "2024-12-22 20:59:16",
    "Body" : "sublime pics !"
  }, {
    "Username" : "Riccardo_Mnt",
    "reported" : false,
    "Timestamp" : "2024-12-22 22:06:34",
    "Body" : "FANTASTIC photos, you really did an amazing job."
  }, {
    "Username" : "singularkudo",
    "reported" : false,
    "Timestamp" : "2024-12-22 22:10:36",
    "Body" : "Wow, these photos are incredible! Well done."
  }, {
    "Username" : "tambrico",
    "reported" : false,
    "Timestamp" : "2024-12-22 22:52:29",
    "Body" : "Did you go solo? Is the 4x4 necessary for Etosha? Can you drive to the watering holes at Etosha by yourself or do you need a guide with you?\n\nI have been considering doing this trip solo for a number of years. It is very high on my list. \n\nI don't have much interest in offroading or driving on sand but I imagine driving on the gravel roads is a necessity. I am primarily interested in wildlife and in particular bird watching.\n\n As a side note -earlier this year in Oman I drove 40km thru the desert on a very, very, very rough gravel road in a Peugot sports car with very thin tires (google maps didnt tell me the road was gravel lmao). I didnt see a single other vehicle the whole way but there were plenty of blown tires on the side of the road."
  }, {
    "Username" : "burgundyhellfire",
    "reported" : false,
    "Timestamp" : "2024-12-22 23:08:31",
    "Body" : "Namibia is my favorite place in the whole world, truly truly truly a magical country. Your photos are awesome and they made me feel like I was back there for a minute :)"
  }, {
    "Username" : "turkeymayosandwich",
    "reported" : false,
    "Timestamp" : "2024-12-23 00:38:48",
    "Body" : "Beautiful photos."
  }, {
    "Username" : "Overall_Stranger8164",
    "reported" : false,
    "Timestamp" : "2024-12-23 02:08:16",
    "Body" : "Namibia such a amazing place. Thanks sharing the photo:)"
  }, {
    "Username" : "curiouslittlethings",
    "reported" : false,
    "Timestamp" : "2024-12-23 03:22:51",
    "Body" : "Your photos are absolutely stunning. What a beautiful country!"
  }, {
    "Username" : "amelisha",
    "reported" : false,
    "Timestamp" : "2024-12-23 04:27:22",
    "Body" : "I spent a month in Namibia visiting a (now) ex-boyfriend who was studying there and it was incredible, absolutely top three trip even though I was in the travel industry and got a ton of amazing experiences. Every time I hear someone express an interest in travelling to Africa, I yell NAMIBIA. It was a perfect combo of adventure travel and safety and stability and it was a bargain too while being very comfortable."
  }, {
    "Username" : "Mother_Formal_7742",
    "reported" : false,
    "Timestamp" : "2024-12-23 11:44:49",
    "Body" : "Africa is such a beautiful continent. So much to do"
  }, {
    "Username" : "AutoModerator",
    "reported" : false,
    "Timestamp" : "2024-12-22 18:21:53",
    "Body" : "Hi /u/National-Actuary-547, Thank you for your submission. The mods have been notified and it will be checked in due course - there's no need to message them.\n\nIn the meantime please **ensure it has the country in the title** and follows the image posting title and content guidelines in the [FAQ](https://www.reddit.com/r/travel/wiki/faq#wiki_.22here_are_my_holiday_photos.21.22) otherwise it will be removed without further explanation. **If your images span a number of locations or attractions within a country or city explain where each of them were taken and what we are looking at**. Whilst waiting, please add a comment and captions telling us something interesting about the trip. If you can't add anything interesting please use a dedicated photography subreddit.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/travel) if you have any questions or concerns.*"
  }, {
    "Username" : "paddyp22",
    "reported" : false,
    "Timestamp" : "2024-12-22 22:00:12",
    "Body" : "Did you dun drive a buggy?"
  }, {
    "Username" : "Runstorun",
    "reported" : false,
    "Timestamp" : "2024-12-23 13:54:44",
    "Body" : "Those are great pics! Thanks for sharing"
  }, {
    "Username" : "-SPOF",
    "reported" : false,
    "Timestamp" : "2024-12-23 14:19:29",
    "Body" : "These photos are absolutely stunning! Great work. I especially love the one of the hyena."
  }, {
    "Username" : "DSkyUI",
    "reported" : false,
    "Timestamp" : "2024-12-23 15:08:08",
    "Body" : "Dude where did you come from, I want to do something similar for a while now.\n\nHow much did it cost? What are the details? Car? Average daily expense? Fuel? Food? How long were you there?"
  }, {
    "Username" : "caution_wet_paint",
    "reported" : false,
    "Timestamp" : "2024-12-22 19:10:45",
    "Body" : "Amazing photos! So many delicious animals"
  }, {
    "Username" : "Due_Doughnut2852",
    "reported" : false,
    "Timestamp" : "2024-12-22 19:45:12",
    "Body" : "Thanks for the post! Can you please provide some specifics/details around where you rented the car from, how much it cost, what kind of vehicle (4x4, I assume), did you drive solo or with a partner, etc.? I ask because I'm considering a solo trip in Southern Africa, including Namibia, and I've been told that it's better to drive with someone in case you get stuck in the mud (in the rainy season) or sand dunes, etc."
  }, {
    "Username" : "loftySeat",
    "reported" : false,
    "Timestamp" : "2024-12-22 20:54:57",
    "Body" : "Thank you for the captions!"
  }, {
    "Username" : "National-Actuary-547",
    "reported" : false,
    "Timestamp" : "2024-12-22 21:30:55",
    "Body" : "I brought my Fuji XS10 with a single 55-200mm zoom objective. And my google pixel phone. I used the phone for wide landscape images whenever I couldn't capture the whole scene with my camera.\n\nI had to get quite close to the animals (less than 3 meters away) to capture the portraits with my camera so a bit more zoom range would've been nice at times."
  }, {
    "Username" : "National-Actuary-547",
    "reported" : false,
    "Timestamp" : "2024-12-22 19:17:15",
    "Body" : "The roads are mostly in good condition but there are a lot of gravel roads so there is always the risk of getting a flat tyre but that is easy to fix as most rental companies will give you two spare tyres and there are plenty of repair shops even in the countryside. Police is usually nice too, didn't have to pay any bribes. \n\nPetrol is easy to get and widely available. The only place where you might have difficulties to fill up the car is inside Etosha national park as the gas stations inside the park might not sell you more than 20 litres at once so it's best to fill up outside the park to have enough range.\n\nThe biggest danger is driving too fast on the gravel roads. A lot of tourists have accidents there because they are on a tight schedule and race between destinations. It's best to take it slow. Other than that it's a safe country to visit for tourists."
  }, {
    "Username" : "Living_Injury_636",
    "reported" : false,
    "Timestamp" : "2024-12-22 19:44:00",
    "Body" : "Do not speed because the cops are definitely on the lookout. Also, gas stations are much more infrequent than in the U.S., but they are nice and safe. Driving on sand or gravel roads is dangerous, but if you rent a car, the agency will force you to watch a short training video which helped me feel more comfortable. Also, rental car insurance does not cover tires or windshields."
  }, {
    "Username" : "National-Actuary-547",
    "reported" : false,
    "Timestamp" : "2024-12-22 21:01:03",
    "Body" : "Zebras are very picturesque animals. If you like them then I can only recommend you to fly to Kenya to see the grevy zebras in the Samburu National Reserve. They have very fine stripes and a beautiful wooden brown nose along with reddish-brown hair tips."
  }, {
    "Username" : "National-Actuary-547",
    "reported" : false,
    "Timestamp" : "2024-12-22 21:34:25",
    "Body" : "Very safe. Didn't hear about any violent crime against tourists and always felt very safe and welcome. Police is very friendly and helpful too. You won't get robbed on the road, at least not in the tourist areas in the middle of the day.\n\n  \nThe biggest risk is driving too fast and losing control of the car on gravel or sand roads."
  }, {
    "Username" : "soil_nerd",
    "reported" : false,
    "Timestamp" : "2024-12-22 21:24:41",
    "Body" : "Namibia is pretty safe. I never felt unsafe while there and have been to all the places OP went."
  }, {
    "Username" : "National-Actuary-547",
    "reported" : false,
    "Timestamp" : "2024-12-22 19:34:57",
    "Body" : "They have everything from simple campgrouds to luxurious lodges. Overall very affordable and with a good western standard. Most lodges have a pool, ac and fridge. The tourism industry is very developed. You can live like a king in the middle of the desert. Or you can put up your tent and enjoy raw nature."
  }, {
    "Username" : "National-Actuary-547",
    "reported" : false,
    "Timestamp" : "2024-12-22 22:17:22",
    "Body" : "Thanks"
  }, {
    "Username" : "National-Actuary-547",
    "reported" : false,
    "Timestamp" : "2024-12-22 23:13:21",
    "Body" : "Yes i did it solo. You don't need a 4x4 in Namibia but i would recommend an SUV because the gravel roads are full of potholes and you have a much better view of the animals from a higher seating position.\n\nYou can do all of Etosha by yourself in a regular car but if you feel like it you can also book game drives from tour operators or lodges. Entrance fee to the etosha park is just around 8 dollars a day. A 3 hour guided game drive around 30-50 dollars. Bird watching is best in the rain season (so this time of the year). All other animals are easier to spot in the dry season as they are forced to visit the waterholes.\n\nIf you want to visit places like Sossouvlei, it's no problem to book a shuttle or tour to take you across the 4x4 roads. That's cheaper to take the shuttle than to rent a 4x4 if you don't use it for any other kind of offroading.\n\nJust as in Oman, you will see plenty of blown tires on the side of the road in Namibia. I had two flat tires. Maybe you are lucky and won't have tire damage but for me it was worthwile to have the car fully insured. Be prepared to change a tire if needed but aside from that the main roads are safe and not difficult to drive on, even a Toyota Corolla would do (or a VW Polo that the locals use). It's just not comfortable in a small car and you don't have good clearance."
  }, {
    "Username" : "National-Actuary-547",
    "reported" : false,
    "Timestamp" : "2024-12-22 22:10:26",
    "Body" : "No, I arrived in Swakopmund having visited Sossouvlei and the Namib Nakuluft park so I didn't feel the need to do another tour to the sand dunes and instead opted to visit places like cape cross. \n\nI saw that there are tons of buggy tours available in Walvis Bay and Swakopmund from local operators."
  }, {
    "Username" : "National-Actuary-547",
    "reported" : false,
    "Timestamp" : "2024-12-22 19:20:18",
    "Body" : "Had many oryx steaks and kudu stews there. Delicious. Could eat that every day. They also have amazing beef on the farms.\n\nIf you're more into eating animals than watching them then it's also a great destination. Barbecue everywhere."
  }, {
    "Username" : "National-Actuary-547",
    "reported" : false,
    "Timestamp" : "2024-12-22 20:06:52",
    "Body" : "I did it solo and rented a 4x4 Toyota Hilux from Europcar (the big rental companies at the airport are all good and provide very reliable and new cars). Cost was around 90 dollars a day + an additional 200 dollars for full coverage insurance (external from Discovercars,, they later compensated me fully for two tyre repairs). \n\nThere are a lot of tourists around so it's usually no problem if you get stuck during the day, just don't drive alone in the evening or at night. The big rental companies also all have 24 hours support hotlines (even though some remote areas have no cellular network). I had one tyre burst and another one deflated. Both times people stopped to help. I also changed the tyre for another group of stuck tourists who weren't able to change the tyre themselves. And there are plenty of repair shops who will provide you a new tyre and fix any issues on the car.\n\nIf you only drive the main roads then you don't need a 4x4 (also not for Etosha). A simple SUV with a good clearance and high seating position is enough. If you want to go offroad or drive on sand then a 4x4 is a must. \n\nIf you go anywhere offroad to see wildlife or nature (like for example the forest elephants in the riverbed or on some sand dunes) then it's best to take a local guide with you who will sit next to you and guide you. This is a person that will show you where to find wildlife and they can also arrange for a local to tow you out of the sand if you get stuck. A tourist travel partner won't be of big help if you need to be towed from a riverbed full of elephants.\n\n  \nHaving said that, there are also tours to the sand dunes and river elephants with local drivers so you don't need to drive any challenging routes if you don't want to."
  }, {
    "Username" : "Chypsylon",
    "reported" : false,
    "Timestamp" : "2024-12-22 22:29:46",
    "Body" : "I also was there solo this year in late May. 4x4 is not needed for the main routes and Etosha. Still the roads can be pretty corrugated and bumpy so something with at least high clearance is recommended.\n\nThat said I went with a 4x4 truck (Toyota Hilux) with rooftop tent from namibia2go. It was about 1700€ with all camping equipment and full insurance for 17 days. I absolutley recommend to also go beyond the main routes and explore the desert and other remote places if you have the time. Of course you really need to have a safety system in place here in case you get stuck somewhere and bring enough water and food. Either tell someone you trust to call for help if you don't check in with them in time or bring a satellite messenger like a garmin inreach. \n\nOne highlight \"offorad\" for me was going to the Messum Crater from Cape Cross. Knowing you're the only human being in a vast radius together with the otherworldly landscape really is a magical experience. https://vgy.me/album/5qcCMrAB\n\nThe other was camping in the middle of the Namib-Naukluft national park. There are several primitive, unmanned campsites where you need to get a cheap permit beforehand. The sites are very far from each other so you don't notice the presence of other people. When I was there I checked out all of them and they were all unoccupied anyway. The ones at Blutkuppe seemed very nice and not that long of a drive but the one at the [Rock arch](https://maps.app.goo.gl/Qbc4XEs2oJawzoaD8) are just stunningly beautiful: https://vgy.me/album/4yzvQ6om\n\nEtosha, Spitzkoppe and Sossusvlei are in every guide book anyway and are really worth the visit. If you don't have a lot of time I would skip the south with Fish river canyon and Lüderitz for the first visit tbh. Not that it's bad but it's just a really long-ass drive better spend exploring sights not as distant.\n\nAmeib Farm with Phillips Cave and Bulls Party rock formations are not that well known but also really worth staying and exploring. The best commercial campsite I stayed at was \"At Kronenhof\". Huge private bathroom and kitchen building for every campsite and the couple running the farm is just so friendly and hospitable."
  }, {
    "Username" : "segacs2",
    "reported" : false,
    "Timestamp" : "2024-12-22 22:59:53",
    "Body" : "Thanks! I'm tempted to take my Sony RX10 on an upcoming safari trip, which goes up to 600mm zoom. But the weight is a real impediment; the camera alone weighs over 1kg."
  }, {
    "Username" : "zoumbou7",
    "reported" : false,
    "Timestamp" : "2024-12-22 19:37:59",
    "Body" : "Thanks v much, appreciate the time to write this. It’s very helpful"
  }, {
    "Username" : "National-Actuary-547",
    "reported" : false,
    "Timestamp" : "2024-12-22 20:19:57",
    "Body" : "You can get full coverage insurance from external companies like Discovercars. They compensated me 400 dollars for 2x tyre damage without any problems. Insurance cost was around 10 dollars a day for full coverage."
  }, {
    "Username" : "elvis_dead_twin",
    "reported" : false,
    "Timestamp" : "2024-12-23 01:44:00",
    "Body" : "We've purchased our flights for next September, but haven't booked rental vehicle or any accommodations.  How far in advance did you book everything?"
  }, {
    "Username" : "National-Actuary-547",
    "reported" : false,
    "Timestamp" : "2024-12-22 23:28:14",
    "Body" : "That's excellent if you want to capture hunting scenes. I find that in the national parks in Southern and Eastern Africa the animals are quite used to humans so they won't be shy and can come really close. But the wild animals outside the reservoirs will often run away as soon as they spot a human in the distance. So for capturing any wildlife outside the top tourist destinations a 600mm would be perfect."
  }, {
    "Username" : "NotMalaysiaRichard",
    "reported" : false,
    "Timestamp" : "2024-12-23 07:29:11",
    "Body" : "Unless you’re backpacking or hiking, a large camera with a lens with reach isn’t an issue."
  }, {
    "Username" : "National-Actuary-547",
    "reported" : false,
    "Timestamp" : "2024-12-23 07:51:28",
    "Body" : "Around 2-3 weeks in advance during the shoulder season in November.\n\nWhat you should book early during the main season: Accommodation in Etosha park (it was no problem in November but there are not many camps and lodges inside the park and they can fill up quickly). Book directly through the government website.\n\nBook the car early. The 4x4 and camping trucks sell out the quickest. If you're too late you might be forced to use a sketchy local rental agency with old and unreliable cars and no roadside assistance. Book either through the big rental companies at the airport or a reputable local provider like Namibia2go.\n\nMany accomdations could've been booked spontaneously on the same day during my time there so you don't need to pre-book for every day if you prefer a spontaneous trip. I did no camping only lodging and had no issues to find accommodation."
  }, {
    "Username" : "segacs2",
    "reported" : false,
    "Timestamp" : "2024-12-23 13:44:07",
    "Body" : "12kg bag weight limit though..."
  }, {
    "Username" : "elvis_dead_twin",
    "reported" : false,
    "Timestamp" : "2024-12-23 14:52:18",
    "Body" : "Thank you for your response.  This is super helpful."
  } ]
}