{
    "post_title": "Basic Tourist Information",
    "post_author": "nechered",
    "post_score": 189,
    "post_url": "https://www.reddit.com/r/oslo/comments/4tkbye/basic_tourist_information/",
    "comments": [
        {
            "author": "PinguMoN",
            "body": "Very nice! This should definitively be a sticky or in the sidebar.",
            "score": 4,
            "created_utc": 1468928135.0
        },
        {
            "author": "boJmoT",
            "body": "Great post, thank you very much.\n\n\nAre there any outdoor activities you (or anyone) would recommend to do in the winter (end of December, early January) ?",
            "score": 3,
            "created_utc": 1468928795.0
        },
        {
            "author": "A2-",
            "body": "Thanks for the recommendation for Tilt Bar. Been there today and having lots of fun. Due to the pandemic only the retro console tables in the booths are in operation. Buy tokens at the bar.",
            "score": 3,
            "created_utc": 1639238967.0
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 2,
            "created_utc": 1471610008.0
        },
        {
            "author": "nbarchha",
            "body": " Where is that amazing Icecream pictured from?",
            "score": 2,
            "created_utc": 1640646477.0
        },
        {
            "author": "retiredslacker01",
            "body": "We’re visiting for 13 nights in June/July. Thinking of splitting 4 nights Oslo; 3 nights city B; 3 nights city C; 3 nights Oslo with cities B and C a few hours by train. Does this make sense? If so, what are good options for cities B and C? \n\nMiddle aged men who like to do walking tours and chill in interesting places. \n\nDoes it make more sense to stay the entire time in Oslo and add day trips?",
            "score": 2,
            "created_utc": 1653437345.0
        },
        {
            "author": "bourbonpie",
            "body": "Thank you for this list! Just a heads up that it looks like Olympen is closed so it may need to be removed",
            "score": 2,
            "created_utc": 1660461657.0
        },
        {
            "author": "Sigg3net",
            "body": "Veldig bra! Da vi reiste til Barcelona brukte vi /r/Barcelona sin egen wiki/FAQ for reisetips. Kanskje vi kunne fått til noe like utfyllende?",
            "score": 1,
            "created_utc": 1474209559.0
        },
        {
            "author": "krlaevnglsta",
            "body": "has anyone taken their pcr test or know someone who did at radisson blu plaza with klinnik spero? how long did it take for you to get your results?thanks",
            "score": 1,
            "created_utc": 1641205102.0
        },
        {
            "author": "EasyWanderer",
            "body": "Great tips, thanks for the info. I just arrived today and this help getting around in the city, planning where to go/when to go. One tip from me, always check bus vs train prices at the airport. Surprisingly train was cheaper than bus today and much faster, didn’t understand why but not gonna question something good :) That dessert soft-is is very delicious, I would recommend everyone to try",
            "score": 1,
            "created_utc": 1659816981.0
        },
        {
            "author": "None",
            "body": "The Airport Express buses are back up and running. They can be very useful if you're going to somewhere not Oslo Central Station. The cost is 199 for a single ticket, or 349 if you buy a return (valid for exchange within 30 days, and each ticket is redeemable for any departure on your chosen date)",
            "score": 1,
            "created_utc": 1661502921.0
        },
        {
            "author": "Criticalan99",
            "body": "Found some cheep Ryanair tickets for Oslo Torp so I'm planning on visiting Oslo. Since I'm from coming from Croatia (not a wealthy country) what are you recommendations. Can I have a normal touriat trip or is Oslo too expensive?",
            "score": 1,
            "created_utc": 1666049391.0
        },
        {
            "author": "cru-sad",
            "body": "Thanks for the thread!\n\nI'm searching for someone to go around next weekend in Oslo so if someone want to go around with an italian guy i would be glad to have some company :)",
            "score": 1,
            "created_utc": 1667127561.0
        },
        {
            "author": "AvaluggTheBrave",
            "body": "Thank you!",
            "score": 1,
            "created_utc": 1668012714.0
        },
        {
            "author": "nechered",
            "body": "I was hoping that, and that redditors would also contribute or correct errors I have made.",
            "score": 8,
            "created_utc": 1468928276.0
        },
        {
            "author": "lightwrangler",
            "body": "How about sledding in [Korketrekkeren](http://www.visitoslo.com/en/product/?TLp=182035) (the corc screw)?\n\n",
            "score": 4,
            "created_utc": 1468935614.0
        },
        {
            "author": "nechered",
            "body": "Not doing enough is a common feeling, I always get that after being on vacation. The important thing is that you enjoyed yourself.  \nAnd thanks :)",
            "score": 2,
            "created_utc": 1471610342.0
        },
        {
            "author": "nechered",
            "body": "The picture is taken outside Nationaltheateret station, bought it on the Narvesen on the outside of the station",
            "score": 3,
            "created_utc": 1640686603.0
        },
        {
            "author": "bullfinch",
            "body": "Great job!",
            "score": 2,
            "created_utc": 1468934057.0
        },
        {
            "author": "nechered",
            "body": "Or Ice skating (added both to the list)",
            "score": 2,
            "created_utc": 1469009118.0
        },
        {
            "author": "nechered",
            "body": "Thanks! Added some information, hopefully the mods will think its good enough to be a sticky :)",
            "score": 2,
            "created_utc": 1469009209.0
        }
    ]
}