{
    "post_title": "Weekly Q&A Megathread. Please post any questions about visiting, tourism, living, working, budgeting, housing here!",
    "post_author": "AutoModerator",
    "post_score": 5,
    "post_url": "https://www.reddit.com/r/london/comments/1h4h61h/weekly_qa_megathread_please_post_any_questions/",
    "comments": [
        {
            "author": "polkadotska",
            "body": "Want suggestions on things to do this week? Check out [this post](https://new.reddit.com/r/london/comments/1h4uze2/mustsee_things_to_do_in_london_this_week/) for some great ideas!",
            "score": 1,
            "created_utc": 1733148645.0
        },
        {
            "author": "maat7043",
            "body": "About to visit the pub. What is the beer you would have me try?\n\nI am from the US southeast and like just about every type of beer. I don’t prefer light beers much.\n\nSo far I’ve had:\n\n**Tribute** *Pale Ale* by St. Austell (7/10 ⭐️)\n\n**Ruddles** *English Ale* by Greene King (4/10 ⭐️)\n\n**Ruby Beer** *Ruby Beer* by Hobgoblin (5/10 ⭐️)\n\nWhat should I try before I leave?\n\nP.S. shoutout to **The William Morris** in Hammersmith. Incredible place. I wish I could take it home with me.",
            "score": 3,
            "created_utc": 1733158388.0
        },
        {
            "author": "bfm211",
            "body": "Random question (hopefully allowed) - can anyone recommend a tiler? I'm in Islington, but I guess it doesn't matter if they are willing to travel.",
            "score": 2,
            "created_utc": 1733153143.0
        },
        {
            "author": "Abc1112233",
            "body": "Hey there! I'll be visiting London from Chile next month and I've been looking for a vinyl record store with a hardcore/punk/post-hardcore/screamo/emo catalog, I checked some stores on google but I couldn't find anything like what I'm searching, if anyone know something I much appreciate some leads! thank you so much!\n\nFor reference similar to [this one](https://specialistsubjectrecords.co.uk/), in Bristol.",
            "score": 2,
            "created_utc": 1733258925.0
        },
        {
            "author": "mralistair",
            "body": "Fyi anyone asking about NYE should see this post\nhttps://www.reddit.com/r/london/comments/1h553k8/the_complete_guide_to_london_new_years_eve_parties/?utm_source=share&utm_medium=mweb3x&utm_name=mweb3xcss&utm_term=1&utm_content=share_button",
            "score": 2,
            "created_utc": 1733254995.0
        },
        {
            "author": "TheUndertakersPubes",
            "body": "Staying at the Z hotel at the strand and have £60 limit from work for Dinner. Any recommendations?",
            "score": 1,
            "created_utc": 1733156975.0
        },
        {
            "author": "midwesterndog",
            "body": "I am relocating to London later this month and looking for places to live! My flat-hunting is slightly complicated by the fact that I have muscular dystrophy and have trouble stair climbing, so I need to be near public transportation that is step-free and have a lift in my building. Any recommendations on the Elizabeth line (or any other line similarly accessible to the disabled)? So thankful for any suggestions xx\n\n(For reference hoping for a one-bedroom near green spaces walkable to shops/pubs/restaurants. May be wishful thinking though!)",
            "score": 1,
            "created_utc": 1733165887.0
        },
        {
            "author": "tatooinewanderer",
            "body": "Does anyone know what the mulled wine prices are like around trafalgar square christmas market? (If there is mulled wine that is!)",
            "score": 1,
            "created_utc": 1733258287.0
        },
        {
            "author": "Kewtn",
            "body": "Best place to meet people to socialize with? Solo traveling",
            "score": 1,
            "created_utc": 1733301074.0
        },
        {
            "author": "Roper1537",
            "body": "I had pints at Ye Olde Cheshire Cheese, Bank of England and Cittie of York the other day. Some cracking pubs in that area. Cittie was my favourite.",
            "score": 1,
            "created_utc": 1733309743.0
        },
        {
            "author": "Pusheensaurus_rawr",
            "body": "Has anyone been to the National Portrait Gallery recently (esp. any disabled Redditors)?\n\nVisiting w. walker for an event soon. How bad is the bag search queue these days?\n\nGot told I need to be at ticket desk at least 15 mins early, due to escort needed, but how long is it actually taking to get inside these days?",
            "score": 1,
            "created_utc": 1733311553.0
        },
        {
            "author": "almostadultingkindof",
            "body": "How to dress for the weather?\nHeaded to London next week, and will be doing a lot of walking around outdoors. Coming from my home, where feels like temps are 6°F today, my knee length down puffer coat feels a bit overkill and I don’t love being in something super bulky in a congested urban setting. Last time I was in London in early October, we would go down into the tube and it would be so hot, is it still like that in December? All that being said, how much do I really need to be bundling up?",
            "score": 1,
            "created_utc": 1733315857.0
        },
        {
            "author": "Inevitable-Way645",
            "body": "Quickest route from Euston to Richmond Park?",
            "score": 1,
            "created_utc": 1733353743.0
        },
        {
            "author": "BrilliantLock8292",
            "body": "Winter wonderland in saturday sold out\n\nHey there, this Saturday I am planning to visit winter wonderland, I have a flight so I need to be taking the train to the airport at 7:30pm/8pm max! I am trying to book a ticket after the sunset like 4:00pm or 5pm to cisit winter wonderland for one hour and see some xmas lights, I can see that this slots are fully booked online. There is one slot after 8:00pm and then really early at 1:00pm but I can’t waste 3 hours to wait for the lights. Do they sell tickets too there if I go at 5pm?",
            "score": 1,
            "created_utc": 1733357924.0
        },
        {
            "author": "Quapuzi1313",
            "body": "Weird question maybe but I‘m going to London this weekend and in the past year I‘ve heard a lot about many phones being stolen. So I‘m wondering is it really that bad? As a tourist is it \"safe\" to take pictures on the street without worrying that someone will run past and snatch my phone away?",
            "score": 1,
            "created_utc": 1733386434.0
        },
        {
            "author": "nagem12",
            "body": "Hello!\nAny suggestions for creepy spots—oddities, death museums, dark tourism spots? I’ll be in London from the US on Sunday Dec 15 & Saturday Dec 16 and Friday Dec 20. Thanks!",
            "score": 0,
            "created_utc": 1733224498.0
        },
        {
            "author": "freshlocalproduce",
            "body": "How can I spend my leftover cash? Been visiting for the past few weeks and am looking to spend my leftover cash. I’ve found London to be mostly cashless, so I was wondering if people know if any restaurants/stores still take cash. Do certain areas ie Chinatown take more cash than others? Would appreciate and recommendations and/or advice :)",
            "score": 0,
            "created_utc": 1733180614.0
        },
        {
            "author": "Schutz01",
            "body": "What jacket should I buy if I am visiting the city between the 2nd and the 3rd week of January 2025. I am considering a \"TNF Arrowood Triclimate\" along with my insulated vest. Would it be enough?",
            "score": 0,
            "created_utc": 1733204942.0
        },
        {
            "author": "pandaaaa26",
            "body": "Anybody have any recommendations for the best place to get a good grilled cheese with tomato soup within walking distance of Waterloo?",
            "score": 0,
            "created_utc": 1733248479.0
        },
        {
            "author": "bydg",
            "body": "Five Points Brewery pints are good, based in Hackney but in quite a few pubs",
            "score": 1,
            "created_utc": 1733164617.0
        },
        {
            "author": "mralistair",
            "body": "Old breweries:   Tom Taylor landlord \nHarvey's best bitter.\n\n\nNew.\n Kernel\nHowling hops if you like more tropical stuff\nFive points \nElb ",
            "score": 1,
            "created_utc": 1733177421.0
        },
        {
            "author": "mralistair",
            "body": "Gypsy hill hepcat.",
            "score": 1,
            "created_utc": 1733181622.0
        },
        {
            "author": "wwisd",
            "body": "Nextdoor is usually better at these sort of questions (as it often location dependent).",
            "score": 2,
            "created_utc": 1733158577.0
        },
        {
            "author": "Roper1537",
            "body": "A local FB group would be a good resource too",
            "score": 1,
            "created_utc": 1733239425.0
        },
        {
            "author": "wwisd",
            "body": "Any sort of food you (don't) like?",
            "score": 2,
            "created_utc": 1733158510.0
        },
        {
            "author": "mralistair",
            "body": "Chettinad Percy street.",
            "score": 2,
            "created_utc": 1733177467.0
        },
        {
            "author": "wwisd",
            "body": "[The wiki](https://www.reddit.com/r/london/wiki/living) has some general resources. What's your rough budget? That might help narrow down options.",
            "score": 2,
            "created_utc": 1733172006.0
        },
        {
            "author": "mralistair",
            "body": "How are you with escalators?   Remember a lot of lines have those but not technically step free (for example blackhorse road)    and there are a lot of new flats there (Google build to rent to see the seem sort of thing)\n\n\n\n\nEg blackhorse mills,  equipment works, fizzy living.",
            "score": 2,
            "created_utc": 1733177247.0
        },
        {
            "author": "mralistair",
            "body": "I'll add one more thing.   There is a significant advantage of having a station which has 2 lines going through it.  As you get a backup.  Which in your case might be a significant difference.\n\n\nSo worth considering ",
            "score": 2,
            "created_utc": 1733241733.0
        },
        {
            "author": "prettypwny",
            "body": "Not to over-complicate matters but it is worth trying to live near a station that has other step-free options nearby (another step-free station, or a useful bus route) otherwise when the lift/escalators inevitably go down you are royally screwed. I live near a step-free Tube stop that's been without a lift for almost the entire year and the ability to walk to the next stop along or take a bus into town without adding huge amounts of time to my journey has been super valuable. DLR is a good shout for this as the stops are really close together and one broken lift rarely means a complete loss, further into South London you will find your options more limited.",
            "score": 2,
            "created_utc": 1733241806.0
        },
        {
            "author": "bydg",
            "body": "You could look at Brockley - step free station with train that goes to Canada Water for step free (when the lifts work 🙄) access to Jubilee line and to Whitechapel for Elizabeth line. It’s a nice area, just a bit hilly!",
            "score": 1,
            "created_utc": 1733178066.0
        },
        {
            "author": "burnin_potato69",
            "body": "I've seen it creep up to £8-10",
            "score": 1,
            "created_utc": 1733400100.0
        },
        {
            "author": "BulkyAccident",
            "body": "Hostel bars, [meetup.com](https://meetup.com) meets.",
            "score": 3,
            "created_utc": 1733304368.0
        },
        {
            "author": "polkadotska",
            "body": "Keep an eye out for anything of interest on r/LondonSocialClub (or organise your own pub night!).",
            "score": 1,
            "created_utc": 1733320261.0
        },
        {
            "author": "mralistair",
            "body": "Micropubs.  Are generally friendly.  More in residential areas.   ",
            "score": -1,
            "created_utc": 1733307590.0
        },
        {
            "author": "mralistair",
            "body": "I always forget which are the sam smiths pubs and so I never snoop around there.   I'm a ye olde mitre man myself ",
            "score": 3,
            "created_utc": 1733329819.0
        },
        {
            "author": "prettypwny",
            "body": "I have been a couple of times in the last few months (at weekends) and the bag queue took maybe 2 minutes. However the lift from the bag search to the ticket desk (assuming the exhibition ticket desk which is one floor up) is terrible and lots of people use it who really don't need it, so I would budget 5 minutes in for waiting for it to turn up.",
            "score": 3,
            "created_utc": 1733348399.0
        },
        {
            "author": "mralistair",
            "body": "Bag search was super fast with a notably jolly chap last time I went in (weekday iirc) \n\n\nI think your 15 mins will be for assistance not bag check.  I bet you'll be through mush quicker than that... Maybe at events it will be worse.as everyone turns up at once but they seemed very on the ball",
            "score": 2,
            "created_utc": 1733329770.0
        },
        {
            "author": "BulkyAccident",
            "body": "We just layer here, because the weather's extremely changeable day to day (and often hour by hour). Yes, the tube is often hot and steamy. A lighter coat will be fine if you've got a decent amount of stuff underneath it and hat/scarf you can take on and off when needed.",
            "score": 5,
            "created_utc": 1733327920.0
        },
        {
            "author": "mralistair",
            "body": "Tube is still warm.. but not crazy hot.\n\n\nLayers and hats is what you want.   Unless doing a lengthy time outdoors ",
            "score": 4,
            "created_utc": 1733329908.0
        },
        {
            "author": "1Moment2Acrobatic",
            "body": "The park is large so it depends where in the park you're aiming for. There are no stations right by the park gates. From Euston I'd get the Victoria line to Vauxhall then go up to the railway platforms and get a train to Richmond or Mortlake. \n\nIf you go to Richmond, have a walk around the pleasant town then up the hill to the park's Richmond gate. If you go to Mortlake walk south to Sheen gate.\n\nIf you wanted the south side of the park, for example Isabella plantation, then you could try the train to Norbiton then walk to Kingston gate.",
            "score": 2,
            "created_utc": 1733401120.0
        },
        {
            "author": "wwisd",
            "body": "Depends on the time of day, use Citymapper (link in the OP) to see your options.",
            "score": 1,
            "created_utc": 1733376362.0
        },
        {
            "author": "mralistair",
            "body": "Which part of the park? It's huge.  Probably victoria line to victoria then distract to Richmond/ Putney ",
            "score": 1,
            "created_utc": 1733391660.0
        },
        {
            "author": "mralistair",
            "body": "Save yourself the hassle and go ice skating in Somerset house instead.   Or just see the Christmas lights and drink something .   (Seven dials has quite nice lights with a pub underneath).\n\n\nI doubt they sell tickets on the door but I may be wrong.",
            "score": 2,
            "created_utc": 1733391575.0
        },
        {
            "author": "mad153",
            "body": "If you want to see Christmas lights, there's other options. \n\nIf it says it's sold out, it will be very very busy. I wouldn't even bother trying. \n\nWhen/ where is your flight leaving?",
            "score": 2,
            "created_utc": 1733391929.0
        },
        {
            "author": "LJA0611",
            "body": "Winter Wonderland is essentially just a (very busy) funfair and drinking venue. \n\nNot really somewhere you would go to see lights - for that go to the shopping streets suggested in other comments ",
            "score": 2,
            "created_utc": 1733401394.0
        },
        {
            "author": "mralistair",
            "body": "Depends.  It's pretty bad but not like it's happening on every street every hour.  \n\n\nBasically they are usually on fast silent electric bikes so if you are waving your phone around. Look around first and avoid doing it at the edge of the pavement/ road.  \n\n\nMost common times it happens is outside a tube as everyone looks at their texts and maps as soon as they get out.  If you are doing this face against a wall or away from the roadway\n\n\nBut even without following this advice it's like a 1:10000 chance something would happen.  (But that means it happens 50 times a day ) *\n\n\n* These numbers are made up",
            "score": 5,
            "created_utc": 1733391434.0
        },
        {
            "author": "Angel_Omachi",
            "body": "Grant Museum of Zoology has lots of weird dead things in jars. A tour of Highgate Cemetery also might be your thing.",
            "score": 3,
            "created_utc": 1733228787.0
        },
        {
            "author": "wwisd",
            "body": "The old operating theatre museum at St Thomas' - stuff they used to do surgeries in the 1800s. That's quite creepy now. Same for the Hunterian Museum, hosted by the royal college of surgeons.",
            "score": 3,
            "created_utc": 1733229169.0
        },
        {
            "author": "maat7043",
            "body": "Hunterian Museum. We just went there today since we were close and it was free, but it was very cool.\n\nIt’s put on by the Royal College of Surgeons and it’s absolutely chock full of ever variety of cadaver you can think of.",
            "score": 3,
            "created_utc": 1733260352.0
        },
        {
            "author": "Adamsoski",
            "body": "Sir John Soane's Museum.",
            "score": 2,
            "created_utc": 1733234406.0
        },
        {
            "author": "BulkyAccident",
            "body": "Look on Atlas Obscura.\n\n[https://www.atlasobscura.com/things-to-do/london-england](https://www.atlasobscura.com/things-to-do/london-england)",
            "score": 1,
            "created_utc": 1733304406.0
        },
        {
            "author": "Petrunka",
            "body": "You might like the Viktor Wynd Museum:  [https://thelasttuesdaysociety.org/museum/](https://thelasttuesdaysociety.org/museum/)",
            "score": 1,
            "created_utc": 1733328289.0
        },
        {
            "author": "mralistair",
            "body": "Lots will still take it,  but we don't run a list.   The older the business (or less hipster) the better.\n\n\nNot many pubs are cashless ",
            "score": 4,
            "created_utc": 1733182984.0
        },
        {
            "author": "Watchblah3333",
            "body": "Most stores will take cash, as will most restaurants",
            "score": 3,
            "created_utc": 1733214630.0
        },
        {
            "author": "polkadotska",
            "body": "Depending on how much cash you’re talking, Fortnum & Mason definitely accepts cash and is good for fancy foodie souvenirs.",
            "score": 2,
            "created_utc": 1733209916.0
        },
        {
            "author": "Academic-Bug-4597",
            "body": "You can spend it in any normal business. Almost nowhere in London is cashless.",
            "score": 1,
            "created_utc": 1733272099.0
        },
        {
            "author": "wwisd",
            "body": "So that's a Northface rain jacket, for anyone else commenting. Yeah, probably good to have something at least water resistant, but that's quite expensive so a bit overkill if you're only going to use it for this trip. \n\nThough obviously depends on your plans. If you're going hiking or something else that would mean being outdoors all day, then being prepared is key. If you're just touristing around London, an umbrella and a £10 Primark raincoat or a poundland poncho will do the job too. \n\nOverall: we don't know what the weather will be in Jan. It's very unpredictable and changeable here. Might be freezing with clear blue skies or wet and windy and 15C. Or anything in between, and different every day. Layers are key for dressing in London.",
            "score": 5,
            "created_utc": 1733210086.0
        },
        {
            "author": "mralistair",
            "body": "Live like a local.\n\n\n\n\nT shirt and shorts.\n\n\nIf you aren't planning on being outdoors all day then a normal jacket vest and jumper will be fine.   If the forecast is really bad pop to sports direct for a cheap base layer.",
            "score": 2,
            "created_utc": 1733241114.0
        },
        {
            "author": "prettypwny",
            "body": "Come at me if you like, but I really rate Pret's tomato soup, and they do a serviceable cheese toastie too.",
            "score": 4,
            "created_utc": 1733326394.0
        },
        {
            "author": "maat7043",
            "body": "I enjoyed the 5 points standard pale ale 🍺",
            "score": 1,
            "created_utc": 1733165623.0
        },
        {
            "author": "TheUndertakersPubes",
            "body": "Absolutely game for anything and love trying new foods!",
            "score": 1,
            "created_utc": 1733172966.0
        },
        {
            "author": "TheUndertakersPubes",
            "body": "Thanks will check it out!",
            "score": 1,
            "created_utc": 1733226490.0
        },
        {
            "author": "midwesterndog",
            "body": "Thank you so much! Rough budget is £1750-2000 pm :)",
            "score": 1,
            "created_utc": 1733172569.0
        },
        {
            "author": "midwesterndog",
            "body": "I'm great with escalators so this is really good to hear and so SO helpful. Looking into all your built to rent recommendations now.",
            "score": 1,
            "created_utc": 1733184858.0
        },
        {
            "author": "midwesterndog",
            "body": "This is so helpful THANK YOU!",
            "score": 1,
            "created_utc": 1733262085.0
        },
        {
            "author": "midwesterndog",
            "body": "This is not over-complicating things at all! I am so grateful that you've raised this as it's a really important thing to think ahead about and I really want to ensure I'm accounting for this.",
            "score": 1,
            "created_utc": 1733262061.0
        },
        {
            "author": "Kewtn",
            "body": "Thank you!",
            "score": 1,
            "created_utc": 1733305970.0
        },
        {
            "author": "Roper1537",
            "body": "I'll definitely have a look at that one",
            "score": 1,
            "created_utc": 1733333788.0
        },
        {
            "author": "mralistair",
            "body": "In which case you want more layers.\n\n\nLong John's are my new favourite thing",
            "score": 1,
            "created_utc": 1733329932.0
        },
        {
            "author": "BrilliantLock8292",
            "body": "Any better option to see Christmas lights? Thanks",
            "score": 1,
            "created_utc": 1733393203.0
        },
        {
            "author": "BrilliantLock8292",
            "body": "Any better option to see Christmas lights? From heathrow at 9:25 pm Thanks",
            "score": 1,
            "created_utc": 1733393311.0
        },
        {
            "author": "Quapuzi1313",
            "body": "Alright, thank you!",
            "score": 1,
            "created_utc": 1733393864.0
        },
        {
            "author": "Eliavldn",
            "body": "Ethiopian food is my favourite cuisine in london you have to find a good place to have good Ethiopian meal nearest to Strand is Gebeta in Farringdon \n\nThai square is moderate but has some good food\n\nInamo for Japanese / sushi in Covent Garden \n\nMasala zone for Indian if you like Indian food ? Quite economical prices \n\nIf you can travel further around london roti king for Malaysian \n\nLots of places and restaurants under 60£ if eating for one person. Drinks could be little expensive adding onto the bill. Depends on the cuisine.\n\nCan find amazing Ethiopian, Japanese, continental/ethnic cuisines etc",
            "score": 1,
            "created_utc": 1733227374.0
        },
        {
            "author": "mralistair",
            "body": "https://www.google.com/url?sa=t&source=web&rct=j&opi=89978449&url=https://www.transportforall.org.uk/wp-content/uploads/2023/11/avoiding-stairs-tube-guide.pdf&ved=2ahUKEwiTqejsqIuKAxVzXUEAHQhOPCUQFnoECCIQAQ&usg=AOvVaw1L2dZpOlV0vsG11rVT38Bc\n\n\n Is a guide to stations with escalator access. Be warned they may break down once a year, but then you could get off at Tottenham hale and bus it.\n\n\nEdit fixed link.\n\n\nJubilee line, Elizabeth and Victoria probably best for escalator access.   East is generally going to have more new-build flats than west.   \n\n\nStratford is also worth a look. Very very well connected and you have the park and olympic village there.  \n\n\nIn theory all new developments should have 5% of flats kitted out for full level access including showers etc. but they are sometimes fudged. ",
            "score": 2,
            "created_utc": 1733219358.0
        },
        {
            "author": "mralistair",
            "body": "The classic route is Oxford st.  Carnaby street.  Regent street and  old bond street .   All about a 5 minute walk apart. \n\n\n Carnaby st is a bit dull this year. So maybe  do Oxford st.  Regent st.  Bond street and then Piccadilly and look in fortnum and masons windows.\n\n\n  Sloane square is apparently also nice",
            "score": 5,
            "created_utc": 1733393483.0
        },
        {
            "author": "mralistair",
            "body": "Do not leave it that close to get to Heathrow.   You need to be leaving central London at 7 max.  Remember that things go wrong on tubes some times and trains to T4 and T5  are not as regular as the ones to 2/3.\n\n\nIt gets dark at 4 so you've got time to see lights.",
            "score": 3,
            "created_utc": 1733393699.0
        },
        {
            "author": "Angel_Omachi",
            "body": "There's a load of new build flats out around West Drayton/Hayes and Harlington/Southall for the Liz line out west.",
            "score": 1,
            "created_utc": 1733228838.0
        },
        {
            "author": "BrilliantLock8292",
            "body": "I took notes, thanks so much!",
            "score": 2,
            "created_utc": 1733393634.0
        },
        {
            "author": "midwesterndog",
            "body": "Thank you both this is beyond helpful. I've been referring to escalator and lift guide all day today as I look for letting agents.",
            "score": 1,
            "created_utc": 1733262137.0
        }
    ]
}