{
    "post_title": "Weekly Free Talk: Ticket info, Rivals, Other Leagues and more",
    "post_author": "AutoModerator",
    "post_score": 6,
    "post_url": "https://www.reddit.com/r/FCInterMilan/comments/1h2g2a9/weekly_free_talk_ticket_info_rivals_other_leagues/",
    "comments": [
        {
            "author": "Interjectionspod",
            "body": "Just letting everyone know that we're taking this week off from the Pod given what happened in the Fiorentina match. We'll be back next week to recap the Parma match.",
            "score": 4,
            "created_utc": 1733087772.0
        },
        {
            "author": "sandrinho88",
            "body": "I really hope Napoli end up like Juve last year and crumble after so many marginal victories. If a team wins the league other than Inter, i would like it to be Atalanta ",
            "score": 3,
            "created_utc": 1733071813.0
        },
        {
            "author": "Evelyn_pog",
            "body": "Juve drew to Lecce at the very end lol",
            "score": 2,
            "created_utc": 1733090187.0
        },
        {
            "author": "Big_Pick4100",
            "body": "Hey guys, I plan on visiting Italy for the first time in March, which coincides with a game against Udinese. I know it’s not the best game to be my first, but seeing inter play in the San Siro is a dream for me. So my question is: what’s the best section to sit at in the San Siro for the best possible experience? I know nothing about how the sections are divided so any recommendations would be greatly appreciated! Thanks 🙏",
            "score": 2,
            "created_utc": 1733253112.0
        },
        {
            "author": "Cerozz",
            "body": "I honestly think teams like Atalanta, Lazio, Fiorentina, etc. will fall off as the season progresses, they always do. They're good, but ultimately never consistent enough to challenge for the title. They can finish comfortably in CL spots, but if we're aiming for the title, I think they're not our main rivals. So currently the main competition looks to be Napoli, Conte is just efficiently terrorizing his way to the top with marginal wins, it's frustrating to see but clearly works well for them. At this point the positive outlook is that we already have a decent lead over Juventus and Milan, who could be the other 2 main rivals if they gain form and consistency.",
            "score": 1,
            "created_utc": 1733208788.0
        }
    ]
}