{
    "post_title": "Feedback, Ideen und Wünsche Megathread!",
    "post_author": "paulihunter",
    "post_score": 6,
    "post_url": "https://www.reddit.com/r/hamburg/comments/1fa3aky/feedback_ideen_und_wünsche_megathread/",
    "comments": [
        {
            "author": "Qegan",
            "body": "Wohnungsgesuche nerven",
            "score": 19,
            "created_utc": 1725603335.0
        },
        {
            "author": "LajosvH",
            "body": "Autobot, der bei Keywords (Wohnung, Besuch, …) eine zusätzliche Schaltfläche macht mit Verweis auf die Regeln und das Wiki",
            "score": 11,
            "created_utc": 1725612294.0
        },
        {
            "author": "Creative_Onion8363",
            "body": "Wäre für wöchentlichen wohnungsgesuch megathread, vllt ne pinned nachricht wie schwer es ist in hamburg ne wohnung zu bekommen",
            "score": 8,
            "created_utc": 1725639958.0
        },
        {
            "author": "HHinnerk",
            "body": "Ich fände AMA mit Vertreter:innen der öfftl. Verwaltung über Themen, die hier immer mal wieder vorkommen, spannend.",
            "score": 4,
            "created_utc": 1725626115.0
        },
        {
            "author": "dirksn",
            "body": "Kleines Lob hier: das Sub hat sich seit der letzten Offensive schon spürbar verbessert.",
            "score": 5,
            "created_utc": 1725989463.0
        },
        {
            "author": "None",
            "body": "Ein bot der automatisch Wohnungsgesuche schließt.",
            "score": 8,
            "created_utc": 1725611363.0
        },
        {
            "author": "None",
            "body": "Doppel- oder Mehrfachposting wie z.B. zu dem Feuer in Billstedt vor ein paar Tagen bitte mehr löschen und das Thema Wohnungssuche wie schon erwähnt mit den vorhandenen Möglichkeiten klein halten.",
            "score": 2,
            "created_utc": 1725707598.0
        },
        {
            "author": "Sweaty-Boot9993",
            "body": "wunschlos glücklich\ndanke ☺️",
            "score": 1,
            "created_utc": 1725607446.0
        },
        {
            "author": "paulihunter",
            "body": "Ich nutze mal dein Kommentar um auf die Thematik Wohnungssuche einzugehen. Gerade in den letzten Wochen haben die Posts zur Wohnungssuche stark zugenommen, das haben wir auch gemerkt. Wahrscheinlich wird es wirklich Zeit darauf zu reagieren, damit wir nicht r/hamburg_wohnungsmarkt werden.\n\n  \nEin Automod wie u/LajosvH und u/TrueObjective1824 vorgeschlagen haben ist sicher ein guter Anfang. Ob wir Wohnungsgesuche komplett verbieten weiß ich noch nicht, aber vielleicht verweisen wir auf einen Megathread in dem es wirklich **nur** um Gesuche geht, oder filtern diese Posts zur Überprüfung und entscheiden von Fall zu Fall. Gerade extreme low-effort Posts könnte man so rausfiltern.\n\nGenerelle Diskussionen über den Wohnungsmarkt und über Wege Wohnungen zu finden würde ich ungern komplett unterbieten, da das Themen sind die sich mit der Zeit entwickeln und verändern können. Daher kommen sicher auch immer mal wieder neue Punkte auf.",
            "score": 2,
            "created_utc": 1725638456.0
        },
        {
            "author": "paulihunter",
            "body": "Generell wäre ein AMA mal interessant. Hab ich persönlich noch nie mitveranstaltet, aber Reddit hat ein eigenes System für AMAs entwickelt.",
            "score": 2,
            "created_utc": 1725638130.0
        },
        {
            "author": "paulihunter",
            "body": "Hey danke dir. Ich habe unter anderem was hasserfüllte und diskriminierende Kommentare und Posts angeht versucht mehr zu unternehmen und die Automod Funktionen ausgeweitet. Reddit bietet mittlerweile sehr viel automatisierte Unterstützung bei Spam an. Das hat ebenfalls geholfen.",
            "score": 3,
            "created_utc": 1726007459.0
        },
        {
            "author": "paulihunter",
            "body": "Das freut uns natürlich. Sollte doch mal etwas sein, Ideen aufkommen oder ihr in einem anderen Subreddit was cooles entdecken was man hier auch einführen könnte, melde dich gerne ☺️",
            "score": 1,
            "created_utc": 1725638588.0
        },
        {
            "author": "MissMags1234",
            "body": "Finde aber auch, dass generische Fragen nach \"wie kann man ne Wohnung finden\" finden absolut keinen Mehrwert bieten, weil es einfach keine neuen Antworten gibt als die Standardantwort, das wird sich in nächster Zeit auch nicht ändern. Da reicht auch nen gut geschriebenes Wiki. \n\nWas anderes ist es, wenn jemand ganz konkrete Fragen zu nem Gebiet hat.",
            "score": 3,
            "created_utc": 1725643501.0
        },
        {
            "author": "LajosvH",
            "body": "Finde auch nicht, dass das Thema generell verboten gehört. Aber genauso wie bei den ‚was kann ich in 25 Minuten um 3 Uhr nachts machen?‘ Posts: ich glaube, wenn die überhaupt erst vorm Posten mit den Regeln/Wiki ‚konfrontiert‘ werden, dass die dann ganz viele Infos auch finden",
            "score": 2,
            "created_utc": 1725641248.0
        },
        {
            "author": "paulihunter",
            "body": "Leider gibt es keinen Weg zu sehen wie oft das Wiki gelesen wird. Würde mich wirklich interessieren was gut ankommt und wie viele von den automatisierten Hinweisen dazu führen das es geöffnet wird.\n\n  \nIch werde mal versuchen den Automoderator etwas direkter darauf auszurichten auf diese Posts zu reagieren.",
            "score": 3,
            "created_utc": 1725641507.0
        }
    ]
}