{
    "post_title": "FORUM LIBRE : TOURISTS AND RESIDENTS, ASK YOUR COMMON QUESTIONS IN THIS WEEKLY THREAD : Open Forum -- 01, December, 2024",
    "post_author": "RichardHenri",
    "post_score": 1,
    "post_url": "https://www.reddit.com/r/paris/comments/1h4bztq/forum_libre_tourists_and_residents_ask_your/",
    "comments": [
        {
            "author": "Delicious_Wear_3820",
            "body": "i’ll be leaving paris by train at 3pm, are there any good relaxed places to go/things to do? i will have already done most of the touristy things and shopping, I just want some input on a more local way to spend my morning?",
            "score": 1,
            "created_utc": 1733174910.0
        },
        {
            "author": "plategola",
            "body": "We are a couple, 28/30 years old, and we will be in Paris for New Year’s Eve. Could you recommend a nice but not too expensive place to book for dinner on the evening of the 31st? Also, maybe a place to spend midnight and a venue to have a drink afterward.\nThank you very much",
            "score": 1,
            "created_utc": 1733246967.0
        },
        {
            "author": "Phukin_Genius",
            "body": "Ice skating at L’Hotel de Ville, do you have to buy tickets online?",
            "score": 1,
            "created_utc": 1733266394.0
        },
        {
            "author": "NSNF_Kata",
            "body": "Bonjour,\nJe me rends à Paris chaque lundi soir pour mon travail, qui se déroule de 20h à 23h. Je cherche des solutions économiques pour passer la nuit et prendre un train tôt le matin. Auriez-vous des suggestions ?\nMerci!",
            "score": 1,
            "created_utc": 1733275523.0
        },
        {
            "author": "WebsterAllen",
            "body": "Student from the US visiting Paris and I’m wondering if anyone knows great flea markets/thrift stores? Ik most of this info can be found online but I’m wondering if people personally know great places :)",
            "score": 1,
            "created_utc": 1733351266.0
        },
        {
            "author": "SeaworthinessKey3654",
            "body": "So while I'm in Paris in June, I'd love to do a self-guided chocolate and pastry tour. It makes sense, I think, to focus on arrondisments where there is a concentration of shops ...so I'm thinking the 6th and the 8th? \n\nOf course I'll do more research, but I was looking at David Lebovitz's blog when thinking where I'd love to visit. There are also shops in other areas that I'd love to visit, but I need to start somewhere. So do you think focusing on the 6th & 8th is a good idea, and then maybe going to a couple of other more out of the way places? \n\nIf not, I'd love to hear ideas as to how I can make this an amazing and delicious day \n\nOf the below, which are your favorites? \n\nThank you!!! \n\n6th \n\nPierre Herme  \nPoilane  \nJean-Charles Rochoux  \nLe Chocolate Alain Ducasse \nPatrick Roger  \nHenri Le Roux \n\n7th \n\nHugo & Victor \n\n8th\n\nLa Maison du Chocolat \n\n3rd\n\nJacques Genin  \nTout Autour du Pain  \nPain de Sucré  \nFrancois Pralus \n\n2nd \n\nPlaq\nFou de Patisserie \n\n4th\n\nMaison Georges Larnicol \n\nBerthillon (I know, ice cream...but I've dreamed about it ever since I went there years ago) \n\nMaison Aleph \n\n7th \n\nMichel Chaudun \n\n11th\n\nBenoit Castel\nTapisserie \nLa Patisserie  \nBoulangerie Utopie \n\n\n12th\n\nAux Merveilleux de Fred \n\n15th \n\nDes Gateaux et du Pain",
            "score": 1,
            "created_utc": 1733363262.0
        },
        {
            "author": "tslanka",
            "body": "Hi everyone!\n\nI’m Teja Subhash Lanka, an international exchange student from India. I’ll be studying at IPSA University in Ivry-sur-Seine from January 26th, 2024, to June 30th, 2024. I’m currently looking for accommodation near my university, preferably within an 8 km radius. Areas like the 12th, 13th, or 14th arrondissements would be ideal.\n\nMy budget is around €600 per month. I’d love any advice or suggestions for finding a place, or if you know of any available rooms or shared accommodations, please let me know!\n\nThank you so much for your help, and I look forward to joining this beautiful city!",
            "score": 0,
            "created_utc": 1733247639.0
        }
    ]
}