{
    "post_title": "Tourists, visitors, people with quick questions. This is your thread - post your questions here",
    "post_author": "11MHz",
    "post_score": 17,
    "post_url": "https://www.reddit.com/r/Reykjavik/comments/oslx6m/tourists_visitors_people_with_quick_questions/",
    "comments": [
        {
            "author": "No-Plastic-9926",
            "body": "Is anyone awake here now?",
            "score": 7,
            "created_utc": 1627440537.0
        },
        {
            "author": "Sharp_Sherbert6678",
            "body": "Hey everyone! Me and my bf are moving to Iceland, are there any really good sites or groups to find apartments for rent in Reykjavik?",
            "score": 3,
            "created_utc": 1648156940.0
        },
        {
            "author": "Muralshoe4416",
            "body": "Hey yall, do you know any fishing guides/tours for a reasonable price? Or maybe even a place to rent poles. I hear fishing is a must especially this time of year.",
            "score": 2,
            "created_utc": 1627503980.0
        },
        {
            "author": "ilowrideforfun",
            "body": "Where is the best place to purchase a cell phone SIM card? TYIA",
            "score": 2,
            "created_utc": 1628017129.0
        },
        {
            "author": "thefringthing",
            "body": "Is there any reason to prefer one of the Icelandic Handknitting Association's locations over the other?",
            "score": 2,
            "created_utc": 1650999822.0
        },
        {
            "author": "SeriousShane",
            "body": "Is there a place that serves tomato beer/coffee in the city? I'm curious, but I don't have time to visit Friðheimar.",
            "score": 2,
            "created_utc": 1682966643.0
        },
        {
            "author": "Self_proclaimed_wall",
            "body": "We have a competition of who can find the funniest logo or sign. Where is a funny sign or logo in reykjavik?",
            "score": 1,
            "created_utc": 1718096496.0
        },
        {
            "author": "NeetyThor",
            "body": "We are going to a friend’s wedding in Calgary in September and our flight from Budapest goes via Reykjavik; but we only have one night there. 😫  So annoying, we’ve always wanted to go to Iceland and this is such a stupidly short stopover but we couldn’t extend it. Anyway, is there anything to see on a Monday night in Reykjavik….. you know, before we have to go to bed and have a quick nap before we have to catch our flight the next morning? Thanks.",
            "score": 1,
            "created_utc": 1718275122.0
        },
        {
            "author": "Sure-Credit-8137",
            "body": "Hi all, I need to do a blood pregnancy test while in Reykjavik.\nIs there any walk in laboratory to do it? Do I need an appointment?\n\nThank you",
            "score": 1,
            "created_utc": 1718323908.0
        },
        {
            "author": "InMooseWeTrust",
            "body": "Do I need to use cash? I will be bringing a credit and debit card in US dollars that accept foreign transactions. I also have cryptocurrency.\n\nDo I need a visa with my US passport?",
            "score": 1,
            "created_utc": 1718446414.0
        },
        {
            "author": "Vegetable_Divide_770",
            "body": "Hi! Where can I buy earmuffs in Reykjavik?",
            "score": 1,
            "created_utc": 1718913241.0
        },
        {
            "author": "guyonabuffalo",
            "body": "Hi Reykjavik! I’m here with three friends on a bicycle tour of your lovely country and we are in need of a place to store our empty cardboard bike boxes for the next two and a half weeks. Anyone have or know of some storage space? Happy to pay some $$ if need be",
            "score": 1,
            "created_utc": 1721658573.0
        },
        {
            "author": "mulberrybushes",
            "body": "Trying to find out more about culture night, the website that the English part of the website asks if you want to participate, but it seems to be for people who want to exhibit or host. Do you have to buy tickets to participate as a tourist?",
            "score": 1,
            "created_utc": 1723895636.0
        },
        {
            "author": "lilladyx",
            "body": "Anyone going travelling to Reykjavik from England at some point before January 2025 and fancy grabbing a jar of jam from a shop in the city centre to bring back for me? Super grateful to anyone who could help, please dm me <3",
            "score": 1,
            "created_utc": 1724831419.0
        },
        {
            "author": "_blacknails",
            "body": "Any Reykjavik local able to offer a ride to the volcano? Really want to fly my drone above it.",
            "score": 1,
            "created_utc": 1725309617.0
        },
        {
            "author": "NormalFriendship5167",
            "body": "Is it possible to do the Ring Road on Feb (using a 4x4 car)?",
            "score": 1,
            "created_utc": 1725350088.0
        },
        {
            "author": "EaterofLaw",
            "body": "Who handles English immigrants? :s",
            "score": 1,
            "created_utc": 1730065245.0
        },
        {
            "author": "thundo_god",
            "body": "Adventurous activities to do in reykjavik",
            "score": 1,
            "created_utc": 1733000758.0
        },
        {
            "author": "None",
            "body": "So, where can i buy x and how much?",
            "score": 1,
            "created_utc": 1627476584.0
        },
        {
            "author": "postnoctum",
            "body": "We just got here, kind of just playing the night by ear and don't quite understand the nightlife at all. Is there something to do?",
            "score": 1,
            "created_utc": 1627604834.0
        },
        {
            "author": "fotla",
            "body": "Hello folks! I am visiting Iceland in September and hope to rent a car. Could anyone recommend a local cheap car rental place? I can only find the expensive airport ones online. \n\nThanks",
            "score": 1,
            "created_utc": 1628157758.0
        },
        {
            "author": "Mauricevanravels",
            "body": "What’s the best way to get a job in Iceland? I just graduated high school and I can’t afford Iceland without a job there.",
            "score": 1,
            "created_utc": 1628833494.0
        },
        {
            "author": "alexabc1",
            "body": "Can anyone help me get a ticket to Vikingur vs. Valur? It's tonight at 19:15. I think it might be sold out. I'm visiting from the US.",
            "score": 1,
            "created_utc": 1629624544.0
        },
        {
            "author": "leavingtheplanet",
            "body": "Hey, where can I get hair dye, specially fun colours (blue/green/purple)?",
            "score": 1,
            "created_utc": 1630281995.0
        },
        {
            "author": "kemmis",
            "body": "It’s raining all week. Can anyone please make it stop and be sunny? kthnxbye",
            "score": 1,
            "created_utc": 1631465248.0
        },
        {
            "author": "Klutzy-Sun741",
            "body": "We’re a group of danish students on a trip to Iceland, and we’re looking for a bar/club where we can get a beer or a drink. There is one criteria tho. You have to be 20 years old to drink in Iceland and we’re only 18-19 years old. So the club has got to be a little loose with the age restrictions.",
            "score": 1,
            "created_utc": 1632855652.0
        },
        {
            "author": "oddfiction528",
            "body": "Coming to Reyjavik mid-November; any odd or unusual dive bars people would recommend?",
            "score": 1,
            "created_utc": 1635722921.0
        },
        {
            "author": "BlueWeetabix",
            "body": "Best website or way to find out about small gigs/ concerts. Anywhere I can catch live music during a visit in late November?",
            "score": 1,
            "created_utc": 1635888618.0
        },
        {
            "author": "BlueWeetabix",
            "body": "Restaurant recommendations in Reykjavik, best cheap - mid priced places to eat, hidden gems?",
            "score": 1,
            "created_utc": 1637623863.0
        },
        {
            "author": "boredonymous",
            "body": "How much is lamb leg or lamb loin roast per kilo at Bonus or Netto around Christmas?",
            "score": 1,
            "created_utc": 1637684373.0
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 1,
            "created_utc": 1638576623.0
        },
        {
            "author": "None",
            "body": "Is it worth travel to iceland in last week of december? Can i see northern lights or weather too bad?",
            "score": 1,
            "created_utc": 1639523325.0
        },
        {
            "author": "Boomcya",
            "body": "Is anyone in the proximity of this location Holavallagarour Reykjavik? Would need a short favor :S",
            "score": 1,
            "created_utc": 1639840382.0
        },
        {
            "author": "MiniiMooose",
            "body": "I want to go out to the movies, but can't find information if any theaters in/around Reykjavík have any covid precautions in place 🤔 anyone know of any 'safe' theaters?",
            "score": 1,
            "created_utc": 1640712450.0
        },
        {
            "author": "angryrabbit11",
            "body": "I’m an American trapped in COVID-jail at an isolation hotel until Sunday. Tried delivery apps with no luck. Not for food but for some booze to help pass the time haha \n\nAny locals or fellow travelers wanna help a brother out? I don’t have any Krona on me but I can Venmo some scrillah. I’d kill for a bottle of Jameson or 30 beers haha",
            "score": 1,
            "created_utc": 1641471524.0
        },
        {
            "author": "Janeqq310",
            "body": "Where can I buy tickets for Reykjavik-Akureyri bus? Is there an app or anything? I'd love to go skiing in Iceland but the Ski Resorts near Reykjavik don't seem that impressive.",
            "score": 1,
            "created_utc": 1642103403.0
        },
        {
            "author": "Tiredbum",
            "body": "American in the city for the next 5 days. Looking for places to browse local art and general souvenir shops. I can understand as locals you probably don't care much for souvenirs, but hopefully there are some great art places to visit",
            "score": 1,
            "created_utc": 1645876122.0
        },
        {
            "author": "Agitated_Scientists",
            "body": "Hi all! I'm an American who is taking a week-long break from his work at a nonprofit to explore the west-side of Iceland. I've built my own kayak, circumnavigated cape cod, traveled to tanzania, but have found that some of the best memories and experiences are with others who also see life as an adventure.\n\nIf you and your friends would like to hang, let me know. I'm free March 13-19 and would love to explore Reykjavik, Stykkisholmur, and the Golden Circle. Let me know if you're interested!\n\n[https://www.linkedin.com/in/nickjmatthew/](https://www.linkedin.com/in/nickjmatthew/)\n\n[https://instagram.com/nickjmatthew](https://instagram.com/nickjmatthew)",
            "score": 1,
            "created_utc": 1646598231.0
        },
        {
            "author": "IchbinCharriz",
            "body": "Are there bars/cafes/art galleries open in Reykjavik sometime April 15-18? Or are they closed?",
            "score": 1,
            "created_utc": 1647464086.0
        },
        {
            "author": "IchbinCharriz",
            "body": "If bars/cafes/art galleries are open sometime April 15-18, which ones do you suggest that people in their late 20s to 30s go to that has not so expensive drinks and is walking distance to the city center?",
            "score": 1,
            "created_utc": 1647464208.0
        },
        {
            "author": "sashlakis",
            "body": "If I'm coming in May with a group of 5 for 10 days should we stay in Reykjavik  for the whole time and just drive/bus around Iceland; or should we stay outside of Reykjavik for a few of the days.",
            "score": 1,
            "created_utc": 1649258688.0
        },
        {
            "author": "sashlakis",
            "body": "What do you think the best way to get around Iceland is? Should I consider living in a motor home to really see Iceland or is that not necessary?",
            "score": 1,
            "created_utc": 1649258782.0
        },
        {
            "author": "Argagax",
            "body": "Are there any cabins to rent or \"rustic\" hotels in Reykjavik?  \nI might want to go there to have an elopement, but we're both really into rustic/cabin type living (we live in the fjords of Norway), and don't like big, fancy hotels. We also don't drive, so we can't go far outside Reykjavik.",
            "score": 1,
            "created_utc": 1649657957.0
        },
        {
            "author": "NervousCauliflower68",
            "body": "Hi! We are currently in Iceland and would want to see some puffins near Reykjavik but it seems no one is offering a tour? Any ideas on how to do make this happen in the next week? It would be very much appreciated . Greetings.",
            "score": 1,
            "created_utc": 1650650015.0
        },
        {
            "author": "rabbijoeman",
            "body": "My partner and I will be in Iceland in June and they have wanted to see a whale their entire life. I'd love to surprise them with a trip, anyone have any advice for a couple staying in this city and willing to travel?",
            "score": 1,
            "created_utc": 1654168582.0
        },
        {
            "author": "Cautious-Package1296",
            "body": "I’m visiting Reykjavik from June 18-25.\nAre there any cool events I should know about / go to. it’s the summer solstice during that week, I thought there might be something on that day.\n\nThanks!!",
            "score": 1,
            "created_utc": 1655303556.0
        },
        {
            "author": "Natural_Minimum4471",
            "body": "Hey! I am in Reykjavik now. I need to print out a PDF, sign it and scan it to send it digitally asap. Is there such shop/service in town?",
            "score": 1,
            "created_utc": 1656367318.0
        },
        {
            "author": "kiwi_rozzers",
            "body": "There's some sort of wind storm going on tonight, and there's a group of people out in Austurvöllur yelling and screaming. Is that something which happens often here, or just a bunch of crazy tourists?",
            "score": 1,
            "created_utc": 1657159744.0
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 1,
            "created_utc": 1658098767.0
        },
        {
            "author": "Defozo",
            "body": "Anyone going to Landmannalaugar 2022-07-24 - 2022-07-25?",
            "score": 1,
            "created_utc": 1658624377.0
        },
        {
            "author": "Excellent_Carrot5456",
            "body": "Is there a mens big and tall store that would carry mens clothing up to 5xl?",
            "score": 1,
            "created_utc": 1658683204.0
        },
        {
            "author": "Henkiepenkieflenkie",
            "body": "Hi, i am in reykjavik right now and would like to eat lamb tonight. Any suggestions and recommendations?",
            "score": 1,
            "created_utc": 1659283292.0
        },
        {
            "author": "Jubileum2020",
            "body": "I would like to work for icelandic clients, as graphic designer animator and video editor. How can I start it?",
            "score": 1,
            "created_utc": 1660073467.0
        },
        {
            "author": "canarialdisease",
            "body": "I’ll be in Reykjavik for one day and two nights next month. What do you recommend I visit/do in that timeframe?",
            "score": 1,
            "created_utc": 1665588034.0
        },
        {
            "author": "emeraldead",
            "body": "February, weekday, any bus transfer I could get from Blue lagoon at 1100 to the city?  Earliest I can find is noon.",
            "score": 1,
            "created_utc": 1666590564.0
        },
        {
            "author": "It-is-what-it-is-hun",
            "body": "Can someone else use my hotel reservation in Reykjavik?\n\nI booked a non-refundable rate at a hotel in Reykjavik in November, and I can no longer go. The hotel tells me that I am allowed to let someone else check in to my booking as long as they have the booking confirmation number. They tell me that their name (the name of the person checking in) does not actually need to be on the reservation.\r  \n\r  \nThis definitely would not work in the U.S. But would this actually work in Iceland?",
            "score": 1,
            "created_utc": 1667224040.0
        },
        {
            "author": "excusemeplez",
            "body": "Google says yes it snows in December, just looking to see if this is true to locals Ty",
            "score": 1,
            "created_utc": 1667248764.0
        },
        {
            "author": "Ambitious-Airport-68",
            "body": "Hi! I will be visiting December 22-28, so I’ll be there for Christmas. Are there any open holiday events for people traveling solo, who want to be with others? I have some tours lined up on the days surrounding Christmas Day, but hoping to find a way to connect on the 25th. Thanks!",
            "score": 1,
            "created_utc": 1667689896.0
        },
        {
            "author": "valentin_htm",
            "body": "Any good Patys/Clubs open tomorrow(7.Nov)?\nI know it’s Monday",
            "score": 1,
            "created_utc": 1667742179.0
        },
        {
            "author": "BinauralPurple",
            "body": "Hello! Can someone help please?\nMe and my friend are come to visit Reykjavik in mid December but we are on a tight budget.\nCan you suggest some free cost things to visit , and where to eat with a good price?\nI would really appreciate your help. \nThank you in advance! 💜",
            "score": 1,
            "created_utc": 1668203714.0
        },
        {
            "author": "Ok_Kaleidoscope5280",
            "body": "Are there any good bars/clubs open past 1 on weekdays?",
            "score": 1,
            "created_utc": 1670354656.0
        },
        {
            "author": "cmptrs",
            "body": "Does anyone know where i can buy a fairly cheap rain pants? I forgot to pack mine and I need them for when I go visit the waterfalls! Thank you!",
            "score": 1,
            "created_utc": 1670859521.0
        },
        {
            "author": "Withloveandviolence",
            "body": "Does anywhere in Reykjavik do food super late on a Sunday night in January? We're not going to get into the city until about 22:30. Thanks in advance!",
            "score": 1,
            "created_utc": 1670885996.0
        },
        {
            "author": "kalee28",
            "body": "Visiting in February,  is there anywhere that my husband can smoke a cigar that is heated? It's not very common where we live so am hopeful. Thank you!",
            "score": 1,
            "created_utc": 1671813919.0
        },
        {
            "author": "Anised",
            "body": "Please help, where to apply for houseekiping job, thanx",
            "score": 1,
            "created_utc": 1672012046.0
        },
        {
            "author": "superchiropteran",
            "body": "My wife and I are in town for New Years. What do you suggest we do for the holiday?",
            "score": 1,
            "created_utc": 1672413806.0
        },
        {
            "author": "sam-watterson",
            "body": "I want to travel to Reykjavik during the upcoming Easter vacation with my partner. I want to travel the southern coast on black sand beach/diamond Beach or Vik. Shall I go with a travel group or drive a car (I have a driving license)? Does the group trip suggest by TripAdvisor worth it? Any suggestions are highly welcomed.",
            "score": 1,
            "created_utc": 1672483190.0
        },
        {
            "author": "bobgower",
            "body": "Hi Everyone, I'll be stopping in Reykjavik for two nights — Saturday and Sunday — in late January (on my way back to NYC from Amsterdam). \n\nWhat should I do? I like food, hot water, history, art and people. \n\nWhere should I stay? I like to be comfortable but I don't need fancy.",
            "score": 1,
            "created_utc": 1673561503.0
        },
        {
            "author": "Worried-Belt-159",
            "body": "I am looking for bands or choirs to join in my spare time. I just moved here.\nDo you know any that might have a foreigner like me join? \nThanks in advance",
            "score": 1,
            "created_utc": 1674556047.0
        },
        {
            "author": "kalee28",
            "body": "Is there a place where you can smoke cigars indoors? We are visiting there in a week and my husband enjoys cigars, would like to find a place where he can have one that isn't outdoors.  He is already fine with not having cigars while we are there but I am hopeful to find somewhere for him.\nThanks!",
            "score": 1,
            "created_utc": 1674867660.0
        },
        {
            "author": "Researchandhelp",
            "body": "Does anyone know a sports bar that will show the Super Bowl tonight?",
            "score": 1,
            "created_utc": 1676176119.0
        },
        {
            "author": "Digital_Faust",
            "body": "Can anyone recommend a barber that can be somewhat trusted with fading textured/Afro hair",
            "score": 1,
            "created_utc": 1677492325.0
        },
        {
            "author": "ArmadilloLonely162",
            "body": "Looking for a guide in Iceland for a group trip\n\n5 days in October - stay and cars are sorted. \n\nContext - I am hosting a group of artists and creative people from India — so would love someone who is a guide (but also an artist, entrepreneur or musician maybe?)\n\nPut me in touch please 🎷",
            "score": 1,
            "created_utc": 1677550900.0
        },
        {
            "author": "TheLostSkeleton91",
            "body": "I will be visiting the city from the 11th to the 15th, and at least one of the nights my partner and I are hoping to go out for some drinks/dancing/nightlife/karaoke/drag shows etc.   We regularly go to punk shows here in the states, but we love pretty much any and all live music.  \n\nWhere are your favorite spots?  Any fun events happening during that time that we shouldn’t miss?\n\nThanks so much in advance :)",
            "score": 1,
            "created_utc": 1677630853.0
        },
        {
            "author": "friedeggbeats",
            "body": "Hello everybody. I have a few (hopefully quick) questions as I’m hoping to visit RVK again soon. Hope it’s okay to post them here. Any help is gratefully received!\n\n2015-19 I was lucky enough to get to visit RVK at least once a year. Got it down to a fine art. Book ticket, boarding pass on phone, valid passport, tiny bag of carry-on luggage, tinier man bag, get to airport, sorted.\nBut since then we’ve had Covid and Brexit so I now have some questions! Can this group help? Fingers crossed!\n\n1 I always got to Keflavik, picked the right-hand bus booth, and got the coach to BSL. Walking distance to downtown RVK, easy, just past the lake. But I heard there’s been changes? Not just because of the volcano? \nDo the buses still run regularly/constantly and do they still terminate at BSL?\n\n2 I’ve heard the local buses - always fussy about exact change - have got worse? Any feedback on the buses? I often used them to visit friends in Kopavogur. Is there an app I can use to pay?\n\n3 Finally - the main one - I used to stay with friends but they’ve since had a baby. Any recommendations for cheap (hah!) clean hotels (with ensuite) near to downtown? \n\nÞakka þér fyrir!",
            "score": 1,
            "created_utc": 1679903496.0
        },
        {
            "author": "johnblueblood",
            "body": "What transport company should I call to get from my hotel to the Norwegian cruise port?  There are 20 of us.",
            "score": 1,
            "created_utc": 1680503456.0
        },
        {
            "author": "SocialDistancePro20",
            "body": "Do the Straeto buses run the same route every day?  I am attempting to use the planner feature on the KLAPPIÐ app for a bus to the Reykjavik domestic airport and while it shows a nice easy route on Bus 15 today it does not show the same bus available tomorrow running at all.\n\nIs it possible bus 15 runs at 7 AM on Wednesday but doesn’t start until 9:30 on Thursday or is that just the App being flakey?",
            "score": 1,
            "created_utc": 1680689482.0
        },
        {
            "author": "re-beck-aa",
            "body": "Hi! I’m visiting Reykjavik in two weeks for work. I am wondering if there is a place where myself and my travel company will be able to watch Eurovision Song Contest while we’re there (both semifinals and the grand final)? I’m thinking of something like a pub, bar etc. Thanks!",
            "score": 1,
            "created_utc": 1682617594.0
        },
        {
            "author": "m_MK1nG",
            "body": "Hi I’m in Reykjavík from Thursday till Monday and basically open for everything if it’s not to expensive \n\nLet me know if you some gems to do",
            "score": 1,
            "created_utc": 1683714730.0
        },
        {
            "author": "MrPrettyKitty",
            "body": "In your lovely country in November in an unescorted group. Staying at the Fosshotel Reykjavik. What are some local suggestions for cheap food in that area? Thanks!",
            "score": 1,
            "created_utc": 1684118377.0
        },
        {
            "author": "WillowSoft9088",
            "body": "Hi,\n\nPlanning to visit Iceland 11-15july with parents,wife and 2yr old.Was wondering:\n1.Which area to stay both price and distnce wise?\n2.Planning to rent a car.Is it possible to visit popular places by car?Like golden circle day trip?Black sand beach etc.\n3.Where to rent car from considering I will be landing on 17:45 at reyjavik airport on 11th?\n\nAny other tip would be good also.😃",
            "score": 1,
            "created_utc": 1686508694.0
        },
        {
            "author": "beefsquaaatch",
            "body": "Hello, my wife and I are visiting at the end of the month. I’m a musician and would love to take in some local performances. I’m already excited about touring Harpan, but any recommendations for other venues would be much appreciated.",
            "score": 1,
            "created_utc": 1688992640.0
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 1,
            "created_utc": 1689331292.0
        },
        {
            "author": "lividthrone",
            "body": "Hi.  I will be In Reykjavik next week seeing three shows (Pavement) and would be grateful for recommendations of post-show spots of any kind - pubs, clubs, late night food etc.  Middle aged guy being only factor of relevance.  Would also just in general love to hear of any good jazz clubs in the city )potentially for other nights).  Thanks!",
            "score": 1,
            "created_utc": 1690010020.0
        },
        {
            "author": "Square-Ad771",
            "body": "0600 flight out of KEF and staying at R13 hotel. Looking to pay for a ride to KEF asap or at 3a!",
            "score": 1,
            "created_utc": 1690762328.0
        },
        {
            "author": "linalotion",
            "body": "Hi! I will arrive in Reykjavik on August 24 at 9am, my destination is Patreksfjörður, im movig there :)  Is there anyone going there? I really need a ride. Or can you recommend how to get there?  I know that there is a flight to Bildudalur but there is only one flight (at 10am) that day and unfortunatley i can’t catch it. Thank you for your help.",
            "score": 1,
            "created_utc": 1692607458.0
        },
        {
            "author": "vivilabe",
            "body": "Hey guys,\n\nmy flight back to my home country is really early (at around 6 A.M.), which means that I have to be at the airport at around 3 A.M.. However, the  FlyBus earliest arrival to the airport is 3:45. Do you have any other, cheap suggestions fora  transfer to the airport ?\n\nxx",
            "score": 1,
            "created_utc": 1692706192.0
        },
        {
            "author": "AuToNotMy",
            "body": "Does Monday Night Football (American Football) get broadcast in Reykjavik? I know it's in the morning (1 AM).\n\nIt's broadcast on ESPN in the US. Sometimes ABC and ESPN+",
            "score": 1,
            "created_utc": 1692922928.0
        },
        {
            "author": "apartmentstory89",
            "body": "There is a live music venue/bar in Reykjavik, Hürra, I was interested in visiting but I wonder if anyone can confirm that it is in fact closed? Found an article from 2019 that said they were going out of business but they have posted on their instagram as of may this year. After that there is nothing though. I’m assuming they’re closed but I would appreciate if someone can confirm it.",
            "score": 1,
            "created_utc": 1694435988.0
        },
        {
            "author": "eggyolknshells",
            "body": "Are businesses open regularly between Dec 26 to Dec 30?",
            "score": 1,
            "created_utc": 1694822292.0
        },
        {
            "author": "Optimal_Character213",
            "body": "Hi folks)\nI'm coming to Reykjavik in mid-November) please advise your favorite places to go) thank you)",
            "score": 1,
            "created_utc": 1697995582.0
        },
        {
            "author": "m2chaaeell",
            "body": "I am travelling to iceland tomorrow and would like to visit the game breidablik-tel Aviv on thursday. \nIs there any Chance the game is sold out and i will not be able to buy Tickets the day tomorrow or before the Game ?",
            "score": 1,
            "created_utc": 1701191512.0
        },
        {
            "author": "applebasket80",
            "body": "Hi!\n\nMy partner and I just arrived in Reykjavik today. We are renting a car. It is much bigger than the car we have at home and we aren't very used to the biting point/ power of this car. Before leaving we were more worried about driving on the other side of the road, which turned out to be fine but we underestimated how big of a difference the car itself would make. Does anyone maybe happen to know a quiet car park around Reykjavik centre where we could practice clutch controls in so that we can improve our driving and not disturb anyone?",
            "score": 1,
            "created_utc": 1701212781.0
        },
        {
            "author": "None",
            "body": "Hey, I just arrived here to do an exchange semester. I need things like pots, dishes, etc. Is there something like a sharing platform, where I can get those things used for a little bit of money?",
            "score": 1,
            "created_utc": 1704372258.0
        },
        {
            "author": "Difficult_Bad_5208",
            "body": "Here is a detailed guide > https://instatravelstyle.com/places-to-see-in-reykjavik/",
            "score": 1,
            "created_utc": 1707568325.0
        },
        {
            "author": "11MHz",
            "body": "Not then, but now yes.",
            "score": 5,
            "created_utc": 1627455531.0
        },
        {
            "author": "powerlifejack",
            "body": "depends on the weather...",
            "score": 1,
            "created_utc": 1641564189.0
        },
        {
            "author": "11MHz",
            "body": "Not sure how experienced you are, if you are looking for something simple you can check out: http://veidikortid.is/index.php?lang=en",
            "score": 1,
            "created_utc": 1627990291.0
        },
        {
            "author": "11MHz",
            "body": "Síminn, Vodafone or Nova\n\nThose are the big three",
            "score": 1,
            "created_utc": 1628020646.0
        },
        {
            "author": "kemmis",
            "body": "I was able to grab a siminn sim at 10/11. Not too expensive. Just ask for it at the counter.",
            "score": 1,
            "created_utc": 1631465181.0
        },
        {
            "author": "11MHz",
            "body": "A good first step is to ask the live chat here: https://www.heilsuvera.is/en/",
            "score": 1,
            "created_utc": 1718351016.0
        },
        {
            "author": "11MHz",
            "body": "You can use cards everywhere. Check with your bank for extra charges. \n\nThe US and Iceland have a mutual visa-free agreement for tourists (for up to 90 days). But starting in 2025 US citizens will have to apply for travel authorisation for Iceland+Europe (Schengen): https://travel-europe.europa.eu/etias/what-etias_en\n\nalso r/visitingiceland",
            "score": 1,
            "created_utc": 1718447715.0
        },
        {
            "author": "11MHz",
            "body": "Maybe, maybe not. Depending on weather related road closures (apply to all vehicles). \n\nSee r/visitingIceland for more",
            "score": 1,
            "created_utc": 1725351303.0
        },
        {
            "author": "11MHz",
            "body": "That’s a state matter not local. https://island.is/s/utlendingastofnun",
            "score": 1,
            "created_utc": 1730065586.0
        },
        {
            "author": "11MHz",
            "body": "Tiger and kr. 500.",
            "score": 3,
            "created_utc": 1627477346.0
        },
        {
            "author": "11MHz",
            "body": "Restaurants? Bars? Clubs? Lots of them are open downtown.",
            "score": 1,
            "created_utc": 1627990224.0
        },
        {
            "author": "11MHz",
            "body": "I recommend asking on r/VisitingIceland\n\nThis sub is more for hyperlocal topics.",
            "score": 1,
            "created_utc": 1628158041.0
        },
        {
            "author": "tychenyn",
            "body": "It’s hard to find a car not expensive. I booked a car with Geysir in airport but I didn’t get a confirmation from the car rental. Is it common now in Iceland? Do you guys have the same issue? Thanks",
            "score": 1,
            "created_utc": 1653188245.0
        },
        {
            "author": "11MHz",
            "body": "https://work.iceland.is/living/job-hunting",
            "score": 1,
            "created_utc": 1628845199.0
        },
        {
            "author": "11MHz",
            "body": "I would try this app: https://stubbur.app\n\nThey are the official ticket sales platform for some games. Not sure if they have the one today.",
            "score": 1,
            "created_utc": 1629627955.0
        },
        {
            "author": "11MHz",
            "body": "You could try https://partybudin.is\n\nI think they used to have vibrant hair colors. I'd give them a call",
            "score": 1,
            "created_utc": 1630421021.0
        },
        {
            "author": "11MHz",
            "body": "You can send requests like to his to wishes@vedur.is\n\nPlease note they are limited to 10 wishes per person per week.",
            "score": 2,
            "created_utc": 1631469562.0
        },
        {
            "author": "11MHz",
            "body": "You came to the wrong city. That's not how we do things here.",
            "score": 1,
            "created_utc": 1632865072.0
        },
        {
            "author": "11MHz",
            "body": "Messinn, Sumac, Rok, 3 Frakkar, Jómfrúin, Sæta Svínið are some examples.\n\nCheck the prices first, \"mid priced\" for food in Reykjavík means some different than in many other places.",
            "score": 2,
            "created_utc": 1637661465.0
        },
        {
            "author": "11MHz",
            "body": "Are those leaves?",
            "score": 1,
            "created_utc": 1638576684.0
        },
        {
            "author": "11MHz",
            "body": "I would check out r/visitingiceland\n\nin general December is one of best months to see the Northern lights but it's never guaranteed.",
            "score": 1,
            "created_utc": 1639555924.0
        },
        {
            "author": "11MHz",
            "body": "This sub isn't that big. You are better off trying your luck on Facebook.",
            "score": 1,
            "created_utc": 1639842400.0
        },
        {
            "author": "11MHz",
            "body": "\"Safe\" is relative and depends on people's personal attitudes. \n\nHowever, we do have laws that create an upper bound on the level of precautions that must be taken to prevent the spread of covid. \n\nAs far as I know, all theatres in Iceland follow these rules and are deemed \"covid safe\" according to that definition.",
            "score": 2,
            "created_utc": 1640713343.0
        },
        {
            "author": "11MHz",
            "body": "Might be better off trying some Facebook groups. The number of people on Reddit is very small",
            "score": 1,
            "created_utc": 1641475242.0
        },
        {
            "author": "11MHz",
            "body": "straeto.is\n\nbut just to warn you, no ski resort in Iceland is \"impressive\"",
            "score": 1,
            "created_utc": 1642103714.0
        },
        {
            "author": "11MHz",
            "body": "Laugavegur is the place for you. It's not long but lots of local art exhibitions and art stores.",
            "score": 3,
            "created_utc": 1645876404.0
        },
        {
            "author": "professorkurt",
            "body": "Everything will be open then.  The tourists are coming back so things are now open again.  Mid-April to early May is usually the beginning of the high season for tourism, so things are open and operating as normally as they can post-covid.  I am here right now and haven't encountered anything closed in Reykjavik except a few of the tour agencies have fewer offerings (but that's actually normal this time of year anyway).",
            "score": 1,
            "created_utc": 1647627500.0
        },
        {
            "author": "11MHz",
            "body": "r/VisitingIceland",
            "score": 1,
            "created_utc": 1649260161.0
        },
        {
            "author": "11MHz",
            "body": "r/visitingIceland",
            "score": 1,
            "created_utc": 1650650457.0
        },
        {
            "author": "11MHz",
            "body": "r/visitingIceland",
            "score": 1,
            "created_utc": 1654273235.0
        },
        {
            "author": "11MHz",
            "body": "also recommend asking in r/visitingIceland",
            "score": 1,
            "created_utc": 1655306257.0
        },
        {
            "author": "11MHz",
            "body": "r/VisitingIceland",
            "score": 2,
            "created_utc": 1656367357.0
        },
        {
            "author": "11MHz",
            "body": "There is a depression approaching Iceland right now. These \"wind storms\" are very common.\n\nPeople shouting at Austurvöllur sounds like some protests. Also very common.",
            "score": 1,
            "created_utc": 1657178722.0
        },
        {
            "author": "11MHz",
            "body": "r/visitingIceland",
            "score": 1,
            "created_utc": 1658099093.0
        },
        {
            "author": "11MHz",
            "body": "r/visitingIceland",
            "score": 2,
            "created_utc": 1665591999.0
        },
        {
            "author": "11MHz",
            "body": "r/VisitingIceland",
            "score": 1,
            "created_utc": 1667224836.0
        },
        {
            "author": "11MHz",
            "body": "Yes you should be prepared for snow but it's not guaranteed",
            "score": 1,
            "created_utc": 1667249958.0
        },
        {
            "author": "11MHz",
            "body": "r/VisitingIceland",
            "score": 2,
            "created_utc": 1667693487.0
        },
        {
            "author": "11MHz",
            "body": "You can try the larger stores like Hagkaup. Útilíf will also have them but not sure if they have budget friendly ones",
            "score": 2,
            "created_utc": 1670880530.0
        },
        {
            "author": "11MHz",
            "body": "r/VisitingIceland",
            "score": 1,
            "created_utc": 1672418468.0
        },
        {
            "author": "11MHz",
            "body": "r/VisitingIceland",
            "score": 2,
            "created_utc": 1672484331.0
        },
        {
            "author": "11MHz",
            "body": "r/VisitingIceland",
            "score": 1,
            "created_utc": 1677570692.0
        },
        {
            "author": "11MHz",
            "body": "r/VisitingIceland",
            "score": 2,
            "created_utc": 1679916941.0
        },
        {
            "author": "11MHz",
            "body": "r/VisitingIceland",
            "score": 1,
            "created_utc": 1680503787.0
        },
        {
            "author": "11MHz",
            "body": "Tomorrow is a holiday in Iceland (Easter).",
            "score": 1,
            "created_utc": 1680689843.0
        },
        {
            "author": "11MHz",
            "body": "It would be hard to find a place not showing it. Eurovision has 99% viewership in Iceland.",
            "score": 2,
            "created_utc": 1682617675.0
        },
        {
            "author": "re-beck-aa",
            "body": "Yes, I know about the high viewership but that does not necessarily mean that there are places to watch it in public. In Sweden, for example, most people watch it at home. But then it sounds like it won’t be a problem finding somewhere to watch it!",
            "score": 1,
            "created_utc": 1682624537.0
        },
        {
            "author": "11MHz",
            "body": "r/VisitingIceland",
            "score": 1,
            "created_utc": 1686515429.0
        },
        {
            "author": "11MHz",
            "body": "r/VisitingIceland",
            "score": 1,
            "created_utc": 1689333313.0
        },
        {
            "author": "11MHz",
            "body": "probably r/VisitingIceland",
            "score": 1,
            "created_utc": 1690010864.0
        },
        {
            "author": "11MHz",
            "body": "I would check out r/VisitingIceland",
            "score": 1,
            "created_utc": 1692608041.0
        },
        {
            "author": "11MHz",
            "body": "I would try r/VisitingIceland",
            "score": 1,
            "created_utc": 1692709359.0
        },
        {
            "author": "11MHz",
            "body": "r/VisitingIceland will give you better answer I think",
            "score": 1,
            "created_utc": 1697995692.0
        },
        {
            "author": "11MHz",
            "body": "try r/boltinn",
            "score": 1,
            "created_utc": 1701191677.0
        },
        {
            "author": "11MHz",
            "body": "Perlan? Quiet in the early morning and evenings and no houses very close by",
            "score": 1,
            "created_utc": 1701213948.0
        },
        {
            "author": "books_blog",
            "body": "This is amazing guide, bookmarking it now.",
            "score": 1,
            "created_utc": 1707568370.0
        },
        {
            "author": "EaterofLaw",
            "body": "Ty friend! \nHow is the job market for just some basic work as an English speaker? I've been trying to learn by myself for years with no luck(I have no one to practice with.) My plan has always been to move there. Short term plan is to move and find some part time work while I attend an emersion school to help me learn it faster while networking my career path. \n\nDo you think this would work, or would the locals hate me for trying to immigrate without learning the language first?",
            "score": 1,
            "created_utc": 1730125004.0
        },
        {
            "author": "fotla",
            "body": "Amazing thank you 🙏🏻",
            "score": 1,
            "created_utc": 1628158076.0
        },
        {
            "author": "kemmis",
            "body": "Lies!",
            "score": 1,
            "created_utc": 1631470023.0
        },
        {
            "author": "BlueWeetabix",
            "body": "Cheers that's helpful. I was thinking around 3,000 ikr for a main course. So some of these aren't bad thanks. If you know any takeaways ~2,000ikr per meal that would be great too.",
            "score": 1,
            "created_utc": 1637693074.0
        },
        {
            "author": "None",
            "body": "Surely they are i love Autumn and cant wait to buy some fresh leaves when they fall to the ground!",
            "score": 1,
            "created_utc": 1638576759.0
        },
        {
            "author": "Boomcya",
            "body": "don't have it unfortunately :(",
            "score": 1,
            "created_utc": 1639844073.0
        },
        {
            "author": "angryrabbit11",
            "body": "It’s not too small.. a little over 5k users. But I’ll give that a shot if you think so",
            "score": 1,
            "created_utc": 1641475412.0
        },
        {
            "author": "Janeqq310",
            "body": "Thanks! The one in Akureyri is decent for me :D",
            "score": 1,
            "created_utc": 1642103807.0
        },
        {
            "author": "kiwi_rozzers",
            "body": "At 2am? We definitely saw some protests going on a couple of days ago, but those were during normal working hours.\n\n(I think a lot of the world is facing a depression or a recession right now...hopefully we can all get through it together! Offering support and friendship)",
            "score": 1,
            "created_utc": 1657186982.0
        },
        {
            "author": "It-is-what-it-is-hun",
            "body": "Thank you!",
            "score": 1,
            "created_utc": 1667246783.0
        },
        {
            "author": "cmptrs",
            "body": "Thank you for your reply! I will go and look for one tomorrow in Hagkaup. Do you know the icelandic name for ‘rainpants’. I’ve looked for ‘regnbuxur’ on the website but maybe that’s not the right translation?",
            "score": 1,
            "created_utc": 1670888546.0
        },
        {
            "author": "friedeggbeats",
            "body": "Thank you!",
            "score": 1,
            "created_utc": 1679927811.0
        },
        {
            "author": "SocialDistancePro20",
            "body": "Wow, thank you.",
            "score": 1,
            "created_utc": 1680693066.0
        },
        {
            "author": "vivilabe",
            "body": "Okay thanks, I chose this subreddit because I will stay in Reykjavik. But I will also post in this one; thanks :)",
            "score": 1,
            "created_utc": 1692710375.0
        },
        {
            "author": "applebasket80",
            "body": "I forgot to say but we did end up going to perlan and it was a really good spot since it was nice and quiet.\n\nThanks again for the recommendation. Really saved our trip because we booked accommodation in a bunch of different places where we needed to be comfortable to drive to.",
            "score": 2,
            "created_utc": 1704991405.0
        },
        {
            "author": "applebasket80",
            "body": "Thanks, appreciate the recommendation! We will look into it",
            "score": 1,
            "created_utc": 1701239085.0
        },
        {
            "author": "11MHz",
            "body": "You will need a visa or residency permit first. \n\nGetting a company to sponsor you for a job that’s not specialised is going to be tough. \n\nIf you are 30 or under and have British citizenship you can also look at this thing: https://island.is/en/permit-for-working-holiday",
            "score": 1,
            "created_utc": 1730125709.0
        },
        {
            "author": "11MHz",
            "body": "You can find leaves in autumn, August-October.",
            "score": 1,
            "created_utc": 1638577579.0
        },
        {
            "author": "11MHz",
            "body": "5k, of which 2 are online.\n\nI and one other person, you if you joined this sub.",
            "score": 1,
            "created_utc": 1641475803.0
        },
        {
            "author": "EaterofLaw",
            "body": "I can't really pursue the careers related to my field until I learn the language first... I wasn't sure about nonspecialized work. \nSpecialized = masters degree +?",
            "score": 1,
            "created_utc": 1730129151.0
        },
        {
            "author": "angryrabbit11",
            "body": "Only takes one… eh? Whatchu doin?",
            "score": 2,
            "created_utc": 1641476093.0
        },
        {
            "author": "11MHz",
            "body": "Basically it depends on how easy it is to find someone in iceland to do it. If it’s hard in iceland and few people do it then it’s easier to get a visa.",
            "score": 1,
            "created_utc": 1730129644.0
        },
        {
            "author": "EaterofLaw",
            "body": "Been trying to contact various branches of government, organizations and companies for a few months...does no one respond to emails if their in English? (using an auto translator seemed insincere)",
            "score": 1,
            "created_utc": 1730275544.0
        },
        {
            "author": "11MHz",
            "body": "It takes time",
            "score": 1,
            "created_utc": 1730279247.0
        },
        {
            "author": "EaterofLaw",
            "body": "I resent them all translated. The replies I got told me I'd need a work visa already. Seems like I'd have to learn the language before trying to immigrate. I don't like this wall. Lol",
            "score": 1,
            "created_utc": 1730401618.0
        },
        {
            "author": "11MHz",
            "body": "One of the side effects of Brexit",
            "score": 1,
            "created_utc": 1730401911.0
        }
    ]
}