{
    "post_title": "ModLog #1 (2024-11): Under New Management",
    "post_author": "electro-cortex",
    "post_score": 79,
    "post_url": "https://www.reddit.com/r/budapest/comments/1gkxwa1/modlog_1_202411_under_new_management/",
    "comments": [
        {
            "author": "Impossible_Box_9906",
            "body": "First of all, thank you very much for the work and effort you’re putting into this subreddit !! \nWe’re planning to visit Budapest in 13/11, vernazza guidebook is very helpful !! Will the updates be in place before that date !?\nAppreciate you",
            "score": 5,
            "created_utc": 1730929427.0
        },
        {
            "author": "vahokif",
            "body": "Szívesen segítenék a vernazza's guideban. :)",
            "score": 4,
            "created_utc": 1730980879.0
        },
        {
            "author": "hkfuckyea",
            "body": "This is interesting and hopefully a very welcome development.\n\nCan I ask if we'll finally be able to share media and content related to Budapest? For example, crossposts, Facebook/Instagram videos and posts, articles and blogs etc. \n\nThere was a ridiculous ban on anything that supposedly led users away from this specific subreddit, even if it was directly related to the city.",
            "score": 7,
            "created_utc": 1730898416.0
        },
        {
            "author": "pudingleves",
            "body": "köszi szépen a munkátokat, csak így tovább!",
            "score": 2,
            "created_utc": 1731071613.0
        },
        {
            "author": "ScourgeOfGod420",
            "body": "Mocskos brit turistázni sem lehet többet? Mármint én értem hogy a rasszizmus rossz dolog, de ha valaki megérdemli…",
            "score": 2,
            "created_utc": 1731113764.0
        },
        {
            "author": "No-Problem-7139",
            "body": "VIVAT!",
            "score": 1,
            "created_utc": 1730980144.0
        },
        {
            "author": "uzaygoblin",
            "body": "hajrá",
            "score": 1,
            "created_utc": 1730997438.0
        },
        {
            "author": "imposter123455",
            "body": "Jol hangzik! 😁",
            "score": 1,
            "created_utc": 1730999198.0
        },
        {
            "author": "electro-cortex",
            "body": "We are actively working on it, I hope we can finish it until the 13th.",
            "score": 2,
            "created_utc": 1730980422.0
        },
        {
            "author": "electro-cortex",
            "body": "Tökre örülnénk neki, írj modmailre, vagy várd meg az első verziót és írj majd ott a poszt alá",
            "score": 2,
            "created_utc": 1730984237.0
        },
        {
            "author": "electro-cortex",
            "body": "What I can share is we (as the mod team) have debated this several times, even voted on a proposal, but it didn't get the majority of votes.  We would like to maintain a delicate balance between freedom to post and the quality of posts, and we have yet to find that.\n\nSo for now, you can share media directly on the subreddit, but no links to social media profiles/blogs/crossposts. Thank you for your understanding!",
            "score": 8,
            "created_utc": 1730899250.0
        },
        {
            "author": "hkfuckyea",
            "body": "Appreciate you replying. Well that's a start I guess. Considering social media is basically an important news source these days, it'd be ideal if you can reconsider that specifically, while filtering overly self promotion posts where necessary. Thanks for your guys hard work too.",
            "score": 0,
            "created_utc": 1730899906.0
        },
        {
            "author": "AnarchiaKapitany",
            "body": "So here's the thing about those insta/YT posts: They are more about hypeing up the presenter through their reactions to common things than the city itself. People don't make those to endorse the city, they're a self-branding tool. \n\nEach and every video tries to apply to the masses by presenting the most common attractions, the most common places you find through Google, and the most generic takeaways. They're a dime a dozen, pardon my French.\n\nIf someone's looking for those, they're very easy to find through Youtube, or the social media of your choice. We're aiming towards a more meaningful content here, mostly because of the possibilities of Reddit's format, and are trying to be more than a link dump sub for the same content in different flavors.",
            "score": 11,
            "created_utc": 1730900814.0
        },
        {
            "author": "hkfuckyea",
            "body": "That's an incredibly broad generalisation. One could easily define Reddit in the same manner that you did of those platforms, and they'd be largely correct from just viewing the unfiltered front page. But as frequent users of reddit, we're both very aware of the quality that exists in most subreddits.\n\nThe same is true of YouTube, Instagram etc. There are people exploring lesser visited districts and places, there are people spotlighting issues not being discussed in the news or of great interest to the average citizen, there are people fostering important communities.\n\nAt the end of the day, they're just platforms, same as Reddit is a platform. Defining which posts are quality on said platforms is the real issue. \n\nThis is the exact same argument I had with the other mods. If you're coming at it with preconceived notions, it's hardly a process that prioritises quality content, so much as a place for the mods to rule in their particular way.",
            "score": -5,
            "created_utc": 1730901518.0
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": -5,
            "created_utc": 1730909405.0
        },
        {
            "author": "AnarchiaKapitany",
            "body": "First of, it's still work hours here, so however committed I am to Reddit in my free time, I still have a job that needs my attention. I'm not ignoring your reply, but I do have the feeling we've reached an impasse. What we want from this sub is it to be an exchange hub, and not a one way showcase for content creators. I PERSONALLY don't think that this sub would benefit from links to Instagram influencer posts, Facebook albums of generic tourist photos (we have a huge amount of those natively anyway), and the occasional Youtube link is acceptable, given that it contains relevant information on the city, and not just a travel blogger gasping at how good gulyásleves is.\n\nThanks, we know.\n\nAnd I'm probably not the mod you had an argument with months ago, since I've only recently taken the mantle, even though (with my old acc included), I'm a metuselah of this sub.\n\nAgain, I DO understand from where your concerns and points come from, but actually SEEING the log of deleted posts, it's 95% what I'm talking about: Travel bloggers/influencers fluffing themselves, and reacting to trivial touristy stuff now in front of a Budapest stage setting. There's no value to be had in that.\n\nIt's not MY preconception, but a mutually agreed point between the moderators, that has been democratically discussed and overturned. What I CAN promise you is that when I do see something of value in the heap of generic travel video posts (eg. timelapse videos, extremely well shot drone footage, etc.), I will personally go and approve it. But the X-th GenZ couple eating lángos on a street corner is not considered quality content, and will not drive discussion or engagement the way you'd like.\n\nThank you for your time.",
            "score": 8,
            "created_utc": 1730910506.0
        },
        {
            "author": "hkfuckyea",
            "body": "I appreciate you going into detail on that. I completely see where youre coming from regarding content creators and I do sympathise with your team having to deal with what must be an endless stream of bland youtubers.\n\nWhat set me off previously was attempting to share a detailed comparison video of inflation and cost of living here vs New York, a video that happened to be shared on Tiktok. It caused an interesting discussion on a major sub with literally hundreds of replies, and it seeemed only fitting to share it here. The mods shut it down, absurdly, because they didn't want to \"mess up the status quo\", which they explained was generally asking for places to buy specific items or sharing Budapest related photos. Imagine that happening on the New York sub.\n\nI do agree we're at an impasse and it remains to be seen how things progress. But I thank you again for your willingness to engage in a discussion about this.",
            "score": 6,
            "created_utc": 1730911411.0
        },
        {
            "author": "AnarchiaKapitany",
            "body": "And I thank you for the same. Regarding the same awful tourist  photos that are shared here daily, I wholeheartedly share your disdain, yet that's a matter that is yet to be discussed between the mods. I'll be the first asking for some kind of restriction.",
            "score": 5,
            "created_utc": 1730913824.0
        }
    ]
}