{
    "post_title": "Monthly thread for advice and recommendations, December 2024 – ask your questions here!",
    "post_author": "AutoModerator",
    "post_score": 3,
    "post_url": "https://www.reddit.com/r/copenhagen/comments/1h3wq3w/monthly_thread_for_advice_and_recommendations/",
    "comments": [
        {
            "author": "trixter21992251",
            "body": "Hi guys. Moved to Valby from Aarhus, and would like to purchase a christmas tree from a local source in Valby, for example local scouts.\n\nAny good ideas? On my own, I found gronnehjem.dk, a local Valby business. Preferably, I would like to purchase from something like scouts :D",
            "score": 1,
            "created_utc": 1733048581.0
        },
        {
            "author": "Capital-Ad3941",
            "body": "Any busy bars or clubs in Copenhagen on Christmas Eve?\n\nHey everyone, I’ll be in Copenhagen from December 24th, 9 AM to December 25th, 9 AM (basically Christmas Eve and early Christmas Day). On that day I have a flight from Copenhagen so I would like to do Something before the flight, also I know it’s a big family holiday there, but I’m wondering if there are any bars or clubs that are still open and likely to have a crowd? Or is the city going to be completely quiet? Let me know if you’ve got any recommendations or tips. Thanks!",
            "score": 1,
            "created_utc": 1733050612.0
        },
        {
            "author": "MadlyInvolved",
            "body": "Anyone know if the Frederiksberg Runddel stake rink is open already today?",
            "score": 1,
            "created_utc": 1733051990.0
        },
        {
            "author": "AvocadoIsTheName",
            "body": "Hi there - I'm visiting Copenhagen for a week with my husband and 8-month old baby. I'm not really looking for things to do \"for\" my 8-month old, but rather places my husband and I can visit and bring her along where it wouldn't be frowned upon to have a baby in tow. Seeing as we are coming from the US, we do not have all the gear required to allow her to nap outside in the winter. Outside of the typical tourist attractions, are there particular neighborhoods or restaurants anyone could recommend where a baby this age will be welcome, or rather places we should definitely avoid? \n\n  \nAdditionally, if you know of a good way to borrow outdoor napping gear, I'm all ears!",
            "score": 1,
            "created_utc": 1733172135.0
        },
        {
            "author": "en--dash",
            "body": "A question about the DOT Billeter app: I'll be visiting Copenhagen in a few days. I have already downloaded the DOT Billeter app to pay for transit fare. When you set up a new account, it requires validation via SMS, which I was able to do as I am still in my home country. However, I was planning to buy a Danish data only eSIM during my travel. So, my question is: once I have validated my account once via SMS, will I later be able to purchase tickets over a data-only connection... or are there further SMS authentication steps that might occur? Thanks for any tips... I have genuinely looked all over the Internet for documentation on this and I can't find any (at least in English).",
            "score": 1,
            "created_utc": 1733173182.0
        },
        {
            "author": "fimusman",
            "body": "Help with mailing out parcel: I am visiting Copenhagen from Toronto and I need to send out a parcel to the UK. Can anyone point me to the best option within downtown Copenhagen? It seems like there's no offices for føtex or postnord in downtown?",
            "score": 1,
            "created_utc": 1733176838.0
        },
        {
            "author": "maia131",
            "body": "Hi!\n\nI am 21 and I am moving to Copenhagen in January. I am still a university student, but since I am in my last year, I can take my courses online and finish everything through distance studies. I am looking for a job probably at a coffee shop or a reception at a hotel or an office building or in retail but so far have not gotten many responses from employers or if I did, they rejected me. I would like to find a job before I relocate so that I can pay my rent haha. Do you have any advice how to get a job the easiest way in Copenhagen? Or any sort of advice regarding this?\n\n  \nPS. I already went around CPH asking for jobs at coffee shops and they all mostly said they are either not hiring or that I should go their website and wait. \n\nThank you so much in advance for your responses!",
            "score": 1,
            "created_utc": 1733224973.0
        },
        {
            "author": "CuddlyCactus13",
            "body": "Hey all -\n\n\n\nI´m looking to change my electricity provider and natural have come to reddit to seek out advice from the people and their experiences so I would greatly appreciate any tips you may have.\n\nI currently have velkommen and am unhappy af. reasons being terrible CS, impossible to understand and communicate overcharged, and a terrible non danish speaker ui/ux experience on the dashboard.\n\nSo I am hoping to switch from the next year and I have a 2 month notice and am curious if anyone has any recommendations (not like it needs to be fancy, I honestly feel like I am looking for the bare minimum).\n\nAppreciate any help there might be.",
            "score": 1,
            "created_utc": 1733305803.0
        },
        {
            "author": "LuxSentimental",
            "body": "Hi! Visiting Copenhagen for Xmas. Looking for recommendations for cools shops (fashion, design, books, art, etc). Also interested in recs for restaurants and places to visit. THANKS! Gracias <3",
            "score": 1,
            "created_utc": 1733349624.0
        },
        {
            "author": "Excellent_Movie_6882",
            "body": "stolen bike insurance issue\n\nHey! \nI got my beloved principia racer stolen a month ago, and finally the insurance company got back to me - i need a frame number, or i won’t get reimbursed for the bike. \nThe problem is, i bought the bike second hand on fb marketplace and i don’t have a frame number, a receipt (paid in cash) or anything else. I contacted the seller, and they no longer have any info on the bike (got it over two years ago, so understandable)\nI the bike has some damages that i can describe, and i have lots of pictures, also of myself with the bike. \nIs there a chance i will get any money back?:( \nthanks for any help",
            "score": 1,
            "created_utc": 1733358374.0
        },
        {
            "author": "Piccolaa",
            "body": "Hey everyone \n\nMe and my bf are visiting Denmark and got quite ill. \n\nWe talked to our insurance doctor and he prescribed us some medicine (brufen and some anti inflammatory), and he said it was fine to pick it up in any aphotek since he is allowed to issue prescriptions troughout Europe.\n\nWe printed the prescriptions but now we went to a pharmacy and they said to us this needs to be sent by fax? Is this true?\n\nI didn’t know that faxes were still used, but this is going to be very tricky to get done.\n\nLittle help here?\n\nThanks",
            "score": 1,
            "created_utc": 1733409689.0
        },
        {
            "author": "Pl4nt-n00b",
            "body": "What are the best neighborhoods to live in as an international? Looking for central but quiet neighborhood. Love access to parks, the water or anything nature.\nSingle Female in early 30’s\nBudget 10-14K",
            "score": 1,
            "created_utc": 1733036289.0
        },
        {
            "author": "axolotlroadkill",
            "body": "Some smaller bars yes, but in general the city feels very, very quiet and empty on the 24th.",
            "score": 2,
            "created_utc": 1733076902.0
        },
        {
            "author": "TheSportsPanda",
            "body": "LA Bar is always open. I've gone out on the 24th many years. There are options for sure.",
            "score": 1,
            "created_utc": 1733305019.0
        },
        {
            "author": "mtdk28",
            "body": "Yes, it opened yesterday.",
            "score": 3,
            "created_utc": 1733059476.0
        },
        {
            "author": "SimonGray",
            "body": ">Outside of the typical tourist attractions, are there particular neighborhoods or restaurants anyone could recommend where a baby this age will be welcome, or rather places we should definitely avoid?\n\nAnywhere that isn't fine dining should be fine to bring a baby. Many bigger places will have chairs available for babies too.\n\nI don't see how the neighbourhood matters for an 8-month old.\n\n> Additionally, if you know of a good way to borrow outdoor napping gear, I'm all ears!\n\nIf you really need it you should buy it ahead of time in the US and resell it back home too. We don't have napping-specific gear and the gear we do have is not something you can rent AFAIK.\n\nFor keeping babies warm we use either a sleeping bag-like implement that attaches to the pram and/or a \"[flyverdragt](https://livingthedanishgene.com/2020/12/04/danish-outdoor-clothing-for-children/)\" which is a warm, full-body jacket. Basically all small kids wear these when the temperature goes below 10 celsius, it's not just for babies and not just for sleeping.\n\nThey should also wear an \"elefanthue\" which is a beanie that covers all parts of the head except for the face.",
            "score": 1,
            "created_utc": 1733302296.0
        },
        {
            "author": "Leonidas_from_XIV",
            "body": "Honestly at this point I'd probably prefer to use the DSB app and their Rejsekort functionality. It's also cheaper, matching Rejsekort prices.\n\nBut I don't know why on earth we have 3 different apps to buy tickets.",
            "score": 2,
            "created_utc": 1733216223.0
        },
        {
            "author": "Leonidas_from_XIV",
            "body": "[There are a ton of places](https://www.postnord.dk/varktojer/find-os/#13.29/55.68157/12.58477) where you can drop off your packages (click \"Posthus\", the other places are places where you can buy stamps etc). Traditional, stand-alone post offices have not existed here for years.",
            "score": 1,
            "created_utc": 1733216496.0
        },
        {
            "author": "Spondophoroi",
            "body": "Many unskilled places won't hire you until you have a CPR number, and you can't get one of those until you have an address in Denmark",
            "score": 2,
            "created_utc": 1733229853.0
        },
        {
            "author": "Puzzleheaded_Grab572",
            "body": "Office jobs : LinkedIn / Student jobs or Hospitality: Facebook groups",
            "score": 1,
            "created_utc": 1733259045.0
        },
        {
            "author": "SimonGray",
            "body": "Altid Energi is pretty nice. They don't overcharge you with random fees, it's just the regular 18 DKK/month + the network fees and taxes that everyone pays. The monthly bill is simple to understand. We switched earlier this year from Andel Energi.\n\nI don't really need any UI other than the hourly prices, though (which they of course provide).",
            "score": 2,
            "created_utc": 1733309779.0
        },
        {
            "author": "Leonidas_from_XIV",
            "body": "I had a similar issue with an energy company before, they would not send bills, they would take ages to respond and be unclear in their responses. I think they closed down since. What I am doing these days is I check [elpris.dk](https://elpris.dk/) for candidates and now check what people on TrustPilot write about the respective company.\n\nI am currently customer at EnergiDrift and their customer service is significantly better (and good ratings on TrustPilot), however they've been [criticized by consumer associations](https://nyheder.tv2.dk/business/2024-10-21-forbrugerraad-dumper-hvert-tredje-elselskab) (Velkommen is on the list as well), so not sure if I would recommend them.",
            "score": 1,
            "created_utc": 1733320109.0
        },
        {
            "author": "SimonGray",
            "body": "No, sorry, you're shit out of luck. Next time you get a bike, note down the frame number (it's on the frame).\n\nYou need the frame number to report your bike as stolen to the police which is usually the first step before you can be reimbursed by your insurance company.",
            "score": 3,
            "created_utc": 1733385385.0
        },
        {
            "author": "SimonGray",
            "body": "Use the search function. Your question gets asked all the time.\n\nIn general, the best area is where you can find something within your budget. And central but quiet is a bit of an oxymoron, but maybe Frederiksberg fits the bill.",
            "score": 3,
            "created_utc": 1733049186.0
        },
        {
            "author": "Leonidas_from_XIV",
            "body": "Quiet and central is probably Østerbro (mostly families, close to Nordhavn for water, Fælledparken is in Østerbro).\n\nNow can you find an apartment there? For 10k probably not, 14k possibly if you get lucky.",
            "score": 2,
            "created_utc": 1733137768.0
        },
        {
            "author": "Leonidas_from_XIV",
            "body": "Excellent, the amount of vampires recently have been quite bothersome.",
            "score": 5,
            "created_utc": 1733137649.0
        },
        {
            "author": "SimonGray",
            "body": ">But I don't know why on earth we have 3 different apps to buy tickets.\n\nIt complements the 3 different apps to check your digital post!",
            "score": 3,
            "created_utc": 1733301719.0
        },
        {
            "author": "Pl4nt-n00b",
            "body": "Thanks! Are there normally options for furnished places? I reckon these would be upwards of 14K 😅 What are the best resources/websites to look for an apartment?",
            "score": 1,
            "created_utc": 1733220992.0
        },
        {
            "author": "Leonidas_from_XIV",
            "body": "There are, but bar for \"student living\" kind of expensive dorms furnished apartments are very rare. But they always come with a kitchen, unlike in Germany and sometimes also with a washing machine and dryer.\n\nThe best resources are the classic apartment websites like Boligportal and the like as well as websites of big corpo landlords like Balder and DEAS as well as project-websites of newly-built areas. They're all not great, because finding apartments is a pain to start with and if you're set on some district but don't have a place to live in the meantime it's rather tough, since you're pressed for time.",
            "score": 2,
            "created_utc": 1733224281.0
        }
    ]
}