{
    "post_title": "Vietnam eVisa Website Outage Megathread",
    "post_author": "protox88",
    "post_score": 7,
    "post_url": "https://www.reddit.com/r/travel/comments/1h6tvix/vietnam_evisa_website_outage_megathread/",
    "comments": [
        {
            "author": "Lumpy-Bass",
            "body": "Thanks for the thread! Applied over the weekend and got an email today stating my ICAO name was wrong (sigh) but can't even look at the site to see what they took issue with.",
            "score": 2,
            "created_utc": 1733353654.0
        },
        {
            "author": "shooter_will",
            "body": "It’s up (in US)",
            "score": 2,
            "created_utc": 1733360045.0
        },
        {
            "author": "Sea-Requirement-2662",
            "body": "Don't think I'm visiting Vietnam again with how annoying the visa process is. The website is down like 99% of the time",
            "score": 2,
            "created_utc": 1733356812.0
        },
        {
            "author": "EnvironmentalSense14",
            "body": "Urgent Vietnam eVisa question - Please help\n\n\nHi there!\n\nI am planning on visiting Vietnam towards the end of this month. I come from a country that requires a visa to visit Vietnam. I had applied for the eVisa a few weeks ago.\n\nThey returned my application last week saying that it needs to be amended, for the following reason: “Please provide information of the tourist company in vietnam”.\n\nThat checkbox was an optional one which I had previously checked as no: “Agency/Organization/Individual that the applicant plans to contact when enter into Viet Nam?”.\n\nAfter they returned it back for amendment, I checked that checkbox and added the details of a company that I MIGHT contact once I am there (they ask for the Name, Address, Phone Number, and Purpose - I added “Tourism tours and cruises” as a Purpose), then I submitted it.\n\nToday, they sent my Visa application AGAIN for amendment, for the very same reason: “Please provide information of the tourist company in vietnam”. \n\nDoes anyone have any tips or first hand experience with this? I am afraid of submitting it again as is and end up getting denied the visa. I am travelling in a few days and this has already taken a few weeks now.\n\nI would greatly appreciate any advice, thanks in advance! :)",
            "score": 1,
            "created_utc": 1733388118.0
        },
        {
            "author": "lseals22",
            "body": "How long is it normally down? Was trying to apply for my EVISA. Flight is January 1st",
            "score": 1,
            "created_utc": 1733356033.0
        },
        {
            "author": "MeanReality2710",
            "body": "It came back for amendment due to name mismatch. I corrected the name and submitted. It’s showing processing. How many days more it’ll take any idea. Am flying in 9 days",
            "score": 0,
            "created_utc": 1733382049.0
        },
        {
            "author": "Kananaskis_Country",
            "body": "It has to match *exactly.* Lots of people mess up by making it match their airline reservation which is usually missing a middle name.",
            "score": 3,
            "created_utc": 1733359752.0
        },
        {
            "author": "Kananaskis_Country",
            "body": "It's usually only a few hours, but it has been a mess for a last couple of days.",
            "score": 5,
            "created_utc": 1733359666.0
        },
        {
            "author": "MeanReality2710",
            "body": "Or should I resubmit a new visa. Which way is faster?",
            "score": 1,
            "created_utc": 1733382433.0
        },
        {
            "author": "Khan00812",
            "body": "Website is up now",
            "score": 2,
            "created_utc": 1733362556.0
        },
        {
            "author": "Kananaskis_Country",
            "body": "So it is. What a piece of crap, haha. Thanks for the heads-up.\n\nHappy travels.",
            "score": 1,
            "created_utc": 1733364896.0
        }
    ]
}