{
    "post_title": "Need advice on visiting Rila lakes in first week of December ",
    "post_author": "jeetathecheetah",
    "post_score": 3,
    "post_url": "https://www.reddit.com/r/Sofia/comments/1h78rwq/need_advice_on_visiting_rila_lakes_in_first_week/",
    "comments": [
        {
            "author": "ViktorKitov",
            "body": "Not trying to insult you, but If you are asking you probably shouldn't go.",
            "score": 7,
            "created_utc": 1733405270.0
        },
        {
            "author": "dwartbg9",
            "body": "This is something only experienced hikers and professional mountaineers would do.  This isn't gonna be like a walk in the park, I suggest not risking your life if you're not with some big hiking background.",
            "score": 3,
            "created_utc": 1733410003.0
        },
        {
            "author": "Easy_Letterhead_8453",
            "body": "I'd advise against it. The lift will most probably not be working, so you'll have to get up there by foot and that's a proper winter hike for snow shoes. \n\n[https://weather-webcam.eu/rilski-ezera-webcam/](https://weather-webcam.eu/rilski-ezera-webcam/)",
            "score": 2,
            "created_utc": 1733404829.0
        },
        {
            "author": "TearPretend2722",
            "body": "I have done it in late February. Truly stunning but it really is a serious winter hike. Snow shoes and gear for potentially extreme weather are a must.",
            "score": 2,
            "created_utc": 1733407301.0
        },
        {
            "author": "MidwinterSun",
            "body": "Are you an experienced hiker?\n\nAre you planning to bring your winter hiking gear with you during your two day stay?\n\nIf the answer to either of these questions is no, you have no business going anywhere near the Rila lakes during this time of year. Plan to make the hike in the height of summer instead and you'll enjoy it quite a bit.",
            "score": 2,
            "created_utc": 1733411143.0
        },
        {
            "author": "jeetathecheetah",
            "body": "How long is the hike? One way and is there any place I can rent hiking gear in Sofia. Thanks for the response :)",
            "score": 1,
            "created_utc": 1733412090.0
        }
    ]
}