{
    "post_title": "Posting about Tickets, Accommodation, Tourism? Things that aren't related to Dublin? Read This First.",
    "post_author": "DublinModerator",
    "post_score": 82,
    "post_url": "https://www.reddit.com/r/Dublin/comments/1dci80w/posting_about_tickets_accommodation_tourism/",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Hello, this is a message from Automod. This subreddit is intended for people who live in Dublin. Tourists are kindly invited to submit their questions to /r/irishtourism.\n\n[**r/irishtourism**](http://www.reddit.com/r/irishtourism) is an archive of previous posts from /r/dublin and beyond on the subject of visiting Ireland. Use the search function to look there first for information and ideas.\n\n[**Visit Dublin**](http://www.visitdublin.com/) Official Tourist Information Site from Bord Fáilte\n\n[**Wikitravel's Dublin page**](http://wikitravel.org/en/Dublin)\n\n[**The National Gallery**](http://www.nationalgallery.ie/)\n\n[**The National Library**](http://www.nli.ie/)\n\n[**The National Museum**](http://www.museum.ie/)\n\n[**The Dead Zoo**](https://www.museum.ie/en-IE/Museums/Natural-History)\n\n[**Temple Bar**](http://www.irishtimes.com/life-and-style/travel/temple-bar-listed-among-world-s-10-most-disappointing-locations-1.1763770)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Dublin) if you have any questions or concerns.*",
            "score": 5,
            "created_utc": 1718015052.0
        },
        {
            "author": "Whole_Chip_7960",
            "body": "Thanks u/DublinModerator! Just checking - did you mean to link r/IrishTourism?",
            "score": 5,
            "created_utc": 1718054119.0
        },
        {
            "author": "AutoModerator",
            "body": "**Mod note**\n\nWe sometimes receive messages in modmail about people being scammed on Reddit while selling or buying products, tickets or services.\n\nIt is best not to assume good intent while buying or selling from Redditors. In case you were scammed on Reddit, the moderation team can't help you get your money/stuff back and we can't ban users from Reddit either. We can only ban them from /r/Dublin.\n\nMost people contacting you via private messages are scammers. Beware of any private message or chat message offering to buy or sell stuff.\n\nNew accounts and shadowbanned accounts may be an indicator that someone is trying to scam you, however we have seen scams coming from years-old account as well. Do not assume an account is legit because they've been on Reddit for years and have plenty of karma.\n\nWe recommend against selling or buying stuff on Reddit.\n\nPlatforms like [Toutless](https://toutless.com/) for tickets, or [adverts](https://www.adverts.ie/) for stuff, are better suited, though they are not scam-free.\n\nNote that it is not allowed to use /r/Dublin to sell your stuff or advertise your business. If you must, pay for Reddit Ads. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Dublin) if you have any questions or concerns.*",
            "score": 2,
            "created_utc": 1718015052.0
        },
        {
            "author": "DramaForBreakfast",
            "body": "Whoops, didn't see this before I posted 5 minutes ago. Will delete now.\n\nEdited bc I accidentally said the exact opposite of what I meant",
            "score": 2,
            "created_utc": 1729344650.0
        },
        {
            "author": "AutoModerator",
            "body": "Hello, this is a message from Automod. If you are asking questions about moving to Dublin, renting in Dublin, buying a house in Dublin, or the cost of living in Dublin, please use /r/RentingInDublin. Please use the search functions before posting more threads about those topics. This thread will likely be removed by the mod team.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Dublin) if you have any questions or concerns.*",
            "score": 1,
            "created_utc": 1718015052.0
        },
        {
            "author": "AutoModerator",
            "body": "**[THIS IS AN IMPORTANT WARNING REGARDING SCAMS](https://imgur.com/Cua01V8.jpeg)**\n\n\n**Taylor Swift | The Eras Tour** - Extremely few tickets for sale (= ALMOST NONE) and probably none of them on Reddit. Use official TicketMaster resale if possible. Reddit mods and admins have no way to verify or ensure that people claiming they have a ticket to sell actually have a ticket to sell and will actually sell it to you. REMINDER: Reddit is a relatively anonymous platform ; it's extremely easy to create an account, run a scam, then delete the account and repeat. Do not trust anyone claiming they will sell you their ticket. **YOU WILL BE SCAMMED.**\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Dublin) if you have any questions or concerns.*",
            "score": 1,
            "created_utc": 1718015052.0
        },
        {
            "author": "erabbette5",
            "body": "Hi, I have 2 standing VIP tickets for Chappell Roan for her show on the 17th of September in Dublin. I was wondering if anyone would have any extra tickets to swap these for? I will swap for any seating or standing tickets. Thank you!",
            "score": 1,
            "created_utc": 1726421568.0
        },
        {
            "author": "Top-Trust6200",
            "body": "If I have listings up on Toutless, Adverts and Ticketswap, can I share the links here?",
            "score": 1,
            "created_utc": 1718543069.0
        },
        {
            "author": "benoriordain",
            "body": "Do you have a new 2024 post? Be good to see another salary discussion!",
            "score": 1,
            "created_utc": 1720530604.0
        },
        {
            "author": "DublinModerator",
            "body": "Yes- of course! Fixed now. \n\nThanks",
            "score": 4,
            "created_utc": 1718061081.0
        }
    ]
}