{
    "name": "Mercure Amsterdam City Hotel",
    "rating": 4.2,
    "reviews": [
        {
            "author_name": "Leandro Paganeli",
            "author_url": "https://www.google.com/maps/contrib/116112216437730411996/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKTYn4o_Up81Tqo0Zsxz-hPIlpKN5ehossAA0nucAXr3DpOUdBc=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 5,
            "relative_time_description": "a week ago",
            "text": "I had an amazing stay! The staff were incredibly kind and welcoming, and the room was spotless and very comfortable. Every detail was taken care of, and I truly felt at home during my time there.\n\nThe location is great, the facilities are excellent, and the overall experience exceeded my expectations. The attention to detail and warm hospitality made a big difference.\n\nThank you to the entire team (reception, Sylvia from the bar and ladies housekeeper) for making everything so wonderful!\n\n21/11 to 25/11 room 1430",
            "time": 1732644590,
            "translated": false
        },
        {
            "author_name": "Magdalena Kielbowicz",
            "author_url": "https://www.google.com/maps/contrib/109941604918007291033/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXQvGpPgma_E34xuaJ5mojumoZsQvsc2qxNUwpYzDavj1NoPvJ-=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 3,
            "relative_time_description": "2 months ago",
            "text": "During my recent stay at the Mercury Hotel in Amsterdam, my experience was a mix of highs and lows.\n\nStarting with cleanliness, the overall standard left much to be desired, especially in the dining area. I noticed that coffee mugs were placed on shelves that were dusty and had visible stain marks. It made me question the hygiene of the space, which was disappointing.\n\nAs for the rooms, they were relatively clean, and the bedding was fresh, which was a positive. However, after my first night, I woke up with bites on my legs, raising concerns about bed bugs. I immediately reported this to the staff, and to their credit, they responded quickly and professionally. They checked the room and reassured me that it wasn't bed bugs, suggesting it might have been mosquitoes. However, since the windows do not open, I'm skeptical of this explanation.\n\nOn a brighter note, the breakfast selection was excellent. There was a wide variety of options, and the food quality was consistently high, which made for an enjoyable start to the day.\n\nIn summary, while there were some issues with cleanliness and concerns about bites, the staff were attentive, and the breakfast offerings were impressive. With improvements in hygiene, the Mercury Hotel could provide a much more satisfying experience.",
            "time": 1725867681,
            "translated": false
        },
        {
            "author_name": "Robert White",
            "author_url": "https://www.google.com/maps/contrib/106479806644881641038/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKU7OBFYsuMHhgbaQi0mEzft8KVNbZcTTXEzcN7A2pi9kE3gA=s128-c0x00000000-cc-rp-mo",
            "rating": 3,
            "relative_time_description": "a month ago",
            "text": "Hotel was nice. Staff were very helpful and kind. The hotel lobby was a nice place to hang out. I found the room pretty small and the bathroom wasn't fully clean. There were stains on the sink when I arrived. Bed was comfortable but the pillows were shallow and I personally found them a little uncomfortable. I had breakfast one morning and paid over 25 euro for a very average selection and poor quality projects. For this price, I would have expected more. Food and drink in the hotel was expensive overall and I don't think I would be likely to return.",
            "time": 1729783872,
            "translated": false
        },
        {
            "author_name": "Waltham Abbey, Essex",
            "author_url": "https://www.google.com/maps/contrib/106325996820372978989/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVUDncLR-ADyKinnma9n5IEh8RKzBpm6iEA5nZZiD0BWP_0zfQD=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 4,
            "relative_time_description": "4 months ago",
            "text": "Very nice hotel. (New) rooms very spacious, clean and comfortable.\n\nHotel is feels welcoming. Staff at reception were very polite, helpful and kind. Seemed to be have a genuine helpful attitude towards customers.\n\nBreakfast was very pleasant. Quite expensive for what you get, but since there is nowhere to go in the direct area, then it’s a good choice to include it in your booking.\n\nLocation is great. Very convenient, only a short stroll from the metro station.\n\nI tried out the gym, sauna and steam room, very small but acceptable.\n\nOverall, very recommendable and I wouldn’t hesitate to stay here again in the future.\n\nNice hotel!",
            "time": 1721978680,
            "translated": false
        },
        {
            "author_name": "Jay Yu",
            "author_url": "https://www.google.com/maps/contrib/116097439065468529368/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKbCkqqN-uINrHZU1ekKH-wBeu6A-5tunBT271Xcyae9aoGOQ=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "Hotel is located in a nice area, but if you need to take public transportation is about 10-15 minutes walk. Has paid parking for €24 a night (in&out). We had 3 rooms in tower B and they were all clean and have a nice view of the canal. Great water pressure. Only problem is when showering water splashing out of the entrance of the shower. The glass isn’t wide enough to keep the water inside.",
            "time": 1730366581,
            "translated": false
        }
    ]
}