{
    "name": "Park Plaza Victoria Amsterdam",
    "rating": 4.4,
    "reviews": [
        {
            "author_name": "黃兆廷",
            "author_url": "https://www.google.com/maps/contrib/108008652744356136255/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWBdY1bYnSKmt0I9uOO4JdUsMI75PzvxwiIAosLm0Fw-S9yMTrpjg=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a week ago",
            "text": "Excellent location, just a short walk from the central station. The rooms were immaculate, and the beds were wonderfully soft and comfortable—I fell asleep instantly! The food was fantastic, and the staff were incredibly warm and welcoming, which made our stay even more enjoyable. My friends and I had an amazing time here and will undoubtedly stay again on our next visit to Amsterdam!",
            "time": 1732786869,
            "translated": false
        },
        {
            "author_name": "Sushil P",
            "author_url": "https://www.google.com/maps/contrib/113892561343187979312/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWaBtCqxOMJCh7vR_s2cXEYeu1gawv9OzedbsVCfZqTNfv5WpOKfw=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "The location is unbeatable—perfectly connected to public transport and just a short walk from all the major attractions. From check-in to check-out (including luggage storage after we checked out), the service was seamless. The staff was incredibly friendly and always ready to assist with a smile.\n\nOur room was spotless, with a well-stocked mini-fridge and a sparkling clean bathroom. And the bed? Absolutely heavenly—one of the best sleeps I've had in a hotel!\n\nHighly recommend for anyone visiting the city!",
            "time": 1725883615,
            "translated": false
        },
        {
            "author_name": "Lena Bremer",
            "author_url": "https://www.google.com/maps/contrib/112263737937179920782/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI89kPbTzllyXno1lUldSodZJ747iyjrW1EVsWYubPWy66hVA=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "The stay in the hotel was very nice. From the beginning, the staff were very friendly and helped with the suitcases. All the staff were always attentive and helpful and responded immediately to every question. The room was modern and everything worked perfectly. The spa area is highly recommended with the pool and the large sauna. The breakfast was chic and small, but there was a large selection. The breakfast staff were very friendly and even brought a lovingly prepared fruit platter for my boyfriend's birthday.\nI would definitely recommend this hotel. It was a wonderful time",
            "time": 1725706797,
            "translated": false
        },
        {
            "author_name": "Roger Ryan",
            "author_url": "https://www.google.com/maps/contrib/104370416841128468163/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIlO4_0LPMbuKAOptIb0mj96H2J5p8iGwtCdYt3nHtaPZoE8Q=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "Like much of Amsterdam these days, prices are much higher than they used to be however, this is an excellent hotel, with skilled staff and a great location. Our room was very modern, clean and everything worked. The breakfast room was a hive of activity but not too noisy and the food selection choices were very good. The staff throughout the hotel are well trained, polite and very helpful.",
            "time": 1730614453,
            "translated": false
        },
        {
            "author_name": "Olympia Dreszer",
            "author_url": "https://www.google.com/maps/contrib/110602293994217273844/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU10Qj96TLtiL9EtD1_YMENz5TaybB9Y5qNl2rY4GBqTeSY8TM=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 4,
            "relative_time_description": "a month ago",
            "text": "Location was great . Not far from Amsterdam centraal train station. There are steps leading up to the reception. There was no one to assist me with my luggage the first day when checking in but the following day upon check out someone helped me . Buffet Breakfast was great lots of fruit and other choices. I'd definitely stay again. My room had a view of other windows. Make sure to close your curtains if you desire privacy. The temp of the room was easily adjustable an great.",
            "time": 1729634292,
            "translated": false
        }
    ]
}