{
    "name": "INK Hotel Amsterdam - MGallery",
    "rating": 4.6,
    "reviews": [
        {
            "author_name": "Guillaume Isselin",
            "author_url": "https://www.google.com/maps/contrib/101681153411471711457/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJPaFcu3gQNoeogPme9RxhNqV0IaGkrkGiRsXqFkv5fQ-6RbQ=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "My stay at the INK Hotel Amsterdam was nothing short of exceptional. From the moment I arrived, I was made to feel incredibly welcome, and the level of service throughout my stay was top-notch. The room itself was superb—beautifully designed, with modern amenities and attention to detail that truly made me feel pampered. The bed was incredibly comfortable, ensuring a restful night’s sleep, and the overall atmosphere of the hotel was stylish yet cosy. I also loved the small, thoughtful touches left in the room, which made me feel like a valued guest.\n\nThe breakfast was a highlight, offering an extensive buffet with plenty of delicious options, both hot and cold. There was something for everyone, whether you preferred fresh pastries, fruit, or a full cooked breakfast. The variety of juices, drinks, and the excellent coffee machine was just what I needed to start my day on the right note.\n\nThe hotel’s central location made it easy to explore the best of Amsterdam, with many attractions and restaurants within walking distance. The staff were friendly and always willing to help, whether it was offering recommendations or making sure I had everything I needed.\n\nThe only minor issue during my stay was at checkout, where I was initially asked to pay for a late check-out, which should have been complimentary due to my membership benefits. After a quick check with the manager, the issue was resolved, and the late check-out was confirmed free of charge. It caused a little bit of stress, but this was quickly forgotten thanks to the overall excellence of my stay. I would suggest ensuring all front desk staff are fully aware of the ALL Limitless benefits to prevent this from happening in the future.\n\nThat said, this was a very small bump in an otherwise flawless experience. I would highly recommend INK Hotel Amsterdam to anyone visiting the city, and I will definitely be returning on my next trip. It’s a fantastic hotel that truly understands how to make its guests feel special!",
            "time": 1728913174,
            "translated": false
        },
        {
            "author_name": "Kev Robertshaw",
            "author_url": "https://www.google.com/maps/contrib/101075096721083096106/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVwsnFw22Yt6JHme-9tKqVugR_BXUM7dbIknOuRoV8JNAeQYydj=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "Arrived very early to drop bags off and was told the room would be ready in a few minutes. Staff on the desk were excellent, very friendly and marked up a map with things to do/see for our first short stay in the city. The room was perfectly clean, very comfortable and unique with the wallpaper art map of the city. Food was great, bar had loads of choice and the signature cocktail was really good. We will be back…soon.",
            "time": 1725819781,
            "translated": false
        },
        {
            "author_name": "Garret Evans",
            "author_url": "https://www.google.com/maps/contrib/104536111435208199975/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVIJI0aSXpL0VgzZNWP7PMgTmtc1JrHR_jNop4-PSSS97r0-gdV=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "Overall, really great experience.  I had a connecting flight that was missed because of an earlier delay.  Looking online, I found INK Hotel and decided to stop by and see if there were anyrooms available and on such a short notice.  Upon entering, the staff were super welcoming and accommodating and were also able to share some of the incredible history of the building.  The checkout was also very easy.",
            "time": 1730130049,
            "translated": false
        },
        {
            "author_name": "David Ngai",
            "author_url": "https://www.google.com/maps/contrib/100435502888035309642/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL4nyAwRS19Llrb2V5PrXcqcNGfwChKWIVkldEY9QWhE2wemw=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "We stayed at two hotels while in Amsterdam and this one was most comfortable and sharpest looking.  Seems to be newly built/renovated modern look, clean lines very nice decorum.  The hotel was a former newspaper so takes its design cue from the history.\n\nOne thing to be cognizant of the bathroom is not a separate room but within the room separated by heavy glass partition.",
            "time": 1726287748,
            "translated": false
        },
        {
            "author_name": "Abigail Gavin",
            "author_url": "https://www.google.com/maps/contrib/113001144996211098356/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLsBv9w-NwvFtJG8GkVduNMudk5n2poFjBNGdzee4iF_c4yxg=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "Vibes are immaculate at the Ink Hotel. Staff are professional, friendly and fun and our room was spotless. As soon as I walked in I felt safe and well taken care of. Breakfast service has everything you can think of and the coffee was fabulous. The only point of feedback that could have made our stay slightly more comfortable would be better pillows and stronger A/C. We will definitely be back next time we travel through Amsterdam!",
            "time": 1724308746,
            "translated": false
        }
    ]
}