{
    "name": "ibis Amsterdam Centre",
    "rating": 3.9,
    "reviews": [
        {
            "author_name": "Emma Donovan McCormack",
            "author_url": "https://www.google.com/maps/contrib/111949640707645234904/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUXSjXm1xnKfQivNkbw1Hjk3ROIX7-PDOjKgG351fGSfUmphoOW=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "a week ago",
            "text": "I highly recommend this hotel! The location is absolutely perfect. The service is fantastic every staff member we encountered was so helpful and friendly. The rooms are very good, small city rooms but more spacious than ones we've stayed in previously, beds and pillows were comfy and I have to mention how quiet it was it's not often now a days to find a hotel where you can't hear your next door neighbours it was great we slept like babies. This is definitely a hotel we will return to again and again.",
            "time": 1732628488,
            "translated": false
        },
        {
            "author_name": "Dal",
            "author_url": "https://www.google.com/maps/contrib/100387814161610014165/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWYEzriKj2P41JkQrZJMzny1tr5_n1fnkAgecAgZJyARuUONdjU=s128-c0x00000000-cc-rp-mo-ba8",
            "rating": 4,
            "relative_time_description": "a month ago",
            "text": "Stayed here a couple of times in the past, and had one night here recently. Great location, comfortable bed. I've had lovely views all three of the times I've stayed. Staff are nice and friendly.\n\nBathrooms could be better, especially the shower pressure. We did have to bring up a member of staff to help fix the air conditioning too, it was quite temperamental.",
            "time": 1730359957,
            "translated": false
        },
        {
            "author_name": "Joseph Pelayo",
            "author_url": "https://www.google.com/maps/contrib/111252225635627723759/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXcAQWgwkrjQf7Anu9gBzLHwpcSbZtSSsw6tHVVL0R3O-iT-ckm=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 3,
            "relative_time_description": "3 weeks ago",
            "text": "Good location and easy access to the central station\nRooms are a bit dodgy, the locks doesn’t really work. Cleaners knocked once and just barged into our room. The walls are also very thin so you can pretty much hear everything.\nThe staff are relatively friendly and welcoming.",
            "time": 1731013244,
            "translated": false
        },
        {
            "author_name": "Nelson G.",
            "author_url": "https://www.google.com/maps/contrib/101677130113533437285/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIjpvJAc9ohMFacLSv2F2LQJvClcqq0j6-wi7qdkoM4vkCM_A=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "3 weeks ago",
            "text": "I recently had a wonderful stay at the Ibis Amsterdam Centre and could not be happier with my experience! From the moment I arrived, the staff went above and beyond to make my stay comfortable and memorable. I want to extend a special thank you to Christian for accommodating me in a beautiful room with a fantastic view; it truly made my stay extra special.\n\nAshraf also deserves my gratitude for his help in using my discount voucher, which I hadn’t gotten around to using until nearly the last night. He was so patient and went out of his way to ensure I was able to take full advantage of it. It’s clear that the staff here genuinely care about their guests’ experiences.\n\nThe location of the hotel was perfect, offering easy access to everything Amsterdam has to offer. The rooms were clean, modern, and very comfortable. I highly recommend the Ibis Amsterdam Centre to anyone looking for an excellent place to stay in Amsterdam. Thank you again to the wonderful team for making my trip so enjoyable!",
            "time": 1731507316,
            "translated": false
        },
        {
            "author_name": "Joanne John",
            "author_url": "https://www.google.com/maps/contrib/112735508036079379812/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKeA2JxYMuRk-GheVeHutseC08CPdIUOyi7gwvaIPjn_zy2oA=s128-c0x00000000-cc-rp-mo",
            "rating": 3,
            "relative_time_description": "a month ago",
            "text": "Good location, rooms cleaned daily however bed sheets not changed for the whole 4 nights we stayed.\nRooms very compact with hardly any storage space for clothes and cases. No tea and coffee facilities in room. Lovely bar area.",
            "time": 1729002031,
            "translated": false
        }
    ]
}