{
    "name": "Clayton Hotel Amsterdam American",
    "rating": 4.3,
    "reviews": [
        {
            "author_name": "Fi C",
            "author_url": "https://www.google.com/maps/contrib/105918459469584302948/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJj3Cd1rAFQ2GrwiXqeqy4LOkLhd7jCk9bRbmYZLlzOEWpkOsYC=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "This is a great, historical hotel. Personally, the decor is a little dark but in keeping with its Art Deco feel . The room I had was huge , comfortable bed , and everything was thought of within the room. The most impressive thing about this hotel were it's staff! Service and welcome were exceptional from reception,bar to restaurant. I would return just for the service..definitely would recommend.",
            "time": 1729432569,
            "translated": false
        },
        {
            "author_name": "Rebecca Bradley",
            "author_url": "https://www.google.com/maps/contrib/115582413615421295559/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL4ge3MMB-6gLshNzVsWGMv3PLN_wVe_9hpFmXymNawskd_tw=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "We had a wonderful 3 night stay. We had a deluxe room overlooking the canal and it was spacious with great amenities. It's a great location close to the museum district with lots of restaurants and shops close by. There is also a close tram stop which made it easy to get to other parts of the city. Everyone we spoke to was very helpful and friendly. We would definitely stay at this hotel again.",
            "time": 1728493160,
            "translated": false
        },
        {
            "author_name": "kevin pluck",
            "author_url": "https://www.google.com/maps/contrib/104451852827179586353/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUOANvIloipcDBrKDQh8ybdHTseJV5vOgqA7jJ3FEMZw_IIMkS8=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 1,
            "relative_time_description": "in the last week",
            "text": "Rooms are old. Shampoo and shower gel are not the products stated on the outside. Balcony floor is falling apart. No mini bar. Couldn't get room service to arrive. 7 euro to deliver 3 beers to a room at 4pm. Charged for the money. Half hour later I visit reception to find out there is no beer. Requested refund. Had to ask twice. Room was not cleaned once or any of the meager supplies replenished. Tried to take 50 deposit for room service whilst checking in for some reason. Used to stay at this hotel absolutely won't be anymore. Was amazing service and a really nice energy when it was hardrock. We left feeling completely ripped off and disappointed by the penny pinching.\n\nI can see from other reviews my above complaints are an ongoing issues.\n\nMost the staff members are just not worth interacting with. Just get eye rolls",
            "time": 1732873885,
            "translated": false
        },
        {
            "author_name": "Karen G",
            "author_url": "https://www.google.com/maps/contrib/111511700017904630983/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIBPb2GC9J1yvDH62nOatiUpRzlQLKE28y9668Vpmaa-ZhJeA=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 4,
            "relative_time_description": "2 months ago",
            "text": "Very glad I chose this hotel. I looked for quite a long time in the different areas before settling on this hotel and very glad we did. We found the location superb, with what we call many “eat streets” very close by with many restaurants. Shops very close by as well. Canal boat tour right outside door which we enjoyed. Very helpful and friendly welcoming staff. We arrived very early in the morning and were very lucky to get checked in earlier. Whilst we checked into a different room than we originally booked which was a balcony room. we didn’t mind as were happy to have a comfy room to sleep after long travel. Great bar downstairs as well. They kindly offered us the opportunity to change to a balcony room next day however we declined as were only staying 2 nights and were happy with the room they had allocated us.",
            "time": 1727382665,
            "translated": false
        },
        {
            "author_name": "Anthony Nuccio",
            "author_url": "https://www.google.com/maps/contrib/117264729657287652571/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV0KZ0Lsx601V7xha7Skh34T7PLG-h1oXAjUJ1dqBrWETVnk1D6=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "I had an excellent stay. The rooms were clean and beautifully decorated. The bed was very comfortable and the a/c worked great. The room was cleaned daily and staff was absolutely amazing from concierge to front desk and custodial staff. Thank you for a very memorable experience for my first time in the Netherlands.",
            "time": 1727714140,
            "translated": false
        }
    ]
}