{
    "name": "Swissôtel Amsterdam",
    "rating": 4.3,
    "reviews": [
        {
            "author_name": "Camille Tankersley",
            "author_url": "https://www.google.com/maps/contrib/117662502261097889174/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK0eD8Z2p1tq5wpPKsfeTu58OsQiRABXue-MiY3h7JQ-67rxT4=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "We had an amazing time at Swissotel Amsterdam 7/21-7/23!!! We loved the location, the service, the rooms, the amenities and the complimentary breakfast! Our connecting flight to London was cancelled so we had a surprise stay in Amsterdam with no luggage. We were able to book 2 king rooms, same day and were upgraded to 2 king suites! The hotel amenities kit had everything we needed, toothbrushes, toothpaste, razor, comb, on top of pump hand soap, shampoo, soap and conditioner. The view of the street and square was amazing and one suite had a little balcony! The staff went above and beyond to assist us in ordering a taxi for our flight. The breakfast was lovely and they had lots of coffee choices. It was so clean, comfy beds. Loved it! Would book again for sure!",
            "time": 1723748437,
            "translated": false
        },
        {
            "author_name": "Chantel Bostock",
            "author_url": "https://www.google.com/maps/contrib/116895657406302940886/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJyk3e4w-AAEhtTdUV44ig3AZuWaT9edD0aO0M-ScuvdM1h9Q=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "in the last week",
            "text": "Booked 2 night stay for my Husbands 40th. The hotel stafff could not be any more helpfull. They decorated the room with balloons and rose petals left a card wishing him happy birthday. The rooms are lovely the bed was amazing so comfortable and so big. If we needed anything the staff was on hand. They extended our check out as our flight was at night. They are extremely friendly and kind and we will definitely be coming back again. Thank you for helping to make our weekend amazing. Mr and Mrs Bostock xx",
            "time": 1733060820,
            "translated": false
        },
        {
            "author_name": "Chris Burns",
            "author_url": "https://www.google.com/maps/contrib/112075162413666443931/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIos-NrUPDtsed0bKWCcKw1iIqxp1s7S_tnsBkiP03wmagSPw=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 4,
            "relative_time_description": "3 months ago",
            "text": "The staff was very friendly and  helpful to us just coming of a cruise. Excellent location for sightseeing and especially for Pride weekend. Only negative would be no electric plugs bedside and no USB plugs at all in room. Would stay again on our next visit.",
            "time": 1723923531,
            "translated": false
        },
        {
            "author_name": "J M",
            "author_url": "https://www.google.com/maps/contrib/118171501806483594619/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK-jP8EBll9UO_S4bwK7Mu3MnR6iOVQJZ808gnOl1djYU-qcg=s128-c0x00000000-cc-rp-mo",
            "rating": 2,
            "relative_time_description": "a month ago",
            "text": "I wish I read the reviews before booking this hotel. I always thought Swissotel was meant to be a decent quality chain, unfortunately we experienced very poor quality and were disappointed from the start.\n\nWhen we arrived in the door, coming from a bright sunny busy main street into the very dark lobby, our eyes hadn’t fully adjusted before we heard “hello”. We greeted the reception staff and proceeded to tell him our booking before he aggressively told us he was dealing with someone and would be with us when he was finished. I said “oh when you said hello I thought you were dealing with us” he proceeded to argue and point to the guest off to the side on a tablet, we didn’t realise he was serving her. In any case it was a very unpleasant and unnecessary interaction and took us by surprise.\n\nNext we went to our room. It was disgusting. 2 star quality. Old, battered and filthy. Cobwebs on the ceiling, dusty towel rails, view out the window was scaffolding and a wall, pillows were yellow! Walls were dirty, artwork on the wall looked like it was done by a random child on cheap canvas and the room stank of cigarette smoke.\n\nThankfully we were changed to a different room when I complained. Grumpy was at reception again and gave us a better room, thankfully. No apology though.\n\nOur second room was a big improvement on the first, although still a bit dirty. Stains on carpet and it just looked like things weren’t cleaned much. I daren’t have used the cups or glasses provided without giving them a good clean first. Windows were nice and soundproofed.\n\nHousekeeping seemed like it was just one person for the whole hotel. We seldom got items replaced, had to ask for tea, tissues and toilet paper after they visited, sometimes there were washcloths, sometimes not. The bathroom bin was left on the desk in the bedroom for some reason.\n\nWe noticed a used bandage on the carpet in the hallway and put bets on for how long it was gonna take before it was removed. Took over 24hrs.\n\nHonestly I’ll probably not use this hotel chain again. I think we would have gotten better quality and service elsewhere.\n\nThey really need to hire more housekeeping staff and give the place a deep cleaning and replace old worn out furniture and carpets. Also train the older man in the reception in customer service skills.\n\nLocation was great though. That’s about it.",
            "time": 1728410886,
            "translated": false
        },
        {
            "author_name": "Merve Şimşek",
            "author_url": "https://www.google.com/maps/contrib/110044080579660671865/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJgtTq7BajtdL3AlMT-BWuFM--Qjc6s094V_3JSFcnKF-3WxQ=s128-c0x00000000-cc-rp-mo",
            "rating": 1,
            "relative_time_description": "3 weeks ago",
            "text": "I absolutely do not recommend this hotel! They are very unempathetic when it comes to unexpected situations such as illness and other unforeseen circumstances! I wanted to change my birthday reservation because I am unable to board the flight due to illness, and I have a doctor’s report confirming this. Booking.com offers date changes for non-refundable reservations in such cases, but the hotel marked every date I requested as unavailable! When I contacted them directly, they rudely rejected my request, stating that they couldn’t do anything, and they didn’t even respond to my last message! When I tried to make a new reservation as a customer, all the dates that had previously shown as unavailable were now available, meaning they are simply telling me that the dates I requested are full in order to avoid changing them! If you or your children become ill or face similar force majeure situations, know that this property will not help you, and your entire payment will unfairly go to waste!",
            "time": 1731068716,
            "translated": false
        }
    ]
}