{
    "name": "Radisson Blu Hotel, Amsterdam City Center",
    "rating": 4.4,
    "reviews": [
        {
            "author_name": "Hen Livgot",
            "author_url": "https://www.google.com/maps/contrib/118054848510342708386/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJvqLl9L7GyER-7WrZX_0WPZKS_pcmkiVekpWRGYLcl4pP97Zym=s128-c0x00000000-cc-rp-mo",
            "rating": 1,
            "relative_time_description": "3 weeks ago",
            "text": "What a terrible hotel. Do yourself a favor and don’t spend even a single penny on this experience. Very low-level room service. People are nice and kind but... it's just worth nothing.\nThe rooms are small and old. The street is incredibly busy and noisy. You can hear every sound from the neighboring rooms, and you can especially hear and even feel the footsteps from the floor above. The location of the hotel is great, but it’s not worth anything. It’s freezing cold, the heating works intermittently, and when it does, it makes such an absurd amount of noise that it’s impossible to sleep. The breakfast is minimal and doesn’t befit a hotel of this level. Additionally, you might end up in a room in the building opposite the reception, which means you have to take two elevators and pass through a special underground corridor to enter and exit your room. In short, I’m really not picky about hotels—I can sleep in a train station if needed—but I’ve never encountered a nightmare like this. I’d prefer a million times over to choose a slightly more distant 3-star hotel, as I’d enjoy it a million times more, and it would definitely be more worthwhile. A dreadful hotel, not worth a penny.",
            "time": 1731193303,
            "translated": false
        },
        {
            "author_name": "Kristian Skillborg",
            "author_url": "https://www.google.com/maps/contrib/112850511699189743164/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWBVwaBvVTrNDZyzUBK8ia7B4JiS6irSv94uGutOgrBdydizrad=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 3,
            "relative_time_description": "3 weeks ago",
            "text": "The location is great if you want to stay in the center of Amsterdam.\n\nThe staff was very friendly and helpful. After some trouble at check in I was informed my room was upgraded due to the inconvenience. The only problem... It was already upgraded prior to my arrival. So, a lie in order to put up a facade of providing something extra.\n\nThe breakfast was nothing I'd recommend. Sure, it was okay but nothing more.\n\nThe room was nice but the bathroom not so much. Mouldy ceiling and dirt at the bathtubs edges.",
            "time": 1731343333,
            "translated": false
        },
        {
            "author_name": "Reem Abdulkreem",
            "author_url": "https://www.google.com/maps/contrib/100618910952466693050/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJenZC83ITtq9lGdW3PxfkFt37nAZOhdxRr0Y139vsILNAtzw=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "3 weeks ago",
            "text": "Thank you, Mr. Cristiano, for the hotel reception. The impact is that he is an excellent face and a person who cooperates with the guests. With his presence, they do not need anything. He manages the hotels completely in an excellent way and wonderful treatment. Thank you very much, Cristiano, and we wish you more progress 👏🏻👏🏻👍👍",
            "time": 1731431961,
            "translated": false
        },
        {
            "author_name": "Karen Nelson",
            "author_url": "https://www.google.com/maps/contrib/108788184442632857683/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKZzEfn06rhxZzc9sY4r7SLIhSBPN1noLYRGuniwTN2WdxPEg=s128-c0x00000000-cc-rp-mo",
            "rating": 3,
            "relative_time_description": "2 months ago",
            "text": "The hotel is in a good location.  We were able to check in an hour early after sitting in the lobby for a few hours,  the first room the bedding request was wrong so we were moved,  the second room there was a man asleep in the bed so we were moved.  The third room, the toiletries needed refilling,  bathroom floor around the toilet needed mopping,  coffee supplies such as sugar empty, the kettle kept shorting out, but the TV worked (it didn't in our relatives room). WiFi excellent,  lifts quick,  air conditioning good, beds comfy.",
            "time": 1725685606,
            "translated": false
        },
        {
            "author_name": "Christophe A.",
            "author_url": "https://www.google.com/maps/contrib/105507316797557298379/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUbuwKTN1cYVLOS882qc90LFdSjTwpYmuDwohv4HtsMjucrUk17bw=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 3,
            "relative_time_description": "2 months ago",
            "text": "Overall, I was a bit disappointed with the level of service I received.\nThe biggest issue was the two separate buildings. One has a classic look by the canal, while the other is a modern, unique building on the street. They're completely different hotels!\nRadisson's communication about this is unclear, and it's not obvious how guests are assigned to one building or the other.\nAdditionally, I noticed some small but unacceptable issues (no body wash in the shower, noisy AC, damaged chair).\nWith 250 rooms, the hotel feels impersonal, lacking a premium or personalized experience.\nOn the plus side, the location is great, and the room itself was spacious and well-equipped.\nIn conclusion, it feels like a hotel geared towards business travelers.",
            "time": 1727977360,
            "translated": false
        }
    ]
}