{
    "name": "Ibis Amsterdam Centre Stopera",
    "rating": 4.1,
    "reviews": [
        {
            "author_name": "Ruairi Osullivan",
            "author_url": "https://www.google.com/maps/contrib/103127364788818310717/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU3FLmFuItFyzkuMfOM0m_1THftZvqePUfjZBNxxqiLyn2JOmCrmA=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 4,
            "relative_time_description": "a month ago",
            "text": "Very enjoyable stay.\nStaff very friendly and helpful, good breakfast every morning. Rooms very clean.\nVery well located with tram 5 minutes away.\nArrived late the first evening and purchased some snacks at reception....very pricey\nOverall very happy and would recommend and would stay here again",
            "time": 1730460673,
            "translated": false
        },
        {
            "author_name": "Iris Potruch",
            "author_url": "https://www.google.com/maps/contrib/113480534310096329723/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUTe8aZmJZQDRyYJIYaplRrryjj2fkFmLigv1IHbW9gP6iYnjA5wA=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "Basic Ibis hotel with several features I found really great: excellent location in the center but quiet. Tram 14 from the central station is a few minutes walk. Comfortable desk to work from in the room. I asked for a room overlooking the canal and it's just lovely. The bed is excellent! The mattress and pillows are wonderful, I slept so well there. There's a charger box in the room you can connect several cables to, and you can decide where to put it- super convenient. The shower is wonderful. The staff at reception is very friendly and helpful. There's a 24 reception with snacks and food, even pizza if you want. It was an excellent choice for where to stay for several days.\nTip - the Motel One bar next door is open until 00:30 and they make excellent drinks.",
            "time": 1723219410,
            "translated": false
        },
        {
            "author_name": "Andrew Hetherington",
            "author_url": "https://www.google.com/maps/contrib/105854296724577372688/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLXgNtaI7du9_AJV4ZDMGuXjxfRxygYVLeYv-Xus2OGNNe2JQ=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "4 months ago",
            "text": "I arrived earlier than the check in time and was able to get into my room right away. It was clean, quiet and had air conditioning that made returning from a day of wandering and sightseeing more comfortable. The bed was was more than comfortable, providing a great nights rest. I used the restaurant downstairs for my morning coffee's more than once, the cappuccino tasting great and the seating relaxing. The staff was always great with anything I needed, from late night ordering of pizza to any questions like directions or advice. My travel plans changed and I ended up extending my stay more than once and the staff always made sure I could keep my room. It was well located, just a few minutes walk to restaurants, groceries, pharmacy and transit for longer inner city trips, and anything else I might have needed. The area was safe and provided a nice walk back to at night. I would definitely look to stay here again should I come back to Amsterdam. Thanks for being one of the easiest parts of my trip.",
            "time": 1721599435,
            "translated": false
        },
        {
            "author_name": "Paul",
            "author_url": "https://www.google.com/maps/contrib/116029371831764925133/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLWe5SfEMkRG6q9mf1DKERHTAfiOpsw3EEOYHryi9890KoFxyOh=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "Our room overlooked the canal and was cool even in the hot weather. The bathroom was good, great shower. Only minor noise from other guests. Breakfast was good, and always somewhere to sit. Your staff were always friendly. Easy check-in and check out. Also a fairly quiet location, usually at least a 20 minute walk to wherever we wanted to go, but thankfully not a problem for us.",
            "time": 1723475681,
            "translated": false
        },
        {
            "author_name": "Samir Saci",
            "author_url": "https://www.google.com/maps/contrib/117646488771155901459/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV1gb8NzpQCUFn504gRSe45NaG5gxJk2xp93F5hHgfFU8149krN=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 4,
            "relative_time_description": "3 months ago",
            "text": "The team here provides excellent service with genuine warmth and effective support. Located conveniently for those keen to explore museums or the vibrant nightlife, it's an advantageous spot for many travelers. The breakfast selection is ample, and the rooms maintain a clean and tranquil environment, though adding complimentary water would enhance the experience. A commendable choice for a stay in the city.",
            "time": 1725004488,
            "translated": false
        }
    ]
}