{
    "name": "Eden Hotel Amsterdam",
    "rating": 4.1,
    "reviews": [
        {
            "author_name": "Bex Middleton",
            "author_url": "https://www.google.com/maps/contrib/113959691988744934044/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVtoOQB5LDrTT7LfUmno9UuR0WHiNSIQRIWldF7LWVUlzxDuL-_hw=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 4,
            "relative_time_description": "a month ago",
            "text": "Overall a lovely hotel. Right in the middle of Amsterdam so close to Rembrandt square. The entrance is gorgeous, it smells amazing downstairs. The view of the canal from the room was good. The staff is helpful and polite, the check in and check out system is perfect. The bar and shop are clean and aesthetically pleasing. The lift is good, the rooms are clean and spacious. The only downside was the lack of full length mirrors, the light switch being inside the bathroom so you had to reach around in the dark to find it. They only clean your room once every three days, we were there for four days and never got a cleaner. Not a problem for us personally but it's just a note. Overall wonderful for the price and location, and not that loud at night.",
            "time": 1730037572,
            "translated": false
        },
        {
            "author_name": "Vivien Leung",
            "author_url": "https://www.google.com/maps/contrib/105501090311179162608/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIJ82t2Wlp4_Hgo4nIdEFya_4KnLHDjqKDDFvKZ4E6pNlHANw=s128-c0x00000000-cc-rp-mo",
            "rating": 4,
            "relative_time_description": "3 weeks ago",
            "text": "Great location with lots of shops/eateries nearby. Easy self-check-in and check-out process and I liked how there was two entrances of the hotel. The only problem I had was that the walls were so thin! We heard everything from the next room, who were singing non-stop at (nearly) all hours of the day!",
            "time": 1731153584,
            "translated": false
        },
        {
            "author_name": "Maya Skalski",
            "author_url": "https://www.google.com/maps/contrib/107426849028839925117/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVn6TiX9bsYyedZNF9G6GTkzsjOrjPX8chbxylfN0hyojNTQV7J=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "Great location, walking distance to downtown,  museums and other attractions.   Room was very nice  and spacious, very comfortable bed, always clean. This hotel has breakfast buffet,  which you can include with room purchase.  We only had breakfast once but it was very good, it's €25 if you pay separately.",
            "time": 1728637452,
            "translated": false
        },
        {
            "author_name": "Lisa Morley",
            "author_url": "https://www.google.com/maps/contrib/109547524029177396844/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIdkzA6rtNAs2BMjaAkghmuk6309TFU0R5IPf6nbRGOHVq3WA=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 4,
            "relative_time_description": "3 months ago",
            "text": "3 nights in Amsterdam and a great location, central, walking distance to most things. This is definitely the main selling point for this hotel. Lobby area is lovely and smells gorgeous,like a Spa, but unfortunately the rooms don't quite match the downstairs.\nRooms are spacious (241),  although very warm, couldn't adjust the air-conditioning,  and had quite a few flying insects which bit us in the night, reception were very efficient though at spraying our room but didnt stop it unfortunately. Beds are comfy, albeit a bit soft.\nDoes lack hooks or space to hang towels to dry. The placement of the shower head is a bit odd as it faces the screen?\nAlso, the bathroom doors are not the best. You can see through them, and they don't close properly, so privacy is a bit of an issue, especially when sharing a room with a friend.\nTake advantage of free housekeeping each day if mainly to stock up on water, toilet paper, etc. We didn't as thought we would be OK as I expected basics of emptying bins, replenishing toilet paper would be standard.\n\nThe birthday package I purchased for my friend was fantastic , really good value and my friend loved the surprise.\nAll in all a lovely hotel in a fab location. Will definitely be back.",
            "time": 1724227830,
            "translated": false
        },
        {
            "author_name": "Kate Adler",
            "author_url": "https://www.google.com/maps/contrib/106203100891319652354/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLBODrJUK8hHuwlZ7ANk-DhTiSdEfL1RqBO5Jo4t0xs2wyyKU8G=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 4,
            "relative_time_description": "3 weeks ago",
            "text": "Good location. Small double rooms are very small. Infact probably the smallest iv ever stayed in. Friendly staff. Good breakfasts. Clean hotel. The shop and pizza facilities are very handy. Would definitely stay again, just in a larger room.",
            "time": 1731161439,
            "translated": false
        }
    ]
}