{
    "name": "Hotel Torenzicht",
    "rating": 3.7,
    "reviews": [
        {
            "author_name": "Richard Phares",
            "author_url": "https://www.google.com/maps/contrib/111915148247489187136/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUrAYUzHpU56hajZGcV1W6s0yf6IkMrtkZsDjDFZhiyxg6w2gTpxg=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 1,
            "relative_time_description": "3 weeks ago",
            "text": "The worst hotel (?) I've ever stayed at. They shouldn't even be allowed to conduct business. Nothing to be expected as per the description and photos shown on Booking.com, by the way with headquarters located nearby that property in Amsterdam. The first impression that you have is a filthy saloon-style bar in place of a reception hall. The owner or manager is a hillbilly-looking guy that won't even give you a formal detailed receipt upon payment, just a little piece of paper without the name of the hotel or any other important information such as the method of payment or their address or contact details. Besides that, the unbearable stench will hit your nose like a heavy weight boxer's punch. Extremely unsafe steep spiral staircase wit NO elevator. They gave us a horrible room on the third floor. We had to carry our heavy luggage all the way up, climbing on those dangerous narrow steps with metal finish at the edge. The smell was indescribable. It looked more like one of those hostel movies with old stinky harrowing places. Our beds were small, filthy and there was no bathroom but a tiny old lavatory in the room. The shared toilet, tiny as well, was at the other end of the hallway. The heater was old and not working at all. The TV screen was more of an old computer monitor and the room was dark and somber. No views to the street and there were water infiltrations all over the place. I would say they should rent this place as a set for another \"Saw\" or \"Hostel\" movie rather than a hospitality setting.",
            "time": 1731363211,
            "translated": false
        },
        {
            "author_name": "Hassene Ben Salem",
            "author_url": "https://www.google.com/maps/contrib/109195760475860195993/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVbSuJ7UMMv98MVkqAikEvf-odoDZjZOtbqRqP-vHhetFiwGQcfZw=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 3,
            "relative_time_description": "5 months ago",
            "text": "I recently stayed in a room with a shared bathroom on the first floor of this hotel.\n\nPositives:\n- The hotel is very central and everything is just a few minutes walk away.\n- The room was clean and well-maintained.\n- I enjoyed hanging out in the bar with my laptop.\n\nNegatives:\n- There were two showers and two bathrooms on my floor. One WC didn't have soap for the entire stay, despite notifying the staff. The other WC was mostly broken.\n- You have to check in with the staff every time you want to access the room areas, even though there's a card reader for your own room. Sometimes, you'll have to wait up to 5 minutes for them to unlock the door.\n- It was extremely noisy at night. The room doors slam automatically, and there's a lot of noise from the street, corridors, and upper floors. I was fortunate to have earplugs.\n\nOverall, it's a convenient location with some good aspects, but the noise and bathroom issues were significant drawbacks.",
            "time": 1718277279,
            "translated": false
        },
        {
            "author_name": "Pinupster",
            "author_url": "https://www.google.com/maps/contrib/109970290038612666678/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJHPeHd3DvD7ldbiw1nHa3xhilFSupcIGuUy6PEcDwPBVvLjzM=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 5,
            "relative_time_description": "5 months ago",
            "text": "Even though the hotel is situated in the Red Light District, we felt safe around the area. The hotel is very accommodating. If you are looking for a hotel in the heart of the Red Light District, this is definitely the place for you. There is an in-house bar in the lobby where you can chill for longer hours. Hotel Torenzicht made our stay memorable. The rooms are okay, nothing too fancy, but it's good for backpackers like us. It's not recommended for families or those with kids. The toilets are shared with the next room, but this was not a problem at all. Overall, it's good value for the money you pay, and the highlight is just down from your hotel",
            "time": 1719681964,
            "translated": false
        },
        {
            "author_name": "Douglas D",
            "author_url": "https://www.google.com/maps/contrib/109795818298943435688/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUlABMRkAtljSbLTOz1tBz8Uf9P92yIGQG9gkaaa596h0pRe72I=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 3,
            "relative_time_description": "in the last week",
            "text": "It's a 1 star hotel, don't expect much. Steep stairs small rooms basic breakfast. Staff where ok.\nYou get what you pay for.",
            "time": 1733070109,
            "translated": false
        },
        {
            "author_name": "Erika Grigio",
            "author_url": "https://www.google.com/maps/contrib/107721384588683378877/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ4d67ZTSDiNNC7mcXNOG0LHwAuWwNMxDZOvu57rhQg7fuULw=s128-c0x00000000-cc-rp-mo",
            "rating": 1,
            "relative_time_description": "3 months ago",
            "text": "disrespectful and boastful staff who also admitted that the customer never matters because he is never right, dirty hotel with many insects, dirty and dusty rooms if you have allergies to dust I do not recommend. unsanitary place unwashed sheets as soon as I sat on the bed I got itchy all over my body, place not at all welcoming, old and backward. truly horrible the worst service and hotel ever seen before not at all recommended call back that you get some illness but above all the fact that they don't refund your money and deny the evidence of bad hygiene and it's absurd it needs to be closed! it doesn't reflect the photos, shame, at least the decency of being honest people and returning the money but if you don't make a living like this you'll be bankrupt so you have to cheat the tourists otherwise how can you support yourself. the shared bathroom, among the worst things, was broken, dirty and smelly as if it were a public toilet that you find on the street after it was used by half of the population. Shame of you, obviously there is no need for me to say that the cost does not reflect the building too expensive too high for the conditions.",
            "time": 1723477400,
            "translated": false
        }
    ]
}