{
    "name": "Grand Hotel Amrâth Amsterdam",
    "rating": 4.2,
    "reviews": [
        {
            "author_name": "Frank Herrera",
            "author_url": "https://www.google.com/maps/contrib/112404074654436682596/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKiw074Ih9tWky8yIByxbTlm_OMSxqOrMv5x8mk2iSnfZDcuw=s128-c0x00000000-cc-rp-mo",
            "rating": 1,
            "relative_time_description": "a week ago",
            "text": "********Attention********** We believe we were robbed by the Hotel Staff! It had to be hotel staff because no one else had access to the room. Beware and Stay Away from this hotel. During our stay, the managers were H. A. and M.G. I have to say that these are the most unprofessional hotel managers you can possibly run into. They did not help the situation and Mr. H. A. made threats to put us on a blacklist and called us liars. We had 2 laptops and other belongings stolen from our room, when in fact the room door and windows were closed. We quickly called the staff and reported what took place. We could not make the police report that evening because they informed us to come in the morning, when we went to the police station the wait during that time was almost 3-4 hours. This was our first Europe vacation, and we were not going to spend almost half the day at the police station. When we approached the manager Hisham and explained the situation he made us feel like we were lying. After almost a day, a complete stranger from a different hotel contacted us since we had our info on our belongings and informed us that they found those items in a different hotel. We went to that hotel and picked up the items that were stolen, they were all in the main area of that hotel. We became aware that the housekeepers are temporary workers and are working at different hotels on a rotation. This was not our only issue, we had other issues with the room that we originally booked. The first room we were given had a problem with the shower door. I crushed my fingers while opening and closing the door. This was a safety hazard. We promptly reported the problem to the hotel staff, and they switched our room to a larger one however it had the same issue with the dangerous shower doors that can crush your fingers. We agreed to stay in the room since we didn’t have any other options considering it was a busy weekend in Amsterdam. After our experience we definitely will not stay at this hotel, if we return to Amsterdam we will choose a different hotel.",
            "time": 1732434153,
            "translated": false
        },
        {
            "author_name": "Sunny",
            "author_url": "https://www.google.com/maps/contrib/112832219831055958068/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJRlg-yh2DOpr3fFTVbrnvpeLJoqenR7VCjHm9i1Irj1s4QSg=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 2,
            "relative_time_description": "in the last week",
            "text": "I recently stayed at this supposedly 5-star hotel, but unfortunately, it fell far short of expectations. Instead of the luxury and comfort I anticipated, my stay was riddled with frustration and disappointment.\n\nUpon check-in, I was assigned a room so cramped it felt like a matchbox—nothing remotely close to what one would expect from a premium hotel. After raising my concerns, I was moved to a slightly larger room, but the issues didn’t end there. The bathroom lacked basic functionality, with no shower curtain to prevent water from flooding the floor after each use. While housekeeping cleaned it the next day, it was unpleasant to walk into a wet, messy bathroom every time.\n\nThe lack of USB charging points was another letdown—an essential amenity for international travelers. When I asked for assistance, instead of offering a complimentary solution, I was asked to pay €11 for a North American converter, which felt unreasonable given the already high price of the stay.\n\nThe overall experience was marred by subpar facilities, indifferent staff, and added charges for basic necessities. The staff seemed disinterested and rarely made an effort to smile or engage. At one point, I wanted to ask about tourist attractions, but the staff appeared too busy, so I ended up heading to the Central Station for information instead. At checkout, I was handed a card with a QR code, but it didn’t work—yet another disappointment.\n\nThe only redeeming quality was the hotel’s location near the Central Station. However, that alone doesn’t justify the premium price tag. My experience was underwhelming and lacked the service, attention, and amenities expected of a 5-star hotel.",
            "time": 1733051068,
            "translated": false
        },
        {
            "author_name": "Chris Penny",
            "author_url": "https://www.google.com/maps/contrib/108307535645170743551/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJKVPqjSHhoEYngXkzO70ZIVZ09pi4TGb87sfWgzuADGYsb7w=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "We had seen reviews about the hotel being dated. The hallways maybe could do with a little revamp but other than that we couldn't have been happier with the hotel. Great location for a short break. The pool and wellness centre is a really nice extra to have in the hotel. room very comfortable with a lovely bathroom. Very pleased.",
            "time": 1729975745,
            "translated": false
        },
        {
            "author_name": "Winnie T.",
            "author_url": "https://www.google.com/maps/contrib/118278914772300316353/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKyBdEKU0mi1I1fuqdeVF6ey6a80bdGEe84LQgt1NzGoaSnqw=s128-c0x00000000-cc-rp-mo",
            "rating": 3,
            "relative_time_description": "3 weeks ago",
            "text": "My husband and I just returned from our long weekend in Amsterdam.  We stayed at this hotel as it’s part of the holiday package that we booked.\n\nHaving read some of the reviews by other customers, wish we read them before we made the booking as most of their comments were pretty accurate.  Although some of the hotel staff were very helpful and courteous, some were not.  On a couple of occasions, we called for the attentions of the waiters/waitresses whilst they were clearly chit-chatting, they only made the way to our table when they finished with their conversation with their colleagues.\n\nThe room in general is very dark but guess that’s in keeping with the 20’s design style of the hotel.  Though they have a nice, decent modern bathroom with great shower.  However, it didn’t help by the fact that we had a broken light bulb in our bathroom for which we reported as soon as we realised after checking-in on day one, it has not been fixed throughout our stay despite repeated reminder to the reception team every morning.  One of the receptionists, blessed his heart, did offer to put a lamp in the bathroom for us but we didn’t think that’s a sensible move putting a lamp right next to the wash basin!\n\nThe above issues aside, bed is comfortable (but not the pillows); absolute fantastic location right across from Amsterdam Central Station and within 10 mins walk to Dam Square.  In addition, the hotel does offer a great Spa/swimming pool facility which we did enjoy and so we’d give that a 5 out of 5.  Apart from that, will we go back and stay at this hotel again?  Sadly no.\n\nNot sure how the star ratings work but in my opinion, it’s more a 4-star rather than a 5-star hotel.",
            "time": 1731417366,
            "translated": false
        },
        {
            "author_name": "Steve McCoy",
            "author_url": "https://www.google.com/maps/contrib/109465633195625529607/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVXSLuF2mq_dwVHMMTsgYoXZozafebHOci3qJAsJWquT9O5pY6UEg=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "5 stars for the GRAND HOTEL AMRATH!!!  From the moment we arrived for check-in, we found the staff to be kind, courteous, helpful, and welcoming.   We were surrounded by old world beauty – a very striking building and an architectural masterpiece that celebrates the height of Art Deco design.  Our room was comfortable, spacious with high ceilings and art deco authenticity, and very well maintained.  The breakfast selection is plentiful and delicious, and this is a great location to use as a “home base” to explore Amsterdam.  Again, I cannot understate just how beautiful the building is.  It is from a time lost.\n\nThe friend with whom I am traveling and I loved our stay so much, we will be returning!\n\n-- Stephanie K.",
            "time": 1729407008,
            "translated": false
        }
    ]
}