{
    "name": "ICON BCN",
    "rating": 4.4,
    "reviews": [
        {
            "author_name": "ricki levi",
            "author_url": "https://www.google.com/maps/contrib/112116101372275414547/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJzF4a3zixWIqW7I0GFnX-EAPAZgdRABFXwcS6LgZEqp18FAw=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "The hotel is located in the center in the heart of things and is really beautifully designed, a boutique hotel that has an old elevator that has been renovated and is even operational. The reception, the restaurant, and the terrace area with the pool are nicely decorated.\nThe staff is very kind, especially at breakfast. When we arrived the first morning, Vanessa talked to the children and realized that we were celebrating my daughter 3rd birthday, she arrived with a brownie and a candle and together with the employees sang her birthday.\nThe breakfast is very rich, there is everything from everything, fresh pastries, fruits, vegetables, eggs, cheeses, sausages, juices, coffee and all types of milk and substitutes. And even a gluten-free menu placed on all the tables (impressive) there is an option to order eggs in the preferred style or pancakes (which the children ordered every morning) for the table. We also ordered room service, the food arrived and was delicious and so was the sangria 💃🏽\nIn terms of cleanliness, everything was good, there was always a pleasant smell in the hotel and in the corridors. Clean towels were brought every day, but by the third day the room was already really dusty, so it's obvious that they don't vacuum every day.\nThe rooms are spacious and equipped with all kinds of fun kits and soaps. And the bunk bed was a hit and my daughter enjoyed climbing :)\nOverall a great hotel I would recommend to families as well as couples",
            "time": 1729430307,
            "translated": false
        },
        {
            "author_name": "Leyla Gasimova",
            "author_url": "https://www.google.com/maps/contrib/107129011928150050247/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVnQXHqHTfzrQ-ERSiFmaNZNygU81aehfpc1I5yKXd2yclka_M=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "Everything was perfect. Especially Martha from reception has helped us a lot! She was very friendly and helpful. Breakfast was amazing. Location is the best, you can walk anywhere. I like to get tanned, they have rooftop and i got really tanned. Overall thanks to the staff for their great service no matter what.",
            "time": 1725365037,
            "translated": false
        },
        {
            "author_name": "Leslie Tripp",
            "author_url": "https://www.google.com/maps/contrib/110999264265085779913/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUfErI27ukYsXG4UxoVab880tVvk7glXhektOwxAfRD4z_5LP1d=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "2 weeks ago",
            "text": "Walk to literally everything! Bus routes are very close too. Groovey little bar downstairs with an outdoor patio. The service and hospitality was top notch! So nice to be in a foreign country and get the best recommendations! The manager was very kind and checked in on us to see how we were doing, I broke my toe and the girls in the bar gave me ice.\nI loved the morning breakfast ! They really have everything! Stay for the breakfast eat dinner out!",
            "time": 1731945284,
            "translated": false
        },
        {
            "author_name": "Jo Myatt",
            "author_url": "https://www.google.com/maps/contrib/117656016951985883185/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKQM2Yqqqiq_nXoWi0B0RcMOACFtNUAfKsgzzGLjzF61bLKbA=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "Visited with husband and 15 year old daughter. Triple room was spacious, clean and comfortable.\nStayed for 4 nights and found that the location was excellent and staff were friendly and helpful.\nBreakfast was good quality with lots of variety and we found the food and service in the restaurant in the evening was very good also.\nWe had a wonderful stay and would recommend.\nThank you for helping make our first trip to Barcelona a very memorable one.",
            "time": 1723993299,
            "translated": false
        },
        {
            "author_name": "AJ F",
            "author_url": "https://www.google.com/maps/contrib/103450606892757072427/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK7Qgo4BA7Cgo_TVciWbg_YLYdtDavn43Fndp6usAilc7ggow=s128-c0x00000000-cc-rp-mo-ba6",
            "rating": 4,
            "relative_time_description": "2 months ago",
            "text": "Centrally located with a super friendly and lovely staff.The beds are comfortable and adequately stocked with basics.\nThe shower is a bit wonky and it is located by a school so if you plan to sleep in past 8am-you may not be able to do so.\n❤️buffet breakfast",
            "time": 1726839504,
            "translated": false
        }
    ]
}