{
    "name": "Hotel Barcelona Catedral",
    "rating": 4.3,
    "reviews": [
        {
            "author_name": "Anastassia Kozyrev",
            "author_url": "https://www.google.com/maps/contrib/113845254556071209726/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLLiCaFpRSeGw6UlUZaGldQMUg4yNNBEJwM0QbeIYwWokqUYg=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 3,
            "relative_time_description": "3 weeks ago",
            "text": "I recently stayed at a hotel near and while the location is absolutely unbeatable—right in the heart of the city and within walking distance to major attractions and great dining spots—the stay itself was less than ideal.\n\nThe room was clean, though quite small, which wasn’t a big issue for me since I spent most of my time exploring the city. However, the bed and pillows were incredibly uncomfortable. The bed was hard, and the pillows were so firm that after three nights, I developed neck pain. Perhaps if we had raised this concern early on, the staff might have been able to change our room or provide softer pillows, but unfortunately, we didn’t ask.\n\nGiven the price point of the hotel, I believe the bed and pillows should have been much more comfortable. A cozy and restful night’s sleep is something I expect at this price level.\n\nOverall, I give the hotel 3 stars: it’s hard to beat the location, and the cleanliness was satisfactory, but the discomfort of the bed and pillows really impacted my experience. If you prioritize location above all else, this could still be a good option, but be prepared for a less-than-cozy sleep.",
            "time": 1731516545,
            "translated": false
        },
        {
            "author_name": "Michelle Bolton",
            "author_url": "https://www.google.com/maps/contrib/107685257049923928038/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXNs957EvbvG2sN_1Xw_ckzZ-iCj9XEC4UauW3HcKR_6MKTn_uCvQ=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "4 weeks ago",
            "text": "Amazing, central location.  Walking distance to many restaurants, shops, and attractions.\nThe room was very clean with a large bathroom.\nThe gym is very small, but I'm happy they had one for a boutique hotel.\nThe staff was kind, patient, aid bent over backwards...",
            "time": 1730948546,
            "translated": false
        },
        {
            "author_name": "Laurie Carty",
            "author_url": "https://www.google.com/maps/contrib/101898830892524543411/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWG4n0RvETuPcPh3PE2gGrd2JNhbhdcAbce07HgXs9yxEoy00ul=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 4,
            "relative_time_description": "in the last week",
            "text": "Place was lovely, the room with the terrace outstanding. But really hard to locate any food or bar workers to order.\nGetting coffee for the maker in the room or ice was near impossible 🙄",
            "time": 1732994459,
            "translated": false
        },
        {
            "author_name": "Sandra El Khouri",
            "author_url": "https://www.google.com/maps/contrib/114036834861721985873/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVDnbwf-rnDLscuhoTjwdOnXxW6m4eu6h6ylTpYr8gwzxZu24FdIg=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 4,
            "relative_time_description": "4 months ago",
            "text": "It's a nice hotel at an amazing location! We arrived to an extremely smelly room with a leaking ceiling. The staff immediately gave us another room. They were friendly and helpful.\nThe new room and bathroom were clean. We got good toiletry. The shower door could be larger/wider to keep the water in the tub. The tub was pretty slippery. Be careful.\nSome cons are the slow WiFi, the uncomfortable pillows and the fact that our safe was locked when we arrived. We didn't have time to let the staff know so we simply didn't use it.\nI recommend using ear plugs during the night because it could be a bit noisy.\nOverall, nice location and good room. I would come back.",
            "time": 1722066749,
            "translated": false
        },
        {
            "author_name": "Monique Lawshe",
            "author_url": "https://www.google.com/maps/contrib/118370701739141674143/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKQdxBA0v6u9UBwMGWy13CsDg1JRNCVEXCsbOD59FeOO0zlXA=s128-c0x00000000-cc-rp-mo",
            "rating": 1,
            "relative_time_description": "2 months ago",
            "text": "I was placed in a first floor room after expressly requesting Not to be on a low floor.  The location is LOUD and I cannot sleep.   The garbage truck has stopped here twice in the last hour.  Another truck, or maybe the same one is now idling making a lot of noise on the block.  I called the desk only to be told there are no rooms available.   However, checking on line,  that is not true.  There are rooms immediately available.  So...not only was the check in staff unhelpful, the current front desk staff lied.  I cannot sleep due to all the noise. Do not stay here if you care about being rested.  It is not worth it!",
            "time": 1726008721,
            "translated": false
        }
    ]
}