{
    "name": "Olívia Plaza Hotel",
    "rating": 4.5,
    "reviews": [
        {
            "author_name": "Soner Tarim",
            "author_url": "https://www.google.com/maps/contrib/116182867554063232141/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVjX8sdAlkFvJsr_ZgfFKW1v8_6ClfSbnDrfqdjdqCgxoOTNS_T=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "in the last week",
            "text": "Olivia Plaza Hotel: A Perfect Blend of Location and Service\n\nLocation, Location, Location\n\nThe Olivia Plaza Hotel boasts an enviable location in the heart of Barcelona. Situated just steps away from Plaça de Catalunya, you'll find yourself immersed in the city's vibrant energy. While it's not tucked away in a quiet corner, the hotel's central position provides easy access to all the major attractions, shopping districts, and public transportation.\n\nConvenience at Your Doorstep\nThe hotel's prime location makes it incredibly convenient for exploring Barcelona. Whether you're eager to wander through the Gothic Quarter, soak up the sun on the beach, or indulge in world-class shopping, everything is within reach. The nearby metro stations and bus stops offer seamless connections to other parts of the city, ensuring a hassle-free experience.\n\nService with a Smile\nOne of the highlights of our stay at the Olivia Plaza Hotel was the exceptional service provided by the staff. From the warm welcome upon check-in to the attentive service throughout our stay, the team went above and beyond to make us feel comfortable and cared for. Their knowledge of the city and willingness to assist with recommendations and bookings were invaluable.\n\nOverall Impression\nWhile the Olivia Plaza Hotel may not be a secluded retreat, its central location and excellent service make it an ideal choice for travelers seeking a vibrant and convenient base in Barcelona.",
            "time": 1733087317,
            "translated": false
        },
        {
            "author_name": "Ivan Hristov",
            "author_url": "https://www.google.com/maps/contrib/114966685034958060664/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUQQc9oVE5b2p8eUns7Nqh46nNIMMjUURG31G-6iChlX_nEmLXc=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 5,
            "relative_time_description": "a week ago",
            "text": "Great place.\n\nAbout the location: It’s obviously great.\n\nAbout the stuff: I expected from the stuff to be nice. But they were much more than that! They treated me like we are family! So warm and helpful. Without crossing the border of a good and polite behavior! I give them 10 out of 10!!!\n\nRooms are totally great too.\n\nI recommend Olivia Plaza Hotel with all my heart!",
            "time": 1732440142,
            "translated": false
        },
        {
            "author_name": "Melanie Goddard",
            "author_url": "https://www.google.com/maps/contrib/104741014958114850837/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUAZH8itYj0YOVu57sy8v_EUkXEyj2cBbJFXI-i1RJKxf4B3Xvy=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "Our 5 day stay at the Olivia Plaza was wonderful - the staff are friendly, helpful and efficient, and quick to accommodate requests.  The facilities were clean, comfortable and stylishly decorated.  Beds were comfortable (a bit firmer than our US preference, but still nice.) The Hospitality Suite was wonderful!  We appreciated being able to get a coffee or beverage and light snack at \"off\" hours, and we enjoyed the secret view of the St Anne's chapel sandwiched in behind the hotel.  You really can't beat this location!!  Would definitely stay here again.",
            "time": 1729617282,
            "translated": false
        },
        {
            "author_name": "Davide Macario",
            "author_url": "https://www.google.com/maps/contrib/104733620905509688805/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVrXhZx6MjjAPPlB3I2pDW2lObD4KMK7bfKVyS7wZ7X0tCPOa7m=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "My stay at this Hotel was extremely pleasant.\nI had a great view of the Plaza and a comfortable room (Suite).\nThe air conditioning works extremely well therefore bearing the heat was not a problem.\nThe services of the hotel provide any comfort you may need.\nI extremely appreciated the breakfast room where the personnel is kind and professional and you can enjoy your time in there.\nThere is an inner restaurant where you can taste different things.\nThe hotel has a joint partnership with a resort / fitness centre that is roughly 10 minutes walk.",
            "time": 1724848040,
            "translated": false
        },
        {
            "author_name": "J L",
            "author_url": "https://www.google.com/maps/contrib/108563751990049429770/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJBTh5BF2rPQoD-jZHtQoSPUUJXiLM_rSDpufdvxRwR3VD8Yg=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "4 weeks ago",
            "text": "I loved everything about Olivia Hotel in Barcelona, Service was fantastic, especially the front desk! They were very helpful and made every effort to accommodate. The room was clean, quiet and very comfortable. Location was fantastic, but the The staff really made the stay. I would highly recommend this hotel, you won’t be disappointed.",
            "time": 1730860079,
            "translated": false
        }
    ]
}