{
    "name": "Hotel Constanza",
    "rating": 4.4,
    "reviews": [
        {
            "author_name": "Jaymes Squirrel",
            "author_url": "https://www.google.com/maps/contrib/114944701201361955596/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXCGoHnC0FYvOpv0yc2nISpQr3zTIe09Bhz5zREg8qiUYPGAqbn=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "Making this post only 2 days of my 7-day trip with my wife. And have to say the staff are very friendly and helpful with any questions that may come up. The fact that we were showed up 5 hours before checking and they let us keep our bags here well it's fantastic. The location is great for Metro bus or walking to certain areas. Food and drinks around here are phenomenal. And the fact that there is a 24-hour supermarket almost every two blocks makes small snacks and things for the hotel room even easier. Highly recommend this place and explains why this place was fully booked the day we arrived.",
            "time": 1728830987,
            "translated": false
        },
        {
            "author_name": "Bradley C",
            "author_url": "https://www.google.com/maps/contrib/112696762711471695451/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU4omEs3MNbBJc4QHboXxytGInNk15AZajdctBn6zM8bYmci143Uw=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "Well located with fabulous affordable restaurant at the corner. Felt like a busy safe area yet not loud.\n\nRoom was nice, bed comfortable, three choices of pillow. Staff spoke excellent English.",
            "time": 1729237568,
            "translated": false
        },
        {
            "author_name": "Elizabeth Griffin",
            "author_url": "https://www.google.com/maps/contrib/111637088225384639464/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIFbk5jNzH10i6JaK35Na9eHauWyJ7mKqaYi4RvfGpbCNtrVA=s128-c0x00000000-cc-rp-mo",
            "rating": 2,
            "relative_time_description": "2 months ago",
            "text": "Location is great. Definitely eat at El Mercat next door. Get the eggplant, chicken with curry, and patatas w bravas.\nBack to the hotel- There was a bunch of hair on the bathroom floor. Like I don’t know how it was missed. The bathroom door doesn’t actually shut. The door seems off the frame. It is not lined up in a way that the door can shut.\nWe found a razor behind the curtain to the patio.\nMy roommate took a shower and flooded the front part of our room all the way into the hall bc the drain wasn’t draining the whole time apparently. There is less than an inch barrier / wall until the water floods over out of the Shower onto the floor.\nThey said they couldn’t fix it until two days later (after we checked out) and there were no other rooms. They told us to just use towels on the floor when we shower to not flood the room / hallway.\nThe hotel breakfast is in a small Space in between the kitchen and the breakfast restaurant next door. There were flies all over the meat.\nIn your room, You can hear everything in the hallway and apparently ppl love slamming their doors. It’s constant. Good luck staying asleep.\nPatio is very cute. Ppl at front desk are nice.\nI would not stay there again.",
            "time": 1726669730,
            "translated": false
        },
        {
            "author_name": "Maddi Seiberlich",
            "author_url": "https://www.google.com/maps/contrib/102727344094976447886/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXBjQniuXaf_OzLg01egB3UYaV8QLOqWMSgHHXFw0CB8PeJaDDo=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "5 months ago",
            "text": "We had such a great experience here at Constanza. Great, central location, and the safety of this hotel is great with the front door being locked at all times. Most importantly Karim, who works at the front desk showed us a map with sight seeing and and food recommendations that did NOT disappoint. Karim defenitely made the difference in our trip. Early luggage drop off, ice cold A/C, and a balcony with a very nice street view!",
            "time": 1719044160,
            "translated": false
        },
        {
            "author_name": "Yani Drenchev",
            "author_url": "https://www.google.com/maps/contrib/109223342445949657392/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVrIfAir1KKQAWHQAZGh1d4r7pKWUrAuZVkXXrosahklxY7U2Ck=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "4 months ago",
            "text": "So perfect location, their rooms were very clear and tidy we were here for like six days and every day one room was clean. There is a rooftop that works until 8 o’clock in the afternoon I would say 5 to 5 stars.",
            "time": 1721837727,
            "translated": false
        }
    ]
}