{
    "name": "Sallès Hotel Pere IV",
    "rating": 4.1,
    "reviews": [
        {
            "author_name": "Geoffrey De Ram",
            "author_url": "https://www.google.com/maps/contrib/104135762218188502749/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUXEYkwh8OQ907QmrCViZA-uRE8vdX8lduZlfytGRancJzHVJbw=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "The hotel was really nice and super clean. All the staff were very friendly. The room was spacious and equipped with all the amenities you need, and the bed was incredibly comfortable. The spa was a great addition to the stay, not large but perfect for relaxing after a day of exploring. The rooftop offers a fantastic view as well. The location is not central but convenient, close to the subway, and you can reach many interesting spots by walking. Despite being close to clubs, the neighborhood feels safe and quiet.",
            "time": 1726572555,
            "translated": false
        },
        {
            "author_name": "Katarzyna Stolarz",
            "author_url": "https://www.google.com/maps/contrib/114985117012952885256/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW7A83apyDR5Ugdzy9cVdih-qvpihqv4BwBbd4C8g4lsl8RDJLJ=s128-c0x00000000-cc-rp-mo",
            "rating": 4,
            "relative_time_description": "a month ago",
            "text": "It's been amazing stay, great connection to the city centre by metro, lovely clean room, service in the restaurant and hotel bar lovely the highest standards! Well done guys! Reception a bit disappointing, we asked if the rooftop bar will be opened, they said yes. We've changed all plans and went there unfortunately no lovely view no cocktails and no attraction and disappointing...",
            "time": 1730413098,
            "translated": false
        },
        {
            "author_name": "Dav Mac",
            "author_url": "https://www.google.com/maps/contrib/100431721945930767802/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKicWJOkQairglw1EVSamMVnIB7_Bx6fz4GbO-Epz-Nku97UZI=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 2,
            "relative_time_description": "3 months ago",
            "text": "Positives:\nThe hotel looks nice and is clean. Staff were lovely and friendly.\nThe rooftop is impressive, and it has lovely views over the city.\nThe room has a safe.\nThe pillows on the bed were nice and comfy.\nPlenty of storage for clothes etc.\nNegatives:\nThe location and vibe of the area are unpleasant. The area is run down and has graffiti everywhere. Having a 4-star hotel in this type of area is really weird. It's too far away from anything, so either bring some good walking shoes or be prepared to call an Uber.\nThe air conditioning worked, but it did not cool the room enough.\nTea and coffee were not replenished during our stay.\nWater in reception was warm, and it would be nice to have some ice in it, especially when there is a heatwave.\nThe windows in our room opened to face windows of opposite rooms but I'm glad we didn't look out onto the street because there were bars and clubs nearby and you would have gotten loads of noise from them.\nThe rooms are not sound proofed so you hear your neighbours and the maids in the morning.\nThe beds were too hard and uncomfortable.\nThe extractor fan in the bathroom did not work, so it got too hot and humid after a shower.\n\nOverall\nThe hotel looks nice and clean and the staff were lovely during our stay but there are too many issues with the room and the location of the hotel is not good. Therefore, I wouldn't return or recommend it.",
            "time": 1723365009,
            "translated": false
        },
        {
            "author_name": "Marko Mrvelj",
            "author_url": "https://www.google.com/maps/contrib/112323348292410008800/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXEFDHEier37JF-JiYwDM-HNCq9isf7gvnZAXNnDObvNQD2OnC15Q=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "5 months ago",
            "text": "Very clean, a great breakfast choice, good location. Room was comfortable although long and narrow. On the downside the whole neighborhood is a bit (not terrible) smelly , not sure where the smell comes from. Rooftop is a great for the end of the day drinks or even dinner.\n\nOverall hotel completed a great Barcelona experience for us.",
            "time": 1720347562,
            "translated": false
        },
        {
            "author_name": "Aleks Malamud",
            "author_url": "https://www.google.com/maps/contrib/115445967912713393915/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ1rc-apxv4uQmE3mtXt97-I94AzH7NMBeIBHSaojbTM4o2lQ=s128-c0x00000000-cc-rp-mo",
            "rating": 4,
            "relative_time_description": "4 months ago",
            "text": "Nice place. Decent location. Very good, friendly staff. Elevators are a bit slow. Terrace upstairs has a fantastic view, but closes at 11, too early for Barcelona. Regular rooms are on a smaller size, but functional. Enjoyed our stay overall",
            "time": 1721471909,
            "translated": false
        }
    ]
}