{
    "name": "Hotel ILUNION Almirante",
    "rating": 3.6,
    "reviews": [
        {
            "author_name": "Ahmad Alkandari",
            "author_url": "https://www.google.com/maps/contrib/116930589007451892944/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLeWjZdzKQSOHIhN9_KOIWjcH0qiE7uSv6KUgAWZw7LtEFk2A=s128-c0x00000000-cc-rp-mo",
            "rating": 1,
            "relative_time_description": "a month ago",
            "text": "I stayed here for 4 nights, paying nearly 900€, and it was a massive letdown. Despite being advertised as 4-star, this hotel felt more like a 2-star at best.\n\n•\tThe bed sheets had yellow stains on them when I first checked in—God knows what they were from, but it was appalling.\n•\tThe elevators didn’t work properly.\n•\tShockingly, room service entered our room early in the morning while we were still sleeping, despite no request—a serious breach of privacy.\n•\tAlthough we asked the receptionist to have our room cleaned while we were out, it wasn’t touched.\n•\tThe staff barely spoke English, the room lacked basics like carpet, adapters, and slippers, and there was constant noise until midnight.\n\nThe location was the only decent thing, but this hotel is nowhere near worth the price. I wouldn’t recommend it to anyone.",
            "time": 1730115696,
            "translated": false
        },
        {
            "author_name": "Stanley Goh",
            "author_url": "https://www.google.com/maps/contrib/115580351153665221187/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLIFjf82FqanjwAUnXbs7h3toIcGWS0FgXUOv_B06RKGjD32qI=s128-c0x00000000-cc-rp-mo",
            "rating": 1,
            "relative_time_description": "5 months ago",
            "text": "We stayed here for 4 nights in total but our experience has been far from even meeting minimum expectations.\n\nLet’s start with the 2 positives and it ends there unfortunately:\n1) The hotel is in a great location, walking distance from many main attractions, Metro stations and eateries.\n2) The front office staff have been very patient and professional but they are unable to counter all the negatives we faced.\n\nCons on why we wouldn’t recommend this place:\n1) The hotel seemed to have put all the work into making the lobby look nice but the rooms feel more like a motel room. The moment we entered there was a constant musky smell. Our room had a window that was 30cm from a wall so there wasn’t any point even opening it up to ventilate it.\n2) The walls are very thin, and this is the first time I have experienced a bed right beside the room door. These features had severely disrupted our sleep as there were constant people walking across the hallway which you will hear. I could hear full conversations and water running from the bathroom in the room next door while in bed.\n3) The pillows were thin and small, and did not provide any support to our necks at all.\n4) The room next door was partying until 1-2am and unfortunately the hotel staff could not do anything to stop them.\n\nThe price we paid versus the 4-star status given to this hotel is going to give many potential customers the wrong idea. Do watch out for reviews like this before making a booking.",
            "time": 1718523527,
            "translated": false
        },
        {
            "author_name": "Emily Ha",
            "author_url": "https://www.google.com/maps/contrib/117235792598357694033/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLJ-Nfq0RYPAzK-3lMsfHreddsOScbsgXnCedML-f3a_3fq=s128-c0x00000000-cc-rp-mo",
            "rating": 3,
            "relative_time_description": "4 months ago",
            "text": "It’s ok. The room is a decent size but thin walls and the mirrors could not be further away from the natural light. Very comfy bed! Decent breakfast options. We were waiting about 20-30 minutes to check in, I have never had to wait that long before at a hotel, and the receptionist made a big deal about the minibar being free and a “gift” when it just contained two cans of water. The 2 parties before us were given cava on arrival but when it got to us we were told they were out of glasses.",
            "time": 1722375733,
            "translated": false
        },
        {
            "author_name": "John Bruce-Kennedy",
            "author_url": "https://www.google.com/maps/contrib/109283077425109678323/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLGfnSiAUyir04FLqjgr4Nozi4ljiAKjlHtZU0EzKr4CWWRYg=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 3,
            "relative_time_description": "4 months ago",
            "text": "Quite disappointed by this hotel. It was OK for a single night stay, but the room was very basic and nowhere near the quality of the pictures shown online. The service was exceptional, prosecco on arrival, sweets and juice available downstairs hallway, beautiful front lobby. But rooms need to be a lot more interesting in my opinion. Also, you can hear lots of noise from the corridor, more so than any other hotel I've stayed in. But the service from Luis made up for a lot of the downsides!",
            "time": 1722231872,
            "translated": false
        },
        {
            "author_name": "Bekie Spark",
            "author_url": "https://www.google.com/maps/contrib/110954797738707484471/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWxvdLnA4PnKtW4ycRgPsjHwsjR4d6-lA5IdS1KGwf_l3r-APuV=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 4,
            "relative_time_description": "2 months ago",
            "text": "Overall good experience.  Lovely room 8/10 for cleanliness. Staff were all lovely and happy to help if needed. They nearly all spoke good English and if not got someone who could.",
            "time": 1727039671,
            "translated": false
        }
    ]
}