{
    "name": "Grand Hotel Central",
    "rating": 4.5,
    "reviews": [
        {
            "author_name": "Millie Puig",
            "author_url": "https://www.google.com/maps/contrib/108037048363756673595/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLgcBJVgN17JicoIbVlz3834g1jG9Wo8zn_wLCp4iEz3SyUHA=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "in the last week",
            "text": "Hotel Grand Central is excellent highly recommend. Excellent location, service and clealiness. But the distinguishing trait is their service. I especially want to acknowledge Nelly the morning breakfast lady who was so accommodating and kind. My deepest thanks to her welcoming. The entire staff at the hotel prides itself on serving the clients. Kudos to the staff..",
            "time": 1732861954,
            "translated": false
        },
        {
            "author_name": "Cailan Shannon",
            "author_url": "https://www.google.com/maps/contrib/106601667954575715938/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXzFs9GeywFAvaX-jlHWcsmMfaujM24MK_dBXkp2d9wMGR03Hk=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "This place was incredible. From the comfort of the rooms, to the rooftop infinity pool & bar, I didn't want to leave the hotel. The bed was so comfortable, the sheets were soft, the tub was huge. They left bottles of water on the bedside table, chocolate on the bed, and personal touches to make the stay feel special. The continental breakfast was the best I've ever had, so many foods to choose from. The guest service was above and beyond, they even helped to celebrate my friend's birthday!! I would highly recommend this place.",
            "time": 1726067573,
            "translated": false
        },
        {
            "author_name": "Neda Sbg",
            "author_url": "https://www.google.com/maps/contrib/104210186437380364834/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKWZ0CPgXGXLrhQwAjdjFoQ7ZpXDJ-_TzYuLOVgLa0pZN-tIg=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a week ago",
            "text": "I recently had the pleasure of staying at the Grand Central Hotel in Barcelona, and it was nothing short of extraordinary. From the moment I arrived, I was impressed by the warm welcome from the staff and the seamless check-in process, which set the tone for a truly memorable stay.\n\nThe hotel’s location is unbeatable—situated in the heart of Barcelona, it offers easy access to the Gothic Quarter, Las Ramblas, and many other iconic attractions. Despite being centrally located, the hotel feels like a serene oasis amidst the vibrant energy of the city.\n\nMy room was impeccable, combining contemporary design with luxurious comfort. The bed was incredibly comfortable, the linens were of high quality, and the attention to detail in the decor made it feel both stylish and cozy. The bathroom was spacious, with a powerful rain shower and premium amenities that added an extra touch of indulgence.\n\nOne of the standout features of the Grand Central Hotel is its rooftop terrace. The panoramic views of Barcelona are breathtaking, and the infinity pool is the perfect spot to relax after a day of exploring the city. Whether you’re enjoying a cocktail at sunset or lounging by the pool, the ambiance is unmatched.\n\nWhat truly sets the Grand Central Hotel apart, however, is the exceptional service. Every staff member I encountered went above and beyond to ensure my stay was perfect, offering thoughtful recommendations and assistance with a genuine smile. Their dedication to hospitality is truly commendable.\n\nOverall, the Grand Central Hotel exceeded all my expectations. Whether you’re visiting Barcelona for leisure or business, this hotel offers a perfect blend of luxury, convenience, and outstanding service. I can’t wait to return and highly recommend it to anyone planning a trip to this incredible city.",
            "time": 1732550846,
            "translated": false
        },
        {
            "author_name": "A s",
            "author_url": "https://www.google.com/maps/contrib/111959112476739595662/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL4X_kKeC8PUrGpTGsVibuabeja2Kzr0rX9mWbLwMMYevo2PA=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "in the last week",
            "text": "Absolutely perfect hotel. The perfect location with amazing hospitality and great spacious rooms. Everyone was amazing there. Until we checked out and were almost 20 minutes late because we were lost in route back to the hotel and the person who checked us out decided to be real rude and ruin the whole experience by ending it on a sour note. He did not bother to understand why we were late TWENTY minutes and demanded we paid 30€, not knowing we did not have international minutes to call the hotel to inform them that we would be late and how the taxi driver decided to drop us further away for us to walk back to the hotel for reasons unknown. If it wasnt for this rude inconsiderate man, this hotel would have been amazing through and through. Maybe better to tell him to give their customers the benefit of the doubt instead of immediately treating us badly for us being 20 minutes late. Otherwise perfect hotel and would definitely stay here hoping not to face that rude face again.",
            "time": 1732895082,
            "translated": false
        },
        {
            "author_name": "Hackjae Park",
            "author_url": "https://www.google.com/maps/contrib/101723169805845940993/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLDwWBZAkPkHAwBNZ1b7VFX1ww1W_Ym3lPQRdxX3mGFLF5GIA=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a week ago",
            "text": "Very good breakfast. Kind Staff. Location is very good.\n\nI want to stay again Grand Hote, if I go to Barcelona in the future.\n\nAnd moreover, I forgot my shirt in the room and they mailed to me to know if I want it or dispose it. I am very surprised. It is not so expensive thing and I did not want it. But I am impressed.\nThank you Grand Hote Central.",
            "time": 1732772691,
            "translated": false
        }
    ]
}