{
    "name": "Hotel Best 4 Barcelona",
    "rating": 3.9,
    "reviews": [
        {
            "author_name": "Jennifer Belissent",
            "author_url": "https://www.google.com/maps/contrib/103266808707201132044/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXHtmewPKRQgITrddCS1t3Br9URXXBc4PVegJGNnL52XUbGSB4F=s128-c0x00000000-cc-rp-mo",
            "rating": 2,
            "relative_time_description": "2 weeks ago",
            "text": "Loved the location near the sea, and the beautiful neighboring cemetery (see pictures). The hotel was very convenient for the conference I attended, and morning walks on the beach. However, it is in desperate need of a renovation. The decor is old and worn but more worrisome is the screeching elevator. I started taking the stairs despite being on the 7th floor. As other reviewer have also noted the breakfast could be improved. The cut fruit was brown, even at 7am. And all coffee options were sweetened. I also had to beg for an iron despite the hotel being a « business » hotel contracted for the conference.",
            "time": 1732111170,
            "translated": false
        },
        {
            "author_name": "Ahmad Fasseeh",
            "author_url": "https://www.google.com/maps/contrib/112523522638417751206/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU9_kaLcp3KgL3NCYjjIId6GjtAI8RsamKgqqSXEXyd8nFgFq0lJw=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 2,
            "relative_time_description": "a week ago",
            "text": "Rooms are clean. Location is technically close to city center but actually it involved a 8 min walking to the nearest metro station to go to most of the places. Average time to different locations is 30-45 min. Breakfast is bad. The view of the cemeteries is not breathtaking. The room is not small but it is not nice.",
            "time": 1732349443,
            "translated": false
        },
        {
            "author_name": "Malcolm Goodall",
            "author_url": "https://www.google.com/maps/contrib/114704840631812488270/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVexIJGYRtkplDaBHFsNDAZgXqg2qgvKMVGcYBB36NZ-l-XBlEE=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 3,
            "relative_time_description": "a month ago",
            "text": "Nice big room, bed and bathroom\nGreat to see out to the sea- looking over a cemetery didn’t worry me. I think they should fix the awful noise in one of the two lifts as that was mentioned in a review here a while ago.\nThe breakfast was good for €12, but not great.",
            "time": 1729261597,
            "translated": false
        },
        {
            "author_name": "iulia iulia",
            "author_url": "https://www.google.com/maps/contrib/113723591207439456570/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI2zJVuffcAhJau9TrieDEhM2-06KQXk5cmypv5Y5zWS-_W=s128-c0x00000000-cc-rp-mo",
            "rating": 1,
            "relative_time_description": "3 months ago",
            "text": "My stay at this hotel was far from ideal. The elevator made unsettling scraping noises, making each ride a nerve-wracking experience. Breakfast was disappointing, with poor-quality food that left much to be desired. The gym was practically useless, with equipment that hadn’t been functioning for years. Our room was uncomfortably warm, as the cooling system didn’t work properly. Worse, our door wouldn’t close securely. The staff did their best, but it couldn't make up for the hotel's many flaws.",
            "time": 1725212404,
            "translated": false
        },
        {
            "author_name": "Frank Thomas",
            "author_url": "https://www.google.com/maps/contrib/115240304958661934682/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLGl2berfjXGbzxBPHjhRtTrzy8hpXYxdmpPSsaxIlPjjGPJw=s128-c0x00000000-cc-rp-mo",
            "rating": 2,
            "relative_time_description": "3 months ago",
            "text": "This was our final hotel during a recent tour of Spain and whilst the quality of the Hotels we stayed in on the tour was varied, the Best4 was the stand out worst. We arrived as a party just off a coach from Valencia and obviously some people needed to use the toilets, however those that tried to access the toilet by the reception area were called back and told these were for staff use only, and they would have to wait for their rooms to be allocated. The rooms are ok with some minor decoration/repairs required around the windows. The air conditioning is set at 27degrees apparently by law, if this is the case then avoid Spain as this temperature makes the room most unpleasant for us used to cooler climes. There is a bar or rather a barren seating area by reception which might have been a bar at one time. There is a counter with some evidence of drinks once served but no staff were ever present. The lifts make some very strange noises and seem to be overdue for maintenance. Then we have the breakfast which was bad by any standard. Poor selection, no rolls only one loaf that you slice yourself. Hardly any meat choices apart from nearly raw bacon, and there was pineapple that was black around the edges. In addition both coffee/ tea machines were on the blink. Also the area around the hotel is not very nice and not convenient for the city. All together an unpleasant stay all round",
            "time": 1724789609,
            "translated": false
        }
    ]
}