{
    "name": "Hotel Hesperia Presidente Barcelona",
    "rating": 4.4,
    "reviews": [
        {
            "author_name": "Muriel Wimpenny",
            "author_url": "https://www.google.com/maps/contrib/118383415292670180280/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKYV6AwGacNhKbYWOf2AKCo4fF_8_M4lciMZlfTvaB21eBr4w=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "This hotel was recommended to us and our visit was great!  The hotel is very clean, the rooms spacious and light and the staff speak good English.  Our breakfasts were absolutely delicious!  The area itself (on Diagonalle) is upmarket and very safe with lots of restaurants, cafes and smart shops.  Lots of people strolling around even late evening,  Taxis are very easy to come by.  Esmeralda and a really young man at the front desk were really helpful but all the staff could not have been more efficient, friendly and welcoming.  Great stay - highly recommended.",
            "time": 1728305201,
            "translated": false
        },
        {
            "author_name": "Caroline Watson",
            "author_url": "https://www.google.com/maps/contrib/108846530389925801472/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLZlCmrGVdrdEDA6g7Z6EIyxt3s3KHwezqqA64d3vXJyw7ftQ=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "The hotel is in a great location for getting round the city, and one of the hop on/off buses had a stop just a across the road which was helpful.\nWe had a large twin room, with a large bathroom and excellent shower, which came with complimentary toiletries.\nThere was also a fridge with replenished bottled water each day, and the room was very clean.\nThe beds and pillows were very comfortable, and the bedding was clean and fresh.\nHousekeeping made beds daily and brought fresh towels and robes.\nThe reception team were so friendly and helpful, and we were also able to access our room a little earlier which was great after a long day of travelling!\nIt was my son’s birthday while we were there and Esmeralda on reception arranged for a surprise cake  in our room for him, when we returned from our day out, which was so incredibly thoughtful, and tasted delicious! Thank you!\nI have already recommended this hotel to a friend and I would definitely return.\nI thought it was great value for money aswell.",
            "time": 1725221029,
            "translated": false
        },
        {
            "author_name": "rezvan aslani",
            "author_url": "https://www.google.com/maps/contrib/117508056893600211581/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKnVFuR6eJ8ErJD67uk-ngzUo3hmzGdWz2VRnJKnaJkDlAsjg=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "3 weeks ago",
            "text": "I recently stayed at this hotel in Barcelona, and overall, I had a pleasant experience. The hotel has a great location, and the rooms were clean, comfortable, spacious.\nOne thing that really stood out was the hotel staff’s helpfulness after my stay. I accidentally left my airpod behind, and their team located it and reached out to let me know. They were polite and professional in assisting me with next steps, which I appreciated very much.\nOverall, I would recommend it to anyone visiting Barcelona, especially for the attentive staff and central location.",
            "time": 1731328745,
            "translated": false
        },
        {
            "author_name": "Vuyo Nkosi",
            "author_url": "https://www.google.com/maps/contrib/104517014730435642151/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKUDAH3PpjijaAbY0CTDBpXiJRjmpBBu9Qtao2p2QP8gmshyQ=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "Absolutely amazing service and cleanliness! Luis at breakfast was spectacular, and had a real fondness for kids- which we really loved as we had our 2-year old daughter with us. The location was great as well, as you were in the hub of the city but could also easily access the main attraction points by cab / taxi, or public transport (bus / train). I also had some work I needed to do during my stay, and the working area was great for this. Would definitely recommend this hotel for both vacation and work purposes!",
            "time": 1726486974,
            "translated": false
        },
        {
            "author_name": "Lisa Sims",
            "author_url": "https://www.google.com/maps/contrib/114173629569223623204/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWPP7pK8rbx5VbW0g3mIRl2l84hSt_kACpg_AVIClL6MirycJmNFA=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "So Laura and Esmeralda was so sweet and knowledgeable. We enjoyed our stay here. It was pretty close to a lot of stuff. The area is vibrant. Our room was clean, great water pressure, nice rooftop, and comfortable bed. When you come be sure to bring an Europe electric adapter to charge your items. They had one, but it didn’t work for my items. Secondly, if you like using face towels, bring your own as they do not use them in Spain.\n\nWe had to change our room twice due to bathroom privacy. The front desk was soooooo accommodating!! I would highly recommend you staying here.",
            "time": 1725181683,
            "translated": false
        }
    ]
}