{
    "name": "Leonardo Royal Hotel Berlin Alexanderplatz",
    "rating": 4.4,
    "reviews": [
        {
            "author_name": "Beck Whelan",
            "author_url": "https://www.google.com/maps/contrib/112235854789228924675/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJj_vxZ0W0aZMvo4CidY9VMUj-N0kmo0QRkRR5QWMYovrCKyw=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "2 weeks ago",
            "text": "We loved Leonardo Royal Alexanderplatz. The location is excellent, really central with a tram right on your doorstop. The room we had was big, beautifully decorated with a huge comfortable bed and bedding. The bathrooms are cleverly designed with the shower and toilet separated and the sink separate. The staff were super friendly and very helpful. Would highly recommend. Loved that you could bid for a better room a few days before your arrival. Great little extras.",
            "time": 1731925280,
            "translated": false
        },
        {
            "author_name": "Florian K",
            "author_url": "https://www.google.com/maps/contrib/107154004482476789636/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVVX7Nyxv6SagbGllYwg2JyEJDe20czaKagCtCUD0zRi8jMNlr35w=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 3,
            "relative_time_description": "2 weeks ago",
            "text": "Our stay here was a comfortable one. The rooms are nicely decorated and the bed was very cozy. Sadly the bathroom, while having modern touches, looks outdated with a sad color scheme and a very small shower.\nThe location, while not directly at the Alexanderplatz, is walkable to the name-giving square and public transport.\nThe staff and service however is not up to par. With a ev charging station listed on the website, the reality is a bit more complicated. For over 300 rooms, there is only one charging opportunity. We were told, even though our car was empty, to not load it overnight, so that other vehicles can charge too. Wanting to plug in the car in the morning, the parking space was occupied by a ICE vehicle. The staff however said that they don’t see a problem there and don’t have a solution. The lady at the front desk even was very unfriendly and unapologetic about the situation. Another staff member, later on, at least waved our parking fee, which bumps the service back up to two stars.\nWhile the bedroom itself was nice, i won’t see a stay at this particular location in my future.",
            "time": 1731847488,
            "translated": false
        },
        {
            "author_name": "Paulene",
            "author_url": "https://www.google.com/maps/contrib/117687272037610471377/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX6BCLcX59aM5suoEgV0s9rKdaTS_yMv1d5DAAYcm5VfiOQV8A=s128-c0x00000000-cc-rp-mo",
            "rating": 4,
            "relative_time_description": "4 months ago",
            "text": "The rooms were clean and beds comfortable. There was a good selection of  breakfast items although we felt the breakfast area in which it's served was very cramped due to the amount of people that were there. Lovely hotel bar to have a few drinks at night. We just felt we would have preferred a hotel a little bit closer to the centre of the city. We prefer to walk everywhere but after walking all day we didn't want to go too far at night for a few drinks but couldn't find any local bars for us.",
            "time": 1722701084,
            "translated": false
        },
        {
            "author_name": "Neland Duncan",
            "author_url": "https://www.google.com/maps/contrib/116819941850058175460/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUtDWW6Yp55F6o2NMaVXyKD2WhOIp0T_278shsS5nsa-TjhJWM6=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 4,
            "relative_time_description": "3 months ago",
            "text": "This place is fine. It felt somewhat corporate to me and a bit sterile, but it was just a place to sleep for the most part. I was a bit hot sleeping there and the last night their A/C went out. It was pretty rough for me. I could've dealt with a fan. This was only 1 night though. The other nights were fine. The rooms are clean and have the amenities we needed.",
            "time": 1725267014,
            "translated": false
        },
        {
            "author_name": "Yulia Bushuk",
            "author_url": "https://www.google.com/maps/contrib/114009849209180102255/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWtyRLlDxaaKSATKkDBQWzMVcbRqUXr2VPRzlDPiL61PsPzmPgh=s128-c0x00000000-cc-rp-mo",
            "rating": 4,
            "relative_time_description": "in the last week",
            "text": "The towels were very old with holes and grey from the time they were used. And we had no proper blanket for a double bed, only a small one, not enough for one person. But we received the second blanket quite fast from the receptionist.",
            "time": 1732931698,
            "translated": false
        }
    ]
}