{
    "name": "Generator Berlin Prenzlauer Berg",
    "rating": 3.1,
    "reviews": [
        {
            "author_name": "Mateusz Timoszuk",
            "author_url": "https://www.google.com/maps/contrib/106982210707042912251/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUwSTb4ROPQsiswNQKnx6QCfii-F2xCzgSl-AdidmT1fOw-xg-N=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "A clean and tidy place to sleep with friendly staff and a nice spot to enjoy a beer. It’s not a five-star hotel, so I don’t understand the complaints from people who expect luxury for such a price. It’s a simple place to rest, take a shower, and then spend the day exploring the vibrant city of Berlin.",
            "time": 1725349473,
            "translated": false
        },
        {
            "author_name": "Giorgi Kalandadze",
            "author_url": "https://www.google.com/maps/contrib/109574936176775321071/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXnWKIUV7S1yHqIdJ-DdwwPx35fGMFQjAhmSQQJYd1USLAv4L6F=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 1,
            "relative_time_description": "2 months ago",
            "text": "In 2018 me and bunch of my friends were in Brlin, filming our travel Show, so i will not tell the story in details but we spent 1 horrible night here,\nWe didn’t slept, the beds were so nasty that we didn’t even took of the clothes and jackets.\nI’m not even talking about the toilets 🤢\nIt was our first day in Berlin and it was night in our country, we waited until morning to contact our company to find something else for us",
            "time": 1728154655,
            "translated": false
        },
        {
            "author_name": "Seyma Kocyigit",
            "author_url": "https://www.google.com/maps/contrib/111017834834606322046/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW89Axqy7tQ_VqccJ6idh9mkM9N-uVDmnwmq_MHKPqBfLtfymMP=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 1,
            "relative_time_description": "3 months ago",
            "text": "Worst hostel I have ever been to!\nFirst of all, the rooms were really dirty, there was hair and weird stains on the bedding. Not only that but some of the other people in the hostel were bothering us and they even threw slippers!\nI can't say anything about the breakfast, because we didn't eat it.\nI don't recommend going here, even though it's cheap",
            "time": 1725133450,
            "translated": false
        },
        {
            "author_name": "Kira",
            "author_url": "https://www.google.com/maps/contrib/111937826821843098584/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJHUcvz7aZebkTEXfeZ5kB_oaC1qs5t8UbF0TksxQ5kock9eg=s128-c0x00000000-cc-rp-mo",
            "rating": 2,
            "relative_time_description": "a year ago",
            "text": "First of all it is important to mention that the Generator stays are by far the cheapest options in Berlin!\nHowever there are some negative sides to it, which in my opinion, cannot be excused by the low costs.\nFirst of all the elevators were barely working. Thank god we were in the second floor - anybody who was in the fifth floor for example must have suffered more lol. I also read some reviews from people who had the same problem - so apparently that’s a common thing there.\nSecond of all I must mention that the room (We had a couple room with a private bathroom) didn’t seem to be properly clean and the safety hinge of one of the windows was broken.\nAnd last but not least - also what leads to my rather negative rating: We booked a late checkout beforehand (+15€ for checking out by 1pm instead of 10am) but yet the cleaning staff opened our door without permission by 10:30. I was literally half naked and my boyfriend still asleep. It was a total awkward moment and in my eyes more than just a no go. Our keys (cards) stopped working by 11 so we had lots of trouble to get our stuff out of the room.. not going there again. However - the receptionist was very sorry about it and gave us the money for the late check out back! she was a total sweetheart I gotta say.",
            "time": 1692689720,
            "translated": false
        },
        {
            "author_name": "Christina Malcorps",
            "author_url": "https://www.google.com/maps/contrib/113853199893247165233/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK1MdVrWgdqOkL3l4QY9fnAXAojwvvpX9RIIJkBOaEbIO2byg=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a year ago",
            "text": "it was a really lovely hostel ❤️ i got there at around 11 am (could normally only check in after 2pm) and they let me check in early for free! my bed wasn’t free yet by that time but they just gave me a bed in another room that was empty. normally stayed in an 8bed shared room and now i got to stay in a 6 bed shared room with a private bathroom! the place was also really clean and you needed your card to get in the hallway, the lift and the rooms. i felt very safe! also 24/7 reception that was really kind and helpful. totally recommend the place!\nalso: i read the comments and i totally can not relate at all?? the hostel was completely silence at night (i’ve stayed 4 days) and was really clean!",
            "time": 1691937557,
            "translated": false
        }
    ]
}