{
    "name": "Easy Lodges Berlin",
    "rating": 3.4,
    "reviews": [
        {
            "author_name": "Constantinescu Mihai",
            "author_url": "https://www.google.com/maps/contrib/101669884878145081021/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV-UiPQfQmp_k41SRuYHSAqtNc3bHj4QDlEtml6kgKeyHiw_BU=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 4,
            "relative_time_description": "a week ago",
            "text": "Bare minimum is what describes this place the best. A room with a bad and a small heater (the heater could have been bigger than the small one we had in our room, literally it was the smallest heater I've ever seen). The toilets were most of the time clean and the same for the showers. They clean them 5 times/day at scheduled hours. Towels are 2 euro each, a decent price I would say. They have a shared kitchen and shared lounge area at the reception. It is not close to the city center, but it is an 8-minute walk to a metro station with a direct line to it. For the money we spent I think it paid off.",
            "time": 1732522864,
            "translated": false
        },
        {
            "author_name": "Alex yo",
            "author_url": "https://www.google.com/maps/contrib/107366819357677112299/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU5-Ki-pyFA-Ziua7yzf4QrKrph5Qe8WyKwgNjUGkMFQIxxuEEO=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 3,
            "relative_time_description": "2 months ago",
            "text": "Great location. Nice and clean. We went in summer and was 32°+ the room was extremely hot with zero air flow through the tiny window gaps. The rooms just soak up all the heat so it's even hotter inside than out.\nIf you can't sleep in the heat avoid it.\n\nOnly 4 showers male and 4 femail for over 40+ rooms only three toilets male and 2 female.",
            "time": 1725916867,
            "translated": false
        },
        {
            "author_name": "Ana Beatriz Coelho",
            "author_url": "https://www.google.com/maps/contrib/104986622815390011120/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWQTu8_BaYaI4f1UfODjCJkYvSbRu1Q22mVJJOg2bhHa3WWdorO=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 3,
            "relative_time_description": "3 months ago",
            "text": "Booked through their website so it was a bit cheaper. My room was fine but I woke up during the night a few times due to loud noises. Bathroom could have been cleaner. There were no hand towels or hand dryers. If you get up to pee during the night, I don't recommend getting the rooms in the back because they are far from the bathrooms. Apart from that, the place is fine, cubes are cute, guests mind their own businesses.",
            "time": 1725415211,
            "translated": false
        },
        {
            "author_name": "Maja Loberg",
            "author_url": "https://www.google.com/maps/contrib/107887470647387346529/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWBLfmRWPv9FDOLwBMskjP2O-ajPm4vgT-hJSdfLfihD_7KcGbv=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 3,
            "relative_time_description": "3 months ago",
            "text": "We stayed 5 nights here and were overall pleased with our visit. Our experience were vastly different from some previous reviewers. The toilets and showers were almost always super clean and I often saw staff cleaning them, at least on the ladies' side. Cleaning staff was very friendly and let me use newly cleaned showers even though she wasn't finished cleaning the other ones. Room service would have been appreciated at least once during our stay.\nStaff in the reception gave off a less service minded impression, but aside from seeming disinterested in their job we had no trouble at all with them.\nThe outdoor pool facility next door was a welcome neighbor during hot summer days, but also meant a lot of loud noises during the day.\nThe room/cube itself was very simple and ours did not have any wifi. It was overall difficult to connect to the wifi no matter where I was. The beds were clean and comfy. Our cube was quite ugly, but most of the other ones were pretty looking.\nBook your room through their own website to get a better price.",
            "time": 1724017351,
            "translated": false
        },
        {
            "author_name": "Paper Trails HQ",
            "author_url": "https://www.google.com/maps/contrib/116473587973424678423/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIL3KG-Jz4fwMj731__GjWXpmpOnzIsvgA9BBIjh6CEReX8FQ=s128-c0x00000000-cc-rp-mo",
            "rating": 2,
            "relative_time_description": "a month ago",
            "text": "If you are content with the bare minimum then this is the place for you!\n\nThe room cubes are semi clean but have no amenities at all. The one we stayed in had no shade and in 30 degree summer weather it was unbearable even with the fan on. The facilities are over by the reception area and it was a far walk from the room. This would have been nice to know in advance as this probably would have altered my booking decision. There are only a few bathrooms and showers available and during our stay they were not very clean, also half of the showers have doors and the others only have a shower curtain. One of the nights there were people sleeping in the hallway which didn't feel ok.",
            "time": 1730197671,
            "translated": false
        }
    ]
}