{
    "name": "Michelberger Hotel",
    "rating": 4.4,
    "reviews": [
        {
            "author_name": "brendon mcglothin",
            "author_url": "https://www.google.com/maps/contrib/115721200210757026580/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUtVKIVE0wID6Ulua3kwQ_5KdWtHZSccmzkmW6WgcGIaYhDuew=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "The design of the hotel is super sexy very bohemian. I stayed in the loft with just myself and it was the perfect size. Plenty of space, massive windows and high ceilings.\n\nThe hotel staff were amazing. Super friendly, accommodating and just genuinely happy people. Loved my conversations with them along with the cafe staff as well. The lounge in the main area is fantastic and is pretty lively every night which was nice to just be around all the people traveling.\n\nThe restaurant that is attached is incredible. The staff were phenomenal, the food fantastic and fresh. The restaurant manager had a passion for the hospitality industry that showed through her extreme attention to detail. She was everywhere all at once making sure every guests needs were met. The menu options changed out as my stay went on keeping the menu new and exciting.\n\nEverything was unbelievably great and I will absolutely be back to Berlin and will absolutely stay in the hotel again. Anyone seconding guessing their decision this is the sign to book it now.",
            "time": 1727809332,
            "translated": false
        },
        {
            "author_name": "Serena T",
            "author_url": "https://www.google.com/maps/contrib/113326211520961680103/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX0ze4RMv5Ve-K-Msm5TI1RohiiC5br8jAn63MZfR11X8N6dEBe=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "My boyfriend and I spent three nights at the Michelberger Hotel in Berlin, and it was truly a lovely experience from start to finish.\n-\nFrom the moment we arrived, the hotel's unique and artistic vibe immediately caught our attention – it's clear that every detail, from the decor to the ambiance, to the music, has been thoughtfully curated to create a one-of-a-kind atmosphere. We felt like we were staying in a cozy, creative retreat rather than just a hotel.\n-\nOur room (the \"cozy\" one) was very small and intimate (we knew that from the start and that has not been a problem as the common areas were functional) but also stylish. Loved the shower with the glass view, and the amazing shower-gels provided. I would suggest adding a shelf in the toilet or one more hanger in the room, just to give guests some storage space.\n-\nA special shout-out to the amazing staff who made our stay even more memorable. Gabi, who made our coffee each morning, was super nice and attentive, ensuring we started our days on a perfect note. Simona, at the restaurant, made our dining experience in the yard truly exceptional. Their kindness and professionalism truly stood out, and we’re so grateful for the wonderful experiences they provided.\n-\nI can't recommend the Michelberger Hotel enough. It's more than just a place to stay – for me it's been an experience in itself.",
            "time": 1724971887,
            "translated": false
        },
        {
            "author_name": "Spikey Lee Claessens",
            "author_url": "https://www.google.com/maps/contrib/107295058847925769440/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUG6mvCEmepd6w7XYx-gvbB9tjjln-l0h15JHuuw-HUZjPu_brA=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "in the last week",
            "text": "I stayed in the hotel end of September and had the best time thanks to Giulia. She gave me such a warm welcome and made me feel special. I will for sure come back!",
            "time": 1733083981,
            "translated": false
        },
        {
            "author_name": "Adam Morrison",
            "author_url": "https://www.google.com/maps/contrib/102706574971086491358/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVJ9Iylh7GrZ-RAfEdEqP8a6VyqTq7IDDSnWkCtMEFMCI7YqSuNZw=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "5 months ago",
            "text": "We stayed for 5 days in a cosy room in the middle of summer. This hotel was extremely cool, the staff was super helpful as well. Coming from Winnipeg, we're used to the cold, and a bit worried about our room not having any air conditioning, but when we arrived, there were two fans and some cooking spray, and the room was comfortable and fun the whole time.\n\nIt's a tight little space but we kind of liked that, with a high ceiling and a wall of windows. This hotel oozed personality and was totally our style.\n\nAlso, it's got everything you need on that block if you are up late. Drinks, snacks, you can basically get it anytime and it's the first time in a long time we didn't order something to our hotel room.\n\nOverall, I can highly recommend this hotel, and would absolutely go back next time I'm in Berlin.",
            "time": 1719077684,
            "translated": false
        },
        {
            "author_name": "Aybars Oge Sürücü",
            "author_url": "https://www.google.com/maps/contrib/112851778208236814653/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX8NsLSbVPak7oV-j6eYlZs5eQILKOO39bBfmhmz4eKPRal0_IR=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 4,
            "relative_time_description": "3 weeks ago",
            "text": "Thank you for the amazing customer service to all team;\nJavier,\nEric,\nElise,\nSergios,\nPaula.\n\nAnd Giulia; thank you for your priceless and precise customer service.\n\nThe only negative thing that I can say for the hotel; please change the fragrance in cold vapour spray on reception.\n\nLocation is amazing. Very close to public transportation, a big mall and Uber Platz.\n\nRooms are more than spacious; you can live short term in a place like this.\n\nRoom service quality is really good.",
            "time": 1731225984,
            "translated": false
        }
    ]
}