{
    "name": "Hotel 26 - Hotel in Berlin Friedrichshain Kreuzberg",
    "rating": 4.6,
    "reviews": [
        {
            "author_name": "Rose nthal",
            "author_url": "https://www.google.com/maps/contrib/114739588227299288902/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIqNhE1ryVGhNYOTl4iUI4aZm8B-c009mnxdObCc-h4YZAFKg=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "We were more than happy to have found Hotel 26. We stayed for three nights and it was very good. Mid of this lively area and totally quiet. No sound from other guests or an elevator nor an aircondition. Good beds, sufficient dark from light blocking curtains.\nAnd the service was good all times - friendly, precise and good thinking for the guests. We had Italian colleagues and as they missed their key no problem - they called and could talk to the service in Italian. astonishing good",
            "time": 1725882027,
            "translated": false
        },
        {
            "author_name": "Hadyn Ankenmann",
            "author_url": "https://www.google.com/maps/contrib/117529214878711168656/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLYkCM-QrZ3PB5ibDtXuXrMzGM0MM26zf7FhzqkYZxCTA64Ag=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 3,
            "relative_time_description": "a year ago",
            "text": "Room was alright, on our last nights stay we were woken up by several wasps in our room (12 total). I personally can not sleep with that, if you can all the power to you. After dealing with the issue and making sure we had no more unwanted guests it was alright. Front desk response was to tell me to not have the window open. fair enough my guy, fair enough",
            "time": 1692011343,
            "translated": false
        },
        {
            "author_name": "Keith Field",
            "author_url": "https://www.google.com/maps/contrib/103630610740313606276/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVAmDrcrJ4UW1knpGtIF7l9_v8aC5Z7DFpf8Zx2YOKr2hKz7BD0gA=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 1,
            "relative_time_description": "a year ago",
            "text": "If you plan to arrive late, you'll be stranded. Booked a room there through Alaska Air Hotels (Rocket miles/Agoda). Sent Hotel 26 a message through the hotel's website that I would be arriving late that evening. When I got there, the exterior gate was locked. There is a panel with a button for Hotel 26 reception, and also many buttons for other residents. I pressed the hotel button several times. Nothing happened. I searched for their phone number and called it,  nobody picked up.\n\nA woman who has an apartment there returned to the property and let me in the gate. She told me where the hotel reception lobby was and said that they close early in the evening so I might be completely out of luck. She was right. I called the number several times. The lobby was locked and all the lights were off. I could hear the phone ringing in there when I called but of course there was no one there to answer it.\n\nNOTHING in the booking confirmations I received nor anywhere on the hotel's website warns you that you will be stranded if you arrive in the evening.",
            "time": 1697194742,
            "translated": false
        },
        {
            "author_name": "Niccolò Fineschi",
            "author_url": "https://www.google.com/maps/contrib/101953697576596706071/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJWa3ckLqPoyf2vDH5WQ1uuRE86_GhO6EqG-_76o8401878UGoH=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "6 years ago",
            "text": "We stayed here for 4 nights: the apartment was very clean and spacious (we were 2 people, but it seemed like it could host 3-4 people) with 1 toilet and 1 bathroom (not merged together), a kitchen with all the supply you could need (fridge, burner...) and a comfortable bedroom with TV included. The stay was absolutely enjoyed: a big buffet breakfast and the quiet location (the hotel is located some meters away from the street, and the noise isolation it's surprisingly good) added more value to Hotel 26. Staff very friendly. Public transportation is easily reachable (tram stop immediately near the hotel and train/metro stations 5-10 minutes of walking from there). We had a great time.",
            "time": 1537544346,
            "translated": false
        },
        {
            "author_name": "Silvie Lamla",
            "author_url": "https://www.google.com/maps/contrib/116377158015699135482/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXSH2A6J0O_D7zJFTBpxGf0J_uB590VtYuJt8kifiol01CHeYOa=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "2 years ago",
            "text": "I would give 10 stars if possible! It is the best hotel in Berlin i ever stayed in! Not because of the rooms or area - which is pretty decent - but because of the people working here! Such nice and very caring people! At the breackfast you will never experience disorderd food nor half empty bowls. The staff is very attentiv, friedly and mindfull! I am impressed. You get to feel welcomed! It is the small things like how they nicely fold the toiletpaper or if you get to your place at the breackfast area and return back to the buffet - then return to your table - your orderd coffee or tea is already placed for you... they pay attention where you seaded and serving you like in a nice reataurant. Also the little outside area is very quiet and relaxing. Price is pretty decent aswell! Beds are comfy and of course you get an access to wifi. In the bathroom you get a piece of soap, shampoo and a hairdryer. An elavater is also there so it is not necessary to carry baggage up stairs.\nOver all - i will return every time I visit Berlin",
            "time": 1656230699,
            "translated": false
        }
    ]
}