{
    "name": "Lulu Guldsmeden Hotel",
    "rating": 4.4,
    "reviews": [
        {
            "author_name": "Gianaurelio Cuniberti (Giovanni)",
            "author_url": "https://www.google.com/maps/contrib/117435320852728182802/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWEXQyZvgovbTbKDOc9skKu0rF5pISqYuTIeQl-9scZ1G93Mkrduw=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "2 weeks ago",
            "text": "I recently had the pleasure of staying at Lulu Guldsmeden, and it was a truly outstanding experience. The hotel effortlessly combines sustainability with luxury, creating a warm and welcoming atmosphere from the moment you step through the door.\n\nThe decor is unique and thoughtfully curated, blending modern design with charming Nordic touches. My room was spotless, cozy, and equipped with all the essentials, including eco-friendly toiletries and the comfiest bed I’ve slept in for a while.\n\nThe breakfast was a highlight—fresh, organic, and locally sourced ingredients that made every morning a delight. The staff deserves special mention for their friendliness and attention to detail, always ready to assist with a smile.\n\nThe location is another plus: perfectly situated in a vibrant area, close to great restaurants, cafes, and public transport, making it an ideal base for exploring Berlin.\n\nIf you’re looking for a boutique hotel that cares about both its guests and the environment, Lulu Guldsmeden is the perfect choice. I can’t wait to return!",
            "time": 1732090673,
            "translated": false
        },
        {
            "author_name": "Gabriela Pérez",
            "author_url": "https://www.google.com/maps/contrib/116215647993158490924/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV-bs1fkMe-BjEjcWeEFXDjcRlhQonc81iwmKMoW1W0KiMUb4LA=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "in the last week",
            "text": "Best stay ever - I booked a weekend with 12 friends to celebrate my birthday and all the staff went above and beyond to make sure we were all looked after, gave us suggestions of where to go, and welcomed us every morning with the biggest smile! The hotel has a lovely atmosphere, and I appreciated the eco friendly approach. I will definitely go back!",
            "time": 1732859503,
            "translated": false
        },
        {
            "author_name": "Mehul Desai",
            "author_url": "https://www.google.com/maps/contrib/118316789604121208018/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWfe3tvhP3PvAC9ssc9pTg4Bu0LTthkOj7u6v8E0dpaTyaHpqSJ=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "Fantastic hotel in a very convenient location in Berlin. The hotel itself is super charming, with lovely rooms and a beautiful patio/garden.\n\nThe staff were absolutely wonderful. Especially Georgia, at the front desk. Without hesitation and without knowing us at all, she lent us cash when we needed it. We really appreciated her helpfulness, and everyone else was equally great and accommodating.\n\nThe coffee and food were excellent too. They have (free) lockers to put your luggage in if you need them. They lent us umbrellas when it was raining. We used the bike rental and the bike was clean and well-maintained. An important note - only the top-floor rooms have AC, so please be sure to book those if you think you need AC.\n\nOverall, you simply cannot go wrong with Lulu Guldsmeden!",
            "time": 1726585361,
            "translated": false
        },
        {
            "author_name": "joarwar",
            "author_url": "https://www.google.com/maps/contrib/108446930163534550595/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ1h8rFUsuLxL6zNvP0fePK-iwW_eT0NuIe92QIZNYTcm-r1A=s128-c0x00000000-cc-rp-mo",
            "rating": 2,
            "relative_time_description": "a month ago",
            "text": "We booked two rooms, and both were beautifully designed. However, the rooms got quite warm at night, and the railing for the upstairs loft was loose, making it a bit challenging to go up.\n\nWe were also unexpectedly charged a €50 early check-in fee, even though we checked in only about 10 minutes before the official time. This was surprising, as we had waited in the lobby until the receptionist said it was okay to check in. Unfortunately, we couldn’t discuss it at checkout, as part of our group was in a rush, so we simply requested an invoice for the entire stay, which we were told would be emailed to us.\n\nWhen the other party in our group checked out of the second room, they inquired about the fee, explained our situation, and were told by the receptionist that there must have been a mistake. The fee was waived for that room.\n\nThinking it was an honest mistake, we emailed the hotel to resolve the issue, but received no response. We even tried contacting them through Booking.com, which attempted to reach the hotel without success. It’s now been about two months with no reply.\n\nAfter reading other reviews, we noticed that similar unexpected fees have been an issue for other guests as well. We’re no longer expecting a refund at this point; we just wanted to warn future guests about our experience.\n\nEdit: This has finally been resolved and I've gotten my refund.",
            "time": 1730740251,
            "translated": false
        },
        {
            "author_name": "Sadaf L",
            "author_url": "https://www.google.com/maps/contrib/112934560968856454780/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJS1oNDa9WlT2_7Zmku5aaADGWwdt3MS205lPQwzgYX_Y1xkA=s128-c0x00000000-cc-rp-mo",
            "rating": 4,
            "relative_time_description": "a month ago",
            "text": "I enjoyed my stay. The staff are excellent and very professional and helpful. The breakfast is really good. The rooms are really nice. I think it is a european thing but I would have liked to have a kettle in the room to make tea in the morning before breakfast.",
            "time": 1729507262,
            "translated": false
        }
    ]
}