{
    "name": "Park Inn by Radisson Berlin Alexanderplatz",
    "rating": 4.1,
    "reviews": [
        {
            "author_name": "Behnam",
            "author_url": "https://www.google.com/maps/contrib/110777209204038422293/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXphmQ_efEYC0FsAx-bAcJkoh-LIvh3lZ1FV580MkC_5t2vDPsw=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 1,
            "relative_time_description": "2 weeks ago",
            "text": "I recently had an incredibly disappointing experience at this hotel. While the check-in process was smooth and we appreciated being given an early check-in at around 12:30 PM, things went downhill from there. At first glance, the room appeared decent, but upon closer inspection, I discovered that the toilet was clogged, and water was overflowing.\n\nI immediately informed the reception and requested a room change, but my request was denied. Instead, they said they would call a technician. Hoping the issue would be resolved, we left for lunch. However, upon returning, nothing had been fixed. I went back to the reception to follow up, and once again, they said they’d call the technician. After waiting for over half an hour without any sign of help, I made a third trip to the reception desk, this time more frustrated.\n\nWhat made matters worse was the receptionist’s dismissive attitude. She mentioned that they had plenty of rooms available, yet claimed the technician was too busy to assist. To add insult to injury, she even implied that I might have caused the toilet blockage myself! I insisted on a room change and was finally moved to a room on a lower floor.\n\nOverall, this experience left me with a very poor impression of the hotel. While I hope the remainder of my stay improves, the lack of responsiveness and the accusatory attitude of the staff were incredibly disappointing. I cannot recommend this hotel based on my experience so far.",
            "time": 1732112746,
            "translated": false
        },
        {
            "author_name": "Anna Cecilia Pilegaard",
            "author_url": "https://www.google.com/maps/contrib/100283318778903325839/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU3GJ4gGLpN21QNvcWjwwFuvg_cBdXu2CtL9HGDNUtCjqpQIwjH=s128-c0x00000000-cc-rp-mo",
            "rating": 2,
            "relative_time_description": "in the last week",
            "text": "I would not recommend Park Inn Berlin to anyone. The service was extremely poor, and the overall experience was disappointing.\n\nOn the first day, we had the buffet, and the service was terrible. We ordered drinks, but they didn’t arrive until 30 minutes later – by which time we had already finished eating. To make matters worse, they forgot one of our drinks entirely, and we had to fetch it ourselves because no one came back to our table.\n\nThe second day was even worse. We tried to dine at the restaurant, but after waiting for a long time at our tanke, a waiter came over and told us to leave because they were too busy and the wait time was too long. This happened 15 minutes after we had already been seated by another waiter.\n\nThe bathroom situation was also a nightmare. Taking a shower was impossible without being scalded by burning hot water or frozen by icy cold water. The thermostat seemed to have a mind of its own, randomly switching between extremes.\n\nTo top it off, the room itself had issues: the lighting didn’t work properly, leaving us in partial darkness for our stay.\n\nFor the price we paid, this experience was absolutely not worth it. I would strongly advise against staying at Park Inn Berlin.",
            "time": 1733046772,
            "translated": false
        },
        {
            "author_name": "Olive Aitken",
            "author_url": "https://www.google.com/maps/contrib/112039393480202227748/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI_UHSL6CiEG1u3fA2ATG-N3Dqcu-lBJz39oiX4TSWpIhQqUw=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "in the last week",
            "text": "What a fantastic place to stay. We stayed here for the last 3 nights. Service fantastic,rooms great, breakfast amazing,location couldn't be better. Proximity to station (from airport),hop-on-hop-off bus all right outside hotel. And not forgetting the barman Karim, absolutely amazing. Definitely will be back .",
            "time": 1732833493,
            "translated": false
        },
        {
            "author_name": "Heikki Kegg",
            "author_url": "https://www.google.com/maps/contrib/117949171109015942454/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUn9xbMLu3w1LbbvuWPWkS7CbRXLrjLEM2Lld4esDnIwnsPUbF9Zw=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "We spent three nights in this giantic central hotel. Our room was an upper floor corner room with views in two directions. The room was in good condition, spacious enough and the bed gave a good night's sleep. It was most quiet room. The bathroom had a glass wall and felt strange at first, but it actually worked well. The hotel's breakfast was excellent. The staff was friendly. The hotel's location is perfect near everything and only approx. 35 minutes by train from the airport. The hotel's roof terrace (for a fee) offers a wonderful view of Berlin. This hotel is a good choice.",
            "time": 1730312495,
            "translated": false
        },
        {
            "author_name": "Katie D",
            "author_url": "https://www.google.com/maps/contrib/100624514234055519923/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJir2NOMsKvapqrHvGBtF8DgdeHBwpRLOXhjw6fKw3b5L4-Xg=s128-c0x00000000-cc-rp-mo",
            "rating": 2,
            "relative_time_description": "a month ago",
            "text": "Absolutley not a 4 star hotel- 2star. We did not enjoy this hotel at all and would never return. The rooms are very small with little privacy. It was also incredibly hot, we reported this to reception and they sent a serviceman to check the air conditioning who was very rude and said it is working- it just clearly doesn’t do anything. They bought us a fan eventually- we would not have stayed if they hadn’t. The hairdryer is awful, it doesn’t do anything. The shower runs hot and cold and within seconds. The complimentary shampoo was horrendous and left my hair feeling like straw. Uncomfortable bed and we were given two singles pushed together even though we informed them it was our anniversary. The housekeepers woke us up twice despite having the do not disturb on the door- just what you want on holiday. There was a big variety for breakfast but the standard of food was poor.\n\nI am so upset I wasted my money here!",
            "time": 1730474124,
            "translated": false
        }
    ]
}