{
    "name": "Sasaya",
    "rating": 4.5,
    "reviews": [
        {
            "author_name": "Clemens Ja",
            "author_url": "https://www.google.com/maps/contrib/104788606082819851401/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL0iKTPaDcMm3f6yuY5blEqRFplB3qNaWUOzsyHYDUMsZ8GAw=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "To me, this is the best place to eat in Berlin. Also it's one of the most authentic Japanese restaurants of the city. The quality of the food is superb and the value for money unbelievable. Service is extremely friendly and the food is served quite fast. Only downside: as all walk in your chances are very slim and reservations are only possible by phone.",
            "time": 1728211025,
            "translated": false
        },
        {
            "author_name": "Ishana Biju",
            "author_url": "https://www.google.com/maps/contrib/115521480360494508101/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXdiwcDH5VQM5-cI8xS_pxQeQcN3weV0uawybCsvUibVCrxGrUQ=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "4 months ago",
            "text": "I usually love everything I eat here.  But today, traditional sushi plate was just okay.  Toro was great.  The squid skewers was also just alright.\nSpinach salad was good.  The buckwheat soup with shrimp tempura was nice.  The nato an interesting flavour to try. And the the fermented squid was also nice. :)\n\nMy usual is the plate for two with the chefs recommendation which is normally amazing. The gemaincha is a true delight.\n\nService always really sweet.  All those women are incredible.   Atmosphere also warm, simple and straightforward.\n\nI obviously don’t have all the pictures.   But here are some.\n\nLove this place on the whole.",
            "time": 1721764436,
            "translated": false
        },
        {
            "author_name": "Rina Feast (That’s How We Feast)",
            "author_url": "https://www.google.com/maps/contrib/103894703564215855464/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWCb03bYFEipgCyDnQSsKUVfvBJ-aRy6lnN6_k24HdazrBiq00=s128-c0x00000000-cc-rp-mo-ba6",
            "rating": 4,
            "relative_time_description": "7 months ago",
            "text": "Our experience at Sasaya was delightful overall. The sushi was exceptional, and we were impressed by the variety of good and authentic Japanese dishes offered at reasonable prices. However, we found the interior could use some improvement to enhance the dining atmosphere. Additionally, the booking process, which involved stopping by the place a week before, could be more convenient with online options. Despite these minor drawbacks, Sasaya is definitely worth a visit for its delicious Japanese cuisine.",
            "time": 1715013790,
            "translated": false
        },
        {
            "author_name": "Chengrui Hu",
            "author_url": "https://www.google.com/maps/contrib/107937046879775035638/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWSD-S12-6Ct_qLDD_gQKg49SW_I9lSqg_gUDXDt9PalGcybD8=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "3 weeks ago",
            "text": "Updated in Nov 2024: now you can make a reservation at the office next to the restaurant, which opens from 12:00 to 15:00.\n\nI’ve been here several times. The reservation is indeed a problem cuz they barely answer the phone but when I finally get the food I don’t mind it. Still, I deduct one star for service because I believe the phone should be accessible if it’s put on the website and Google Map. The rest of service is friendly and welcoming.\nI keep going without caring about the reservation issues because of the food and price. Sushi is delicious and fresh, as well Buta Don. This time I tried Sansai Soba, which actually gave me a surprise because the multilayered taste of different kinds of vegetables in one dish. Most importantly, the price is not expensive at all. Comparing to those expensive and fancy fusion restaurants, I’d definitely prefer Sasaya.\nBtw, now we figure out the best way to reserve is either to drop by and book seats for another day or to arrive at the place at least 15 minutes before they open to get a seat on the day.",
            "time": 1731260728,
            "translated": false
        },
        {
            "author_name": "antonio coelho silva",
            "author_url": "https://www.google.com/maps/contrib/101380617825165183603/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWphPoLUM2trQxysHCjrByo5x4T8G4oaDgM4vS03huQDmlfXSqAwg=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 4,
            "relative_time_description": "10 months ago",
            "text": "Food is amazing the service absolutely friendly but by a weird reason they were not removing the things when I was finishing that’s the only reason to don’t give 5 stars to the service. And from what I saw was o my me … a must you you like Japonese food rather than sushi. Booking mandatory and only available by phone between 12 and 15….",
            "time": 1705870405,
            "translated": false
        }
    ]
}