{
    "name": "Cookies Cream",
    "rating": 4.7,
    "reviews": [
        {
            "author_name": "Mary LeCompte",
            "author_url": "https://www.google.com/maps/contrib/100066420341523157334/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU1X2eucjpqPXyf099B3qrf1fmWAyKuX7qfFMwksGyxJma1hRB2iA=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "Our first time was April 2024 when we visited Berlin to celebrate my birthday. We loved Berlin so much we came back in October for our anniversary and celebrated here. The chef was very creative with each dish and each had so many flavors. We got the wine pairing which complemented the food very well. Service was great and attentive. It was also nice that one of the staff remembered us from our first visit. We enjoyed our experience and will definitely be back the next time we visit.",
            "time": 1729891862,
            "translated": false
        },
        {
            "author_name": "Es",
            "author_url": "https://www.google.com/maps/contrib/104799370023372434061/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK-38bUo8F3-jOYyTUSUMic9hP88b_Wk_WMiKTpYiR2S2DcmC4=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "Ordered the 7 courses. Overall an incredible vegetarian culinary experience. Each dish was creative/novel, a unique menu filled with combinations that surprised me.\n\nA interesting juxtaposition between the casual atmosphere and the Michelin starred fine dining experience. Eccentric decor. Service was impeccable.\n\n7 courses was 140 euros. Was able to get 15% off by booking online a couple days ahead of time.",
            "time": 1725430438,
            "translated": false
        },
        {
            "author_name": "Bobby Kariyatty",
            "author_url": "https://www.google.com/maps/contrib/111306770950079111842/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVKY_a0RX2Fw5rNO__GFkXDxKF9UNAYpRu--IDlg9cQC7ogMg7S=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "If you plan to visit this place, be prepared for this restaurant to blow your mind.\n\nPlaced in the silent, unassuming back alley to the Westin, this restaurant is nothing of what you’d have an impression of as you walk into it.\n\nYou are welcomed into the hands of their fantastic staff, who come around with smiles every time and care to check how you are feeling. It feels like you are dining and also constantly being hugged ❤️\n\nWe asked for the Magnificent Seven in all its glory and were totally blown away. Paired with the restaurant's non-alcoholic pairing, the flavors took our tastebuds for a ride.\n\nOverall, this place is perfect for a date or an intimate evening for someone close to you.\n\nI would certainly recommend that you arrive by 18:30 and be prepared to spend your evening here, blown away by the magic you see unfolding in front of you, course after course!\n\nA definite must-visit if Michelin is on your palette! ❤️\n\nA special kudos to the staff for making our dinner an dining experience!",
            "time": 1729237479,
            "translated": false
        },
        {
            "author_name": "Sofie Vermeulen",
            "author_url": "https://www.google.com/maps/contrib/114518570755608805369/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLxrdkL5c9ehXG3InuCdbKMmjPNcB3fqF-wxAu1UWI7oFd6zA=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "5 months ago",
            "text": "Visiting this restaurant is an adventure in itself. The location is truly unique and getting there is an experience in its own right. The restaurant is situated in a remote area, and the journey to reach it takes you through a scenic route that sets the perfect mood for a culinary journey. Upon arrival, we were warmly greeted by Martha, who provided us with exceptionally friendly and professional service throughout the evening. Her attention to detail and warm smile immediately made us feel at home. Every dish served was a true culinary masterpiece. It's evident that great care and thought goes into both the presentation and flavor of the dishes. The creations on our plates were not only visually appealing but also a delight for the taste buds. While the restaurant offers carefully selected paired drinks with each course, I found this personal touch not essential. The dishes themselves were so exquisite that the non-alcoholic beverages, while tasty on their own, didn't add significant value to the experience. The flavors of the dishes stood well on their own without this additional pairing. Overall, it was an evening to remember, and I look forward to experiencing this culinary adventure again soon. This restaurant is definitely worth revisiting! Sofie - Belgium",
            "time": 1719411768,
            "translated": false
        },
        {
            "author_name": "Beatrix Muc",
            "author_url": "https://www.google.com/maps/contrib/103808717981209967417/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJtc_0_r3xBw31dux9xQy7aridKSen0nUA-DQPcx6iVsCOy2Q=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "Cookies is known for being a vegetarian one-star Michelin restaurant. What comes short in my opinion is the surprise and experience you will get eating there!\nWe love the location, the hidden steel door entrance and the stylish warehouse interior. But the food….what an amazing surprise and throughout the menu a wonderful journey we didn’t want to come to an end. Every single dish created joy and even weeks later we keep the memory of taste and presentation. Although the portions looked small,  we left fully feeded and very happy. The menu is full of creativity and courage - the tomato as main component of the dessert was my personal highlight and made the whole experience unforgettable. They don’t serve  Amuse-Bouche, the butter and chocolate are vegan - but it all makes sense and is part of this experience full of surprises. We have been to Cookies a few times -  will soon be back.",
            "time": 1727204811,
            "translated": false
        }
    ]
}