{
    "name": "Clayton Hotel Birmingham",
    "rating": 4.3,
    "reviews": [
        {
            "author_name": "Andrew Field",
            "author_url": "https://www.google.com/maps/contrib/115262844440769613917/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIcvKCpFtSC9NnI6K3akHyeVQv85kVBAU_7pntmwNsaxL4-2g=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 3,
            "relative_time_description": "in the last week",
            "text": "This is a lovely hotel BUT. They've turned the heating off. Beautiful hotel, great rooms, good food. We only stayed one night. We got there about 7, because we got lost due to all the road works and building. Lovely welcome on arrival. We were offered a glass of prosecco but we're running late for a concert. On return the room was cold. Put the heating on and it didn't work,so went to bed. The following morning I asked a member of staff how it worked. They reluctantly told me the heating didn't work, we had a great breakfast, on checking out I told reception, and got a reluctant apology. Then we were told we can have a fan heater as we were checking out?? . This could be a fantastic Hotel. Such a shame.",
            "time": 1733057822,
            "translated": false
        },
        {
            "author_name": "Ashley Christie",
            "author_url": "https://www.google.com/maps/contrib/107605958687832246880/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUjG7iQBjEWJizTR8Xg6oiE212uSBd3hTt3Mjba6qpayNOc64YixQ=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "a week ago",
            "text": "Booked this hotel for my boyfriend’s birthday surprise. The lovely lady who checked us in let my mom up so she could help me set up the surprise. The room is very spacious with a great full length mirror for outfit pictures. The bed is super comfortable and very big, great for relaxing after a long day of travel. The only issue we had was it was a little cold, we tried to turn up the heat but it didn’t seem to make a difference. Apart from that everything was 10/10. I will definitely be coming back here for a stay.",
            "time": 1732699247,
            "translated": false
        },
        {
            "author_name": "Alex Anghel",
            "author_url": "https://www.google.com/maps/contrib/113227546493653310423/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWZvQrTcvpDtfa0dmwMotbSmq0HM7opDYHaTNmgnz9SKNsFJwVB2g=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "Fantastic hotel.  Excellent position,  close to city centre, and bull ring. I had afternoon tea( the scones are absolutely divine!) and dinner - I recommend the salmon.\nBar and reception staff have been attentive as I was on my own, and it was my birthday. They gifted me a card and a box of chocolates  ❤️",
            "time": 1729394926,
            "translated": false
        },
        {
            "author_name": "Mickey Mouse",
            "author_url": "https://www.google.com/maps/contrib/100154575037315345031/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK3Ow0VbrJF0vAl7xTyCqSLJ4IjowwRFWBffn1uiRJGTxkaYQs=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "2 weeks ago",
            "text": "Warm welcome  on a bitterly cold night (we would wake up to snow ) from reception and even better news on our 2nd visit here awaited us a complimentary  upgrade to a suite thank  you The  Clayton . However and not because of that we found the staff , reception, restaurant and bar to be exceptional polite just attentive enough without being intrusive.  The room was heavenly, warm spacious with a nice seating area and a great movable TV . Would highly recommend if your wanting a hotel within good distance of the majority of the large venues in the are 8 taxi to the Symphony Hall for example.. So to summarise great hotel great service good food and great staff . Can't wait to go back",
            "time": 1732128876,
            "translated": false
        },
        {
            "author_name": "Fay-Amie Aspen",
            "author_url": "https://www.google.com/maps/contrib/113641143164452590546/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWCX85gN_oJJKLsRednXsZW-MBLL6p3XMvF10sjjA929PD5RevYpQ=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "On this occasion I wasn't staying at the hotel but had gone there to specifically pick up my Too Good To Go order which wasn't that good only 3 'pastries' in a box. But the hotel itself is charming I love the features within. The breakfast food is delicious. Room comfortable enough.",
            "time": 1730796589,
            "translated": false
        }
    ]
}