{
    "name": "Apollo Hotel, Birmingham",
    "rating": 3.1,
    "reviews": [
        {
            "author_name": "Kevin Holcombe",
            "author_url": "https://www.google.com/maps/contrib/111721615981286839496/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLWrcVnTCuSqzC0Nh74PHnwnl-9l-_oZ3v4_AXcR1-I83yYOw=s128-c0x00000000-cc-rp-mo",
            "rating": 1,
            "relative_time_description": "3 weeks ago",
            "text": "First impressions on arrival was I thought it was closed down. Reception is tucked away behind front building. Parked the car & was greeted with the smell of Canabis.\nMy room was on 1st floor. The whole property is very outdated somthing out of the 70s\nThe room is very brown outdated & very tired. Curtains were disgusting dirty & stained the armchair was also very stained. Light fitting hanging by its wires, bath panel de-laminated, heated towel rail did not work.\nFound a old ear ring on the floor lots of rubbish under the bed\nOnly good thing was the Bed sheets & pillows were clean.\n\nChecked out the bar gave that a big miss. Bland & damaged chairs. super bright, no atmosphere like being in a doctors waiting room. Beer pumps apparently don't work all drinks are bottles on cans.\nFound a very nice pub 5mins walk away.\nOn retuning to room later was very un easy about the area. Anyone can walk around the hotel grounds from.off the Street.\nThe surrounding area is very run down with many boarded up properties.\nStrong smell of canabis from.the room next door with windows wide open.\nMy room was full of that smell.\nChained & bolted my door.\n\nBreakfast was buffet.  Receptionist hardly took any notice of me when I walked in. Never ask if I had paid or asked my room number.\nCooked English ok usual 6 basic items. Full range of cereals & juices. Never saw any other guests or staff.\n\nWould definitely never stay here again Definitely give this place a miss. Very out dated & run down. Not a pleasant place. So glade it was only one night.",
            "time": 1731019498,
            "translated": false
        },
        {
            "author_name": "Nikhil G Menon",
            "author_url": "https://www.google.com/maps/contrib/107479708464209114175/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU_17aenz2fN7x0jpjrRmzogsCDhlvFgAZM7KSELlHm9VpYDnWX=s128-c0x00000000-cc-rp-mo-ba6",
            "rating": 4,
            "relative_time_description": "a month ago",
            "text": "The stay was pretty ok given the budget of the hotel rooms. They are really cheap and near to the city center. But the room were not really upto the mark but we're reasonably ok with iron box and iron board along with other necessary stuff. They have no dental kit so please bring your own brush and paste. Also the place is really accessible,  you can take a cab to the city center for 8 quid. Over all if you are not looking for something fancy and really upto the mark and chep this is the place, other wise no. I had this hotel booked since I had a 1 day training in birmingham . It's looks more like a hostel than a hotel but there is ample amount of parking spaces.",
            "time": 1729194494,
            "translated": false
        },
        {
            "author_name": "Ruby Bunker",
            "author_url": "https://www.google.com/maps/contrib/101136516876287773404/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWY9Bixu3-Ln4EblkgAtz6hsTiHoD6TyvMthFG6DFIghV1-6jk=s128-c0x00000000-cc-rp-mo",
            "rating": 1,
            "relative_time_description": "4 months ago",
            "text": "i’m writing on behalf of my friend currently staying the night and has called me extremely nervous about her stay. there are strange red stains all around the room and bed has dirty stains. no locks on inside of the door which makes her feel uncomfortable and dirty cutlery and bedding. as a younger woman in a hotel she should feel safe. staff were not as welcoming as they should’ve been🤦‍♀️",
            "time": 1722034761,
            "translated": false
        },
        {
            "author_name": "Lucy Flower",
            "author_url": "https://www.google.com/maps/contrib/110839535108643359206/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUc2BjZAFRwygzcFqvplRCagnXI737si4pM7EPUG9r57A21u_tq5w=s128-c0x00000000-cc-rp-mo",
            "rating": 2,
            "relative_time_description": "4 months ago",
            "text": "The hotel was not very clean. When you arrive you can even tell by the outside appearance that it is not a good place.\nThe room was smelly and was not clean. The staff at the reception was not very friendly. I had requested a ground floor room because of my bad knee, but my room was on the 1st floor, and there were no lifts there.",
            "time": 1721123230,
            "translated": false
        },
        {
            "author_name": "Jazz Farmer-Furfaro",
            "author_url": "https://www.google.com/maps/contrib/114604028108516396824/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUxdTs8GZRf07bm1lLzub7b0aUcKkMz_efJ18zdkX2i1p3DBIaRAg=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 2,
            "relative_time_description": "6 months ago",
            "text": "They only reason this review isn't getting a single star is because the staff were lovely.\nI was going to write an eloquent masterpiece, with long words, about just how bad this hotel actually is... But honestly it isn't worth it.\n\nThe room was disgusting. Stains on the walls and floors, and definitely in need of a face lift. The sheet on the bed, for reasons known only to a higher power, didn't actually fit the bed, and upon checking with other guests, seemed to be standard.\nThe power sockets were nowhere near the bed, which presented a problem when trying to plug in medical machines needed overnight.\nThe lift looked like someone had vomited all over the door, but not recently.\nThe heat .. we were lucky, we tend to carry a fan with us, but I honestly think Hell would have been a colder place to visit.\n\nThe included breakfast. Now admittedly, I'm a bit of a snob; when I go away I look forward to having pastries for breakfast. It's the only time I really eat them, so imagine my disappointment when the breakfast options were cereal or a full English. Now, due to allergies, I couldn't risk the full English, so I asked for beans on toast. This may have been a concept lost on the kitchen staff, as I received my toast, then a few minutes later I received a breakfast bowl full of beans, and a spoon to eat them with, from confused staff.\nThe food itself was standard, lower the of the catering range. Apart from the coffee, which was the least pleasant, cheap, instant coffee, provided in a small breakfast bowl with a spoon.\nOn the second morning, a toaster had appeared, so at least my toast was hot (what is it about hotel toast that means it just isn't ever warm?!).\n\nOverall, this hotel left me feeling dirty. It's not even that cheap. I definitely would not recommend it.",
            "time": 1716097169,
            "translated": false
        }
    ]
}