{
    "name": "The Old Joint Stock Pub & Theatre, Birmingham",
    "rating": 4.4,
    "reviews": [
        {
            "author_name": "Emma D",
            "author_url": "https://www.google.com/maps/contrib/116913656324853920211/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW-m1qln1-CvH_7sezfwMKutC49xi8dvhlIoXOZXHwzXk09hkkl=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "We visited here for dinner in the pub before seeing a show in the theatre. It was a busy Saturday night and the place was packed. It was loud but with a good atmosphere and the service was very efficient and friendly.\n\nThere is a great selection on the food menu. They also catered brilliantly for my sister's complex dietary restrictions (no gluten, dairy, oils, garlic, onion or seasonings - everything plain). She contacted them in advance and received a very positive response saying they would be able to cater for her. They followed all of her requests and she received a meal that she was able to eat in full. There was no fuss, it was well presented and everything was kept plain as requested.\n\nI enjoyed the chicken pie with triple cooked chips, which was very tasty. We didn't have time for dessert but if I come again I definitely want to try the scones with clotted cream.\n\nWe also enjoyed the show upstairs. Such a quirky, fun venue with kind, attentive staff.\n\nThank you!",
            "time": 1726432115,
            "translated": false
        },
        {
            "author_name": "T",
            "author_url": "https://www.google.com/maps/contrib/106641346086873115308/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJDamxLTwXRrCoH5jvJuXFupzJjtjBjLOOqqBa3vRjWHoud=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 3,
            "relative_time_description": "4 months ago",
            "text": "Fantastic interior architecture! Upon arriving it has a wow factor with its impressive style like you’ve just walked down the staircase of the Titanic. Maybe their grand interior is used to promote a feeling of class and how they justify their prices.\n\nI paid £20 for a pint of beer and a glass of wine which made me almost drop them in shock! this is extortionate! This place can never complain about rising costs when they are clearly robbing the public with those prices and making a hefty profit.\n\nI also had the roast dinner which was £25! Although it was very nice the price did not justify the quality and portion size. Probably the most expensive roast dinner in the area.\n\nThis pub on a whole is expensive! I would not return here for anything other than a quick drink on pay day.\n\nThe atmosphere is the only part I couldn’t fault. Definitely worth a visit but just make sure your wallet is loaded beforehand...",
            "time": 1720789003,
            "translated": false
        },
        {
            "author_name": "John Hingley",
            "author_url": "https://www.google.com/maps/contrib/115831859335291398908/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVwhRbx-H-8AUVE4vNPA5SqgcpJwIoWbfbkxFKrj6psGrqjt0lLbg=s128-c0x00000000-cc-rp-mo-ba6",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "What an awesome pub, my wife are staying around the corner from here and this is our go-to place for tasty food and drinks. The people here are so nice and welcoming, and the space is nice, large, light and comfortable. We have had several meals here both lunch and dinner. Our faves are the fish & chips, BLT, fish finger sandwich (excellent!), and the steak & ale pie.  They nail everything, go!",
            "time": 1724835251,
            "translated": false
        },
        {
            "author_name": "Lina Nieto",
            "author_url": "https://www.google.com/maps/contrib/104474046663010517246/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXRAPCpEl95R8vGneNEdw1G--kyxQcM3IZdCyc4ot0tK6c8WI2K=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "The architecture of this place is unbelievably gorgeous. The high ceilings and intricate design. Good selection of beers and courteous staff even before closing. Clean and spacious. Perfect for large groups.",
            "time": 1730558947,
            "translated": false
        },
        {
            "author_name": "Ian Burns",
            "author_url": "https://www.google.com/maps/contrib/108811944818167149696/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXzmMvLYU9y5yKr_5HnQb7LcVvFhQMkXCZUSrNWSnTQUXauZOhD=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 4,
            "relative_time_description": "3 months ago",
            "text": "I thought this was a great pub for drinks but the overpriced food let it down.we came in all 3 nights we were in Birmingham and thoroughly enjoyed the atmosphere and surroundings but on the first night I ordered steak and chips and the steak was good and cooked as I ordered but £28 for steak and a few frozen chips was way to much.Might have been better if there were mushrooms or onion rings or peas but it was just steak and some not so nice chips. obviously we ate elsewhere the rest of the holiday but we did enjoy our drinks here and they have a nice little beer garden at the back.. definitely come here for drinks but I'd give the food a miss",
            "time": 1725561439,
            "translated": false
        }
    ]
}