{
    "name": "Premier Inn Birmingham City - Aston hotel",
    "rating": 4,
    "reviews": [
        {
            "author_name": "Tyler Merkd",
            "author_url": "https://www.google.com/maps/contrib/112610061776596874767/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJF-sKxA9VVy85G2ZlF-pqf-XA3zj5ienYFRV6gjIhs8dIKKg=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 5,
            "relative_time_description": "2 weeks ago",
            "text": "I've been living out of various Premier Inns for the past month or so due to work, these being New St, Hagley Rd and Aston.\n\nI was working on Birmingham High st, this hotel is maybe a 10 minute drive or so, not far at all, close to the action but miles more peaceful then New St;\nI can say hands down Aston was the best one I visited.\n\nThe room was spacious and clean, fairly standard as premier inn goes and is what I have seen achieved over multiple visits throughout the country.\n\nThe food was brilliant, I stayed for 3 nights and had an allowance on my room. The Gammon was my favourite, so juicy and flavoursome!\n\nBut what really set this one out from the rest was the evening staff, especially Tia. She was so polite and friendly, could not do enough for us and she is just such a superstar I couldn't thank her enough.\n\nTia and her colleagues are an absolute credit to your business and are instrumental in providing a warm and friendly atmosphere to relax in.",
            "time": 1732135737,
            "translated": false
        },
        {
            "author_name": "Gab Dilworth",
            "author_url": "https://www.google.com/maps/contrib/103571741070719759356/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWgqkKJkyvvt6ZcQ_c6PrhpJ5kginkwLa_tcdyMSfCu3eu3qIhekw=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 3,
            "relative_time_description": "in the last week",
            "text": "The room was clean enough.\nTV had no casting abilities, so it was commercial television or nothing.\nThe internet was extremely poor. I'm assuming that's because they want you to pay for the upgrade. I didn't, so I can't comment on its capabilities.\nThe guy serving for breakfast was extremely nice, helpful and aware, the stars are his alone.\nNo option to pre-pay parking, so I had to do it in the morning outside in the cold prior to departure.\nHowever, as far as needing somewhere to sleep, it was more than adequate for this",
            "time": 1732963612,
            "translated": false
        },
        {
            "author_name": "Jo Knight",
            "author_url": "https://www.google.com/maps/contrib/112886214819605963196/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLt7xUVfSWxZymXB6m_qb8rssMAcn-QND3SdTa_XFB7l7FGXw=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "3 weeks ago",
            "text": "Food and stay 100% we will be returning\nThe staff were so kind,\nWe arrived to drop our son to university and managed to rest, have a wonderful evening meal, and have a super breakfast.\nThe ladies in the evening were very kind to find a lead for our machine that we needed plugged in next to the bed.\nThey really did go above and beyond for us.",
            "time": 1731416373,
            "translated": false
        },
        {
            "author_name": "Khaled Smadi",
            "author_url": "https://www.google.com/maps/contrib/104657205299035750410/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWwhGwS_Cd6H1TeHIf4XAzYuFv8RGbCjCcUtUf61qcFluK_Mb2JSg=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 1,
            "relative_time_description": "a month ago",
            "text": "Not sure where to start from. Well squeeky floors all over, smells like a care home inside the room. The air-con smells horrible once put on. Very old and tatty and needs a very good refurbishment, no remote control for TV and one towel for two people.  Staff are helpful  but this review is clearly only about the place it self. Put into consideration its quiet far from the centre so please try and book something central to save yourself time.",
            "time": 1729626634,
            "translated": false
        },
        {
            "author_name": "Alan Gray",
            "author_url": "https://www.google.com/maps/contrib/110579634686563775954/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUAkw_ZsJOij56I64r0mvrhuUqOakW3ecpKoTpCRj6YAZXbk0Z9=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 3,
            "relative_time_description": "2 months ago",
            "text": "Somewhat disappointing compared to previous visits. The room smelt musty, especially in the bathroom. Left the bathroom fan on for a while, which helped. Room was quiet. Restaurant is being refurbished, so no breakfast available. By email was promised, by way of compensation, that coffee and free pastries would be available free of charge in the morning. The coffee machine broke down, and no pastries were offered. Not good.",
            "time": 1726501986,
            "translated": false
        }
    ]
}