{
    "name": "Premier Inn Birmingham City Centre Bridge Street hotel",
    "rating": 4.2,
    "reviews": [
        {
            "author_name": "Lorraine Dickinson",
            "author_url": "https://www.google.com/maps/contrib/104818338123364668233/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVXJ_aNFPk1jod63l8uI-rJ7_XrL3ccwRU2hSVUnW-3l62yGNlyjA=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "I lovely hotel,with great views right on the Birmingham canal. Rooms were a little small but as it was only me staying here so it wasn't a problem. The room was very clean as are all premier in hotels I have stayed in.  The staff were super friendly and helped me find a car park. Would recommend the 5 ways euro car park it is a 10 minute walk from the hotel, but it's the closest £10 for 24hrs. The buffet breakfast was lovely and much better than other premier inn hotels I have stayed at and they are normally all good, but food wasn't over cooked or greasy. The chefs even said hello and asked how I was which was a nice touch. Would stay again. Great location to the centre.",
            "time": 1729239120,
            "translated": false
        },
        {
            "author_name": "Richard Longden",
            "author_url": "https://www.google.com/maps/contrib/108363575779454395457/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVEBtcebxdfgOsWiTlaWo_LxL2GpecALfcDl1AnvAW_XjUViIM=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 4,
            "relative_time_description": "in the last week",
            "text": "Although allocated wrong room and not enough towels, reception brought more, so all good. Room was tiny and no heating in bathroom, so chilly in the morning, but good value for price paid. Breakfast was excellent and staff were very friendly and helpful. Great base to explore and good value!",
            "time": 1732825116,
            "translated": false
        },
        {
            "author_name": "Chris Taylor",
            "author_url": "https://www.google.com/maps/contrib/105942770180392620602/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocITGVZHCq24Le5Sj0mGneQduO2uuAA0KYtcG6SneayaEd69QQ=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 3,
            "relative_time_description": "2 months ago",
            "text": "We recently stayed at the Premier Inn in Bridge Street Birmingham for 3 days.\nAfter stopping in many Premier Inns around the country. Generally, the only consideration is which side of the room the bathroom was on.\nThey all tend to be of the same high standard.\nThis was a standard Premier Inn, not a small Hub room. However, the rooms were really small. There was just about enough room to walk around the bed. Certainly not enough room to leave an open suitcase, to get things in and out of. The room didn't have air-conditioning, and even with the window opened to the maximum, and with no heating on, the room was still 24 degrees. The provided fan did alleviate the issue a small amount, but not enough to get a good night's sleep.\nHowever, it is safe to say that although I really like Premier Inns, I won't be stopping here again. I wish Premier Inn would state the size of the rooms on the website. So that informed choices could be made when booking hotel rooms in the future.",
            "time": 1727356632,
            "translated": false
        },
        {
            "author_name": "Elza Baldzhiyska",
            "author_url": "https://www.google.com/maps/contrib/113540095814563216235/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJRDou7BWPSYUi8qSCxT1Dgra5ZXCIWPnSDo7tpp8AXqmLcEw=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "3 weeks ago",
            "text": "I love this place!!! Cozy rooms! I was almost dead from exhaustion! The staff tried to accommodate me as quickly as possible, because I fell asleep as I was standing at the reception desk! So careful! Then they took care of me in the restaurant, where they made me feel at home! Cozy restaurant with delicious cuisine! Thank youuuu ❤️❤️❤️",
            "time": 1731324466,
            "translated": false
        },
        {
            "author_name": "Rachel",
            "author_url": "https://www.google.com/maps/contrib/109881560811501028431/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLavl-V9_zzGVlhLUumhkWaKpAFRYAAC5M9BIzfXQJSo0o0ew=s128-c0x00000000-cc-rp-mo",
            "rating": 4,
            "relative_time_description": "2 months ago",
            "text": "Clean and comfortable. Staff were warm and accommodating. Close to the station but I felt vulnerable walking the route after dark. Not a well populated area, passing an underpass, 2 sets of underground car parks, an industrial plot and an abandoned building. The site is not well lit on the approach. Get a cab.",
            "time": 1727483582,
            "translated": false
        }
    ]
}