{
    "name": "Premier Inn Birmingham City Centre Broad Street hotel",
    "rating": 4.1,
    "reviews": [
        {
            "author_name": "Gab Dilworth",
            "author_url": "https://www.google.com/maps/contrib/103571741070719759356/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWgqkKJkyvvt6ZcQ_c6PrhpJ5kginkwLa_tcdyMSfCu3eu3qIhekw=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 3,
            "relative_time_description": "in the last week",
            "text": "Quite possibly the best of the Premier Inns I've stayed in around Birmingham, apart from the parking. Parking is extremely limited.\nThe room was clean.\nThe TV had no casting abilities, so it was commercial television or nothing.\nThe internet was extremely poor. I'm assuming that's because they want you to pay for the upgrade. I didn't, so I can't comment on its capabilities.\nThe guy running check-in and providing all service was great and made me feel very welcome. He alone made this Premier Inn my favorite of the three I stayed at during my stay in Birmingham.",
            "time": 1732964559,
            "translated": false
        },
        {
            "author_name": "Mark Pearson",
            "author_url": "https://www.google.com/maps/contrib/103525949120722038089/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUQT3M53V9PLIjA3PC2AzB9nyxJLqXiNVLQqTGs6Baf12UktzI=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 4,
            "relative_time_description": "a month ago",
            "text": "Stayed here for one night for a concert at the arena. The location is very good and only a few mins walk to the arena with lots of nice food outlets and bards coffee shops etc around. we walked into the city center too only a 20min walk past some of Birmingham's best bits. Good transport links near by if you need them with the tram and bus stops close to the hotel.\n\nThe hotel has some parking cost me £18 for just over 24hrs. there is a Q park local should you need it too. The hotel was very nice and was what we needed a comfy bed and clean room.\n\nWould come back again as the location suited us very much.",
            "time": 1729889331,
            "translated": false
        },
        {
            "author_name": "Tim Clarke",
            "author_url": "https://www.google.com/maps/contrib/116737051689340295574/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWDJTPDzTqlRMwMc0Qi3-lTqmStivgbCPXY-cTQKLfLbrRyRQwApw=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 3,
            "relative_time_description": "2 weeks ago",
            "text": "Unusually disappointed, as Premier Inn are our go to.\n\nHowever, we arrived on foot. For a relatively modern building, we were surprised that pedestrians clearly aren't catered for! The entrance was poorly signed, meaning we walked all the way round and then had to walk back again.\n\nThere was no-one in reception, and the check in machine didn't work. However, a member of staff came fairly quickly after we pressed the buzzer.\n\nThe room was OK. We had an accessible one, as my wife is registered blind. As seems to be fairly common in the industry, the lighting in the room and bathroom was very dim.\n\nFor some strange reason, the TV didn't align with the bed at all, making it impossible to watch. The free Internet was totally useless.\n\nThere was no air conditioning, only a totally inadequate heater that we had to ask how it worked. We were warned that it would reset to a lower temperature at midnight. They weren't kidding. The room was freezing and that, coupled with the usually soft mattress, meant we had a lousy night's sleep.\n\nAlthough the restaurant was supposed to be open in the evening, it wasn't, so we had to go out in the rain to get our evening meal.\n\nBreakfast was supposed to be from 6:30am. As we had to be out early, we arrived at 6:35am to find it still closed. A member of staff, who had clearly only just arrived, let us in. Breakfast was cooked to order. To be fair, the poached eggs were excellent. However, I placed an order for our two breakfasts - an the chef forgot to cook one of them!\n\nIt's also a shame that Premier Inn now provide a cheap coffee in the rooms instead of the Kenco they used to, which was much nicer. But at least they provide a stock of spares in reception.",
            "time": 1732017670,
            "translated": false
        },
        {
            "author_name": "Sapna D",
            "author_url": "https://www.google.com/maps/contrib/112731289985877687600/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLbjpX_cVWaOnnh6-318QU8ghLowjm_yVrKUC9mC7S3ca-h=s128-c0x00000000-cc-rp-mo",
            "rating": 3,
            "relative_time_description": "2 months ago",
            "text": "We stayed overnight at this hotel when attending a concert at the Arena. Location is great for the arena, plenty of restaurants around. Room and bed comfortable enough. However, strong smell of sewage from the bathroom made use of the bathroom very unpleasant. We informed reception of this when leaving as thought it may be our room but they advised us that they are aware it is an issue within the hotel. Something to note when booking the hotel. Manageable for a 1 night stay at the price offered but wouldn't want to stay much longer due to this.",
            "time": 1726944700,
            "translated": false
        },
        {
            "author_name": "Barry Goldsworthy",
            "author_url": "https://www.google.com/maps/contrib/108825446417706423435/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXixo1fxFP7JqiF8YshV2kppoXdK5_PiNmQh33EMB46F8ZkS42a=s128-c0x00000000-cc-rp-mo",
            "rating": 3,
            "relative_time_description": "2 months ago",
            "text": "Ideal location for anything city centre in Birmingham. The rooms are a good size and pretty clean, with everything you need. There’s a vending machine in reception and although I haven’t tried it, there is an adjoining eatery. Stayed here a few times now for events at the arena, and it’s ideal walking distance. The staff are always friendly and helpful, and they always have that key element of a smile, which is nice to see. There is a car park (pay and display) right there, although spaces are often in demand. The only negative is the outside space, it is very “city centre” and there are often food wrappers and broken bottles about which detracts slightly. Otherwise, it’s a good Premier Inn standard.",
            "time": 1725727408,
            "translated": false
        }
    ]
}