{
    "name": "Hotel ibis Styles Birmingham Centre",
    "rating": 4,
    "reviews": [
        {
            "author_name": "Amrann Singh",
            "author_url": "https://www.google.com/maps/contrib/110526297311490160080/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIp-Noz_Vl-yp1P38J2MgImcYgDgpfZ_sB1XAEUNQ_VUu2Vqg=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a week ago",
            "text": "Here’s a draft of a glowing review for Neel’s performance at the Ibis Hotel:\n\nExceptional Service and Professionalism by Neel at Ibis Hotel\n\nI recently stayed at the Ibis Hotel and had the pleasure of interacting with Neel, who truly stood out as an exceptional team member. From the moment I arrived, Neel went above and beyond to ensure my stay was comfortable and enjoyable.\n\nNeel’s professionalism, attention to detail, and friendly demeanor made a lasting impression. Whether it was assisting with check-in, offering local recommendations, or addressing any questions, Neel consistently delivered service with a genuine smile and a can-do attitude. His efficiency and ability to anticipate guest needs showcase his dedication and passion for hospitality.\n\nIt’s rare to find someone so committed to creating positive experiences for guests. Neel is not just an asset to the Ibis Hotel team but a prime example of what excellent customer service looks like. I look forward to staying at Ibis again, knowing individuals like Neel are part of the team.\n\nThank you, Neel, for making my stay unforgettable!",
            "time": 1732463927,
            "translated": false
        },
        {
            "author_name": "Vaibhav Fadia",
            "author_url": "https://www.google.com/maps/contrib/110416382597869522133/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWWzwrI8dVYQ4FN4shMvjX9S_2yqJFjm36Ijgk7i4EtvbEn1OhA=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "Stayed for 1 night and very pleased with the service in all areas. Not high tech by any standards bur Double room was very spacious and sound insulation pretty good as don't here the noise from next door or outside. It was nicely comfortable to sleep and room had perfect temperature. Breakfast choices are bit limited like in budget hotel but catering staff was super friendly and was topping up fresh cooked food regularly. Overall, good one and will stay again.",
            "time": 1726059866,
            "translated": false
        },
        {
            "author_name": "Jake Boarder",
            "author_url": "https://www.google.com/maps/contrib/101554903081103388099/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ_pHXoKxkKVRxfKUjpYvjHBv0DhJ3dBIRqxBM3g_PGaUkz8w=s128-c0x00000000-cc-rp-mo",
            "rating": 4,
            "relative_time_description": "4 months ago",
            "text": "Great hotel for a work trip. Very friendly service and rooms very clean. The air con only works with the key in the room and it’s needed to be on for a while to make the room cool otherwise it wasn’t very comfortable. Breakfast was fresh and good variety, hotel had an ice machine downstairs for use and a small shop nearby too. Very happy with hotel and would use again.",
            "time": 1721389638,
            "translated": false
        },
        {
            "author_name": "Hans Antov",
            "author_url": "https://www.google.com/maps/contrib/100753407372085829904/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVEju_Nuei14goYiEhhWB6JXqVx6IS9x3igDV_Zhygv7dPSCpSD=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 3,
            "relative_time_description": "a month ago",
            "text": "I had prepaid in full for my room, and when I came to check in (a day later) they told me it was taken and actually told me off for not calling them! I could not believe it, given I had PRE PAID for three nights.\nThe rooms are quite basic and offer no water.\nOverall quite poor service for their prices.",
            "time": 1729420146,
            "translated": false
        },
        {
            "author_name": "neilcee66",
            "author_url": "https://www.google.com/maps/contrib/101207298508481614416/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVtuLMJ6zPjTwFAQCG_1woB8DyNoh4Lk85_LDWfhVp2SafYZpk=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 4,
            "relative_time_description": "5 months ago",
            "text": "Great location if you want to be near Broad St and the main city. Nice reception area with free tea and coffee area, nice little touch I think.  The staff were very helpful and I can't fault the rooms the only small thing is if you are a light sleeper there seems to be a bit of noise early in the morning coming from the road at the front of the building apparently the back rooms are fine.\nFantastic buffet breakfast which is only £9 also very well laid out, there is also a small bar.\nIf you book early you can get it at a very reasonable price.\nOur stay was fantastic.\nDefinitely book again.",
            "time": 1718653282,
            "translated": false
        }
    ]
}