{
    "name": "ibis Birmingham Bordesley Circus",
    "rating": 3.9,
    "reviews": [
        {
            "author_name": "JR IfteKhar",
            "author_url": "https://www.google.com/maps/contrib/115660529432824914241/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXUi4I9iBtyBFZtiUVNktlTqs6fBLfyEYYOB4X-n4lMHC6n-N5Z=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 1,
            "relative_time_description": "a year ago",
            "text": "Two years ago I stayed there for 10 days and I obtained excellent service from the crew, I was impressed and now again I have come to Birmingham and I wanted to book a room for myself. However, I don't know what the condition was there. A crew member came outside and behaved extremely rudely, he said no rooms were available, yes it's normal that rooms can be fully booked. But he didn't even allow me to enter the reception. He shouldn't have spoken that way. I liked their services last time that's why I came there again to stay. You guys should have chosen the right employees.\n\nThanks",
            "time": 1690406226,
            "translated": false
        },
        {
            "author_name": "Josephine Nadiyah Al Pinay",
            "author_url": "https://www.google.com/maps/contrib/111108217708717602252/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWX2xPcMzZk6YDXj8940qiXF2uKRtpjHj5vE-h75eWeKTa9KfSu=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "2 years ago",
            "text": "Reception staff we're very friendly. Nice breakfast variety. The room was lovely, the bed was really comfortable. Had a desk and chair so I could do some work. Internet was free (just have to register your email) that was a bonus!! The water and heating was nice and hot.",
            "time": 1640847821,
            "translated": false
        },
        {
            "author_name": "Maxine Morgan-Hayward",
            "author_url": "https://www.google.com/maps/contrib/104988303930645075857/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWm1eUl_lEV8-Hg4HU85JtcplJfOam3drTNz_XSfbLSfwwkyQhqqg=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 4,
            "relative_time_description": "2 years ago",
            "text": "Although the bed wasn't the comfiest, we did enjoy our stay here. The set up of the room was really cool and the bathroom is almost like a capsule with a stand in shower inside. The location is about a 5 min drive from the Bullring or a 30 minute walk. The staff were friendly and the hotel looked clean.",
            "time": 1652606814,
            "translated": false
        },
        {
            "author_name": "Anderson Francisco",
            "author_url": "https://www.google.com/maps/contrib/105108337162132433463/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIp4aVeqsTGqfAxCLihDRK0ovU_HG7e7UGJoJo7F1NUfn8A6A=s128-c0x00000000-cc-rp-mo",
            "rating": 2,
            "relative_time_description": "2 years ago",
            "text": "Expected a better service from Ibis but disappointed after all. Stayed for 2 nights. TV in my room did not work, staff was asked to provide a remote control and never got it. Towels were cheap ones and stinky on second day. Location is ok but full of beggars around. Staff were ok, I did not require much from them, they seemed friendly but still awaiting for the TV remote control. Room has only 1 chair and 1 clothing hanger which is not ideal for a couple, and there is no safe. There is no air conditioning in the room and the shower room gets wet outside the glass, and the room carpet is not cleaned from a night to another as there were some litter left untouched since day 1. It will obviously depend on your requirements, for me the things mentioned are reasonable. Positive point is the silence.",
            "time": 1654972562,
            "translated": false
        },
        {
            "author_name": "James H",
            "author_url": "https://www.google.com/maps/contrib/101621415106802327751/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU8l9Z8yMWaCYngVVCBLwchCKhTa1dbO2LGXvAmdjpuviwW4AjD=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 4,
            "relative_time_description": "4 years ago",
            "text": "We spent 4 nights at the hotel and overall were very happy and satisfied with our experience. The room was clean, well equipped, spacious and comfortable enough to stay in. An issue with the shower was immediately resolved. The bed could have been slightly more comfortable and the room a little cooler but those are quibbles. The staff were all very polite and welcoming. Given it's just a short(ish) walk from the city centre the value for money was superb. The Covid arrangements in place were well thought through.",
            "time": 1603551346,
            "translated": false
        }
    ]
}