{
    "name": "Premier Inn Birmingham City Centre (Waterloo Street) hotel",
    "rating": 4.2,
    "reviews": [
        {
            "author_name": "D",
            "author_url": "https://www.google.com/maps/contrib/103604571849965109648/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWXlWRo1UOQzidVrW2nHHSR_JydlV5YmpQWBzv0jgCrPb4H5op6=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "Typical Premier Inn.  However,  connected to a great restaurant.  Staff were really helpful and friendly.\nRoom was clean.  Hotel was quiet.  View from my room wasn't great,  but then I want there for the view.\nPerfect for visiting Snow Hill, which is a gem of an area.  Great pubs.  Fabulous architecture.\nCan't wait to visit again",
            "time": 1729015658,
            "translated": false
        },
        {
            "author_name": "Kacey Haines",
            "author_url": "https://www.google.com/maps/contrib/103918027387536840670/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVGR5fFzE2ADDlohFf9JPYUNP1vZtveDsoMBQrNkhK0hNOuWE5w=s128-c0x00000000-cc-rp-mo",
            "rating": 2,
            "relative_time_description": "a week ago",
            "text": "People who work here are very nice and don’t get me wrong the location is great however I was disgusted with the cleaning there is hair all up the wall in the shower and hair in the bed which both have the same colour. Me and my partner are not  black heard . I asked for rather get moved to another room or the bed to be changed as they weren’t clean however they said that out of 700 rooms they ain’t got one free for two people and then gave us the clean sheets to then be told we have to change the bed and do there job which they failed in the first place ik this ain’t nothing to do with staff however I clean apartments myself and this wrong to leave a room in this condition I’m truly disgusted to this and I do have to say for a place with such good reviews me and my partner have been let down",
            "time": 1732323855,
            "translated": false
        },
        {
            "author_name": "S S",
            "author_url": "https://www.google.com/maps/contrib/106535066166560424043/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUeXEgvBC1ae-kMVN5qUqix41wacRs-auqA2Z3fOcyi421ZzhLXgA=s128-c0x00000000-cc-rp-mo",
            "rating": 4,
            "relative_time_description": "4 weeks ago",
            "text": "It's a good location, close to Birmingham New Street 🚉\nMy room was clean but I couldn't sleep well. I went to bed around 10:30 pm.  I was able to hear loud music from outside...(I'm not sure where the music comes from.)I had to wake up before 7 am the next morning and my schedule was finished by 9:30 am. Luckily the checkout was by 12 noon so I had a nap and relaxed in the room until 11:30 am. 😊\n\nSelf Check-in was easy. And checkout was easy as well just give your card key to the staff.👍",
            "time": 1730847036,
            "translated": false
        },
        {
            "author_name": "Miss Clarke",
            "author_url": "https://www.google.com/maps/contrib/101687751564763510631/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIfuNIRUODg780601RwXj4C2WCoELhc9ldT9JJHyLfO6pVlTw=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "I have stayed here many times, extremely convenient location, centre of Birmingham.\nLots of bars and restaurants to go to. A few minutes walk to the shopping centre.\n\nOnly issue is that at night it can be a little loud but that is anywhere in a city centre\n\nI had a few queries with my room and Cris was extremely helpful.\n\nPauline is also great and very attentive.",
            "time": 1729938342,
            "translated": false
        },
        {
            "author_name": "Tosin Harold Akingbemisilu",
            "author_url": "https://www.google.com/maps/contrib/110319764765457499579/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXnKCoWYp5tlukwjxHjWhC--N0k_UnYSLC0nhXwSur9PNMIED62=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 4,
            "relative_time_description": "2 months ago",
            "text": "Lodged here for 3 nights in one of the premium plus rooms. The most important part for me is the proximity to Birmingham city centre and the centre train station. It was really easy to move around and get everything I wanted. Environment outside is quite busy though, but that does not affect the rooms in anyway as it still remains quiet.\n\nThe rooms are clean, and the necessary facilities are available, including a fridge, enough towels, and WiFi which is good enough for virtual meetings/regular internet surfing but not strong enough to stream videos without consistent buffering. No intercom, but there is a phone number if you need to call the reception.\n\nWhile booking, you will need to pay for breakfast and/or dinner separately, which is in the bar+block building connected. The meal is good but regular English. I only did breakfast, so I can't tell what the dinner is like.\n\nI requested room cleaning at the reception, but my room was never cleaned throughout the 3 nights that I stayed. Enough TV stations but didn't really find anything interesting. The toilet and bathroom are clean and well maintained. The mattress is soft (silent night), and it was indeed a slient night, cause I enjoyed every bit of my sleep.\n\nAlthough, on one hot day, I tried to switch on the AC and there was so much dust from the AC that I inhaled and caught flu. This sort of messed up my stay a little bit.\n\nNonetheless, my overall experience was good and I still found my stay pleasant. It is not the best hotel that I have stayed in, but it was worth it.",
            "time": 1726257766,
            "translated": false
        }
    ]
}