{
    "name": "Premier Inn Birmingham City Centre (New St Station) hotel",
    "rating": 4.3,
    "reviews": [
        {
            "author_name": "M Taylor",
            "author_url": "https://www.google.com/maps/contrib/102050951812289923009/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI48M7xT-i3W3lfbfOokvKnEJld-8QiDkzJ04STgyIKEAcYzg=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "a week ago",
            "text": "I love Premier inns and this was one of the best out of very many I have stayed in. Location was so convenient for New Street station, right in the city centre but so quiet in the room. Room was spacious and warm with a lovely view over the Christmas markets. It looked as if it had been refurbished/ modernised recently, nice walk in shower and comfortable chair in the room. Staff were super friendly and helpful, I would have loved to stay longer, just had one night to attend a wedding. Brilliant stay.",
            "time": 1732399595,
            "translated": false
        },
        {
            "author_name": "Barry Towell",
            "author_url": "https://www.google.com/maps/contrib/114129052415919484304/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLlh1djV-B4njeyv-KtZTR2Amr8T1mCanaMenM5y8uHb4FxdA=s128-c0x00000000-cc-rp-mo",
            "rating": 4,
            "relative_time_description": "in the last week",
            "text": "After a rotten journey in, we were met with a great big smile and the very cheerful Tyrese, who made us feel right at home. The room we had was a little tired and in need of some tlc, however the staff, who are all so enthusiastic and attentive in their roles....which seems to be every role going! Made up for the whole experience. The hotel is in a great location to explore the city and gives some fantastic views of the architecture which is not always so obvious from the ground. The restaurant is very convenient and the food is very reasonable. The breakfast items were of good quality and Ewan together with the rest of the team helped to get the day off to a cheery start.To the staff, we would say a huge thank you for going the extra 'smile', making our short stay near on perfect. To anyone thinking about exploring Birmingham, this is indeed the best place to stay.",
            "time": 1732828800,
            "translated": false
        },
        {
            "author_name": "Karen Wells",
            "author_url": "https://www.google.com/maps/contrib/112026010921574429292/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX2QHJhsLq4m5aREMhgmU75clowpIMUb_kxU21aKLRhbJkyDj-x=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 4,
            "relative_time_description": "2 months ago",
            "text": "Great hotel and so convenient for the station and a McDonald's right next door. The rooms are comfy, although i wish there was at least one drawer in the room. The staff are friendly and helpful also the food and drinks superb. The only reason I have knocked a star off it nothing really to do with the hotel, but if you're a smoker, it's not a great place to stand outside. Although the last time we visited, they did have security.",
            "time": 1727040401,
            "translated": false
        },
        {
            "author_name": "Tim Leunig",
            "author_url": "https://www.google.com/maps/contrib/111008423803862354719/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLU7fkHMq9zCpB8M3x2CFKo5QKIbruZFMqorBaSku8rozRgmw=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "Good points: the room was excellent. Great mattress, great curtains, and very, very quiet. USB charger (A) on both sides of the bed. The shower was powerful although the temperature was not as stable as it might have been. Breakfast was good, although no fried eggs!! Area a bit rough late at night, be aware.",
            "time": 1727727855,
            "translated": false
        },
        {
            "author_name": "Sarah Maugham",
            "author_url": "https://www.google.com/maps/contrib/114826753423025403988/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLj-sgUNfBjdxL6vSkJvTaQ2rMmYJ-KKusAL49p--L7E8mJvQ=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "I'm never disappointed with a Premier Inn as you get exactly what you expect...comfy bed, tea/ coffee etc,good shower & a decent hairdryer next to a mirror!\nStaff were very friendly especially Ewan at breakfast and we took advantage of the 2 course evening meal & breakfast as good value and nice food.\nLocation is so convenient to the train station making travelling easy and all the shops on the doorstep. Also with it being right in the centre was surprisingly quiet at night.",
            "time": 1725553309,
            "translated": false
        }
    ]
}