{
    "name": "Lasan Indian Restaurant & Cocktail Bar",
    "rating": 4.5,
    "reviews": [
        {
            "author_name": "sushant tiwari",
            "author_url": "https://www.google.com/maps/contrib/103677016216161432086/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLtRmYz0XJSTAJ5ALvXpASIhj2mCUkiPDfxiD6yRrSERkdlnA=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "5 months ago",
            "text": "Right when we come to Birmingham we expect the best Indian food and curries. Have tried many places in the city and finally had an opportunity to come to Lasan.\nIt’s a great place / a little out of the way of city centre but 5 mins by cab so not too bad.\nIn a newer building, modern decor and very nicely made. The service was fantastic and very good though we went for 6 pm table / and the restaurant was not busy at that time especially mid week.\nWe had the grill platter which was a selection of starters including seafood and meats. Everything was delicious and cooked well. Loved it. For the mains we went with Daal Makhni / Lamb and Methi Chicken.\nAll of them were great/ delicious and authentic.\nIt’s a great place and a definite place for a revisit.\nMeal for 2 was £150 with a bottle of wine.\nVerdict 5/5",
            "time": 1720257034,
            "translated": false
        },
        {
            "author_name": "Carol Dickinson",
            "author_url": "https://www.google.com/maps/contrib/103990408858465820499/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXa5H1SFvqWfPs_gDoFo7-T0CmIiR_K2m42XpUfX6r-Vx2VEze0IQ=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "3 weeks ago",
            "text": "We have wanted to try Lasan for a while and as we have two family birthdays on the same day we decided to go along last Saturday to celebrate. We all had the 6 course tasting menu which was absolutely amazing. I was worried that there wouldn’t be enough food for the men in our party but there was plenty and we all left feeling well fed. Everything was perfect, outstanding service from knowledgeable staff, amazing food and lovely comfortable surroundings. We will definitely be returning to try out more dishes from the extensive menu 😃",
            "time": 1731350683,
            "translated": false
        },
        {
            "author_name": "Suraj Miah",
            "author_url": "https://www.google.com/maps/contrib/114009876936803430183/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVNgfYJB6rZIggDfSILDa-d-k5uRTVKx52wMhQGUINlcGl6-2Nm=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "Had a great time at Lasan with family.\n\nThe curries that we ordered all tasted unique and different to one another. The Decor is very elegant and back ground music was enough for us to have a nice conversation.\n\nWe ordered a selection of starters and the Lamb chops literally melt in your mouth and seasoned to perfection.\n\nWe ordered a selection of 4 mains which we all shared and accompanied it with the most tastiest Garlic Nan, the softest tandoori Roti and the light Romali roti.\n\nWe didn't have space for desserts but i will definitely be back to try out the taster menu.\n\nService by Marvil (hope i got that correct) was excellent, his awareness of the menu and recommendations was excellent. The way her glides through tables to provide services to others was like an Art. Keep it up brother\n\nOn average we spent around £46 per head, but that's without Alcohol.\n\nEven though I have given it a 5 star rating there is however 2 area's that I felt could improve on. The stairs leading up to the restaurant feels very steep and the steps could be wider in depth. So please ladies becareful with those heels on. The other point I would like to raise is, please don't rush the customers towards the end. We felt the manager came to us in 3 occasions  which was very intimidating, throughout the night he didnt even once come to check up on his, he even gave the bill without me asking for it, at this point my family felt they had to leave, I did not like that at all!!\n\nWhen you have a pleasant meal, you like to finish off with a nice conversation.\n\nThis is one area you definitely need to change... I will definitely be coming again soon and will raise issues if the manager does this again.\n\nOverall i still give it a very good experience and will highly recommend it to others.",
            "time": 1730097253,
            "translated": false
        },
        {
            "author_name": "Andy Smythe",
            "author_url": "https://www.google.com/maps/contrib/112893550219857068807/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUgnnstghmv6YTQX6z9F-CpfYu2GRL5WIcMH5nEmZRLxyTU6gd3=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "5 months ago",
            "text": "First time we have eaten here, easy booking online via their website. Was greeted at the door and made to feel comfortable straight away, instead of being shown to our table we were offered the bar first, which was perfect for us, had a cobra and a gin cocktail, the cocktail was outstanding a spiced gin with ginger. We decided to have the 6 course taster menu plus the wine flight, the food the service was excellent not rushed with the food and sensible gaps between courses, the wine 🍷 is really nice on the wine flight and completely perfect for the taster menu. The restaurant has great atmosphere and the servers are brill, would I go again most definitely.",
            "time": 1717962448,
            "translated": false
        },
        {
            "author_name": "Emma Upton",
            "author_url": "https://www.google.com/maps/contrib/101293465072190809945/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKdyFhIUlGq2AjSrwV_fXl2EvfhK7j2bnudm50XF3QBgkSxUQ=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 5,
            "relative_time_description": "5 months ago",
            "text": "Perfect evening. Had 6 course taster menu with wine flight\nAll the food was delicious, the wine was lovely and good value, and the service was impeccable\nCan't wait to come back again",
            "time": 1719496001,
            "translated": false
        }
    ]
}