{
    "name": "Birmingham Strathallan Hotel | Signature Collection by Best Western",
    "rating": 3.7,
    "reviews": [
        {
            "author_name": "Carl Warmington",
            "author_url": "https://www.google.com/maps/contrib/106211890806413240241/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXNF8iyLDjm0CNCoY66-yN4ouJ-t8ZrOur9GSvxPfTnKricijA=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 3,
            "relative_time_description": "5 months ago",
            "text": "Nice hotel. Lovely clean rooms. Most of the staff were very nice apart from the evening manager who was very rude had a very bad attitude. It is a shame he let the hotel down. Nice english and continental all you can eat breakfast.",
            "time": 1718742498,
            "translated": false
        },
        {
            "author_name": "Liam Penny",
            "author_url": "https://www.google.com/maps/contrib/115557117431024749382/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXU7eRpJ-kj-p8Fo3BWuFr8y9-ix--HCY8hE2lTT3jPP8fbMph8UA=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 3,
            "relative_time_description": "a year ago",
            "text": "The hotel doesn't look up to much from the outside as it's in much need of some TLC but the reception area was a pleasant surprise & the lady in the desk was lovely. The room was small but very nice & did the job for the night at a very good price. We had a full English breakfast in the morning for an additional £10 and it was an all you can buffet style and was good.",
            "time": 1681041639,
            "translated": false
        },
        {
            "author_name": "Scott Randell",
            "author_url": "https://www.google.com/maps/contrib/116473155624661964068/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK_kDtP2EcNGjgLDxx-bDPyq2FpUn7rTY3eMuU0DImAyBPvNg=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "a year ago",
            "text": "Stayed here on business just got a cozy room was very good value for £57 including decent breakfast.\nGood location for night as pubs and restaurants within walking distance.\nAll staff friendly would stay again happily",
            "time": 1700586499,
            "translated": false
        },
        {
            "author_name": "Adam Line",
            "author_url": "https://www.google.com/maps/contrib/110527354342111423638/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWHr2my7DHDg8Grr970T_sNKtbHNI42T6lCNB3nhWvbgZUGNQMy=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 4,
            "relative_time_description": "a year ago",
            "text": "Nice hotel with reasonable rooms.  At least the rooms on the outside of the circle are a good size, the rooms on the inside of the circle are quite limited in space.  Food is nice and a good standard buffet cooked breakfast.  The bar is quite extensive priced, but the staff are lovely.  Located on Hagley Road it is easy to get in or around Birmingham.",
            "time": 1700159096,
            "translated": false
        },
        {
            "author_name": "Ross M",
            "author_url": "https://www.google.com/maps/contrib/109130814411552944164/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKGfPgD__pXv-9TpGrZKnGW5_njigKpBhb1qj9duf88pJ4D9XxY=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "a year ago",
            "text": "My partner and I stayed here for 8 days with our hamster Stormi, in between moving house. First of all, I was really pleased to find a hotel that was willing to accommodate a hamster - many said they only allow cats and dogs (despite the fact Stormi makes no noise, doesn't smell, is caged, makes no mess and causes no damage). Further, they agreed to waive their policy of charging extra for pets - great to find a business willing to be flexible and use common sense. Ana was the lovely lady who agreed to this prior to our stay (presumably with senior approval, so thank you to anyone involved in applying the common sense approach!). Upon arriving, it seemed the compact room we had booked would be too small for the large cage (to be fair Ana had warned me about this via email, but I was on a budget so tried the cheapest room) - the night manager 'Mr Patel' advised even the next room up wouldn't be large enough, but agreed to give us the superior double for the same uplift as the standard double - again, great service. On one of the days the beds were being upgraded in all the rooms and Ana kindly agreed to have Stormi in the office downstairs whilst our room was being worked on - most places would just say it is against our policy, we aren't insured etc, so again it was great Ana was willing to be flexible. Mr Patel and the young chap that often worked with him at night were extremely helpful and personable consistently. During the day, Ana was the shining star, but there was also a young lady of Asian descent who was most helpful  and a lady on the bar that lives near Kings Heath - also really helpful and genuinely concerned about our welfare. I think I also spoke with Matt the manager on the day of the bed change and he too was professional and courteous. Nothing was too much trouble - they gave us cutlery and plates to take to the room for take aways, ice to take to the room for drinks and they even give out drink vouchers if you are happy not to have your room cleaned - it's not heavily publicised, but just ask at the desk and they will help. Another young lady I think called Sophie was pleasant and helped with these vouchers. The food and drink is overpriced , but the one meal I had there was tasty and good for Vegans. The location is great being on the Hagley Road and you get free parking by entering your Reg into the tablets on reception - loads of parking in the outside ground level car park and further in the multi-storey. The room was comfortable if slightly dated and it was a shame there was no air conditioning (I gather some rooms of a lower cost actually have this). The hotel was really clean and generally well maintained. For us, it was perfect as it wasn't just a hotel stay, but a temporary home and they were all extremely accommodating and attentive - if there were things to fault then I'd have found them, but genuinely it was a lovely stay and the staff were impeccable. Only other critique, is the restaurant and bar closed earlier than the published times on numerous occasions, and there was no night menu for food or drink that I could see. All the staff were great and the rooms were really clean and cleaners helped with supplies (even on days we had received the voucher for no cleaning), but Ana especially made the difference! Thank you Ana! From Ross, Kelsie and Stormi 🐹 picture of the little fluffy stunner attached, for everyone's mutual benefit - so much fluff in such a tiny package!😂",
            "time": 1695050856,
            "translated": false
        }
    ]
}