{
    "name": "Cbc café & restaurant",
    "rating": 3.6,
    "reviews": [
        {
            "author_name": "Darrell S",
            "author_url": "https://www.google.com/maps/contrib/107417149399174655154/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJvg4HDigbjE7hoe7dCkKUjokv0ScVHPjbGQBiXr4Y4Vq3Vrw=s128-c0x00000000-cc-rp-mo",
            "rating": 1,
            "relative_time_description": "3 years ago",
            "text": "Does not even rate for one star. Staff was not friendly. I ordered chicken with rice where both were cold to the touch. Chicken looked like it was cooked well before I ordered it, maybe a day or more. Not appetizing at all. The salad served with the meal looked like it had seen better days. They offered to heat up the food but I was not interested in the food going into a microwave to try a second time.\nI sent the food back, RIP.\nI spoke to a customer prior to ordering who was already eating who said her meal had a lot of quantity but she said she would not recommend ordering it as it did not taste good. I saw her leave the restaurant with the plate of food remaining.\nToo bad I did not read the reviews before ordering a meal as I would have gone elsewhere. I was there at 12:20 pm, lunch time. There were only a couple of other customers in the restaurant. Being lunch time this should have been a red flag as to why there were not more people eating here? Then to add insult to injury, they tried to charge for the returned menu item.\nThe prior reviews are absolutely correct, I would not recommend this establishment to anyone.",
            "time": 1636454822,
            "translated": false
        },
        {
            "author_name": "R. Koedam",
            "author_url": "https://www.google.com/maps/contrib/114094970982765669353/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXs3J9ojcLg5sTPoCafQwpDIaE_wyKfW4eoc5yjSPrD7GrvoCDVJA=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 1,
            "relative_time_description": "5 years ago",
            "text": "Low quality and almost always cold food would not recommend it at all and the old ladies at the cash desk are slow which is resulting in unnecessary ques. If you can don't go there it's not word the struggle and i'm not talking about the toilets which are disgusting. Now they even raised the prices to 5,60 for a normal dish this is crazy for the quality of the food if you can just boycott this place until they realize that you need to provide also the service and not to just raise the prices....",
            "time": 1565339756,
            "translated": false
        },
        {
            "author_name": "David Lukacik",
            "author_url": "https://www.google.com/maps/contrib/103749642469206915179/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUO6rlhUO0yYBsUsxO3WJvOEifiCM2oC_sfttk7bcGbuAADzl-_gw=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 3,
            "relative_time_description": "5 years ago",
            "text": "Decent Service, but other than that, dissapointing.\n\nPrices were far too high for the quality of food offered.\n\nPasta had far too much garlic, entire cloves thrown in and too much sauce and not enough pasta.\nSmoking area was not distinctly seperate from the rest of the dining area.\n\nOverall, would not recommend, but not the worst.",
            "time": 1562746221,
            "translated": false
        },
        {
            "author_name": "Tomáš “popko” Sarlós",
            "author_url": "https://www.google.com/maps/contrib/113905415265952269452/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWEt3dr47KhH_57etOpmTa-bhi9w2Wpf0kMtqbQHGhNPj3ssYHO=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 3,
            "relative_time_description": "7 years ago",
            "text": "Unbalanced quality. Tried mostly daily menu from which most options had at least one showstopper for choosing as a meal. On the other hand, very good salad table. Minute steak also very good. The place has two separate rooms for table serviced part and self serviced part, both with the same kitchen.",
            "time": 1488577881,
            "translated": false
        },
        {
            "author_name": "Petar D. Petrov",
            "author_url": "https://www.google.com/maps/contrib/100384008420950340346/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUTEvpqQkE96W91iO5iuMpDQt-bB-aLlbVHxdeQt21fgNyZNUNWCw=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "5 years ago",
            "text": "The food was really good, ans portions are huge. The staff doesn't really speak English, but there is a well-written English menu, so choosing what to eat was hustle-free. 2 soups (330ml) , 2 small salads (200grams), 2 portions of pasta with meat (450grams)  and 2 drinks for about 28 euros.",
            "time": 1566379355,
            "translated": false
        }
    ]
}