{
    "name": "Radisson Blu Carlton Hotel, Bratislava",
    "rating": 4.6,
    "reviews": [
        {
            "author_name": "Laura L",
            "author_url": "https://www.google.com/maps/contrib/103458271405007790717/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJM2H2zlIoUKK9JR7ySVrftgcpR0x3DFn9XE7uLMkdmCja6jA=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "Extremely lovely hotel with professional and very friendly and knowledgeable front of house team. The room was very special with a stunning view and cozy atmosphere. Excellent location with parking and walkable distance to all of the main sights. Especially fantastic Mirror Bar with helpful staff. Brilliant gym. Thank you for making my birthday getaway incredibly memorable, the team went above and beyond all expectations!",
            "time": 1730725144,
            "translated": false
        },
        {
            "author_name": "Simonmytravels “Simonmytravels”",
            "author_url": "https://www.google.com/maps/contrib/117091571433069007026/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ3yy5e7vCeEGk6Un6JLd3lP_YvPPFf9dTMt6sHUEO1rVQgUw=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "What a wonderful hotel this is.\n\nWe visited  for a lovely Bratislava birthday break.\n\nThe hotel is situated right on one of the atmospheric main squares, opposite many restaurants and bars.Just a very brief stroll to all of the other old town attractions, across the many charming cobbled streets and squares.\n\nWe were given a free upgrade for the extensive breakfast buffet and accommodated in a seventh floor room overlooking the square and offering a gorgeous vista of the castle, opera house, numerous other renowned buildings and way over to the surrounding mountains beyond.\n\nWe also received a bottle of fizz and a cake for my birthday, which I felt was a very nice touch.\n\nThe room was quite spacious and had everything we needed.\n\nThere was a blockage in the shower but this was quickly resolved.\n\nService was attentive and extremely professional throughout.\n\nSpecial mention to Kareena who was very helpful.\n\nWe got a good room rate and this hotel utterly exceeded my expectations.\n\nThe best hotel I have stayed at in Europe for quite some time, highly recommended.",
            "time": 1723920546,
            "translated": false
        },
        {
            "author_name": "scott scheinbaum",
            "author_url": "https://www.google.com/maps/contrib/104157251748425379153/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXpzvX0-wIcWfdMx1pwBdQ68JcuDHKbjpLnKOEh6Ytz4dBNMwZV=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "Stayed here for a wedding in Bratislava. Hotel was new, clean and very comfortable. Ema at reception was very helpful. Right in the middle of the old city and just steps from a lot of bars/restaurants/clubs. The hotel bar was fantastic and Eva and Deana gave our large party great service on multiple nights. Fitness center was modern and clean. Casino downstairs was very enjoyable. I will be staying here again!",
            "time": 1724948244,
            "translated": false
        },
        {
            "author_name": "Tim G",
            "author_url": "https://www.google.com/maps/contrib/107381592050821583348/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKS6A2E2z2s0aHV2IPO5QB4TTqDZL_0IKXqsJUrvPpLf8zh5A=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "Great hotel right in the centre. The gym is one of the best I’ve used at a hotel. Only negative is that you have to pay to use the spa (sauna, steam and jacuzzi) €17 per person. Didn’t use it because it really should really be included at a hotel like this. Breakfast was excellent with buffet and a la carte.",
            "time": 1725295199,
            "translated": false
        },
        {
            "author_name": "Vivek Shahi",
            "author_url": "https://www.google.com/maps/contrib/100412532118161062312/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXFlf14CTjtAuDZLI4hzhY2UShICAWaNug86HdZ_Ir73jRqfjWp=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "Radisson never disappoints! Awesome location, great rooms and breakfast and fantastic service.  From check in to check out. These kinds of places make your stay memorable and helps you relax for a usually stressful vacation itinerary. The added bonus was a surprise offer of a cake and wine to celebrate a special occasion.\nThe stay convinces you of opting for a hotel on the city center. It is worth to pay a bit more and avoid the hassles of commuting to and fro from the touristic spots",
            "time": 1725561593,
            "translated": false
        }
    ]
}