{
    "name": "Park Inn by Radisson Danube Bratislava",
    "rating": 4.3,
    "reviews": [
        {
            "author_name": "Mariia Ivankovych",
            "author_url": "https://www.google.com/maps/contrib/102886255743861863078/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUBeebqJDI_ePPM-Sy4bMSuVTL8qColYj7__vb8AG55vi6fS0zk=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 4,
            "relative_time_description": "in the last week",
            "text": "Overpriced, tiny rooms, however clean and cleaning is available every day. Location is AMAZING everything is super close and lviv croissants are right in front of the entrance which was gorgeous and unexpected. Castles and river and architecture is amazing too which is 2 minutes away. check-in was rather slow, but not receptionist fault. The biggest issue was club working till 4 am literally banging on our walls on the third floor. And very noisy street. I'd rather not recommend it for a quiet vacation, but overall a pleasant experience.",
            "time": 1733058810,
            "translated": false
        },
        {
            "author_name": "Réka R",
            "author_url": "https://www.google.com/maps/contrib/100710677018059565209/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVTRCNp4g_0Sbdts7g9T8g1D31YebRIHsuPDxH4nGl3rZitjD4K=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 3,
            "relative_time_description": "a month ago",
            "text": "The location of the hotel is very good, the old town is just a few minutes walk away, and there is a shopping centre nearby.\nBreakfast is buffet style, with plenty of choice and a varied menu.\nThe rooms are clean and well equipped, but unfortunately the air conditioning is not adjustable, it was quite cold. Unfortunately for me, I probably got a \"family room\", which means that there is a thin door separating me from the person in the room next to me. This is quite unpleasant because all the noise, from snoring to flushing the toilet, was filtered through and this inconvenience was not warned about at check-in. Overall I would recommend the place, even if I didn't have a good experience, with the right room I think everyone will be happy.",
            "time": 1730020777,
            "translated": false
        },
        {
            "author_name": "Luis Serra",
            "author_url": "https://www.google.com/maps/contrib/116868962705041217609/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX3jlHlgJrx9jn1-CcZ__vPO-__3NGYS1yV6aTGthVsrmSFp1PEKA=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 1,
            "relative_time_description": "a month ago",
            "text": "A 4 star hotel with a disco on the ground floor? Really? I'm currently on my room, on the third floor while writing this review listening a very loud music. How is this possible?\n\nJust called the reception and the answer was that the music will continue until 2am and there is nothing they can do, quickly holding up my call.\n\nLocation is good, but it's not everything. If you want to enjoy your stay at the hotel, don't choose this one.",
            "time": 1729369997,
            "translated": false
        },
        {
            "author_name": "Rosalind Aitchison",
            "author_url": "https://www.google.com/maps/contrib/102679006429750015499/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUffB8PGJ8MAGXoUul_0qgdlU9I1haLUtLrilK-8ptKH2eW9nsOCQ=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 3,
            "relative_time_description": "a month ago",
            "text": "Loved the location, the breakfast is very good. The room was comfortable and clean with a great view of the river. We had a massage at the spa and it was fantastic\n\nWe asked before booking if the swimming pool was open and was told it was. During our stay the swimming pool closed and was told was emergency repairs. This was a lie as a sign was then posted saying it was routine maintenance. Why a pool has to be closed for 5 days I do not know! Surely it can be fixed in a day. They could have told us when booking the pool would have been out of use but they didn't. We would have booked elsewhere as we wanted a pool. It was a shame as we got to use it once and it was a beautiful spa area. Also housekeeping is not good, you need to request room to be cleaned and sometimes they do and sometimes they don't, and water is never refilled.",
            "time": 1730620005,
            "translated": false
        },
        {
            "author_name": "Adler Mobasser",
            "author_url": "https://www.google.com/maps/contrib/101518604446911957795/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUsko4E2obO_lt91iSFIHfHSoRivUjm8AaWEvgEbWlqf-wIsHF7=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "So far it's one of mine and my dog's favourite hotels ... Yes!!! The only hotel that my dog received a welcome pack 🥰❤️ Sara at the front desk was absolutely amazing and made us feel very welcome.\n\nThe hotel itself is in a perfect spot too, right by the river with castle view rooms and across from the square full of restaurants, bars and cafes.\n\nIt also has one of the most extensive gyms with the best equipment that I've seen and a nice pool and spa. I only wish the wellness opening hours were a couple of hours longer from each end.",
            "time": 1725308440,
            "translated": false
        }
    ]
}