{
    "name": "Falkensteiner Hotel Bratislava",
    "rating": 4.4,
    "reviews": [
        {
            "author_name": "Marius CHIRITA",
            "author_url": "https://www.google.com/maps/contrib/104433965895582639628/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUK532zzBPc7cyWutW2kZiuN_bi8jLQpJZgyk0w1pe4okeqJ92GeQ=s128-c0x00000000-cc-rp-mo-ba6",
            "rating": 4,
            "relative_time_description": "3 weeks ago",
            "text": "The hotel is located very convenient for accessing the city old Center where are the main attractions and many restaurants. It also has a underground parking which again is very convenient if you are coming by car. The breakfast was really good with so many different things to choose and with high quality products.\nThe only downside is the room, which are quite old, and the speed of WiFi network which was closed to nothing.",
            "time": 1731554548,
            "translated": false
        },
        {
            "author_name": "Viktor Gurevich (GViktor)",
            "author_url": "https://www.google.com/maps/contrib/100377506412868167802/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW3AhMFcjJVCq3IQ789ztDR0kUA1_oG7bpdg4bNTORDBqeMKVY=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 4,
            "relative_time_description": "a month ago",
            "text": "Very good breakfast. Gorgeous spa. Very helpful staff. Unfortunately some rooms do not provide enough comfort and privacy b/c of lack of thin curtains. WiFi signal was weak.\nWe stayed one week in October 2024.",
            "time": 1729883825,
            "translated": false
        },
        {
            "author_name": "T0mmy",
            "author_url": "https://www.google.com/maps/contrib/112568669178978053962/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU63brOzFSTSgr7IKJn_6GMu6c2ilYaK2j6yZGTyEwaUZniWwfvPg=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 3,
            "relative_time_description": "4 months ago",
            "text": "Linda and Ivan made the stay very comfortable and the staff in general are all great!\n\nBreakfast was very well laid out too!\n\nThe hotel is well situated, clean and safe (with safes in each room) and the robes were amazing!\n\nUnfortunatly our air conditioning was kaput in the first room and the barely working in the new room.\n\nOr friend's air conditioning however worked great but our was struggling in the 31 degree heat. Meaning we were both struggling to get a good night's sleep.\n\nThe rooms also have a glass seperator between the bathroom and the bedroom with no blind or curtain in the bathroom so the light floods in despite nice bedroom curtains. I had to made some temporary adjustments.\n\nAside from this everything was as expected for a decent three star 6 floored hotel in the heart of the city.\n\nCustomers may need more than one bottle of water in the summer time.",
            "time": 1721720396,
            "translated": false
        },
        {
            "author_name": "Harri Salonen",
            "author_url": "https://www.google.com/maps/contrib/111030815599617872517/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUFPE3A5_agrj1CCcbjpt8OS_aakMGeUMGCCzHSMSk9PrEdz5jJMQ=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "Nice and clean hotel. It is from walking distance from most of the old town. Bus line 93 goes from train station (both of them) to just outside hotel. There is a tunnel you have to take to cross the road, but it felt safe even during weekends. Rooms were kinda old rooms, but it was ok and they were clean. Breakfast was also ok, nothing special, but it was nice. This hotel is good value for money if you get it for less than 100€/night.  But it is a good choice, even if you have to pay more. Originally I reserved this hotel because of AC, but weather was not hot , it was 10C and stormy. Rooms were still great, and instead of cooling I was happy that heating worked :)",
            "time": 1726674494,
            "translated": false
        },
        {
            "author_name": "Denis Valašek",
            "author_url": "https://www.google.com/maps/contrib/107848045798343866284/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU25zQNJE-QuRLwTT-b6wb1rPaDjDVK2QJQ9pLhWAvH9VHa39oi=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "I was there for 4 days. I liked location, especially nice view of castle and downtown from the roof. Food was great, for breakfast there are lot of options... Staff are kindfull and positive.  The room was clean. This hotel has 4* legitimately.",
            "time": 1724097817,
            "translated": false
        }
    ]
}