{
    "name": "Sofitel Brussels Europe",
    "rating": 4.5,
    "reviews": [
        {
            "author_name": "Jane Mullen",
            "author_url": "https://www.google.com/maps/contrib/115727776064741615625/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWH9Q4gmjIgoRKtheeq9xb4FxIifV3b-a8u6z1-IOqdyFzrmLoHcA=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "We recently had the pleasure of staying here, and it exceeded all our expectations. From the moment we arrived, the service was impeccable. Clara and Ava at the reception were absolute stars, especially with our 5-year-old. They went above and beyond by surprising him with a travel diary filled with fun activities and coloring pencils, which kept him entertained throughout our stay—such a thoughtful gesture that really made us feel welcome.\n\nThe location of the hotel is perfect. The cleanliness of the hotel was flawless. Our room was spacious, and had the most comfortable beds we’ve ever slept in—ensuring a restful night after our days of exploring.\n\nOne of the highlights of our stay was the rooftop bar. The views were absolutely superb, and it was the perfect spot to unwind with a drink in hand while watching the sunset. The atmosphere was vibrant yet relaxing, making it a great place to end the day.\n\nOverall, our stay was nothing short of exceptional. The combination of outstanding service, prime location, immaculate cleanliness, comfortable accommodations, and that incredible rooftop bar makes this hotel a must-visit. We can’t wait to return!",
            "time": 1723475060,
            "translated": false
        },
        {
            "author_name": "Rhys Linnell",
            "author_url": "https://www.google.com/maps/contrib/100089427996562288923/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLA3_kZTMxdOyHBo89NtwZaI2Sr0oRyXjh2Yc4hzBK2z_XLhQ=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "Recently stayed here as a birthday treat for my partner and had such an amazing experience! A huge shoutout to Clara for her personal touches and for making the experience so special. You were amazing. The hospitality, friendliness and attentiveness went above and beyond. The location is great, the room is very clean and the amenities are great. I would highly recommend staying and look forward to coming back for business and pleasure in the future. Thank you!!",
            "time": 1724102089,
            "translated": false
        },
        {
            "author_name": "Anna Kocanova",
            "author_url": "https://www.google.com/maps/contrib/104732363497990640685/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW5fYRV5KWQtxkSLb4RyvkWh6ZQ_INMpSTQYTONHyEryJnZz50=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 4,
            "relative_time_description": "3 months ago",
            "text": "Very good and quiet hotel. Service was excellent and the people in different departments were very polite and exceeded expectations. Breakfast was very nice. I loved the happy design of the lobby area. The hotel is  located on the square with many different restaurants and also a small park beside. Plenty of supermarkets around.I truly enjoy our stay there.",
            "time": 1723979203,
            "translated": false
        },
        {
            "author_name": "Nicholas Richards-Bentley",
            "author_url": "https://www.google.com/maps/contrib/109582708792714941315/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI3aiYQ_uHDpvQipQOoNg8Kd3d-HNhHt6cWe6SbO_dz6cgHtQ=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "I just finished my first stay at the Sofitel. Was very impressed by the consistently high level of service and friendliness amongst all staff: front desk, maid, breakfast servers, and masseuse. Upon checking in, I received a call to ensure that everything in my room was in order. The manager then dropped by with a gift of Belgian chocolates. The gym is also excellent. Only minor quibble is that the room arm chair and curtains were a bit dated and could use refreshing. Overall, I would be happy to return!",
            "time": 1727268565,
            "translated": false
        },
        {
            "author_name": "Trupti Puranik",
            "author_url": "https://www.google.com/maps/contrib/118360512973140342899/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXQSohos9Ze-oAr9zY-lFAYbJMX2JvlVxXvZTR3kWp23g1OOwha=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "Best hotel for tourists to stay in Brussels. The location is super convenient, public transportation connectivity is good. The hotel itself is nice, well maintained, comfortable rooms. We had a wonderful stay at the hotel. They have a roof top bar to add to the charm.\nBreakfast was great and the staff at the restaurant were very helpful.",
            "time": 1723788702,
            "translated": false
        }
    ]
}