{
    "name": "Hotel Le Plaza Brussels",
    "rating": 4.3,
    "reviews": [
        {
            "author_name": "Amaterasu",
            "author_url": "https://www.google.com/maps/contrib/116059277298077925670/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV1Q6SSb4ccsCi3C6IXUZLoTTxIary1Bi6tpduA1JPJpgI4BD6c=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "in the last week",
            "text": "I had an absolutely delightful stay at the Plaza Hotel in Brussels! The experience was perfect from start to finish.\n\nThe rooms are spacious, well-furnished, and immaculately clean. The bed was incredibly comfortable, ensuring a great night’s sleep, and the vintage decor gave the space a charming and elegant feel.\n\nThe dining areas are equally impressive, offering a classy ambiance with their beautiful lighting and tasteful decor. Breakfast was an exceptional experience with a wide variety of high-quality options to satisfy every palate. The attention to detail is evident in every corner of the hotel.\n\nI attended a conference in one of their meeting rooms, and I was blown away by the grandeur of the space! The chandeliers, intricate ceiling details, and overall opulence create a setting that’s both professional and inspiring. It’s the perfect venue for any event.\n\nThe room service was also impeccable. The food was fresh, delicious, and beautifully presented. I particularly enjoyed the thoughtful combination of flavors in the dishes.\n\nOverall, the staff were incredibly welcoming and professional, always going the extra mile to ensure my stay was memorable. The hotel’s location in Brussels is also a big plus, offering easy access to the city’s attractions.\n\nI highly recommend the Plaza Hotel for anyone looking for a luxurious and unforgettable experience in Brussels. I can’t wait to be back!",
            "time": 1733009517,
            "translated": false
        },
        {
            "author_name": "Angela Keane",
            "author_url": "https://www.google.com/maps/contrib/111969779378501940432/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLRvew2-E2gvMYIKXtqMghBrtbM48kTxWQpML2GhrNrRQ57xA=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a week ago",
            "text": "Three of us friends spent two nights in Le Plaza Hotel. We were very happy with our triple room as one bed was like a mini bedroom with its own door.\nBoth room & bathroom were very clean.\nStaff attention & service was excellent.\nAlso information shared re city & map given much appreciated.\nBreakfast was very fresh.\nWe would certainly stay here again very central location for city access, restaurants & metro. Walking distance of city.\nEasy access for train to Bruge.\nThank you\nAngela Keane & Friends",
            "time": 1732544575,
            "translated": false
        },
        {
            "author_name": "Alaa nazaryan (Coachalaa)",
            "author_url": "https://www.google.com/maps/contrib/102139989760445324000/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWP_TXWHRWNVChU7RD9qs7KfzHUwsSgPxId7eHloCPWaLTjsC3DWQ=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "I recently stayed at Hotel Le Plaza, and I couldn't be more pleased with my experience. The rooms are impressively spacious and beautifully decorated, providing a comfortable and aesthetically pleasing environment. The staff were exceptional—always helpful and accommodating, making my stay even more enjoyable.\n\nThe hotel's location is another major highlight; it's situated right in downtown Brussels, making it incredibly convenient to explore the city’s attractions, restaurants, and shops. Overall, I highly recommend Hotel Le Plaza for anyone looking for a blend of comfort, service, and prime location!",
            "time": 1729192961,
            "translated": false
        },
        {
            "author_name": "Alex Fomin",
            "author_url": "https://www.google.com/maps/contrib/104285248242818107431/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUjSHU7r5WBu6nDYk2a8uk9hU2opAzzHh6cUhMqTeOHkYFTw_M7=s128-c0x00000000-cc-rp-mo-ba6",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "This hotel is quite old (almost 100 years) and unique in its own way. There is a lot of history attached to this place.\n\nIt was an entire pleasure to stay there. Beautiful, spacious, clean and quiet room, very good service, good breakfast, very central location with optimal accessibility to the main places in Brussels. The rooms have all the amenities, including bathrobe and slippers. Considering the amount I paid, it's great value for money and recommend it heartily.\n\nThe staff is very courteous, though it was somehow funny to see the the arrogant look of the waiter when I couldn't operate the fancy toaster)).\n\nThe interiors are very elegant.\n\nCertainly it would be great to have some renovations and improvements, but yet again for the money I paid, the hotel and service is fabulous.\n\nAlso I would include something extra for breakfast, like optional porridge.",
            "time": 1724688648,
            "translated": false
        },
        {
            "author_name": "Réka Kálló",
            "author_url": "https://www.google.com/maps/contrib/103837552381369766400/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIHlvl-LtuI8bcZzZPBoa78RSVIQDS9k3AMDqwAvBkUBtneqA=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "a week ago",
            "text": "Very well located hotel with a big, spacious garage. The price-value ratio is pretty good. The rooms are clean and the breakfast is OK. I loved the Christmas decoration in the lobby.",
            "time": 1732709716,
            "translated": false
        }
    ]
}