{
    "name": "Thon Hotel Bristol Stephanie",
    "rating": 4.5,
    "reviews": [
        {
            "author_name": "Colin Day",
            "author_url": "https://www.google.com/maps/contrib/102385252921030326787/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVEEE47BZf-IIgllR94x4FCn_Ldf6GkXYt_izhpYlY-OxWX40a3=s128-c0x00000000-cc-rp-mo-ba6",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "Absolutely nothing that I could really fault during this stay.\n\nThe room that we had (we were given an upgrade), was really massive.  The room was very clean., it was well laid out and just pleasant to stay in.  Another plus was that it is right at the back so away from the main Avenue Louise so was very quiet.\n\nReception and other staff were just excellent throughout of our stay.  Absolutely nothing to fault and lots to compliment about them.  Very help knowledge of the local area.\n\nBreakfast was typically excellent.  A wonderful selection and the staff were really helpful and attentive,\n\nLots of facilities to use in this place, but we sadly did not have time to use them all.\n\nOverall all that I can say is that we had a brilliant stay and that was in a large part cause by the wonderful staff on site.",
            "time": 1729427255,
            "translated": false
        },
        {
            "author_name": "Josephine",
            "author_url": "https://www.google.com/maps/contrib/108112680612542825768/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJDrnXkM0CwQj6rL8ok0W8DSbVdzkqv9ts_bAIIVs0jffl2Mg=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "Lovely hotel,  beautiful room, upgraded by a friendly staff. Buffet breakfast was excellent.  The bread and brioche were so fresh. Selection of coffees, teas and drinks really excellent. I would definitely come back.",
            "time": 1730059353,
            "translated": false
        },
        {
            "author_name": "B K",
            "author_url": "https://www.google.com/maps/contrib/115796462908282755697/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLuWs0ZzxRdeEGsZc7ELCLgToIDqyEXt2SqoxQ_J99Ze4y2dlE=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "4 months ago",
            "text": "What a wonderful visit. We had a superb room with a terrace and seating outdoor. The room was so spacious. Breakfast was excellent with all of the best products. Staff were beyond helpful with any of our requests. Room cleaned everyday. Water left in the room each day. It is some distance from the city centre which is good and bad as we had to use taxi/ transport a good bit but it was brilliant at night as there was no noise in the rooms. We love this hotel. We stayed for 4 days and will be back very soon!!",
            "time": 1722963554,
            "translated": false
        },
        {
            "author_name": "Lynn Nguyen",
            "author_url": "https://www.google.com/maps/contrib/105162389521604153409/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW6PVoJai07ohCSYuPpzxSSIuqg4CwgqMwjWUslzEdyLnhW6wk=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "The hotel is very nice and clean, big room, comfortable and very clean with a huge king bed and queen bed. Definitely valued for money! Location is great too! Right on the street of luxury shops, walking distance to the square or you can take a tram right in front. Highly recommended especially you travel with family of 3-4p",
            "time": 1728367357,
            "translated": false
        },
        {
            "author_name": "Yip Wong",
            "author_url": "https://www.google.com/maps/contrib/101865401254603967134/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVFhq_YgqZ43Dg3yYBP6etvXekgAc4_auiYi0MfXgKbE5NqlOQ=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "Went for a holiday with my family. Staff very friendly and welcoming. They gave out kids a rubber duck which they played with in the bath.\nVery simple thing like we had breakfast which was delicious, but our little one refused to have a lot, and then said he was hungry at checkout, and the staff went to get him a croissant when they didn't really need to. Pleasant stay. Short walk from louise station.",
            "time": 1730185334,
            "translated": false
        }
    ]
}