{
    "name": "Novotel Brussels City Centre",
    "rating": 4.3,
    "reviews": [
        {
            "author_name": "Ryan",
            "author_url": "https://www.google.com/maps/contrib/103518476036633922783/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXt-Mi137tK9ZWlTNT1yw3LYbAc9L4U6-2dgZmjoJX4RDup85VL=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 5,
            "relative_time_description": "a week ago",
            "text": "Pretty nice place to stay in Brussels City Centre. The rooms are nice, it’s in a great location, and it manages to be somewhat quiet given its central location, and also because it’s adjacent to some ongoing construction. The price of the breakfast is a little ridiculous (26€ per person) but there are many nice breakfast and brunch places within a 10 minute walk.\n\nThe fitness center is nice and gets the job done if you’re looking for a workout. There’s also a pool, though we didn’t use it. They have umbrella rentals in case it’s raining out (2€ for 48 hours). They have snacks and drinks available for purchase in the lobby, but 4€ for a water is a ridiculous price.\n\nOverall, solid place to stay in the heart of Brussels. Great location with most of the major tourist attractions pretty much within a 15 minute walk. I would recommend this place.",
            "time": 1732554842,
            "translated": false
        },
        {
            "author_name": "Jarrod S",
            "author_url": "https://www.google.com/maps/contrib/115970130637750249249/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVX3mADX04IX8BITT_zltoZ_7uyFRusFZJhIWascuOrqKu0HUs=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "2 weeks ago",
            "text": "Great hotel. Standard room very large and clean enough. Close walk to resturants and bars and tourist attractions. Service was fine. Has a pool, restaurant and bar so everything you need should the weather keep you indoors. Little bit of street noise but not over the top. Would stay again",
            "time": 1731751587,
            "translated": false
        },
        {
            "author_name": "V “Vic” Dave",
            "author_url": "https://www.google.com/maps/contrib/115834604017231366698/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJbNX5apQlOywsBAnmz_YagdnBH_z1YydfRdI0WdY1UtJ5x6w=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "We had a great time, as a family of 4, staying at Novotel Brussels City Centre. The location is excellent for all the key sights and local restaurants. The staff were excellent, particularly Awa in reception who went above and beyond us us with all our needs. The gym is small but well-equipped but could do with a water dispenser. The pool was small but the kids had fun. Overall,  I would thoroughly recommend the hotel!",
            "time": 1724567158,
            "translated": false
        },
        {
            "author_name": "Yasir",
            "author_url": "https://www.google.com/maps/contrib/101113636371612598549/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWTdZ6zJc6f7xcULGnFfTnWrLeUzJmbbL5CXln3sbXeAbwKh6WAMQ=s128-c0x00000000-cc-rp-mo-ba6",
            "rating": 4,
            "relative_time_description": "3 months ago",
            "text": "Location and staff were really good, so attentive and thoughtful. Rooms were nice and spacious. The pool was one of the reasons we booked this place and that was underwhelming - we ended up not swimming because it just didn’t look great. Otherwise, hotel is great",
            "time": 1724754719,
            "translated": false
        },
        {
            "author_name": "Sunil Gupta",
            "author_url": "https://www.google.com/maps/contrib/101653760540946733989/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV_6ZkZSVVJHkMIWlOchZaooor10jnhIltaE_8bhwrCj_VsiUzOYA=s128-c0x00000000-cc-rp-mo-ba6",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "Our first stay at Novotel turned out to be a truly delightful experience that exceeded our expectations. Located in the heart of Brussels city centre, the hotel is perfectly situated, with many of the city's major attractions just a short walk away. This made exploring the vibrant city incredibly convenient and enjoyable.\n\nI had made a special request in advance for a surprise birthday celebration for my wife, hoping to make the occasion memorable. The hotel staff not only fulfilled my request with great attention to detail but also went above and beyond by surprising us with additional thoughtful gestures. They presented us with gifts and complimentary drinks, which added a personal touch to our stay and made the celebration even more special.\n\nThe entire experience reflected the hotel’s commitment to excellent service and hospitality. The staff's warm and considerate actions truly made our stay at Novotel a memorable one.",
            "time": 1725353080,
            "translated": false
        }
    ]
}