{
    "name": "Penta Hotel Brussels City Centre",
    "rating": 4.3,
    "reviews": [
        {
            "author_name": "S “Anon”",
            "author_url": "https://www.google.com/maps/contrib/115930618173594069387/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJTp07Zyg0D3SpS3Rw35ew8FuhkJjNQzk7NsQFdH6dvm2T6tg=s128-c0x00000000-cc-rp-mo",
            "rating": 3,
            "relative_time_description": "a month ago",
            "text": "The reception staff are great and very accepting, making for a pleasant check-in experience.\n\nThe rooms felt comfortable. The curtains in the room are great; they are heavy and excellent at blocking out sunlight. However, they can be a little difficult to close.\n\nOne downside is the lack of cupboard or storage space, which can be inconvenient. The halls are quiet, and there is a good-sized TV for entertainment.\n\nHowever, there are a few amenities missing, such as an iron and a microwave. The fridge is very small, which may not be ideal for storing larger items.\n\nThe gym is average-sized, offering basic equipment for a workout. One issue with the beds is that they are split into singles, and there is a noticeable difference in mattress firmness, with one being softer than the other.\n\nAdditionally, there is no water provided in the rooms, which can be a drawback for guests. Lastly, the lobby tends to be crowded, as it essentially functions as a bar, leading to a busy atmosphere.\n\nThis is more deserving of a three star hotel than a four, unfortunately.",
            "time": 1728713361,
            "translated": false
        },
        {
            "author_name": "F",
            "author_url": "https://www.google.com/maps/contrib/110194237067638328025/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUJIJBvSp-vK-OmdTStRqplaUscBCWCp6IeIpbNPgQrifE-WNWu=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 4,
            "relative_time_description": "a month ago",
            "text": "Solid hotel with walkable distance to everything in Brussels. The cleanliness of the rooms was next level, the beds were huge and very comfortable. The room was big with an overlook of the area. The service was also very good, very easy to check-in and check-out. Great food and small bites to grab with a good Belgian beer or such. Great selection of beers and other alcoholic beverages. Takes around 15 minutes to get to grand palace and about 20 minutes to get to central Brussels. Good area with a lot of luxury brands and good cafes. Overall a very pleasant experience!",
            "time": 1730702884,
            "translated": false
        },
        {
            "author_name": "Kelly HG",
            "author_url": "https://www.google.com/maps/contrib/107090552170235326300/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKh8pmy7prTJO5RzihJol-8-q8Zuk0sEP-dcw4jTR-UcfhIJg=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 5,
            "relative_time_description": "2 weeks ago",
            "text": "The hotel was clean, the staff were friendly and the bed was massive. We enjoyed the 24 hour bar and played the pool table and made friends. The location is great for local shops and restaurants the main city with all the attractions was only a 20 minute walk which was a nice stroll with plenty of scenery and pit stops for photos. Overall I loved this stay only negative was the tv didn't work but we didn't need it",
            "time": 1731917632,
            "translated": false
        },
        {
            "author_name": "ijeoma Ngene",
            "author_url": "https://www.google.com/maps/contrib/117143350872898354353/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUTpBTig592lOsNZfMdmVIw8ysUS9ucUiFVkYuFD8w9_F7G7dI=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 4,
            "relative_time_description": "a month ago",
            "text": "Great value for money and great location\nThe atmosphere is different, no much lighting inside. And felt so warm at the receprion/bar.\n\nThe food is good. And if hanging with friends, there are free pool tables for much fun time.",
            "time": 1729145279,
            "translated": false
        },
        {
            "author_name": "Mumtaz",
            "author_url": "https://www.google.com/maps/contrib/109781446472904237312/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLRe_71yBgddg_JO9gzhx6O_hir3wrjBJHcb8Yu9ldQJnZNKBE=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 2,
            "relative_time_description": "a month ago",
            "text": "I recently stayed at this hotel for a week and had a mixed experience. The breakfast was nice compared to other European hotels, which was a pleasant surprise. However, the cleaning “sustainable” policy was quite disappointing. They only clean the rooms if you specifically ask them to, and otherwise, it’s once every three days. Due to my work commitments, I couldn't stop by reception every day to request cleaning, so I often returned to a messy room.\n\nAdditionally, I found the lack of basic amenities frustrating. There were no slippers, dental kits, or any other amenities, and there wasn't even a phone in the room to contact reception.\nOne night, I saw a spider in my room, and without a way to call for assistance, I felt trapped, worried I might lose track of it. Despite these issues, the hotel had a great location and a good ambiance, which I appreciated.",
            "time": 1729071789,
            "translated": false
        }
    ]
}