{
    "name": "The Dominican",
    "rating": 4.4,
    "reviews": [
        {
            "author_name": "Stephanie Benton",
            "author_url": "https://www.google.com/maps/contrib/109538849963715803434/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXfjqQN9Gwl7VA4XNxstlm62kvEU3qqpmCSfM2NNcFZndhndXTZ=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 4,
            "relative_time_description": "2 weeks ago",
            "text": "It's a beautiful hotel perfectly located for seeing the sights by foot. The staff was very friendly and accommodating. The bar area is beautiful and a very enjoyable space to spend a bit of time between activities. The room was a bit small, but I loved the linens, the room was clean, and I appreciate the Dyson hair dryer!",
            "time": 1731836830,
            "translated": false
        },
        {
            "author_name": "Rita D",
            "author_url": "https://www.google.com/maps/contrib/104378323068042957278/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVHmratrlah7QN-mqRde6M3UX4T5hjh_omfywDqzAr2qzgnzyns=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 4,
            "relative_time_description": "3 weeks ago",
            "text": "The Dominican Hotel was an overall pleasant experience! Our room was spacious, well-maintained, and impeccably clean, making for a comfortable stay. The highlight of our visit was definitely the breakfast — it was absolutely top-notch, with a great variety and quality that left us feeling spoiled in the morning.\n\nWhile we did notice that the front desk staff seemed a bit distant and very busy, which impacted the usual warm welcome, the rest of the staff was attentive and helpful throughout our stay. We had requested a room decoration for our anniversary, and while that wasn’t set up as expected, the hotel still provided a lovely ambiance that helped us enjoy our special occasion.\n\nIn short, this hotel is a wonderful choice, especially if you appreciate a high-quality breakfast and comfortable accommodations.",
            "time": 1731313107,
            "translated": false
        },
        {
            "author_name": "Yvonne W",
            "author_url": "https://www.google.com/maps/contrib/111893407181658733926/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVF-1_JqYcNJFbI6FEI7jIuWrDTRF4edGCz2ONt3cwtDdNhj2w=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "This hotel deserves its Michelin Award. I enjoyed my stay at the Dominican Hotel Brussels. It was in a central location near the train station, near all the shops and the central square. The front desk staff were friendly and helpful. The restaurant and bar were beautiful and the breakfast was excellent. The rooms were gorgeous, roomy and cleaned daily.",
            "time": 1727047459,
            "translated": false
        },
        {
            "author_name": "Martin Gammon",
            "author_url": "https://www.google.com/maps/contrib/106172456969056219987/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUARx0impYWmNhYOEMVsCev9hgGmoTrVi7z7Aju6JAjgKO9iDjkGQ=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "Good value for such an upscale and central hotel. The rooms were well decorated and good quality. When we were there they we supporting a local artist in the foyer. Professional staff in both reception and the bar.",
            "time": 1728565570,
            "translated": false
        },
        {
            "author_name": "Nikos Tzanetis",
            "author_url": "https://www.google.com/maps/contrib/111851421319819971179/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLbcI8Lfh4tHTi5psX14xNrL9Q8qvjx86R7JlVo12Z7Wi1Ihw=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 3,
            "relative_time_description": "2 weeks ago",
            "text": "Amazing design and atmosphere of the entrance and ground floor of the hotel. Executive room looks exactly the same as standard and bit different than photos. Mattress could be better. During breakfast they don't inform you that in the price one a la carte choice is included. Variety of things but nothing special. They don't have prices for the mini bar. They don't inform you how to spend the cash points you get when booking directly with them. One star for all these and one star for being very pricey compared others and what it offers.",
            "time": 1731863245,
            "translated": false
        }
    ]
}