{
    "name": "ibis Brussels Centre Gare Midi",
    "rating": 4,
    "reviews": [
        {
            "author_name": "Andrea Bowes",
            "author_url": "https://www.google.com/maps/contrib/101658939385322019553/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWeJsMzuTTWx6tTt7STXeiQ5ksenGOLm3Wck1XQx5STC07-xnUiYQ=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 4,
            "relative_time_description": "3 weeks ago",
            "text": "The hotel is very convenient for the station but like all too many train stations it's not the most salubrious area. Check in was glacialy slow even though we had completed the online check in prior to arrival. The reception staff did not seem to be very happy in their work, never smiling or in any way welcoming.\nOn the plus side, the rooms are large, comfortable and clean. The bar area was also comfortable and clean. Fortunately the bar staff are considerably more friendly than reception. There was food available in the bar and some very good Belgian beers. The food was simple, pizzas, macaroni cheese with bacon, and a chicken korma. We had a margarita pizza and the macaroni.  Both tasty but the macaroni was best.\nI wold stay again, it really is conveniently placed,  and won't let the miserable reception put us off an otherwise pretty decent hotel.",
            "time": 1731515983,
            "translated": false
        },
        {
            "author_name": "Mauro Costa",
            "author_url": "https://www.google.com/maps/contrib/117663373734876217109/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUhnF_hUTJ3Ux1T3Ui-kQDY37Nd5gQHOtBygqk0Qt3dBAPfjild=s128-c0x00000000-cc-rp-mo",
            "rating": 2,
            "relative_time_description": "a month ago",
            "text": "Good location and friendly staff. That's pretty much all it's got going for it, the hotel looks and smells pretty old. The room was very simple a pretty dirty. There were stains on the floor, the towels had hairs on them and the bathroom sink was all wet, as if it wasn't cleaned after the last person left.\n\nOk for a night if you need somewhere to stay near the terminal, other than that you should avoid it.",
            "time": 1730696702,
            "translated": false
        },
        {
            "author_name": "Levi Litman",
            "author_url": "https://www.google.com/maps/contrib/110496838992006236367/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLedrdaqtotBt0JXyEX44-jJ4KJLnLcEcFW2MpOU5ueYXfZ1Q=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 3,
            "relative_time_description": "3 months ago",
            "text": "While there were some positives, a few things could definitely be improved. The location is a real highlight—just a stone’s throw from the Midi train station, making it incredibly convenient for travel. The rooms were clean and, for what you pay, completely reasonable.\n\nHowever, the immediate area outside the hotel felt a bit sketchy. I even saw a fight on my first night, which was quite unsettling, and there seemed to be an issue with loitering around the entrance, making some guests uncomfortable - especially in the evening.\n\nThe breakfast, unfortunately, wasn’t great. The scrambled eggs tasted like they were made from powder, which was disappointing. On the plus side, the staff were fantastic—friendly, multi-lingual, and very helpful.\n\nOne other thing that bothered me was having to pay extra, in cash, to store my bags after checking out. It felt a bit unnecessary, especially since most hotels offer this service for free.\n\nOverall, it’s an okay option for a short stay, but there are definitely areas that could be improved.",
            "time": 1723413966,
            "translated": false
        },
        {
            "author_name": "Ruben Dias",
            "author_url": "https://www.google.com/maps/contrib/107386022278592267002/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWdnWFy78ov2hrnWcHpgOIxlKVAnmnM-EMVACmPbKV4AUgcNNQ=s128-c0x00000000-cc-rp-mo",
            "rating": 3,
            "relative_time_description": "3 months ago",
            "text": "a very basic/budget hotel lacking simple amenities such as a tea kettle & mini fridge. Room was clean; the size and location was good. TV screen is probably same size as that of a laptop, definitely needs to be upgraded. Reception and housekeeping staff were friendly.",
            "time": 1725566417,
            "translated": false
        },
        {
            "author_name": "Jo Hammond",
            "author_url": "https://www.google.com/maps/contrib/112579699724019487703/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWdE71z8HVLYLg1twRsKIM1MmYcGBdK0iA2fnZIGuMClxHs-t4=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "Very conveniently for Brussels-Midi, easy check-in, spacious, comfortable and clean room.  Modern decor, decent bed linen and windows that open fully.  Views and noise levels as expected in a city and big hotel but very good breakfast selection and kept well maintained.",
            "time": 1727248749,
            "translated": false
        }
    ]
}