{
    "name": "Grand Casino Brussels VIAGE",
    "rating": 3.9,
    "reviews": [
        {
            "author_name": "Igor Bjeli",
            "author_url": "https://www.google.com/maps/contrib/103407178020689379700/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUFkjpCq_wZ8HalA8gSm2BswgbWKyRuMmoDU5oRGLHr4Zgo_MUz=s128-c0x00000000-cc-rp-mo-ba7",
            "rating": 4,
            "relative_time_description": "2 months ago",
            "text": "1. Location: Casino Viage is located in a narrow street in the heart of Brussels, near the Central train station, making it easily accessible for visitors. At first glance, it's difficult to spot that this is a casino, as the entrance is quite discreet and only becomes visible when you're right up close.\n\n2. Interior Appearance: The interior of the casino is well-decorated and nicely laid out. Upon entering, escalators take you to the first floor, where the main hall is located, featuring a bar, slot machines, and gaming tables. The spaces are spacious and pleasantly lit, contributing to a relaxed atmosphere.\n\n3. Offerings: On the second floor, you’ll find a grill restaurant, a poker room, and an event space for smaller gatherings, complete with its own bar. The third floor houses a large hall where bigger events and concerts are held. The variety of rooms allows for a wide range of activities, in addition to the standard gaming offerings.\n\n4. Food: The food in the grill restaurant is tasty and varied. I recommend the steak sandwich or the Asian noodles with chicken, both of which are excellent. For a smaller snack, the crispy fries are a great option if you’re looking for something quick to eat.\n\n5. Service: The staff at the casino is quite friendly. The employees at the reception are very clear in explaining everything to first-time visitors and are ready to answer any questions. They also speak several languages, which is a great advantage for international guests. However, in the poker room, the waitstaff can be a bit slow and hard to find if you need service during the game.\n\n6. Conclusion: Casino Viage in Brussels is a great place for relaxation and entertainment, with a rich offering of games, delicious food, and a pleasant atmosphere. Although the entrance is a bit discreet, the interior surprises with its spaciousness and variety. With some improvements in service, the casino could exceed visitors' expectations even more, but I still recommend it for an enjoyable evening in the heart of the city.",
            "time": 1725915018,
            "translated": false
        },
        {
            "author_name": "Fall Creek House",
            "author_url": "https://www.google.com/maps/contrib/107190827991152167520/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU96B2I6mhGfv9gFH-v30kgjShVN3hDAX2AhC7wnSovyvZ_fPg=s128-c0x00000000-cc-rp-mo",
            "rating": 4,
            "relative_time_description": "a year ago",
            "text": "Came to play the Sunday poker tournament.  Place was very slow at 14:00, but clean and staff was nice.\n\nGood looking poker room/area.",
            "time": 1684675393,
            "translated": false
        },
        {
            "author_name": "Brian Kim",
            "author_url": "https://www.google.com/maps/contrib/114066938290126443558/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI_X8b8F0zpp5qtjf9HpVJsN18Whf_2eh_5Sp17Sj5Xh0FF_Q=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 1,
            "relative_time_description": "2 months ago",
            "text": "BEWARE!!!\n\nHad a decent time at the casino, but just found out 6 separate transactions for drinks & food that were purchased two weeks ago were charged as CASH ADVANCES by the casino WITHOUT authorization costing me an additional $5 per transaction + accrued interest. DO NOT use your credit card here!!",
            "time": 1726609170,
            "translated": false
        },
        {
            "author_name": "Nguyen Phuong",
            "author_url": "https://www.google.com/maps/contrib/111884281075694935449/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVehG2RUgk-MLQjf202lMaYJDsC6xJ9Li5jTkNBs5SpA8czOcWQ=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "4 years ago",
            "text": "Nice casino with friendly staff. Drinks were good and with good price as well. I was stuck a broken machine and staff was happily to help ^^ they also offered free tea and coffee (to get you to stay longer I guess).\n\nIn my opinion, it’s a fun place to go if you can control yourself and don’t get too caught up with the games. Remember that the casino is always the one who wins ;)",
            "time": 1581973485,
            "translated": false
        },
        {
            "author_name": "Samakian",
            "author_url": "https://www.google.com/maps/contrib/116984640695331675160/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIAuXR_f7Ao_tLXiP0Tn4rcfKwgmR3-PY38ZcM1H8i_1aj0RQ=s128-c0x00000000-cc-rp-mo",
            "rating": 3,
            "relative_time_description": "2 months ago",
            "text": "Lost money, won money. All in all its a casino. Staff is nice however if you can't speak french its gonna be hard to understand the staff.",
            "time": 1727992156,
            "translated": false
        }
    ]
}