{
    "name": "Radisson Blu",
    "rating": 4.6,
    "reviews": [
        {
            "author_name": "Aleksandar Nyagolov",
            "author_url": "https://www.google.com/maps/contrib/116131533268300275540/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUfsXIyFObPJ28-Ijbv3mzwiOwCGdI9gJXw3Ppiy2F6l2J0GQZf=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "2 weeks ago",
            "text": "I had a great experience staying in this hotel. Excellent location, very near and walking distance to landmarks, local restaurants and public buildings.\n\nHotel itself was clean, the staff were welcoming and the entrance was nice.\n\nRoom is spacious enough, the beds were comfortable and so were the pillows. The bathroom was nice with a hot shower. The isolation of the room was really good, as soon as you enter your room and close the door it would be quiet and you wouldn't hear any noise coming from anywhere.",
            "time": 1731916637,
            "translated": false
        },
        {
            "author_name": "Andrejs L",
            "author_url": "https://www.google.com/maps/contrib/102060160826681330760/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXyiEB6JhVYMhU4bZ-5-A7LaQOmX-ZRKR9gYKNPpvlQbWaoKF0=s128-c0x00000000-cc-rp-mo-ba6",
            "rating": 4,
            "relative_time_description": "a week ago",
            "text": "Good hotel, but rooms unfortunately are not 5* hotel level, that's why not 5* rating... everything else was great. Rooms are big, you can open a window (what becomes very rare), free mini bar, tea, coffee. Breakfast was great, a lot of options to choose from. Facilities are nice, as well as a swimming pool...but getting to it from the hotel isn't the easiest and I would say it is awkward. Personnel was great.",
            "time": 1732769241,
            "translated": false
        },
        {
            "author_name": "Biciianu Nicoleta",
            "author_url": "https://www.google.com/maps/contrib/107869057444463862438/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWWX91_0OnJa9vbjy4EJKyABkRh4lxaQkQDt9w-ZUGuU9ihD4X6=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "3 weeks ago",
            "text": "All staff were exceptionally friendly and efficient. We were on a short business trip.\nFood was very delicious and to my surprise, they also packed breakfast boxes for us as we left the hotel just before breakfast started, and not to forget to mention that all food was fresh and of very good quality.\nRooms are very comfortable and practical.\n\nAs a frequent traveler I am very impressed how the hotel has managed to achieve great quality at every aspect of the business.\n\nWell done!!! 👏🏻",
            "time": 1731252596,
            "translated": false
        },
        {
            "author_name": "D A",
            "author_url": "https://www.google.com/maps/contrib/117175880977748208095/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjULO87dfhP4G3TxzJMRedb36V0Cv1_G8KmRKWTAeowBdl0ypYXh=s128-c0x00000000-cc-rp-mo",
            "rating": 1,
            "relative_time_description": "a month ago",
            "text": "My first impression is very bad they said that the premium room is with amazing view I will add photos, we booked because of the spa but unfortunately the spa is not working during our stay they offer us to go with taxi 10 minutes away but we are with a kid and it is cold outside so totally disappointed. My mother has birthday tomorrow and I asked from where we can buy flowers but they “was not sure” I asked for a cake but again “not sure” I had bigger expectations from the stuff and the end there is no lift to the parking every time you want something from the car you have to go outside",
            "time": 1730649235,
            "translated": false
        },
        {
            "author_name": "Jesse Hamilton",
            "author_url": "https://www.google.com/maps/contrib/103423592201856691627/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLWzvDpUfJJUJkaDL-vxqgFozdA3ymBboVNa0rFyUd2j_RM_8E=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 4,
            "relative_time_description": "a week ago",
            "text": "The room one night we could not get the temperature lower than 26 Celsius (78.8 fahrenheit) we told the front desk and a person was sent and just told us to open a window. Which we had been doing but the room kept getting hotter even with the thermostat turned down to the lowest setting. The first night it was at 23 Celsius and was okay. The breakfast is great at the place. Overall it was nice except for the room being hot and being told to do what we had been doing to try to get the room cooler.",
            "time": 1732602528,
            "translated": false
        }
    ]
}