{
    "name": "Excalibur",
    "rating": 4.4,
    "reviews": [
        {
            "author_name": "Francesco Righi",
            "author_url": "https://www.google.com/maps/contrib/113370397508545218041/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUEZjLIFXYR5cmunDHZlWqEyot64hNq2KgEgAODKqYI1nGKBhsG=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "a week ago",
            "text": "Medieval-themed immersive restaurant. For around €20 per person, you can eat like kings with plenty of meat and excellent platters. There are also more refined cuts of meat, which I recommend ordering well in advance. The place is always packed!! Be sure to make a reservation; it can only be done in person, and often on weekends, you need to go early to have a chance. Highly recommended!!",
            "time": 1732629127,
            "translated": false
        },
        {
            "author_name": "James J. Palmeri",
            "author_url": "https://www.google.com/maps/contrib/101455716141742247514/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUZaM3E7RYOwouKb2ddVCCYxPI30Oy5ZJATWy_hIH1NpaMQFqGr=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 4,
            "relative_time_description": "a month ago",
            "text": "Food was very good.  Extra large portions.  It is kind of a thematic atmosphere which would be fun for a larger group of 6 or more.  It loses that feel with only two people.  Service is “relaxed”, although they tell you upfront that it will be 35 minutes for food to arrive. We would definitely go back if with a group and had time for good conversation over some wine!",
            "time": 1728365383,
            "translated": false
        },
        {
            "author_name": "Beth Smith",
            "author_url": "https://www.google.com/maps/contrib/105084652485267001780/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKPCHV58cTGf0kI9vQQp3PNYH26fJkV6SbtsjUg6XsGlU5I0w=s128-c0x00000000-cc-rp-mo",
            "rating": 1,
            "relative_time_description": "a month ago",
            "text": "The service at this restaurant was terrible. We waited 15 minutes to receive a menu. We then waited another 15-20 minutes for anyone to even acknowledge us/ take our order. We waited a further 50 minutes for food (which our waiter did inform us as we ordered) although the restaurant only had 4 other tables in.\n\nThe food was very poor. The golden royal potatoes were cold and uncooked in the middle (not sure why after being cooked for 50 minutes).\nThe vegetarian platter, which was described as - “MEGA VEGETARIAN -Cauliflower, mushrooms, carrots, golden royal potatoes, cabbage, olives, mixed vegetables, tomato, cucumber, pineapple, orange.”\nCame with all of the vegetables battered and fried, although this wasn't specified in the description. The vegetables inside the batter were incredibly watery, and the platter was topped with a banana (again not specified) and included 1 slice of tomato.\n\nAfter eating what we could of the food we asked a waiter for a bill. We were asked the usual cash or card. 10 minutes pass before the same waiter returns to inform us we need to wait for our waiter (who took our food order) to give us our bill, so we would have to wait. During this time 4 waiters were stood idly while we waited as there were only 4 tables in the entire restaurant. Finally after another 10 minutes (20 in total) our waiter comes with our bill.\nShe asked whether we wanted to tip 10 or 15%, my partner said we didn’t want to leave a tip (because we had a poor service). Our waiter began to question why we didn’t leave a tip and became rather angry and argumentative when we described our experience. Overall I would not recommend.",
            "time": 1730555835,
            "translated": false
        },
        {
            "author_name": "κωστας Λουμπας",
            "author_url": "https://www.google.com/maps/contrib/108148613071827225582/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ8pUjFeElm8QIddzFfwJhjyeMKzPOfx_et_AZZTScpMnICxA=s128-c0x00000000-cc-rp-mo-ba6",
            "rating": 5,
            "relative_time_description": "4 weeks ago",
            "text": "We got King ARTHUR's favorite beef tenderloin steak, royal golden potatoes, cabase, oranges .... and Knights Sword chicken breast.  Also two jugs of beer.   The staff nicer.  Because the quantities were large, they give the rest in a package. At the end with your bill, they ask for a tip.",
            "time": 1730914193,
            "translated": false
        },
        {
            "author_name": "Shuang",
            "author_url": "https://www.google.com/maps/contrib/102804167453264965266/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLa8SY7ZTD297HbMw9QhpuOLv2LyXxYwTAhKpzYXADHfe-2gg=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "Found this high rating restaurant and it was definitely an unforgettable experience.\n\nAt first we felt creepy because need to go down a pathway to enter the restaurant. But no light at 16:30! Pure darkness! Took the courage to walk and reach the entrance. And the door was big and heavy. After opening the door, still dim but finally we saw the waiter and guests.\n\nThe armors and swords in display were beautiful, service was good and food was good too.\nOrdered Micul Print, Gulas de Tabara in Paine and one dessert.\n\nThe restaurant gave us a wood sword and paper crown. Wow! So happy.\n\nWhen we exited, the pathway was with light on, not scary anymore. We laughed at each other and took photo pretending to pull the sword from the stone.\n\nWill visit it again!",
            "time": 1729315164,
            "translated": false
        }
    ]
}