{
    "name": "VakVarjú Restaurant",
    "rating": 4.4,
    "reviews": [
        {
            "author_name": "ian griffin",
            "author_url": "https://www.google.com/maps/contrib/108925247564283103176/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUY4Yhi644c_JtDPyQeleD0tdViUsaiyr51RVuk1TAeoIU0qIJF=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "a week ago",
            "text": "Lovely restaurant found by walking past on our way into the city centre. We booked in advance because it looked busy in the daytime. We reserved a table for 9 pm, and it's a good job we did as it was full on a Wednesday night. Service was quick and polite, and the food was delicious. We stayed a few hours and had a lovely time.",
            "time": 1732470943,
            "translated": false
        },
        {
            "author_name": "Sabbi Gavrailov Art",
            "author_url": "https://www.google.com/maps/contrib/115303011533000193652/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXJTU_jemB52vo12SMh_8pnL8or1m7oIvBKk_rA6lPo4lPzyNDvog=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "There are two branches of Vakvarju in Budapest and this is the one closer to the inner part of Pest. The other is closer to the river. This place was very busy and you will be lucky to get without a reservation. We booked in advance(same day).\nThe ambience is very pleasant and comfortable. The service is very attentive and most waiters speak good English which is a plus. The menus are very well thought through and are simple but the quality very high.\nThe wine list is sufficient and at a good price range.\nStrongly recommend this place.",
            "time": 1729848022,
            "translated": false
        },
        {
            "author_name": "Anton Shishkin",
            "author_url": "https://www.google.com/maps/contrib/101199424224257534763/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXJHztx0JiT2IQBigf61wis6OZ31s8AbOgyQLzKql5N464tOX9Oyg=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "in the last week",
            "text": "We came to Budapest with my 3 year old son, and I cannot make a reservation with him because it's nearly impossible to be on time without stress for both of us.\n\nSo we came with no reservation, and yet the manager found a table for us real quick. My son was playing in the kids area while I was waiting.\n\nThe food came very fast, and it was great. We ended up coming every evening (every time without reservation), and the great experience was very consistent every time we came.\n\nThanks to the team we never thought twice, and next time in Budapest there's no other option we will explore for dinner!",
            "time": 1732998449,
            "translated": false
        },
        {
            "author_name": "JP",
            "author_url": "https://www.google.com/maps/contrib/100347838273697864207/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIGuaP2eVIPkDwEYJL3FPU3kVvIOMK9ZUIodx8Nt3HDCrw3YA=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "12 of us recently had dinner at this VakVarjú restaurant and sat on the mezzanine floor. The waiters coped admirably with different levels of English, the varied orders, split bills (though we each had to pay by the till downstairs, which made perfect sense) and complaints from some in the party.\n\nThe food was exquisite Hungarian fare (they cater for locals and tourists alike and they have menus in English and German, too). The menu is extensive, with plenty of Chef's Specials; the boar deserves a particular mention: very well cooked and presented. They have a good selection of drinks, too, including cocktails. The prices weren't as bad as you'd expect, but of course higher than lower-end restaurants in the area.\n\nThey have a kid's menu (though I'm not sure I understand the height-limit of 120cm... perhaps age would have been more appropriate) and a fenced-off playpen: handy for keeping the little critters away from other diners. They will also be fascinated by the upside-down cityscape on the ceiling and the mannequins, I'm sure. (And the one or two dogs hiding under tables or in their owners' laps).\n\nAll in all a very pleasant dining experience and one that should not be missed if you find yourself in Budapest!\n\nThere is one thing that baffles me, though: I have been to thousands of eateries around the world and the punch bag in the toilets is a first for me. I cannot for the life of me work out why you'd need one: to take out your frustration at bad service, expense, if a date isn't going to plan or to burn some calories before the next course...?",
            "time": 1729594504,
            "translated": false
        },
        {
            "author_name": "Frank Yen",
            "author_url": "https://www.google.com/maps/contrib/101899315456804180730/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKn6POybqwPxHvCQhFldSEnuV0LnFN2OPnbLYjQTkzzvJjzhA=s128-c0x00000000-cc-rp-mo-ba6",
            "rating": 4,
            "relative_time_description": "2 months ago",
            "text": "It seems to be a fairly popular and famous local restaurant with some branches in Budapest. The environment was nice and the staffs were friendly. The delivery speed was super fast, waiting only 5 minutes to get our meals. The main course, stewed veal, that we ordered was amazing. Its tenderness and taste made our surprised and satisfied. However, as we were assigned to the second floor, which could made echoes of sound when people talked loudly, our dining experience wasn’t that pleasant and decent. Its toilets were clean and organized. Overall, recommend if you stay here and with certain budget.",
            "time": 1725652367,
            "translated": false
        }
    ]
}