{
    "name": "Mamaison Hotel Andrássy Budapest",
    "rating": 4.5,
    "reviews": [
        {
            "author_name": "Michelle D",
            "author_url": "https://www.google.com/maps/contrib/104937187331376616869/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVigvVF8k4oQexieulysvC9Y11D7uGCygyOuatVnDLtA39uJ5rM6A=s128-c0x00000000-cc-rp-mo-ba6",
            "rating": 4,
            "relative_time_description": "2 months ago",
            "text": "It's a nice and comfy hotel in a pretty area surrounded by greenery and beautiful buildings, palaces and embassies. It's close to the heroes square and art galleries. It's easily accessible by metro and close to the downtown area of Budapest. The rooms are comfy and spacious, very clean and light. The breakfast is yummy and there is a wide choice of food. The staff is friendly and welcoming. I had a coffee maker in my room but I it didn't work. And it was quite cold in my room, there were no radiators, just air an conditioner in my room. Overall it was a pleasant stay.",
            "time": 1728219117,
            "translated": false
        },
        {
            "author_name": "Felicity Ap",
            "author_url": "https://www.google.com/maps/contrib/114393412600306785923/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUdapEWZ_3XkxuR56vAekqfdiSoiSJMeWx7asbf1v1yFb6VTU5J=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "4 months ago",
            "text": "Wonderful hotel in Budapest! Budget-friendly, provided an extra bed when needed, super quick response from reception when we called with any issues. Squeaky clean and running a sustainable service on towels. Breakfast and bar inside. Friendly staff. Good facilities and unexpected balcony included, with great views! Was actually more quiet than we expected. 2 mins walk away from the M1 metro line which took us everywhere we needed to go. Would definitely stay again.",
            "time": 1721833911,
            "translated": false
        },
        {
            "author_name": "Stephen R",
            "author_url": "https://www.google.com/maps/contrib/117480291725959285123/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKpfFemt1Bmia6Nk1E-lWyKx4A7P2O-D0d7F3eIMbOD8whIQQ=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "4 months ago",
            "text": "We're staying here for 6 nights and are very happy with the hotel. They are doing some renovations on the restaurant but handled it well. It's also in the middle of a harsh heat wave so the AC had some issues but they did everything they could to make us happy. The location is great and the staff are among the best we've ever seen in the world. Super helpful and friendly! The food is amazing.",
            "time": 1720775585,
            "translated": false
        },
        {
            "author_name": "Ellyse Gutierrez",
            "author_url": "https://www.google.com/maps/contrib/103460675993345377873/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLcd8aPWdBRflc6IAP6mYlK5mLpDZjgo6brnXPhCxLhK7NlEw=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 4,
            "relative_time_description": "2 months ago",
            "text": "Situated on Andrássy Avenue this is a short walk from a Main Street filled with bars and restaurants as well as being 15 minutes away from the famous Széchenyi baths (in the other direction).\n\nEach day we had to put a sign on the door ticking boxes that indicated what we wanted cleaned or replenished e.g., shampoo and conditioner. Once we even left the room after 12pm and our wishes were still fulfilled.\nThe reception staff were very helpful as well. We requested extra towels to take with us to the baths and the receptionist ran upstairs to retrieve three for us which was kind.\n\nThe room was large and spacious boasting 2 armchairs and a desk chair. The bathroom had plenty of counter space and the room had enough mirrors for three girls to get ready at the same time.\n\nThe safe was free to use. Laundry services were offered at an extra cost but we didn’t use this. We couldn’t figure out how tot turn on the light on the balcony but I’m sure if we cared enough to ask reception they would have helped us with this issue.\n\nThe downside was that the third bed was much less comfortable than the other two and sometimes the additional furniture would make the room feel cramped.\n\nAll round great value for money hotel!",
            "time": 1725993413,
            "translated": false
        },
        {
            "author_name": "Karl Aylett",
            "author_url": "https://www.google.com/maps/contrib/113294727520798164592/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL5D5rzpd3UDae0PGYaOIRahwEeA8A0cpRW-mY1iklx__Dvfw=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a week ago",
            "text": "Good size room with a balcony, Huge bath and bathroom, great staff and for us the perfect location right by a metro station for quick access to the center ,and walking distance to the spa recommended.",
            "time": 1732782482,
            "translated": false
        }
    ]
}