{
    "name": "Radisson Blu Beke Hotel, Budapest",
    "rating": 4.4,
    "reviews": [
        {
            "author_name": "Brandi Bird",
            "author_url": "https://www.google.com/maps/contrib/107980828919839520170/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUEKxcdsKf-kf4YhV79zt_3zl9l-nbGBygmJraO2V5H5WOijZPZ=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "Due to a last-minute flight cancellation, we had an additional night in Budapest and stayed here.\n\nSmooth and friendly check-in.\nNice rooms with comfortable beds and amenities.\nGood dining as well.\n\nSeemed to be a convenient location just outside of the hustle and bustle of the city center.",
            "time": 1727057535,
            "translated": false
        },
        {
            "author_name": "Vera Pekker",
            "author_url": "https://www.google.com/maps/contrib/102279933833385318091/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ5y5Xp_4ju34ckKmyj8Oaozv71iDNpEM3FDTQWMI0fIbHs8Q=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "4 months ago",
            "text": "Incredible hotel! The rooms were spacious, modern and very clean, the service was friendly and efficient and the location is central and fantastic- accessible by public transit and within walking distance to many attractions. Highly recommend for anyone staying in Budapest! Loved Mr. Forest and Jack, so cute! Also the cafe downstairs inside the hotel is fantastic- serving delicious desserts and wonderful tea/coffee beverages! Similarly there is a delicious bakery next door with lots of great sandwiches and savoury/ sweet pastries perfect for snacks/breakfast etc.",
            "time": 1722961727,
            "translated": false
        },
        {
            "author_name": "KD",
            "author_url": "https://www.google.com/maps/contrib/113070638662715659709/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKSYsYra1UoWs8Zu6RSOfdCBm05WRwbV_Xh8mnlNm9pqOPs=s128-c0x00000000-cc-rp-mo",
            "rating": 1,
            "relative_time_description": "a week ago",
            "text": "Your staff named Istvan (night shift) is extremely arrogant rude since the checked in started on 20/11/2024.\n\n1. He spoke in Hungarian to his colleague in front of us about some of the checkin and room/payment issues. This should not happen if the guests don’t understand local language. Please educate him, Mind his basic manner.\n\n2. He crumple the paper he printed wrong and show emotionally angry towards us since we had the issues. At the checked in.\n\n3. Today 23/11/2024 during check out at 4 am. - we went to him (its only him there) we want official receipt he said he can’t print the paper receipt because his laptop has issue and not loading neither he could not used other laptops. Wow. Very disappointing! Doesn’t eager to help! , we insisted to wait for the official receipt, then he crumpled the paper again it’s not our paper since at the beginning he could not print, it’s other paper which he can release his angry???!!! So angry to the guest wow?  This is rude! I travelled 3 continents and more than 20 countries none hotel staff ever can do this. It’s common that’s rude!\n\nFinally he mentioned he can print.\n\nI was questioning if this hotel is a really a chain brand or it’s just a hostel, your staff behavior is extremely arrogant and lacking of emotional intelligence.  Extremely rude, zero can do attitude and provide negative energy to the customers. In my opinion, He doesn’t fit to be customer facing role, laking of professionalism and empathy to the customers.\n\nI don’t know if this staff represent the HR training quality, or it’s just him.\n\nIt’s my first and last time, and will not recommend to our business connections in EU and USA.\n\nKind regards,\nKanthida,",
            "time": 1732364612,
            "translated": false
        },
        {
            "author_name": "Martin L",
            "author_url": "https://www.google.com/maps/contrib/104160097026579874717/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI0MIQKz7BJX6Cz-XZViELrpS4MwyysR8f2kdqwhUNRrFIcOA=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "I want to point out the excellent gym the hotel has. It's not big but it's amazingly functional and will give you a nice few days worth of separate exercises. Open 24h and always clean and tidy.",
            "time": 1725526580,
            "translated": false
        },
        {
            "author_name": "Tiffany Hill",
            "author_url": "https://www.google.com/maps/contrib/116487088510130638990/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUZr726IH1ke-2Y4l5fCSSurTY7V7av2kkA4Mr-NUeROxoqLFEk=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "This hotel was a surprise treat in Budapest for a 4 night stay. We booked on Agoda and got a great deal on it. Check in was fast. Staff was helpful and friendly. Rooms were clean and housekeeping efficient. Breakfast was great. Lots of options. The bar/cafe downstairs is reasonably priced.  Upstairs is also a Zsolnay Café location.\n\nYou are in walking distance to a number of restaurants and stores and the staff is super helpful in booking rides/transport if needed. Def a repeat stay for me.\n\nEnjoy!",
            "time": 1729342705,
            "translated": false
        }
    ]
}