{
    "name": "Fortuna Boat Hotel Budapest",
    "rating": 4.3,
    "reviews": [
        {
            "author_name": "Jules Rees",
            "author_url": "https://www.google.com/maps/contrib/110859207334788611888/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVNl1lqJHJq5n8QO-UqcHCifVWZSWPmZThNYB25v93WalUMZwis=s128-c0x00000000-cc-rp-mo",
            "rating": 1,
            "relative_time_description": "in the last week",
            "text": "This hotel is an absolute cat fish, it looks nothing like the pictures, the rooms are beyond basic and city view was a metal wall near the main entrance with no view whatsoever. The reception staff clearly do not want to be there and do not help or speak. The bed was broken so leaned to one side, asked if they had another room to change us to but they didn’t want to help, breakfast was awful, although the staff at breakfast was friendly. No bar of any facilities to get a drink or evening snack despite some pictures showing nice evening meals. The pictures look all lit up and welcoming but as soon as we arrived it was dark and depressing. Wouldn’t recommend",
            "time": 1733141036,
            "translated": false
        },
        {
            "author_name": "Alexandra Domerschikova",
            "author_url": "https://www.google.com/maps/contrib/113468162139895739143/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK4l_5jfLVUlRE9qUlsUeKBmPCrjFNSn4vNV-Cg1ViEIwKfVq8=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "What I need from a hotel is a fresh, comfortable bed; a clean room and bathroom and a hot shower that works  Added not-so-essential details are a good breakfast, a helpful staff and receptionist and a location not far from what I want to see. The Fortuna ticked all these boxes for me. Everyone, from Cynthia and Zoltan on the front desk to the housekeepers, to the staff in the dining room, was charming. The breakfast was delicious, with a wide variety of tasty choices. I walked to all the places I needed to see. I can't recommend this hotel enough. A tip! Choose the river side! The city side is a bit busy and noisy at night!",
            "time": 1730486548,
            "translated": false
        },
        {
            "author_name": "outreach stafford",
            "author_url": "https://www.google.com/maps/contrib/101916946067934246351/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJI5oTOSFGa5CCEFZqV5EnpCSk8QIOtRYI4oe5XiEDUjT7FQA=s128-c0x00000000-cc-rp-mo",
            "rating": 1,
            "relative_time_description": "in the last week",
            "text": "The smallprint and the pictures online looked amazing until we arrived. The boat was dark and gloomy from the outside and was not appealing at all but in the pictures it was all lit up romantically and beutiful.\n\nIt did not have a bar or anywhere where you could get refreshments however on the pictures and smallprint it mentions a bar and restaurant also shows pictures of alcohol and food.\n\nThe room was not suitable for 2 adults also the view was obsolete and the beds was broken and lobsided.\n\nThe breakfast staff was polite.",
            "time": 1733140942,
            "translated": false
        },
        {
            "author_name": "Safrany Eva",
            "author_url": "https://www.google.com/maps/contrib/113535352945814950653/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIuZ8lJo5eJ3TmmT-sdUYaOnYxT8Wwa1Yg0sDqKQU8W4NpZkw=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "4 months ago",
            "text": "Exactly this boat next is  to the Danube River, my room viewing to the river ,beautiful, outside on the board have some tables, you can eat ,drink  ,smoking there. The staff is very friendly, helpful, the breakfast a bit poor but anyway fresh, but this boat just a 3* hotel . I highly recommend it , room and everything is very clean , all room hase a air-conditioning ,but no fridge .",
            "time": 1722372087,
            "translated": false
        },
        {
            "author_name": "Adrian Peplak",
            "author_url": "https://www.google.com/maps/contrib/105275627009668137196/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV4vWi-mCuNiH3WDnpBHELRQee707lXod66WrDIKMwGW8pOQrZiSg=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 4,
            "relative_time_description": "5 months ago",
            "text": "ROOM: OK, but it looked much better on photo. And air conditioner was damaged and was stopping to chill every morning.\nSERVICE: Excellent, even before we checked in and after checked out we were able to leave our luggage in a locked room.\nBREAKFAST: OK.\nLOCATION: Perfect - not too far from the most prominent tourist objects in the city.\nVIEW: Poor - one from one of our window we saw the street and from other \"parking lot\" for other boats.",
            "time": 1718204737,
            "translated": false
        }
    ]
}