{
    "name": "Rubin Wellness & Conference Hotel",
    "rating": 4.2,
    "reviews": [
        {
            "author_name": "Tom",
            "author_url": "https://www.google.com/maps/contrib/106991472319605162689/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI-v6II_UKYnzwGqbGgtCj3r_eC-sazCWPkixfFOHohcMoaGQ=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 5,
            "relative_time_description": "4 months ago",
            "text": "This is a Lovely large Conference Business centre situated in it's own grounds just adjacent to the main road, it has a Lovely large sumptuous green space that you can be at one with your thoughts.\n\nThe rooms are very generous in size steeped in red with views depending on where your situated in the hotel.\n\nThe staff are very accommodating and always polite and welcoming.\n\nThe new menu is really good and the food first class but limited if you're there for two weeks like i was, as I said it's a Conference and business centre.\n\nIt's the perfect bolt hole to go to when you want peace and quiet and always my first choice when i come to Budapest",
            "time": 1720480476,
            "translated": false
        },
        {
            "author_name": "James Neil",
            "author_url": "https://www.google.com/maps/contrib/110941471672978535635/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKZpNHZIP9ycJFIpq6gx659a4oeTwTfXRMhn_Zx3xStKkbcHA=s128-c0x00000000-cc-rp-mo",
            "rating": 4,
            "relative_time_description": "4 months ago",
            "text": "A great no-nonsense hotel perfect for a comfortable stay. A substantial breakfast is included and the on site restaurant serves great traditional Hungarian food and drinks. The spa facilities are great, albeit with a confusing layout! The location is not central to the city, but a short taxi or bus ride gets you there!",
            "time": 1720782955,
            "translated": false
        },
        {
            "author_name": "Rakesh Chatterjee",
            "author_url": "https://www.google.com/maps/contrib/111673333478860395591/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWn-gDLb5F4ISgpG_0dhSe9eYVQGS8uEYB-7M93IFW7aXohTn1e=s128-c0x00000000-cc-rp-mo-ba6",
            "rating": 4,
            "relative_time_description": "3 months ago",
            "text": "A bit far away from the city centre, however the hotel is great in terms of comfort, food and spa, swimming facilities.\n\nThe interior is bit communist style with long red carpeted corridors and dullish interiors, however the reception is friendly and 24 hours.\n\nThere are locked doors at entry to the rooms from reception, so you can feel safe.\n\nRooms are comfy with large firm comfortable mattresses, trendy glass panelled en suite bathrooms, tea coffee facilities.\n\nThere's a bar that was closed during our stay due to technical reasons. The spa, pool facility is very good. There are 3 different sauna, steam room, swimming pool, large hot tub, salt room, multiple sunbeds both indoors and outdoors etc. Though the spa facility is due to close during our last day of stay, we enjoyed it immensely.\n\nThe commute to city centre is around 20-30 mins using local transport. The nearest shops are 10 mins walk and closest eatery McDonald's is 15 min walk.",
            "time": 1724602741,
            "translated": false
        },
        {
            "author_name": "Maksym Volokhan",
            "author_url": "https://www.google.com/maps/contrib/114614796065142361439/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjULeJBbW0x4XoddsLvMKOxGwT-RHhhRuEeRdFHdAyymytM5DE50jQ=s128-c0x00000000-cc-rp-mo",
            "rating": 1,
            "relative_time_description": "4 months ago",
            "text": "Probably the worst hotel experience ever. We booked this hotel for 4 nights (F1 weekend) a year in advance (on August 23) and left after the first night. First reason is - lack of privacy in the “economy” rooms, you have only one window behind someone else’s balcony, so it’s 360 view on your room if someone is on the balcony (and we had a person smoking every hour). Never saw this genius “design”, and there is no mention about it on Booking.com. Secondly - rooms and hotel condition is far from the photos. The room is much smaller and desperately requires renovation. The bathroom has a horrible smell, old air conditioning will turn on and off randomly even when I put the lowest possible temperature. Also no respect for the preferences, I’ve requested a double room, and with a year in advance booking and a my reminder in May this year, I would expect to have this fulliled, but we just got two single beds. After asking the reception they sent the lady to tight bed legs, but did not even put one big sheet. The general condition of the hotel and pool area is poor for the money you pay, there are much better options. On a good note, staff on the reception had great English and we managed to agree  cancelation, so we can leave after one night and the rest was refounded. And breakfast is also pretty good as well. But generally - I do not recommend this hotel.",
            "time": 1721585423,
            "translated": false
        },
        {
            "author_name": "nenad Nenad",
            "author_url": "https://www.google.com/maps/contrib/101830407992152791655/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUJar-lyRiSf7K6dYbZSjVvT3hD-27DUDSgehlBOebPgew9TOo=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "4 months ago",
            "text": "All the best about the hotel! Nice, tidy and large rooms, swimming pool and spa for guests, parking for 7€ in front of the hotel for 24 hours! Rich and varied breakfast!\nFriendly staff at the reception, especially on the day of our arrival on 28.7.2024.",
            "time": 1722264905,
            "translated": false
        }
    ]
}