{
    "name": "Benczúr Hotel",
    "rating": 4.1,
    "reviews": [
        {
            "author_name": "ged mcdonnell",
            "author_url": "https://www.google.com/maps/contrib/100817805773826321093/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJXpjbS70_wXmbnE3s-RYDpofpsbsHmf5RXUpvK8DTe_RGQtw=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 3,
            "relative_time_description": "2 weeks ago",
            "text": "The rooms are what you'd expect from a 3 star hotel. They are clean and spacious, but in need of a face-lift , no tea, and coffee making facilities .\nThe staff were pleasant and helpful. There's a restaurant and bar, can't review the food,  we didn't eat there but the the alcohol is cheap ,\nLocation,  about 5 minutes walk from the city park, and hero square,  about 30 minutes walk to the elizibeth bridge,  at a decent pace,  if you're not a walker don't worry as there's plenty of public transport links,\nSo, if cheap and cheerful  will do , then the hotel benczúr, I am sure will please you 😁",
            "time": 1731766045,
            "translated": false
        },
        {
            "author_name": "Mohamed Nawar",
            "author_url": "https://www.google.com/maps/contrib/101746405614440504051/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVO_LZLxAshDX3_wflekX8NRqwM2RQTf3yP-iY5kqD5afdcgIgS=s128-c0x00000000-cc-rp-mo",
            "rating": 4,
            "relative_time_description": "3 months ago",
            "text": "We stayed there for 3 nights. The hotel was close to the metro and bus stations, which was very convenient.\nThe room was clean and spacious, but the furniture was a bit out dated.\nWe got a complimentary upgrade to our room, which was very much appreciated.\nThe only negative thing there was that the hotel hallways and entrance were always dirty and needed more attention. Other than that, everything was great.\nWe would definitely stay there again.",
            "time": 1723420175,
            "translated": false
        },
        {
            "author_name": "Gary Shimell",
            "author_url": "https://www.google.com/maps/contrib/106333114825044967038/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI3Tr97InfUpCBoxEFoyqKFBi6NtccWPMEwuaoPuwG2amnpaw=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 4,
            "relative_time_description": "4 months ago",
            "text": "We had a bit of a mix-up when checking in, but the reception staff were very helpful, plus service with a smile.\nThe superior rooms that we stayed in we comfortable with nice air conditioning and a small balcony.\nThey had a quartet that played in the beer yard in the afternoons which brought a lovely atmosphere.\nThe location was not central, but easily accessible with the yellow line metro.\nOverall, a pleasant stay next to a tree-lined, quiet road, with a nice continental breakfast.\nThe sausages were really nice.",
            "time": 1720968159,
            "translated": false
        },
        {
            "author_name": "Michèle",
            "author_url": "https://www.google.com/maps/contrib/110426264794788200153/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKCyHwwX_xx6K4IuKMPjkAbyCsDuMO1NDxkHHBR4WYw11SVu6c=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 4,
            "relative_time_description": "4 months ago",
            "text": "The hotel is a bit old and can do with some upgrades. The rooms are big and come with a fridge (we had the cheapest 2 person room). The staff is friendly and their English is really good. There is a locker room for bags if you need to store your bags before checking in or after checking out. The breakfast is good. You have enough choices. Rooms are cleaned well except for the decorative blue blanket on the end of our bed. That one had some suspicious stains… So we threw that in a corner under the desk and never looked at it again 😅. The beds are really wide, but not very long, around 190cm.",
            "time": 1722327536,
            "translated": false
        },
        {
            "author_name": "Amanda WARD",
            "author_url": "https://www.google.com/maps/contrib/116426449033870234293/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUEdVrpKDCKMy9OEebNs5oeUD8JvvCpV3vnCfGeZi5aUgFRXPU1=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "5 months ago",
            "text": "This is not an expensive hotel but is clean helpful and a good place to base yourself. The breakfast is lovely we sat outside as well as in the restaurant, you could sit there and make breakfast last 3 hours no one would stop you, they do however frown on you trying to take away food to use as lunch. The rooms have air con and running hot and cold water they are cleaned daily the bed was comfortable, hair dryer and fridge in the room. Nothing to complain about",
            "time": 1719656110,
            "translated": false
        }
    ]
}