{
    "name": "Kempinski Hotel Corvinus Budapest",
    "rating": 4.7,
    "reviews": [
        {
            "author_name": "Jamie Dawson",
            "author_url": "https://www.google.com/maps/contrib/103515343006891947555/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUVy46hKkuNP0LYSj2ZP-d3uAF2Va4wA7wMjqNDGU684lpkUHQ=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "This hotel is top notch! It's incredibly beautiful inside and out. Our room was spacious and gorgeous. Bathroom was also well appointed and included everything one could forget (for me it was a nail file). The staff was very friendly. The breakfast was impressive. Location, location, location - this hotel was in a prime spot. Highly recommend !",
            "time": 1730209037,
            "translated": false
        },
        {
            "author_name": "Mioara Diaconescu",
            "author_url": "https://www.google.com/maps/contrib/106345008102585918935/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXzEYfp84V2RGFWkoij8Hy9jVQWt-yFAgP6exQBICPPGoTQS5w_=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "I stayed in this hotel for 4 nights this week. The small things make the difference between a 4- and 5-stars hotel. And all these things are made by people. Very good services, very nice rooms, nice pillows (you can choose) and bed, temperature in the room very good, every 2 days the linen are changed (very good quality).\nFood was amazing, with taste and also traditional Hungarian but at the same time international. Good Indian food (they have a special chef for this). Included the breakfast is very very good. They have gluten free products or free lactose products and for the first time I saw gem for diabetics.\nThe people are so dedicated, the chef was at dinner and lunch with us to see if everything is ok, every night the bed was prepared for night in a very special mode. Was for the first time when I saw a such service. So this hotel is very very good so I have the impression that the bad reviews are not so correct. Indeed, in the neighborhood there is some works but it is not under hotel control to speed up or to stop the process. It is a pleasure to stay in this hotel. We had also, an event manager so present at the meeting room. Also, the young boys from technical department were so good. I hope to come back some day.",
            "time": 1730489105,
            "translated": false
        },
        {
            "author_name": "gillian blake",
            "author_url": "https://www.google.com/maps/contrib/113211739891152915465/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJi4xZSK3ay6jd9qSzO3LVJDdWkAwXKNasSCtg1I-QmlTudGw=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "2 weeks ago",
            "text": "A brilliant hotel in a great position. The  staff are  so friendly and knowledgeable. Our room was outstanding with fabulous views of the Basillica . Breakfast was the best we have had in any hotel.\nThe spa area and pool were lovely.",
            "time": 1732102073,
            "translated": false
        },
        {
            "author_name": "Dariusz Jemielniak (Pundit)",
            "author_url": "https://www.google.com/maps/contrib/117163860043878506573/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUQ9kEAFT5WtRXdD4sLY7qUoXwggRWBu8GgZkuub7UkJpBJapbsbQ=s128-c0x00000000-cc-rp-mo-ba7",
            "rating": 5,
            "relative_time_description": "a week ago",
            "text": "A great hotel with quiet rooms, comfy beds, top notch breakfast, and fantastic staff.\n\nThe decor is old fashioned, but good. Wifi could be better, but is enough for typical uses.",
            "time": 1732257118,
            "translated": false
        },
        {
            "author_name": "Lynda",
            "author_url": "https://www.google.com/maps/contrib/108230582680955007177/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWMrQKSn2xWpJE1CWLj5QsZOcpGzuT3qxyTmYaswB5WjAaESDRMqA=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 3,
            "relative_time_description": "2 months ago",
            "text": "A beautiful hotel, situated minutes from central shopping, eateries, and a large square to sit and relax and watch the world go by.\n\nMultiple bars and lounge areas within the hotel to relax after a busy day sightseeing. Very reasonable prices, as is room service.\n\nFive minutes walk from stop 3 for the hop on hop off buses and an easy walk to attractions like St Stephens, The Big Wheel, and the Danube River.\n\nWith a large spacious room, staff are friendly and helpful. Hotel breakfast is great, too, with plenty of choices. Watch out for the toaster! It's tricky to operate!😄\n\nIf you need fresh milk for coffee, there is a small supermarket close by.\n\nThere's so many stunning city sights to see while you're here staying at Kempenski Hotel.\nPest City Park is a must!",
            "time": 1727175770,
            "translated": false
        }
    ]
}