{
    "name": "Park Plaza Budapest",
    "rating": 4.4,
    "reviews": [
        {
            "author_name": "Thip R",
            "author_url": "https://www.google.com/maps/contrib/101010416701564654729/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVFszlgF5y_wCYaQ-QNWqBB2BKx4kV_ya3mwtKbwniBA7n554Ie=s128-c0x00000000-cc-rp-mo-ba6",
            "rating": 5,
            "relative_time_description": "3 weeks ago",
            "text": "I would highly recommend this hotel to anyone. I loved staying here because of the view and its location. Also, the room was quiet. The bed was comfy. The staff has professional mannerisms. The room is big, and the bed is comfy. Will definitely go back to stay there again.",
            "time": 1731330134,
            "translated": false
        },
        {
            "author_name": "Marcel Scholte",
            "author_url": "https://www.google.com/maps/contrib/113636179105245722342/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXFsKRCaRqycrCbyvmsxx8Wf_m-O1C97DQXXBqF-s08JOUBM_I=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 4,
            "relative_time_description": "a month ago",
            "text": "Nice place to stay,  close to many buildings, monuments and the like.\nHad a good view in house of Parliament, and on the fisher bastion when getting the elevator.\nRooms are modern, quiet and well maintained and clean.\n\nRestaurant has sufficient choice when one does want to dine out.\n\nPlace to return to.",
            "time": 1729022714,
            "translated": false
        },
        {
            "author_name": "Christina Filep",
            "author_url": "https://www.google.com/maps/contrib/110590094611198518143/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXbo1Wdu95dZMwYB6vqTb6zKWfmk-S2tP1cQc1ph92wN6Y1VJAg=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "3 weeks ago",
            "text": "Fantastic location with great views no matter which side you stay on. Professional staff was always available and helpful during our weekend stay. Our\nroom had everything we needed and great shower pressure. The only thing I would improve would be to add the body soap to the shower, not outside. We look forward to staying here again in the future.",
            "time": 1731418925,
            "translated": false
        },
        {
            "author_name": "Martin Collett",
            "author_url": "https://www.google.com/maps/contrib/101478103506104331188/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKlet-lWiSA5KEq31RsropStU4rsrxmMZgCmbM1JURcv4Js9w=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 4,
            "relative_time_description": "a month ago",
            "text": "Fantastic views ( you can choose a river view or a castle view - we chose river) which can be the only thing that drove the cost. Nice enough hotel but in terms of quality I would compare to UK Premier Inn. Clean and tidy but lacking any atmosphere.  Great base to explore Buda and Pest.",
            "time": 1729006253,
            "translated": false
        },
        {
            "author_name": "Vin Pyeon",
            "author_url": "https://www.google.com/maps/contrib/117042095732865102884/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKWsfhxTgSVb70ZIa123O8ooBo5Np0BygPIboqsqshbyjuwYg=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 1,
            "relative_time_description": "a month ago",
            "text": "I paid for a river view room so it had a good view of the parliament building but otherwise, not recommended.\n\nFirstly, when checking in, I was asked to pay with a non-AMEX card. While this is okay, I asked that I be given my room first so that I can open my luggage bag, locate my visa card and bring it back down to the lobby to pay. The staff at reception flat out refused and demanded that I open my luggage in the lobby. I politely refused as I didn’t want everyone in the lobby looking at the contents of my bag. He shrugged and told me I have to pay. It was humiliating to be opening up my huge 28-inch suitcase to look for my visa card in the middle of the lobby. I am a frequent traveller and never have I been treated this way. You have a card guaranteeing my booking. I will be staying in the room. It would have taken me less than 5 minutes to go the room, unpack in privacy and come back down to pay.\n\nSecond, the room is outdated. Carpet looks disgusting and no slippers are provided. There were spiders on the walls. There was hair in the shower from the prior guests.\n\nThird, upon check out, the reception staff offered to call a “taxi” for me. When the taxi arrived, I was surprised to see a black car pull up. I asked if the driver is going by taxi meter. He said “no, fixed price”. The fixed price to the train station (10 minutes away) was at least three times the usual taxi price. What a scam. The hotel knew perfectly what they were doing. This is unacceptable. When you want a “taxi”, you are not asking for a private transfer.",
            "time": 1729588267,
            "translated": false
        }
    ]
}