{
    "name": "Trofea Grill Restaurant",
    "rating": 4.5,
    "reviews": [
        {
            "author_name": "Marian Buzarnescu",
            "author_url": "https://www.google.com/maps/contrib/114385162768765365938/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUuUSf1NNa7_9_SYlQbtlDE4QXel-cFOEn-dLLyHjftUR7s_IF62g=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "This was one of the best experiences I have ever had!\nWe went for lunch during a weekday, and everything was amazing. Starting with the service which was top notch, and the atmosphere - we were not expecting such a beautiful decor, it felt like a high end restaurant, not a buffet.\nThe all you can eat option also includes drinks, you get a variety of local wines which were decent, local beer or even sparkling wine. We managed to try a bit of all during the 2 hours we had.\nOf course, the main focus point is the food. There is a lot of variety to choose from, for everybody. From sushi and seafood options, vegetarian option to cured meats, fancy cheeses, many types of meat and vegan dishes at the buffet to delicious dessert options. On top of that there is the grill section where you could choose what you want and they will do it on the spot! We tried some exotic meats like shark, it was truly a great experience.\nYou won't have time to try all of the dishes, but you will leave full nonetheless.\nAgain, this was one of the best food related experiences I had and I highly recommend it.\nFor sure we will visit again the next time we are in Budapest.\n11/10!",
            "time": 1730192802,
            "translated": false
        },
        {
            "author_name": "Victoria Lengei",
            "author_url": "https://www.google.com/maps/contrib/100624299108730569696/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUrkM-GRrbAI-WUsEskK2wrX41fxSfDKT1-Rh9rIHJjcMLwTaLK=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "2 weeks ago",
            "text": "All-you-can-eat restaurant in the city center. Typical Hungarian dishes, salads, cheese, dessert…. We loved this place.\nBe prepared it is full, so not a quiet cozy restaurant. You can eat in 2-2.5 hours as much as you want.",
            "time": 1731741255,
            "translated": false
        },
        {
            "author_name": "Vivian L",
            "author_url": "https://www.google.com/maps/contrib/107207962455487230377/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUsEIzNRnOTDUXTZvoXbB_fxZIHmrO63E1UowkN_qXVOXpWEI5uYQ=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 4,
            "relative_time_description": "2 months ago",
            "text": "Buffet style  (lunch €26 / person, dinner €40 / person), drinks (soft drinks, beer, red wine ) and food to eat for 2 hours. The difference between lunch and dinner is that there is no steak to eat and champagne to drink. Only chicken chops, pork chops and fish chops are served at noon\n\nThe biggest annoyance of eating a buffet is not that there is nothing to eat, but that there is so much good food in front of you and so sad to find that your stomach cannot hold it.\n\nBe sure to make reservations.",
            "time": 1727953790,
            "translated": false
        },
        {
            "author_name": "Foodapest",
            "author_url": "https://www.google.com/maps/contrib/113226663127061504265/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWq54ccxRKGYV4dKQtYwKxf56wZDZ9-f7qtJPdW4F3Su98i--S0=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "4 months ago",
            "text": "You can try a variety of Hungarian dishes, desserts, and a wide selection of salads at the buffet. And there's even a grill counter where dishes are made to order. They have options for vegetarians and vegans too. And the service is very nice. Overall, in terms of quality for an unlimited restaurant, it doesn't disappoint.",
            "time": 1721205049,
            "translated": false
        },
        {
            "author_name": "Minh Luan Nguyen",
            "author_url": "https://www.google.com/maps/contrib/115194235860369357346/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJoWu2_sOTjaVEqpv0We0D2YBN7k3ADtf3T3jyHHK_qGbpNBA=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "It's a buffet style restaurant with variety of options from seafood, meat, poultry, and mixed grill by order. Roasted duck and goulash were delicious.\n\nThe buffet area was a little small for more than 5-6 pax at the same times. Besides that, food choice, customer service, and atmosphere were on point. I would come back with friends and families.",
            "time": 1729058456,
            "translated": false
        }
    ]
}