{
    "name": "Hotel Castle Garden",
    "rating": 4.5,
    "reviews": [
        {
            "author_name": "Natalia Konior",
            "author_url": "https://www.google.com/maps/contrib/103409592495511315296/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKv45b88SDKi6EGvEd98BLm-5Arc1ov0MwMNix6jg0-cOAW35U=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "3 weeks ago",
            "text": "I can honestly say it is one of the best hotels I’ve ever been to. Rooms are clean and provide the highest comfort. In the bathroom you can expect beautifully scented cosmetics. We’ve been greeted with much needed coffee, while in the room there was a small treat waiting for us.  The breakfast - pure perfection. But the most precious thing is the staff - professionals, who are really empathetic and always open to make your stay as pleasant as possible. Whenever we come to the Budapest, we will stay here.",
            "time": 1731349947,
            "translated": false
        },
        {
            "author_name": "Jessy",
            "author_url": "https://www.google.com/maps/contrib/117747558571335929767/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU-6o1Hz0KJG7nivvIkBqZGR2q7lXzXxOX3icB8Q8TG9k_UWMam=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "Me and my friend stayed there for a week and the experience was amazing. The rooms were clean, spacious and well furnished and the staff was kind and always willing to help us. The hotel was very well located as well since it was close to a ton of nice places to visit, eat from and also a bus stop. Plus the area overall was very peaceful\n\nI strongly recomend this hotel for anyone who wants to take a trip here :)",
            "time": 1725708282,
            "translated": false
        },
        {
            "author_name": "Pawi Kaur",
            "author_url": "https://www.google.com/maps/contrib/104439098658578588004/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI4MYU19EmOKcBYN7FjHXdRjmJDvrQyaCawSRu1h-_VlqxbFw=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "All great!\nThe location is perfect. It is located very close to transport links such as metro, bus and tram. In addition, you can reach many restaurants and places to visit on foot. The atmosphere is very relaxing because the hotel is located in a leafy neighborhood. The rooms and bathrooms are nice and clean. The hotel staff is very kind, immediately providing for every need. Great value for such a place.\n\nP.S. For transport here you use the BudapestGo app, so I recommend you download it. Also if you want to order in your room from nearby restaurants I recommend you to use the Wolt app, which is a kind of Hungarian Just Eat. However, the food provided by the hotel restaurant is also great.",
            "time": 1725708256,
            "translated": false
        },
        {
            "author_name": "Mila Venus",
            "author_url": "https://www.google.com/maps/contrib/106117425360771492362/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJIiWVKqnyYmPZGmRlq27iEn7P3dXiHzedqTPwHLJ7rmyGNAwY=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 5,
            "relative_time_description": "4 months ago",
            "text": "The room was both clean and very nice. The teas they served were very nice. Apart from that, since I had a lot of luggage, I made a small request and they helped me very nicely. The reception and staff are very nice and polite people 🙏🏻🙏🏻💓 Also, the location and view were very nice. You can feel peace in nature",
            "time": 1722941341,
            "translated": false
        },
        {
            "author_name": "Luca Pislaru",
            "author_url": "https://www.google.com/maps/contrib/108710419291694460243/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVjz3lNxq9L2H0hQJt9pqNu3m2aufJA84c-2zjI8bwDXmcjKruA=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "This hotel is really great!😌 It is very close to the Budapest Castle.🏰 The restaurant is very good and the food is INCREDIBLE.😘The rooms are very quiet and the view from the room is so PEACEFUL.😊And when we got into the hotel room, we saw on the bed that there were two chocolates on the house!🤗Can you believe that?🤨And then the tv was Philips which was a smart Android TV.😍The outside was beautiful!😚And the reception was out of this world!🌎 Keep up the good work Hotel Castle Garden, and we will see you next time!🥰",
            "time": 1730638171,
            "translated": false
        }
    ]
}