{
    "name": "Menza Étterem és Kávéház",
    "rating": 4.4,
    "reviews": [
        {
            "author_name": "L. KR.",
            "author_url": "https://www.google.com/maps/contrib/108819286791832738826/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL5l4yi3N1fhmMk4MBg33DFbRTxc9wBEpKZ8GHF-e6P-SUsoA=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "in the last week",
            "text": "We were lucky to get a table without reservation. Nice atmosphere and it seemed like many locals dined there as well. I love that they offer many Hungarian dishes. The menu has a big variety for everyone. We could share the delicious goulash soup and it tasted home made. The Beef Pörkölt was so tender, the beef fell apart on the fork. We wanted a side salad and the waiter recommended a Hungarian pickled salad - it was divine! Exactly what I needed. So fresh and paired wonderful with the main dish. Elderberry and strawberry lemonade were delicious as well. The service fee was included but I don’t mind because the staff were outstanding. Patient, friendly and always with a smile, they made us feel welcome. Prices were absolutely fair! I would definitely come back!",
            "time": 1732895684,
            "translated": false
        },
        {
            "author_name": "Escobar",
            "author_url": "https://www.google.com/maps/contrib/110257409375962103227/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX6NH_dUi81L-3eTP0BZ3pe7nyTVt2v0qwAwQUE0wRdjHPSUZAUVA=s128-c0x00000000-cc-rp-mo-ba6",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "I was at Menza twice without a reservation, even with the restaurant full the friendliness of serving was indicated as soon as possible to the table. As it was my first time in Budapest I wanted to taste the local cuisine. The very attentive, professional waiter suggested the dishes that were very well cooked and delicious.\nIf you ever return to this city, it will be a must to go to Menza. Highly recommend reservation.",
            "time": 1729268923,
            "translated": false
        },
        {
            "author_name": "Wei C Sigala",
            "author_url": "https://www.google.com/maps/contrib/111691491853084608129/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVh_pN1ium9PyMGGZt1kz_ZB1TJUPztl1gROO8oHydrrLHLLNdF=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "Great restaurant, friendly staff and delicious food! We sat outside and beat the dinner crowd. We ordered from the chef special menu: duck empanadas, duck burger and duck leg pasta - it was a duck day! For dessert we had pecan cake - sweet (by American standards) and very refreshing since pastries in general aren’t sweet. The service is fantastic. Food tasted delicious and affordable. The restaurant is chic without being pretentious. Would definitely come back again.",
            "time": 1729089499,
            "translated": false
        },
        {
            "author_name": "Georgios Kospatis",
            "author_url": "https://www.google.com/maps/contrib/114208856924884608779/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWVerD_G43nMADysyjackttH-RkRbjC4IWyxBpxhTGG1O_TRjO3=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "a week ago",
            "text": "We dined without reservation and although the (huge) restaurant was almost full the service was fast, friendly and attentive.\n\nThe food was served fast and was very well cooked and tasteful.\n\nGreat experience overall.\n\nThe prices though are on the expensive side. Could have been a bit lower.",
            "time": 1732736642,
            "translated": false
        },
        {
            "author_name": "THE REVIEWER",
            "author_url": "https://www.google.com/maps/contrib/104962368656516265955/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVwEljXky1bKgD630N6j96F5TO4DsdHhnNPVyBEBuUGY9E68nTM1g=s128-c0x00000000-cc-rp-mo-ba6",
            "rating": 4,
            "relative_time_description": "4 months ago",
            "text": "We arrived in Budapest Hungary kind of late. We were hungry and we were searching for places to eat. This restaurant Menza had really good reviews. We decided to try it out and we were pretty impressed! The soup was great probably one of the best soups I've ever had! The steak was really good as well! The service was good but they were really busy.  I feel like the service could have been a little bit better. The atmosphere is okay but there's no air conditioning in the restaurant only fans. We've eaten here two nights in a row and really enjoy it.",
            "time": 1721503167,
            "translated": false
        }
    ]
}