{
    "name": "St. George Residence All Suite Hotel de Luxe",
    "rating": 4.4,
    "reviews": [
        {
            "author_name": "Jesie Hong",
            "author_url": "https://www.google.com/maps/contrib/109295053664372420814/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVK6d_i_nBry70_HR2v6YR117EQU_98M9BH9m-Vg-tQoMkNIlw=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "4 years ago",
            "text": "Amazing local food! We had the recommended 3 course meal with Goulash, Hungarian noodles with Turkey and cheese cake. Best selection for those who would love to try the local food. The coffee was excellent too. Service was great and price were reasonable. Definitely will come back again when we visit next. Btw, the interior is beautiful too. Looks like an old building.",
            "time": 1577632830,
            "translated": false
        },
        {
            "author_name": "prachi aggarwal",
            "author_url": "https://www.google.com/maps/contrib/115539733473073600996/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVpph_sSrxOoicqNhEYXVWtKS2G783ervY8h63MUyP251henh1J=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "3 years ago",
            "text": "One of the best stays in Budapest. Spacious rooms. The room had a kitchen and the bathroom floor were heated. A seperate sitting area with the kitchen. Almost felt like a small apartment. The breakfast buffet was not that great. Less options. But the staff was friendly and it is located at a very convenient location. The castle is at a walking distance. And the bus station is also really close to the hotel. Loved the stay.",
            "time": 1638734958,
            "translated": false
        },
        {
            "author_name": "Bruno Sista",
            "author_url": "https://www.google.com/maps/contrib/102571682499557229939/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVsu0qSoUKK9xx5sMQNHYdue-GZLbYVHCUcFDpyUrAhgFs15hrW=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 5,
            "relative_time_description": "7 years ago",
            "text": "Didn't stay at the hotel as a guest, but had lunch there. Their menu meal was great value and delicious, giving us a teaser of the traditional hungarian cuisine. The venue is incredibly beautiful, definitely worth taking a look. Great choice of wines and very helpful staff. We were in a group of 9 with no reservation but they still managed to arrange for a big table for us.",
            "time": 1488058869,
            "translated": false
        },
        {
            "author_name": "VAS",
            "author_url": "https://www.google.com/maps/contrib/114409534055270330109/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWGREhyCrouSByT2Q7slRdRj_0lQxJYWj1-z6XEbWBnxTTXxlM=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 4,
            "relative_time_description": "6 years ago",
            "text": "If you want to experience what a 1980s five star hotel must’ve felt like than you’ll love this place. As previously mentioned it totally feels like you’re staying at a royal palace. Marble hallways, fancy real wood furniture etc. Solid and as beautiful as a hotel room can come.\n\nHelpful staff (Balint was awesome!!).\n\nThis hotel however felt like it’s financially run lean, and is nowhere close to a 2018 five star hotel.\n\nThe breakfast was the worst of our entire trip. I saw so many guests peak in, look at it and immediately leave. The breakfast male waiter was also the rudest person I encountered on my entire trip. Didn’t bother to welcome any of the guests who came into breakfast, and only showed up to boss people around and disappeared once they needed something. We avoided the restaurant all-together after our encounter with him.\n\nTowels were clean but thread worn. Room clean enough but quite dust layered around all the edges. Our room only had a bathtub, so be sure to confirm if you require a shower.\n\nStrange place, but if you don’t mind the quirks a funky affordable hotel away from the chaos of Pest with super convenient and safe parking.",
            "time": 1526100472,
            "translated": false
        },
        {
            "author_name": "Bob Hatty",
            "author_url": "https://www.google.com/maps/contrib/101368909905329947860/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWBo1kbCByS_z2d1yV7S7OAFaZbjUmOcGkoDxKkjORITD4P8dw=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "5 years ago",
            "text": "My wife and I dined there last night, we had two separate entrees and shared them, traditional Hungarian selections-\n\nThey were fantastic, flavorful and great presentation-excellent.\n\nWe ate in the garden area and had local beer and red wine, both great choices.\n\nAlso, very good prices & service.  Just down to he street from the St. Mathias church.",
            "time": 1568626851,
            "translated": false
        }
    ]
}