{
    "name": "Löwenbräu Köln Hotel und Restaurant",
    "rating": 3.6,
    "reviews": [
        {
            "author_name": "Alina Bilokonieva",
            "author_url": "https://www.google.com/maps/contrib/102921803729412207042/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLydCMQNNyp_THjvaXpDt9hj-_rkC4YfssaCdZwJW9X7O_CIg=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "We had dinner at the restaurant because it caught our attention by its amazing design. We weren't disappointed by the food either, we had a very german meal: sausages and apple strudel for dessert. We also asked to change the sauerkraut to just a normal fresh salad and there was no problem with that, the waiter was very nice.",
            "time": 1727872905,
            "translated": false
        },
        {
            "author_name": "Graci Persch Severo",
            "author_url": "https://www.google.com/maps/contrib/113716655019069085528/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXjuYbeT8KWWtBdJVwbqbThOLjJue6rGGmhcF-qHiKJLhU60BwJbQ=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "[Hotel review] I was surprised by this hotel! It has a quirky format with a sink inside the room and the bathroom being on the other side of the corridor, but the design was a great topic of conversation between my friends so I would say it was great to experience that hahah\nLocation is unbeatable, right next to the river and where all the authentic German places are :) the restaurant below the hotel has a very design too. It is also just ~8 min from the cathedral.\nIT HAS AIR CONDITIONER!!! Best thing :P\nThe room and the bathroom were spotless, everything very clean and organized. The hotel reception staff was very friendly and attentive, I was able to leave my luggage there and while I was concerned because they just told me to leave it in the middle of the restaurant tables (second floor), they took care of it and it was there when I came back :)\nBut to be honest I grabbed my luggage and left and I don't think anyone saw me taking it, so maybe if someone else tried to take it they would have been able to. Hopefully it didn't happen so I leave 5 stars, but it would be good if the hotel could find a place to keep luggage safer to avoid a situation where someone just steals the suitcase and leaves haha",
            "time": 1724329379,
            "translated": false
        },
        {
            "author_name": "Jeano B.A",
            "author_url": "https://www.google.com/maps/contrib/107794571823862579765/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW9WF6KH-mmiUb-TLq1_I5ViRJjdu1YCXSSq-ZLUmHu0KWNTOZq0A=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 1,
            "relative_time_description": "3 months ago",
            "text": "I had the worst service ever at this establishment. A waiter, who initially refused to give his name but was later identified as Alam, exhibited clear homophobia towards my friends. He instructed them to 'behave' and failed to serve them properly. It’s disappointing that such behavior is still tolerated in 2024. This individual is damaging the reputation and image of the place, and I hope the owner is made aware of these issues, as it could negatively impact their business. I do appreciate the efforts of the other staff members who tried to improve the situation",
            "time": 1723233701,
            "translated": false
        },
        {
            "author_name": "Yavuzhan Çürük",
            "author_url": "https://www.google.com/maps/contrib/112717542745085186811/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKFFVtP1-dJuLha4xYX9fTpySGESKmzay7g0N5l7K1_5uWUhQ=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "5 months ago",
            "text": "I recently had the pleasure of staying at Löwenbrau and dining at their exquisite restaurant. The rooms were not only comfortable but also elegantly decorated, offering a perfect blend of luxury and coziness.\n\nThe highlight of my stay was undoubtedly the dining experience. The restaurant offers a diverse menu featuring both local and international cuisine, all prepared with the freshest ingredients. Every dish was a delight to the senses, beautifully presented and bursting with flavor.\n\nThe attention to detail and the commitment to providing an exceptional guest experience were evident in every aspect of my stay. Whether you’re looking for a relaxing getaway or a culinary adventure, Löwenbrau is the perfect choice. I highly recommend it and look forward to returning soon.",
            "time": 1718825018,
            "translated": false
        },
        {
            "author_name": "Iam Irunya",
            "author_url": "https://www.google.com/maps/contrib/117336321076541838648/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJqKrQ62-etsPsQ5RwT_n4IU3lM5W_mIODr8_kHiX5DBTwB8fg=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 1,
            "relative_time_description": "2 months ago",
            "text": "I don't know about hotel itself, we were walking around and saw that they are serving mussels . And that was their specialty... Hmmm ok! The price was 21 euros for the same amount of mussels as everywhere. As a fish lover, of course I was wondering to taste it. Let's try...\nOhhh how disappointed I was. ((( Almost every mussel I took, contained sand.. 😢 They also had 0 taste to them.\nI wouldn't recommend this place to eat mussels , about other food I can't say anything.",
            "time": 1726330153,
            "translated": false
        }
    ]
}