{
    "name": "Radisson Blu Hotel, Cologne",
    "rating": 4.3,
    "reviews": [
        {
            "author_name": "Life Reviewed by Debabrata Sarker",
            "author_url": "https://www.google.com/maps/contrib/102217151268832279819/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjURvI2CIglHDcAriglb6E83fhrnTj6aTNosld4Lbkb5stjjT-bGGA=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "I am a traveller from India and stayed in this hotel for 6 days for a business trip in October. The experience was really good. The room was huge. They assign a double room even for a single person. The only complaint was the room was not cleaned regularly, and I had to inform the reception to get it cleaned every time. Apart from that nothing to complain at all. The washroom had a full bathtub, the shower ran great, and the lights were moody and awesome. The bed was comfortable and the sheets were clean. The temperature could be controlled perfectly and also had automatic electric blinds. Had a small fridge, iron, dryer and everything. One of the most luxurious hotels I have ever stayed in. The best thing was the free breakfast buffet in the mornings. They had such huge options of healthy food. Fruits, breast, variety of cheese, fruit juices, coffee, eggs, cornflakes, you name it and it's there. And the seating area was huge. Loved it. Highly recommended. I hope to stay here again in the future.",
            "time": 1727888601,
            "translated": false
        },
        {
            "author_name": "BKK Wanderer",
            "author_url": "https://www.google.com/maps/contrib/114443772162362478357/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUitfqmIYG_5D84b1OowVI6lcrpUaYQ0RrGKvlwarJEs0RgVFTv=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "Excellent stay, our receptionist upon checking in was really nice and friendly which made everything better. Spacious room with 2 seats to chill. Quick less than 5 min walk to the train station. Parking is around 17 to 19 euro for the night.",
            "time": 1727825237,
            "translated": false
        },
        {
            "author_name": "Orest Maluga",
            "author_url": "https://www.google.com/maps/contrib/105181774492548121398/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVz7yWWXJfolZn7yTcnUX31RMpOgUzjJccwHu3FzSzIaHS43-dU=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 1,
            "relative_time_description": "2 months ago",
            "text": "I am writing to express my dissatisfaction with the service I received during my stay at your hotel from 4th to 7th September. Specifically, I encountered several inaccuracies in the information filled out on the hotel documents, including incorrect details and grammar mistakes.\n\nAdditionally, during my stay, I left some clothes in my room upon checkout. I contacted the hotel twice, and on both occasions, I was told that no items were found. However, after my colleagues insisted on further checking, my clothes were eventually located. This experience caused me undue stress and inconvenience, which is unacceptable.\n\nI kindly request that your staff exercise more diligence when handling guest belongings and ensure all items are accounted for accurately. Moreover, attention to detail in document preparation is crucial for maintaining the professional standards expected by your guests.\n\nI would appreciate it if you could address these concerns and take the necessary steps to improve your services. I look forward to your response and any actions you plan to implement to prevent such issues in the future.",
            "time": 1726869356,
            "translated": false
        },
        {
            "author_name": "Lloyd Armstrong",
            "author_url": "https://www.google.com/maps/contrib/116921497702429874806/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXVluo2tTmDwkgPk2JPycGK7hXjOAd_NyvGYLeJVPN4qbcvxC6GHg=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "Clean, spacious rooms with large beds make for an enjoyable stay. The check-in/check-out process is seamless, with the option of self-service. The location is ideal for conferences and events at the nearby Arena and Conference Center.",
            "time": 1724751051,
            "translated": false
        },
        {
            "author_name": "Franie N",
            "author_url": "https://www.google.com/maps/contrib/115825261004478101106/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWxVl5BglaWdq-_YazJVsPR9rsM9OX5ykCIGK64nqiLbaVCFG-U=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 4,
            "relative_time_description": "5 months ago",
            "text": "Very friendly staff and location is great. The room was clean and very comfortable. My only complaint is that I paid for an upgrade to “garden view” and the view was not nice at all. Also I upgraded to have a bottle of wine in the room but the wine never arrived. The breakfast was delicious and the variety was great.",
            "time": 1718186658,
            "translated": false
        }
    ]
}