{
    "name": "Gilden im Zims “Heimat kölscher Helden”",
    "rating": 4.3,
    "reviews": [
        {
            "author_name": "David Chung",
            "author_url": "https://www.google.com/maps/contrib/114322939076409377849/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX6vRVqc8U_ugbjDbZLkHV6JNMzhB1-LzrF4_1r1-nGAsxVOnIW=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "Popular restaurant and brew house in Heumarkt square. Was very busy on the square but it's deceptively large inside with plenty of space.  Walked in for dinner and was seated and served straight away. Service was quick efficient and friendly. Ordering in English was not a problem as is the case everywhere. Had the schnitzel which was delicious. kids portions too, which was enough for adults! Beer good too. Food came out very rapidly and meals were flying out of the kitchen constantly. Amazing food service. Really enjoyed it and cannot fault the food or service. Recommended.",
            "time": 1724875727,
            "translated": false
        },
        {
            "author_name": "Andrew Sharpe",
            "author_url": "https://www.google.com/maps/contrib/107262860055059089578/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKFxq-4YtN-bHJzohVFC5EPfqBNHwwIPOCFEHnUdLe36pNbHQ=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "As an American visiting Cologne for the first time, some of my work colleagues brought me here for dinner after walking around town and visiting the cathedral. First, the wait staff was very friendly and provided a menu in English. Second, the beer is very good and just keeps coming so long as you are willing to keep drinking. Third, the food was incredible. I ordered the schnitzel with mushroom gravy and fried potatoes instead of fries. I was full half way through because of the generous portion, but ate it all anyways because it was so delicious. The atmosphere and the building itself was also five star and provided what I felt (take that for what you will as an American visiting Germany for the first time) was a very authentic German experience. They also have outdoor seating in a lovely town square if the weather is good. 10/10 would for sure recommend, and I hope to get back here again someday.",
            "time": 1729798878,
            "translated": false
        },
        {
            "author_name": "Tom McKinnon",
            "author_url": "https://www.google.com/maps/contrib/105248521172835594895/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXIwBEXyiqWAmm1_qZJQsUWdQz8jQ_EyJCkDkbQRV331h3iGUgY=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 2,
            "relative_time_description": "2 months ago",
            "text": "Average food and not great service.\nThe vibe was ok in there because there were so many people (especially for a Tuesday night) but the staff all looked depressed and my meal (spinach and fried eggs) was a plate of slop. They do have giant gherkins though which were good.\nThe one really positive thing about this place is that the beers keep coming. When you’re finished your 200ml beer, it automatically gets replaced. If you want them to stop bringing you beer, you have to put your coaster on top of your empty glass.",
            "time": 1726602021,
            "translated": false
        },
        {
            "author_name": "James D",
            "author_url": "https://www.google.com/maps/contrib/100148383455191793243/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVpqn1qxwvh_A7VjNKau7O54BqDebYueZSei8GuYCBD_4Y9cAtP=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 2,
            "relative_time_description": "2 months ago",
            "text": "Food: I had the marinated beef dish (pictured) and a pickle. Unfortunately, I was unimpressed by the marinated beef. I thought that the beef itself was a bit dry, but not chewy, and the gravy/sauce was far too salty - it really overpowered the whole dish. The red cabbage was okay and had a better balance of flavour and the potato dumplings were good - having a nice chew to them. Overall, the dish did not meet the mark and it was not something that I would ordered again. The beer situation is good, and if you order the 0.2L Gilden Kölsch, they will continue replacing your finished glass with a new beer until you ask them to stop (which you can signify by putting a coaster over your glass).\n\nOverall, this place did not hit the mark and I would look to eat somewhere else. I would not recommend this place.\n\nService: The staff members were not overly enthusiastic, and did not seem happy to serve us (not sure if this is because I can’t speak German), but it is something to keep in mind, you might feel a bit uncomfortable when you are trying to order - like they can’t be bothered dealing with a non-German speaker. There are, however, English menus so they seem to be expecting tourists. I ended up having to grab the menus myself as no one provided us with any for some time after we were seated. When we arrived to be seated—albeit no booking—it took some time to be acknowledged. Bathrooms were clean.\n\nAtmosphere: the atmosphere is nice, especially the outside area. The inside, where we sat, was spacious and had decent sized tables/benches.",
            "time": 1726662511,
            "translated": false
        },
        {
            "author_name": "Sey Ha Sok",
            "author_url": "https://www.google.com/maps/contrib/101468819071784628893/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUWEUXhUT6xW0xvIXXxWYJHXiRdZMzh_XHbWBdnatLmaG2CgqJc=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "I’ve eaten here numerous times, and it never disappoints. The consistency is outstanding, I’ve never had a bad experience. In a city like Cologne, known for its fantastic food scene, that’s remarkable.\n\nSituated right on Heumarkt Square, the restaurant offers great food, attentive service, well organised (thanks Felix) and a welcoming atmosphere. It’s the perfect spot for lunch, dinner, or just enjoying a Kölsch in one of the city's most lively areas.\n\nThe restroom is also very cool.",
            "time": 1728059188,
            "translated": false
        }
    ]
}