{
    "name": "art'otel Cologne, Powered by Radisson Hotels",
    "rating": 4.3,
    "reviews": [
        {
            "author_name": "Maciej Poletylo",
            "author_url": "https://www.google.com/maps/contrib/116972541074564378426/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKTJpLCMq-zyTnIlpzXgrOZIscIfiCzWiDpDV_uD5oQztRo=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 5,
            "relative_time_description": "3 weeks ago",
            "text": "An absolutely brilliant hotel. Conveniently (and beautifully, at the same time) located - 20 min. walk from the Central Railway Station / Cathedral (you find it in the old harbour, at the Rhein river bank), close to the Chocolate and Mustard museums in Cologne 😀\nThe rooms design is great - I'm loving the idea of glass painted wall behind the bathroom shower (my favourite \"walk-in\" solution) and the bedroom! Also I liked the washbasin in the main room, which helps optimize the division of the room's space.\nThe breakfast is really good - fresh, tasty, and regularly replenished.. 😉\nStaff is generally fast, nice, and helpful (my special credit goes to Ms. Niknejad! 😀).\nOne thing - there are problems with the elevators that occur quite regularly (either one or both are out of order for some time).\nOtherwise, the hotel is very cool and worth recommending!",
            "time": 1731240195,
            "translated": false
        },
        {
            "author_name": "Rory Fulwell",
            "author_url": "https://www.google.com/maps/contrib/100278962660892968016/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLCbWzQbgmnRJUbddJGL1jMmm9q59CbeOy4L_VEHZ8WaYp9DA=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "Stayed at this hotel many times and the team have been brilliant every time. Shahrzad was a faultless host providing great service and wonderful recommendations throughout the stay. The rooms are well designed with beautiful artwork, the breakfast choice is ace, and the rooftop views are calming after sundown. With the chocolate museum next door and the old town a small walk away, this hotel is a brilliant location for those wanting to discover Cologne!",
            "time": 1724836197,
            "translated": false
        },
        {
            "author_name": "Dylan B Choi",
            "author_url": "https://www.google.com/maps/contrib/107863700375868086556/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVv7bSMrkVBDIFU2ReDOcGGGFU7DY8M0A8eCjyI9nRjpL19blk=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 2,
            "relative_time_description": "a month ago",
            "text": "Pros : Room is fancy. Location is close to city centre\nCons: Rudest/unkind staff service in the entire world. Parking is super expensive.\nThey should mention it on booking.com and everywhere but they leave the looking for \"parking fees\" as guests responsibility and looks at you like alien when asking for help finding parking spots that are free.\n\nWho would wanna come to a hotel and pay 40-60euro per day parking? This hotel is nothing more than average 2-3star hotel in Eastern Europe. But staffs (especially long black curly haired lady) was behaving like \"this is super luxury hotel & how dare you ask for help finding parking\". Shouldn't it be basic expectation or consideration from hotel knowing that all their guests are coming for staying at their hotel and more way to get more customers are by being kind and helping them find what they need instead of having grumpy face and \"cant be bothered to help you behavior\".\n\nIn Italy, any hotel in any region i stayed never had such experiences. In Itally all hotel owners were kind enough to let guests know where we could freely park or spend as minimum as possible. Only in Cologn, the staff here won't give a shit how much you have to lose out of your pocket for stupid parking.. speechless worst experience ever. never again will I have interest in coming to Cologne",
            "time": 1730104088,
            "translated": false
        },
        {
            "author_name": "Jordan Mansfield",
            "author_url": "https://www.google.com/maps/contrib/109804444439200464173/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUpaM7XC_SttrHVi5WZoTrVjPHci6rwecyAJm2ADINYyqK_2Qkw=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "An incredible hotel. Parking available above  ground and in a parking garage. Very safe and secure area. Walking distance to the sckholade museum (5mins) and the centre (15mins). The staff were incredible, so helpful to my partner who's in wheelchair. Lift available at a different entrance as the main entrance has steps. The rooms were great, amenities were great and the view was awesome. Also loved the aesthetic of the hotel. Overall very happy and would go back again if ever in Cologne.",
            "time": 1728673958,
            "translated": false
        },
        {
            "author_name": "Miloš Milenković",
            "author_url": "https://www.google.com/maps/contrib/100433520422445115167/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXN4-0WUscdnoxcpKoySN90thhZxHLGmM6feSC3Ixmg7qRZij4=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "5 months ago",
            "text": "We booked this hotel for our long weekend stay in Cologne, and it was a good destination. Less than 15 walking mins away from the old town, situated right at the river and with lots of dining options around, it offered everything we needed. The room was very spacious, with sort of a balcony just above the canal, with comfy beds.",
            "time": 1719902087,
            "translated": false
        }
    ]
}