{
    "name": "SAVOY Hotel",
    "rating": 4.4,
    "reviews": [
        {
            "author_name": "Lindsay smith",
            "author_url": "https://www.google.com/maps/contrib/107300794879275733431/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLntnSw23H2PGJgVUHZpPk0OS_lYhsaW-zj81R158mbqrlkbg=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "in the last week",
            "text": "Fabulous.  Loved the luxurious opulent decor.  We stayed in a suite overlooking the garden.  It was perfect.  The bathtub and shower were amazing.  The staff were lovely and very helpful regarding our missing luggage which didn't make the flight with us.  It's just a shame are flight was delayed and we missed a night but our suite was ready and waiting for us when we arrived early the next morning Well located close to the station.  Very clean and comfortable.",
            "time": 1732997527,
            "translated": false
        },
        {
            "author_name": "nele bes",
            "author_url": "https://www.google.com/maps/contrib/112691580142330370878/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL9QRgRezJ7Lh3aMny0oMz-QsksSoRShJtHNtczuLeFsQx65A=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 1,
            "relative_time_description": "3 months ago",
            "text": "Absolutely worst hotel experience of my life.\nWe arrive in the room. There is a half drank water bottle in our fridge. We contact the reception and they send us over to the bar. We go down, ask the barman to send up a new water and explain the situation - they tell us to go to reception. We are staying in the PREMIUM SUITE btw. Back at reception the receptionist tells us they can’t do anything (in a very unpleasant manner) as the room service only starts tomorrow. After more back and forth we eventually had to go back to the room and call from our room phone to get the grumpy receptionist to show up with 4 waters, which we later found out they charged us 25€ for.\nThe next day we had food delivered to our hotel and when we went down to reception there was nobody there, and a plastic food bag with our room number was on the counter, so we grabbed it. Then, RUNNING, came a receptionist and screamed “ARE YOU OUT OF YOUR MIND?” We were shocked and reminded him that we’re hotel guests. He then went on to say “what’s wrong with you” and kept telling us how we’re insane for grabbing the food on our own. He smelled like cigarettes and admitted he was smoking, but he also claimed that he never left the desk.\nThe hotel has an “environmental policy” of cleaning the rooms every 2 day. We didn’t get our shampoo and hand wash restocked a single time though.\nWe also had an AC in the room but upon calling reception we found out it’s “not actually an AC” and got very vague instructions to just make it 21 degrees, which never made it work anyways. We never got our luggage taken to the room or even got offered any help. The stay was very unpleasant and the workers are just a nightmare. When checking out we were surprised about the water charge but the workers just said that’s how it works. There is NO free water in the room. No robes or flip flops. Nothing was restocked properly (like the little bathroom sanitary bags)\nalso, no french fries available anywhere in the hotel 🍟",
            "time": 1724597504,
            "translated": false
        },
        {
            "author_name": "P",
            "author_url": "https://www.google.com/maps/contrib/106353000146389714956/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ2yZVuHqT8FKJipkbs_cAtH9U7BGINbqvlKPb5YcRUVsLliQ=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 4,
            "relative_time_description": "6 months ago",
            "text": "Great hotel. Super friendly and helpful staff all around. Nice clean rooms and comfortable beds. Walking distance from centre. Very nice gym and sauna.\n\nBreakfast isn’t the level you’d expect. No fresh juice and limited options in comparison to similar hotels.",
            "time": 1715515359,
            "translated": false
        },
        {
            "author_name": "Cleo C.",
            "author_url": "https://www.google.com/maps/contrib/103169892111941503840/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ6eKIxJzXcxEvdSdMg7eUivCaQ_Qmm9GNNLYMwAwa0G2tWaA=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a year ago",
            "text": "I recently had the pleasure of staying at Hotel Savoy Cologne during my visit to the city, and I must say, it was an enjoyable experience from start to finish. Upon entering the hotel, I was immediately struck by the impeccable design and attention to detail in the room. Every aspect of the decor seemed to have been carefully chosen, creating a warm and inviting atmosphere. It was evident that the room had been designed with love and a keen eye for aesthetics!\nThe staff at Hotel Savoy Cologne truly went above and beyond to make me feel welcome and comfortable during my stay. From the moment I checked in, their warm-hearted and friendly demeanor made me feel right at home. They were always available to assist with any inquiries or requests, ensuring that my needs were met promptly and efficiently. One of the highlights of my stay was the breathtaking view from the rooftop of the hotel. Whether it was during the day or at night, the view never failed to captivate me, and I found myself spending hours simply gazing out at the city below. To top it all off, the food and drinks served on the rooftop were absolutely delicious.",
            "time": 1694087869,
            "translated": false
        },
        {
            "author_name": "Lynn Gardner",
            "author_url": "https://www.google.com/maps/contrib/103807651211665539008/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUGzb71lLezTLP3p2Rds9AHTzlBuj8oIoU8RUQVnUqt3FQ9dfYr=s128-c0x00000000-cc-rp-mo",
            "rating": 3,
            "relative_time_description": "a year ago",
            "text": "This hotel was a disappointment and we didn't stay the night here. The service was good and friendly but most other areas didn't meet our expectations. First, walking from the train at night took us through an area/underpass that was sketchy. But, mostly the hotel room furnishings are outdated and very tired. Besides that the odor in the room triggered my allergies that had been dormant for a long time. To try to combat the smell they use a heavy perfume deodorizer. The highway outside of the hotel was loud too. Our room was expensive compared to local, nearby chain hotels.  We wanted to stay in a locally owned boutique hotel but this one didn't meet the mark!",
            "time": 1698734601,
            "translated": false
        }
    ]
}