{
    "name": "Copenhagen Admiral Hotel",
    "rating": 4.4,
    "reviews": [
        {
            "author_name": "Meghan Hammond",
            "author_url": "https://www.google.com/maps/contrib/103783600071079348354/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWRsy902H6Ed2wYgAasnxzji5wIKyhbMmQz8mLWjA_jy0-EfMGoyA=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 4,
            "relative_time_description": "a month ago",
            "text": "Great location, close to many beautiful places and in a quiet part of town. There is construction going on, but the impacts were minimal. We didn’t stay long enough to use much in the way of services, but the staff was all very kinds and helpful. Breakfast was wonderful! Only reason for a 4-star review of the room is because it was very narrow, being covered width-wise almost entirely by the bed! But the bed was comfy and the bathroom was very nice. Would definitely book this place again.",
            "time": 1729707603,
            "translated": false
        },
        {
            "author_name": "Gigi T",
            "author_url": "https://www.google.com/maps/contrib/105892641089696901107/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKwVB42SXD3xFVSLwZELM2cJCX5gR0zN5c3-a20z0uy_RBJfzyA=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 3,
            "relative_time_description": "a month ago",
            "text": "Cleanliness: The room was spotless, with clean carpets and no unpleasant odours.\n\nComfort: The bed and blanket were comfortable, but the pillows could use improvement.\n\nSpace: The room was spacious, featuring a resting area two armchairs.\n\nAmenities: Plenty of conveniently placed electrical outlets, a well-stocked minibar (not complimentary), but only instant coffee — lacking a coffee machine. The full-height mirror was a nice touch.\n\nBathroom: Spacious and clean, with toiletries provided. The rain shower was great.\n\nView: The hotel is located by the waterfront, but whether you get a view depends on your luck; otherwise, you'll get a street view.\n\nQuietness: The neighbourhood was peaceful and quiet.\nLighting: The room was well-lit.\n\nTemperature Control: The air conditioning and heating worked perfectly.\n\nInterior Design: Modern and cozy with warm timber accents, welcoming environment.\n\nStorage: Good closet space, with ample drawers, luggage racks, and hangers. The additional hooks for jackets were a nice bonus.\n\nOther feature: The corridor, likely part of a refurbished older building, featured beautiful arches but felt narrow. Maneuvering large luggage was tricky, especially with linen and cleaner trolleys often stored along the hallway, blocking both the pathway and the nice architectural features.",
            "time": 1728903386,
            "translated": false
        },
        {
            "author_name": "Thomas Strickland",
            "author_url": "https://www.google.com/maps/contrib/109265607119049198712/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU17dYKClbB2RTc-GxcR-vjoOjPxffWCn-oEnMoaeb6Wk4xEfoj=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "The design of the room was outstanding. Windows opened which made for excellent sleep. I found it to be larger than my expectations and when compared to similar hotels. The staff was amazing! Location is perfect.",
            "time": 1729084193,
            "translated": false
        },
        {
            "author_name": "Daniel Pievsky",
            "author_url": "https://www.google.com/maps/contrib/101701955020631029798/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU_jg3Vs04m77WUYzKjmJiJHcmrY-wR2SVfztNuThxk44Q3v3wn=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 4,
            "relative_time_description": "5 months ago",
            "text": "We stayed for one night and had a very good experience. We arrived very early (several hours before check in) but they did have one room that was already clean and they gave it to us. The check in area is on the ground floor (floor 0), we had to take the elevator to the first floor which was confusing the first time. The hallways and path to the rooms are small and tight but manageable, even with large bags. The rooms themselves are a good size and have an open concept. Huge wooden beams run across the room which was interesting. The bed and pillows were comfortable. Bathroom was a good size and shower could fit 2. We did not eat at the restaurant or the bar. Location is great with the opera house on one side and the royal residence on the other. It's also a 5 minute walk to nyhem.",
            "time": 1719729914,
            "translated": false
        },
        {
            "author_name": "Derek Yee",
            "author_url": "https://www.google.com/maps/contrib/103222958202777845059/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUB6RMoBkAV-ognk1GxM9Lk6nwn0dLkWs2IGApIOst-fNXS-vwSlQ=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 3,
            "relative_time_description": "3 months ago",
            "text": "This could have been a great stay, was here for 4 nights and honestly the room was only cleaned once! The last two days of my stay I am usually up and out early in the morning, only to return by 2-3pm.\n\nThe first day my room was cleaned as expected. The subsequent day I was out by 6am and back by 4pm. It was not cleaned.\n\nNext day I was out again by 7am, turned on the “Make my room” light and left for the day. I got back to the hotel by 2:30/3pm and the light was still on…they hadn’t even cleaned the room.\n\nI check out tomorrow and am pretty over it….will probably not stay here again this was 🚫 a five star experience at all…sorry.",
            "time": 1724084524,
            "translated": false
        }
    ]
}