{
    "name": "Hotel Danmark - By Brøchner Hotels",
    "rating": 4.1,
    "reviews": [
        {
            "author_name": "Michael Knight",
            "author_url": "https://www.google.com/maps/contrib/109404129315854774010/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIIalWYhYQ_hR5goXxnVll-V1msDAapYRXMGvLxjNaN4Z1pOw=s128-c0x00000000-cc-rp-mo",
            "rating": 1,
            "relative_time_description": "a week ago",
            "text": "Beware of Hotel Danmark not honoring your guaranteed reservation.\n\nI had reservations, paid for in advance, for a Sunday. The reservation was for 3 days. Due to flight delays, I was not able to arrive on that day. I contacted the hotel via phone, and was told no problem that they would see me the next day. I had additional flight problems the next day. Again, I contacted the hotel via phone. There was no answer and the automated message told me to email. I emailed them, letting them know there was an additional delay and expected to arrive on the last day of my paid for reservation. As I am getting on my flight, the hotel emails me back stating they had sold my room and I needed to find other accommodations. I told them I understood that I would not be refunded for the days missed as it was a guaranteed/paid for in advance reservation, but expected the room for the last night as I had kept them informed each step of the way what was happening.  I get to my layover to find an email stating that my reservation is no longer valid and that I need to book a new reservation. They told me their sister property had room and I could pay a second time for a room with them. They claimed I had not contacted them the first day. Even after I provided phone logs showing I had contacted them, they refused to honor my reservation. They eventually refunded my last night, but never apologized and showed zero interest in helping me. I had to book another hotel, during a layover, so I had a place to stay when I arrived to the city in a few hours. Luckily one of their competitors had rooms and I had zero problems with their competitors. I highly recommend NOT booking with Hotel Danmark because of these issues. I have never had this type of issue with any hotel chain before this. Book somewhere else if you want to have a room when you arrive.",
            "time": 1732392574,
            "translated": false
        },
        {
            "author_name": "Adrian Tan",
            "author_url": "https://www.google.com/maps/contrib/112936711725228610586/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIiwD4SPo4ruqCFInqkF6ejKfiHBb4axTaVZuwvBl3jP6EZVw=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "Nice cosy hotel. The rooms are small but the staffs goes out of the way to make you feels welcome.\nWe have sudden change in our schedule and have to leave the hotel early. Breakfast starts at 7am we spoke to reception and they accommodate us to eat early at 6:30am\nTheir happy hour at 5-6pm was fantastic.  You can have free wines free of charge.\nVery different hotel but would definitely come again.",
            "time": 1730707194,
            "translated": false
        },
        {
            "author_name": "Andy Green",
            "author_url": "https://www.google.com/maps/contrib/113668766355126559071/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ4PZql-Se_bpcuMUSTzaqFTfEJbvuLxHYbH9wONy_Eyptyeg=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "Lovely hotel situated near tge Town and museums.  The staff were friendly and welcoming and attentive.  Our room was a bit small and bed was against the wall. However, we had a grand time and the breakfasts were marvellous.  Nice happy hour and late night tipple on the house was very nice. We will certainly be back",
            "time": 1729330832,
            "translated": false
        },
        {
            "author_name": "Mahima Ponnappan",
            "author_url": "https://www.google.com/maps/contrib/102120962462969830626/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX5TaSwrwreIRpWy28xQeIcsG12PmrHQYhpUFSIoNP18COJgX98Qw=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "Very convenient location.  The rooms and good enough but the evening happy hours were really fun.  The staffs very friendly.  Gave me suggestions on what to do around.  The breakfast spread s pretty decent.\nVery close to tivoli garden, station n office spaces. Lots of cute restaurants near by.  Enjoyed my stay.",
            "time": 1726128744,
            "translated": false
        },
        {
            "author_name": "Doug Noble",
            "author_url": "https://www.google.com/maps/contrib/102388876515008264289/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLBEqhwQZIXc8aq_dOkIv4GaxfJG8P-7HrxjfyV9MWLqtEuhQ=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 4,
            "relative_time_description": "4 months ago",
            "text": "Great little boutique hotel in a super location for those wanting to explore Copenhagen. The staff are friendly and very knowledgeable on sites & activities as well as local restaurant recommendations.\nThe rooms are a good size and come with everything you need. One comment I will make is that the room was extremely warm and there wasn’t aircon in the room. The fan was helpful but didn’t really make much difference.\nThere’s a smart rooftop bar offering some wonderful views of the city, and for guests, there is a wine hour as well as a nightcap hour. The hotel only does a continental style buffet breakfast, otherwise no other food is served. The variety of the breakfast spread is wide and varied, with plenty of options from granola, fruit, cheese & ham, to eggs, sausages and pastries.\nThe only other comment I’d make is that the doors on the 6th floor slam very loudly and it’s therefore very easy to hear guests coming and going, and the rooftop bar means that occasionally you’ll get some loud guests going back down. Otherwise I’d recommend this hotel for anyone looking for a simple, clean base with friendly staff very knowledgeable of the city and happy to help out with any bookings or recommendations.",
            "time": 1722168472,
            "translated": false
        }
    ]
}