{
    "name": "Babette Guldsmeden",
    "rating": 4.3,
    "reviews": [
        {
            "author_name": "Shahin Lotfi",
            "author_url": "https://www.google.com/maps/contrib/101837074937211458798/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL5D4iZZ4qmGGW6xdvNFhfHAxTK8caHSAGhgdLYO4ttN63h3qM=s128-c0x00000000-cc-rp-mo",
            "rating": 3,
            "relative_time_description": "in the last week",
            "text": "We arrived around 16:00 and the check-in went really smoothly. The person at the reception was very friendly and immediately took care of us.\n\nThe rooms are good sized. However, the bed is squeaky and makes all kinds of noises. The mattress is very firm, as are the pillows. I would have liked a bit softer mattress and pillows. The blanket was very comfy. Our room was next to the elevator which was quite annoying.\n\nThe cleaning is very good. Floors, the beds and the bathrooms were super clean. They also have a wide assortment of soaps, creams and hygiene products. There's even a bottle of massage oil.\n\nThe breakfast is not what we're used to seeing at a 4 star hotel. There's such a small variety of items to choose between that we thought it was either a mistake or that we were between service. Sadly, no, that was it. No bread rolls, no toast, and very few options for sandwich meats, and only 1 or 2  pastry options. Breakfast was included in our room, but it was really disappointing.\n\nWe didn't check out the SPA, so I have nothing to say about that.\n\nThe checkout was less smooth. There were 2 staff behind the reception desk, but one of them was just standing there while the other one was helping another company. After 5 minutes, we decided to just put the key cards on the desk and tell her our room number and leave.\n\nOverall, we had a very pleasant stay, but there's definitely room for improvement. Having said that, the location is excellent!",
            "time": 1733138667,
            "translated": false
        },
        {
            "author_name": "Karen n",
            "author_url": "https://www.google.com/maps/contrib/110752925706601039339/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI2Sim6PoRmROsQpvH6BYMmrSg374FriYj-aXDUUdMg4AIFrg=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "We had a fantastic stay at the hotel. The location was ideal and within walking distance to Nyhavn. The room was very comfortable and had so many special touches. All staff we met were super helpful and friendly. The highlight was definitely the rooftop spa which was amazing, and still feeling the benefits of the face mask days later!! Won't stay anywhere else on return trips to Copenhagen - thank you!",
            "time": 1728572771,
            "translated": false
        },
        {
            "author_name": "Modi Ahmed",
            "author_url": "https://www.google.com/maps/contrib/116469692714380107430/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI6wiUPVAD0IaRGU0hMcmwEBY1XrDz4aosr6OTk1tHkew0TCw=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "Had a delightful stay at Babette Guldsmeden. Arrived a day early due to my error and the Front Desk staff happily and thankfully was able to accommodate me! All with smiles and charm. The rooms was cozy with a wonderful balcony. Really appreciated the eco-friendly sustainability initiatives of the hotel. Highly recommended!",
            "time": 1726590021,
            "translated": false
        },
        {
            "author_name": "Antoninia Hammerman",
            "author_url": "https://www.google.com/maps/contrib/107373408713846906810/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKFkHWHSx2QX4xa16fnZ7fqH5BPOuXjqu3zVaKXNKe18IWr4A=s128-c0x00000000-cc-rp-mo",
            "rating": 1,
            "relative_time_description": "3 weeks ago",
            "text": "I don’t understand the hype around this chain hotel. After staying at another one of their properties earlier in the trip, Manon Les Suites, which was very overrated and overpriced, I expected better at this one but this location didn’t deliver either.\n\nThe building itself is old, which means uneven floors and thin walls. I could hear every sound from my neighbors—woke up to a hairdryer at 4:30 a.m. one day and conversations next door the next. The floors are hardwood with only a small carpet, so no attempt was made to soften the stomping noises either.\n\nThe room was also tiny, and I had to pay extra just for a bit more space, only to find that the “extra” space was just an oddly long entry hallway—not worth the $20+ USD per night!\n\nTo top it all off, I found a huge spider in the bathroom. Wouldn’t recommend if you’re looking for comfort and quiet.\n\nStaff were nice, though! Can’t say the same for Manon Les Suites!\n\nAnd, do not automatically reply to this comment",
            "time": 1731357651,
            "translated": false
        },
        {
            "author_name": "Kajsa Nydahl",
            "author_url": "https://www.google.com/maps/contrib/115323561928517639452/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLDvIP6Ezf3Nr9hA4wfT-uA0z9SPENhxf-bi1GXscbitv_wiQ=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "2 weeks ago",
            "text": "Amazing rooms and amazing staff! Had such a great stay celebrating our mom who turned 60. Warmest welcome, always helpful and always giving that “little extra”. We would love to come back again.",
            "time": 1731958705,
            "translated": false
        }
    ]
}