{
    "name": "Hotel D'Angleterre",
    "rating": 4.6,
    "reviews": [
        {
            "author_name": "Sultan Alsultan",
            "author_url": "https://www.google.com/maps/contrib/104987466999492151787/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLruqjgPNkfJRief0jdaEjUR0eMoWHpvcuSnUQc3Wz-Cl7myw=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "3 weeks ago",
            "text": "Exceptional hospitality and outstanding service provided by the entire staff during my recent stay.\n\nThe dedication and professionalism of the team are truly commendable. Every staff member I encountered went above and beyond to ensure my stay was comfortable and memorable.\n\nThe attention to detail, prompt assistance, and genuine care exhibited by your staff made all the difference. Whether it was the impeccable room service, the friendly and helpful front desk, or the delightful dining experience, every aspect of my stay was flawless.\n\nThank you for creating such a welcoming and pleasant environment. Your commitment to excellence is evident in every interaction, and I will certainly be recommending your hotel to friends, family, and colleagues.",
            "time": 1731024187,
            "translated": false
        },
        {
            "author_name": "Rissa Zimmerman",
            "author_url": "https://www.google.com/maps/contrib/101734294202782084567/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVmD5JCBIG6ea7OucaHtkp_ISD2MgUSuBjGquE9B_rrsSE96Hxm=s128-c0x00000000-cc-rp-mo",
            "rating": 4,
            "relative_time_description": "3 weeks ago",
            "text": "The hotel is simply gorgeous, beautifully appointed and decorated for the holidays added extra charm. As another reviewer mentioned, the space in the closets and bathroom are limited and we were traveling for 2 weeks with a lot of personal effects so it was tight. The concierge staff although friendly, directed us to a lunch spot which was only open for dinner. Another member of the staff couldn't have been nicer but did not listen when we requested a sit down meal rather than take away so that was a negative. The bar staff was excellent however on our last evening when we were excited to have a festive cocktail in a romantic setting it was closed to  full paying hotel guests like us in order to accommodate a conference. This is a five star hotel and in many ways earns the reputation but having a spa filled with dirty laundry strewn about the locker rooms and on the chaises in the pool was not up to the standards of earning this reputation. As an aside, we did mention these to the desk clerk.",
            "time": 1731001849,
            "translated": false
        },
        {
            "author_name": "Julie Blanton",
            "author_url": "https://www.google.com/maps/contrib/104487751405411519403/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKCCpfMWZKe5F-agiq7hLqE_GkgvWl1xywzzA49Y3c21fS7jw=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "4 months ago",
            "text": "We stayed here for four nights while visiting our daughter who is doing a study abroad. We can’t recommend this hotel enough. We arrived late and the staff went above and beyond to help us get settled quickly.\nWe received a suite that overlooks the square, the theater and the famous canal street. It was the perfect spot for morning coffee and afternoon wine. And it was one of the most sound proof hotels we have stayed in. Our room was near the elevator and we never heard anything.\nThe location is perfect for the metro, shopping, historic sites to visit and many great restaurants close by.\nConcierge helped us with a day trip we did as well as several dinner recommendations and reservations.\nEvery staff we encountered went above and beyond to assist and accommodate. They are all friendly and helpful.\nWe had a fabulous stay and look forward to returning one day.",
            "time": 1720868057,
            "translated": false
        },
        {
            "author_name": "Courtney Hallock",
            "author_url": "https://www.google.com/maps/contrib/111458213839778091033/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIG7OwvD1IrFVJSzqCttA8ZGutV47tIFg_fuMqpDl8HmUxCGA=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 5,
            "relative_time_description": "3 weeks ago",
            "text": "Dare you to find a more beautiful hotel in Copenhagen!  The staff is warm and friendly, the breakfast is top-notch, the doormen are super helpful and got us bikes with explanations of how to navigate Copenhagen bike lanes, and the wait staff is attentive and eager to please.  Our breakfast waitress, Svedlana (?) went above and beyond to make sure we were well-cared for, and the breakfast offers a huge selection including specific items ordered from the kitchen.  We had an issue with our room the first night and the front desk moved us to a suite with a view the next night which certainly helped and we slept so well there!  Hotel is located centrally so it is easy to get to all the sights, across the square which is covered with flowers is Nyhavn with the colorful rows of buildings and the port/canal, the square is littered with restaurants, and the entire area including the hotel is beautifully lit up at night.  Will highly recommend to friends, family and our travel agent connections...Magical!",
            "time": 1731077885,
            "translated": false
        },
        {
            "author_name": "J Hammond",
            "author_url": "https://www.google.com/maps/contrib/103179453033315119990/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUFHkUuZ50N8PqobhbNi5_dgH3CWf5CoGUwm82-iyhh5NpFw9o=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "Just a lovely first visit to Copenhagen, we decided to stay at D’Angleterre and it was a wonderful experience. All the staff so friendly pleasant and the room was nice and comfy.\n\nPerfect location, of course the price is higher but you get what you pay for!\n\nCan’t wait to come back and stay here again.",
            "time": 1724071718,
            "translated": false
        }
    ]
}