{
    "name": "Ascot Hotel",
    "rating": 4,
    "reviews": [
        {
            "author_name": "Rubeena Pal",
            "author_url": "https://www.google.com/maps/contrib/109833968923706256490/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIbXsrB9FAx4vr1U0vFBKr-tVJIz7zml8X2qFEjOQbYu1xzvA=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 3,
            "relative_time_description": "a month ago",
            "text": "Good location, close to Tivoli Food Hall and other attractions, as well as a metro and train line. Dated room, given 2 single duvets for 2 guests sharing a double bed instead of one large, bathroom light on a timer of a minute or two (why?) so had to shower and use toilet in the dark most of the time, shower very compact and kept banging elbows into the glass panes, noisy room as backed onto a garbage area so lots of clattering early hours. Lots of light entering room outside at night even with curtains closed, had to prop pillows up to tighten the gap. Service was great, but the bar doesn't serve the likes of orange juice, so we had to get this from a local shop instead.",
            "time": 1730732166,
            "translated": false
        },
        {
            "author_name": "Luke Andrew",
            "author_url": "https://www.google.com/maps/contrib/108072636376682965756/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLeJmqh0Yv_j_PP_L3Rn6t6LvnFjXWQHTUf9PHVVmtc-zNyLg=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "Just 8 minutes walk from Copenhagen station, had a room on Level 4 however facing the live music outside. The live musics finished at 9pm and while we were out at dinner so no issues with noise.\n\nRoom and amenities were great - and location to walk to many places were great. I’d recommend not eating around here and getting to other suburbs where locals eat.",
            "time": 1726208169,
            "translated": false
        },
        {
            "author_name": "Helen Michelle",
            "author_url": "https://www.google.com/maps/contrib/113190796137830228427/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVJjXr07xD09e4x5mby4vo9Vtn1ZptCwWtBbmT4vh-_feQeQuw=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 2,
            "relative_time_description": "4 months ago",
            "text": "Bathroom was dated, shower over bath, no rail. Room was nice but bedspread had a hole in it, there wasn’t a full length mirror and we were opposite a music venue which on one night, Tuesday, was very loud. Breakfast was good, the bar was so pretty but when we visited, the bar tender was buying supplies so only wine or beer offered nothing else. Didn’t feel special for the price. Metro was close and location was good.",
            "time": 1722370779,
            "translated": false
        },
        {
            "author_name": "Nicky Medas",
            "author_url": "https://www.google.com/maps/contrib/107162850732692329775/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIW4YGJ86ozR1HIH86hcaWc1bo7dIe8CA8PusXZmYqUOro7Lg=s128-c0x00000000-cc-rp-mo",
            "rating": 2,
            "relative_time_description": "3 months ago",
            "text": "Tall slim guy with darker hair at reception was so rude. No customer service. Used his head to direct us to come to the the other side of the counter on arrival. No greeting, just gave us a card and said to put our luggage in the storage section that was that. Terrible service\nRooms are a box. Toilet is one step from the bed. Our shower head sprayed water outside of the shower onto the toilet/toilet paper and floor everytime you turned it on. No complimentary water available at reception or in the room. Not worth 4 stars. 3 would suit it well.",
            "time": 1725116020,
            "translated": false
        },
        {
            "author_name": "Monique Lesieur",
            "author_url": "https://www.google.com/maps/contrib/115434747580769875956/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI98Kqno1LMc4ytGBsYyOiLzeipmSoXihiKH9H62ontGli4TfYP=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "4 months ago",
            "text": "I had a great time staying at the Ascot hotel. I did a solo trip to Copenhagen and felt fully safe and comfortable at this hotel. I stayed for 3 nights and loved it. The location was super central for everything I wanted to do and right next to Tivoli. There is also a 24 hr 7Eleven right near the property, close to the metro and coffee shops on the same block. The shower was great and had all the necessary products, staff were helpful when I asked for more towels. Sheets and bed was comfy, full length mirror in room, and controllable AC which in Europe in the summer is always a must. The bar in the lobby was amazing, so beautifully designed and great staff working there. I didn’t realize a few hotels operate out the same building but I would recommend for any trip to Copenhagen!",
            "time": 1722891216,
            "translated": false
        }
    ]
}