{
    "name": "Nimb Hotel, an SLH Hotel",
    "rating": 4.7,
    "reviews": [
        {
            "author_name": "Alexandra Bidmead",
            "author_url": "https://www.google.com/maps/contrib/116439067792255671629/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUCl4mD1FD5oJLbS5t5-fdHlv6greX0cjY-CUUY9CTiKPD6BoT5=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "Our five night stay with friends was beyond fantastic. The room was beautifully decorated, as specially requested by my friend, with autumnal flowers and pumpkins. The staff were incredibly accommodating to our needs and happy to have a chat and offer help at every turn. The hotel itself was beautifully decorated and situated opposite the station and right in the centre of town which was great for sight seeing. The food was phenomenal and the presentation speaks for itself. The only possible improvement I could suggest was making the rooftop pool heated to a higher degree as we weren't quite brave enough in the chilly weather to try it out. Thanks to Nimb and all the lovely staff.",
            "time": 1730403867,
            "translated": false
        },
        {
            "author_name": "Ricardo Rojas",
            "author_url": "https://www.google.com/maps/contrib/110576963144493218821/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWIe6OHnqrzT-n7E_ES43PkmcdX9c5O227c8onL9tEBJV6Wag8b=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "in the last week",
            "text": "**A Wonderful Stay for a Special Occasion**\n\nFrom my beautiful wife Tatiana:\n\nMy husband and I stayed at this hotel in Copenhagen to celebrate our wedding, and it was absolutely perfect. The location is unbeatable—right across the street from the central train station and within walking distance of City Hall and all the main shops.\n\nThe hotel is beautifully decorated, exceptionally clean, and exudes elegance. The staff are professional, friendly, and impeccably presented. A special thank you to Magnus and Emil at reception for their warm hospitality and helpful advice, as well as to Joseph for providing outstanding service during breakfast.\n\nSpeaking of breakfast, it was delicious, with a stunning view of the Tivoli Christmas Market. Our room was elegantly furnished, spotless, and equipped with everything we needed for a comfortable stay.\n\nWe couldn’t be happier with our visit and look forward to returning in the future.",
            "time": 1733083857,
            "translated": false
        },
        {
            "author_name": "Scott Kowaleski",
            "author_url": "https://www.google.com/maps/contrib/107105651810926595065/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUSlM2vAWgawOdbXu7XTLDzbiIfPfdnMvW-zfAeyrdeMDJD4Yu3hw=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "Absolutely spectacular hotel!!!\nThe location is amazing.\nThe staff were interactive and very helpful.\nThe room lacked nothing.\nAnd facilities at the hotel  (restaurants and fitness) were flawless.\nAnd direct access to the Tivoli Gardens made the stay extra special.",
            "time": 1729425768,
            "translated": false
        },
        {
            "author_name": "Rodrigo Muñoz",
            "author_url": "https://www.google.com/maps/contrib/109161998093932840798/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUTM50KYUy3DsDTa0GTUMA4Cxe_8Ke2F7rfjDp9aOcTXUw8R6II=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "My husband and I spent our honeymoon in Copenhagen and stayed at Nimb for a week. We were treated like royalty. The transfer service from the hotel was easy. When we arrived to the hotel, they took our bags and gave us wristbands to Tivoli so that we could explore the gardens while we waited for our room to be ready. The room itself was spacious and beautiful. We had a fireplace in our room with a view of Tivoli. The bathroom had a tub and a shower. The staff had a chilled bottle of champagne waiting for us as a honeymoon gift. We did the couple's massage with dinner at the brasserie while we were there, romantic with delicious food. The afternoon tea was also such an experience. Every staff member with whom we interacted was professional and courteous. We loved our stay and it made our trip so special. We recommend Nimb to any couple that is looking to celebrate.",
            "time": 1730818664,
            "translated": false
        },
        {
            "author_name": "Zhen Z",
            "author_url": "https://www.google.com/maps/contrib/109097353797093407101/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJXUFc_ZweDUZaMYbNQiHq5o7NAJJdVyRNYArOutnhJXNHbuA=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "This review is for Nimb Bar- we had high tea there and it was a lovely experience. Arrived a little before our booking and were seated and made to feel very welcome. The food was exquisite and delicious- the rye butterfly was so unique! Highly recommended.",
            "time": 1726114072,
            "translated": false
        }
    ]
}