{
    "name": "Scandic Front",
    "rating": 4.1,
    "reviews": [
        {
            "author_name": "Khaled",
            "author_url": "https://www.google.com/maps/contrib/101870263235145900634/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUVsqkYdjzg8TolqkvhdTAxypxgcL-mkt-dVeLapuPEgP7bv8TsIA=s128-c0x00000000-cc-rp-mo-ba7",
            "rating": 4,
            "relative_time_description": "2 months ago",
            "text": "Pros:\nThe location of this hotel is amazing. It’s surrounded by the river and the main tourist attraction (Nybvan).\nI was lucky to be given a corner room, with a great view of the river. The room size is a bigger size than other rooms. The hotel is in the heart of the city centre so the area is walkable.\n\nCons:\nThe hotel is old and it needs major maintenance in some places. Plus the towels weren't cleaned enough.",
            "time": 1728072572,
            "translated": false
        },
        {
            "author_name": "Elena Lioubimtseva",
            "author_url": "https://www.google.com/maps/contrib/112031525734646796772/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW1aV4azTcDehWVZY1fd0MtaGRtqoFjBKSJGiMQJA4becOpJxLTZQ=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "A very comfortable and cozy hotel, in a great location, only a few steps away from the harbor. Very generous breakfast and exceptional service. My room decor and the balcony have exceeded my expectations. The neighborhood is very walkable, close to numerous historical sites, restaurants, and attractions. A short walk from the metro station provides inexpensive and fast direct connections to the airport and central train station.",
            "time": 1724786493,
            "translated": false
        },
        {
            "author_name": "Morten Marwell-Hauge",
            "author_url": "https://www.google.com/maps/contrib/100227038266138415051/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXvVZFNhGgA-oDTK6BuoP1ZaVZOcX_0KGIaurceZA1b9ywzeew=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "Location and Location. This hotel is perfectly situated in Copenhagen. It is on a small pier with not a lot of noise. The street outside the hotel is a one-way street and ends in a nice parking house. The hotel has an agreement with the parking house, and it is perfect to park your car there during your stay. It is not very expensive if you are not a Norwegian and have just Norwegian Crones, the world's worst valuta.\nThe hotel has embarked on a journey of improvement, with renovations underway. While there's still work to be done, the location more than makes up for it. The option to rent bicycles at the hotel adds to the convenience, and if you prefer, you can also find electric Lime bikes just across the street. The breakfast is delightful, although it can get a bit crowded during the summer.\nGreat hotel and GREAT GREAT LOCATION!!! .",
            "time": 1723536654,
            "translated": false
        },
        {
            "author_name": "Nick Day",
            "author_url": "https://www.google.com/maps/contrib/105778449675022197017/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUtke0I6_RTdn9mWcNY7_Oyh7SwuMLN-SeBuM1-JM9ycRY9icEC=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 4,
            "relative_time_description": "2 months ago",
            "text": "The location was fantastic, perfect for first time tourists to Copenhagen as it is a very short walk from many prime attractions and walkable to many more. I imagine the hotel is equally pleasant for repeat visits due to its quiet position and proximity to a main underground station (Kongens Nytorv) with multiple connections.\n\nThe reception staff were welcoming and helpful and the breakfast staff were also very attentive and helpful. We didn't take advantage of any additional services or the gym but we did wish to 'borrow' a bike as the website suggests is possible, but were told there was a rental fee. That was misleading and quite disappointing as we thought that was a wonderful perk. Use any of the e-bike rentals across town as they are much cheaper.\n\nOur room (a Standard Queen) was exactly as advertised and surprisingly spacious with a nice dedicated seating area. The beds were very soft (not our choice) but ultimately perfectly comfortable. The bathroom was spotless and a good size with a very large walk-in shower. There was no heated towel rail in the bathroom which meant our towels never felt fully dry. This is not really a complaint, just something to bear in mind - you may want to have your towels replaced each day. The hotel asks you to avoid this to be greener, but no-one enjoys damp towels!\n\nWe opted for a cheaper room to save money but if you can afford it, I imagine a river front room would be very worth the price. As it was, our view was to the rear (looking over The Admiral Hotel entrance) and was perfectly fine.\n\nThe tea and coffee selection in our room was poor and the creamer was clearly old and had solidified in the packet. Replacements the next day were better. No mini-bar is perhaps unusual in this size hotel but we don't usually use them so it wasn't important for us. It would have been a nice gesture if the tea and coffee located in the lobby had been complimentary instead of charged as we often wanted a nicer drink than provided for in the rooms.\n\nAs a side note about our room - the light switch arrangement is odd, though perhaps only to a foreign visitor? Turning off some lights also turned off the power to sockets. We only discovered this after turning off lights for the night to discover our phone had not charged overnight. Not a complaint, just something to be aware of!\n\nBreakfast was fantastic - a really large and very nice selection of foods, from the usual European cold cuts to a full English, as well as cereals, yogurts, cakes and much more. There is also a nice fresh bread selection and a toaster, something you don't always find! We appreciate good hotel breakfasts and Hotel Scandic's is very good. They also had a dedicated allergens and gluten counter.\n\nOverall, very happy with our stay and pretty much as expected from the booking information. We'd happily visit again.\n\n*Not many photos attached to the review as the booking photos on their website and sites like Booking.com seem perfectly accurate.",
            "time": 1726834336,
            "translated": false
        },
        {
            "author_name": "Željka Gjuranović",
            "author_url": "https://www.google.com/maps/contrib/115913266881076105903/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLCKbAsHoyk5g-TSVoz4Xe-FhVMTC8sf83wxPUc5dHliPjD8Q=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "Very pleasant hotel close to Nyhaven and metro station. Clean room with huge shower cabin. A bit too soft bed. Very helpful receptionists  (especially the Russian guy) and excelent breakfast buffet. Do not hesitate to book this hotel.",
            "time": 1729530209,
            "translated": false
        }
    ]
}