{
    "name": "ProfilHotels Copenhagen Plaza",
    "rating": 4,
    "reviews": [
        {
            "author_name": "Michael Martin",
            "author_url": "https://www.google.com/maps/contrib/111771770398402400109/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIuHj_K40k0Whn4w-kXJPtF3ceK_0ECNQnPWlH1kg_w86qL9Q=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "While an older property, the Plaza carried all the necessities and amenities as one would expect. Its restaurant and bar were also excellent. The breakfast buffet provided a wide variety of food to accommodate all guests. Its staff stood out as its finest quality. Everyone I interacted was pleasant, helpful in every way, and extremely friendly. I greatly enjoyed my stay and highly recommend this hotel. And its elevator was great fun, IMHO.",
            "time": 1725687034,
            "translated": false
        },
        {
            "author_name": "Kathryn Martin",
            "author_url": "https://www.google.com/maps/contrib/105162907133886240320/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLEPg3dRtvBEcw3CtzlrzU0Ku9uSGQ3nMi_wlsaig5FCQOdhg=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 2,
            "relative_time_description": "3 months ago",
            "text": "Come for the Library and stay… don’t actually stay here.\n\nBefore roasting this hotel like a marshmallow,  I’d like to highlight how pleasant the staff was. Because I’m sure they deal with complaints 24/7/365 or 66 days a year if it’s a leap year.  Every employee I interacted with was top notch, a professional.\n\nTo start, I’ve never been so hot in my life. Ever. Not exaggerating. They placed us on the 6th floor in a room with a broken bathroom heated floor that would not shut off. Luckily, the man at the desk coordinated maintenance and fixed. So instead of being a million Celsius it was only like 999,999,999 Celsius. Very hot.\n\nThe coffee pot smelled like fresh vinegar. Of course the fake air conditioner made me sick. So I couldn’t smell the vinegar after a day but I knew it was still there.\n\nI’m fairly certain they thought I needed to loose some water weight because they did not replace our cardboard water boxes.\n\nThe room itself was pretty- nice view of the train station.\n\nThey give you a complimentary pair of ear plugs because the noise from the train station is so loud you can feel the sound of the train station like it’s under your bed.\n\nBetween the sauna that was our room and the noise, I had the worst sleep of my life.\n\nsegue- there is a lovely jazz bar called the library at the bottom of the hotel. Perhaps  had I spent a little more time there, I could have gotten drunk enough to maybe sleep… on the other hand, I can’t even imagine waking up with a hangover to the sound of trains screeching.\n\nThat being said, the location was fantastic for exploring the city.  Espresso house on the bottom floor.",
            "time": 1725117754,
            "translated": false
        },
        {
            "author_name": "Nuri Mehmet Gokhan",
            "author_url": "https://www.google.com/maps/contrib/101235778368759828331/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV8NYzW6rM1upqcMiPmVvjthCJ6UzvpUPCzbxDEyZd7ULEfXFY4kA=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 4,
            "relative_time_description": "3 months ago",
            "text": "We had an interesting experience in this hotel. Our first room at the top floor looked and felt great but A/C didn't work, and floor heating was on, could not be turned off. It was not a great experience. However, after moving to another room at lower floors, it is definitely a great hotel. Location is perfect, right next to the train station, Tivoli Gardens, and just a 10-minute walk from city center and canals.\nGood breakfast offerings but also lots of alternatives right outside. Historical building but nicely renovated, for most of the floors.",
            "time": 1723333111,
            "translated": false
        },
        {
            "author_name": "MaryJane Ewing",
            "author_url": "https://www.google.com/maps/contrib/114570789967862108411/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVAGy7k5ZKz5VgwJBOLqf2bINiyRC0R1Zhgsd0-Y3EzFI33URtKmA=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 2,
            "relative_time_description": "5 months ago",
            "text": "Cleaning staff is great. Front desk is not staffed adequately to help with issues. Make sure your room air conditioning works! Noise level depends on which side of the hall. Street side we could see fireworks on the weekend! And if you want to exercise, weights in the room. Towels, beds, amenities were all proper.\nLibrary Bar is lovely.\nWine at the restaurant was very good and appreciated attentive service there. Did not eat there but saw the next table and pizza, salad, and pasta all looked good.\nVery convenient to train station and Tivoli. Walked easily to other locations.",
            "time": 1719405565,
            "translated": false
        },
        {
            "author_name": "Hannah Wilson",
            "author_url": "https://www.google.com/maps/contrib/118001664557587627722/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU1D0Qg3QnArFoyGc29AcZqXzd68PqfAz7YyYfEFKGVG1XAH6IH=s128-c0x00000000-cc-rp-mo",
            "rating": 2,
            "relative_time_description": "a month ago",
            "text": "Overall disappointed. The first thing I noticed was the dinginess of the room. It smelled like bleach and there was what looked like mold all over the bathroom walls and tile grout. The mattresses were extremely firm and uneven which made it hard to sleep comfortably - in fact I woke up with a hip and shoulder ache. Bedding felt very clean and fresh though, so that’s one plus. WiFi seemed to be super restricted, many basic websites wouldn’t load at all and services were not available (example: clash of clans game app).\n\nStaff was very pleasant and the library bar downstairs is lovely. Location is convenient in the sense that it’s a short walk to central station and Tivoli, but that also comes with lots of loud car noises.\n\nWould not stay here again.",
            "time": 1730360273,
            "translated": false
        }
    ]
}