{
    "name": "Generator Copenhagen",
    "rating": 4.1,
    "reviews": [
        {
            "author_name": "Ana Carolina Borges de Broetz",
            "author_url": "https://www.google.com/maps/contrib/114688670938333104456/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI34NMNXRMHbsFSVFYMefSNcUJLWuT24qFecT6Xw3cruKUk1w=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "2 weeks ago",
            "text": "We stayed there for one night and booked two rooms with two single beds each. The rooms were very clean and nicely decorated. Overall, we were impressed with the hostel – the decor is creative and appealing, and they offer many leisure activities like a pool table, a foosball table, and several other games.\n\nThe staff at the reception and in the bar were all very friendly and attentive. I’d especially like to highlight Gabriel, a Brazilian at the bar, who was particularly friendly and attentive.\n\nThe only downside is the prices at the bar, which I found to be too high – especially considering that the clientele is mostly young. I personally found it excessive to pay almost 40€ for a simple bottle of wine.\n\nI also found it a bit disappointing that after 11 PM you can no longer play pool because the bar closes, and you can’t stay there either. Since you’re out exploring the city all day, you usually return to the hostel late, and it’s nice to have a chance to play and have a drink.\n\nNevertheless, if I return to Copenhagen, I would definitely stay there again. Highly recommended!",
            "time": 1732045185,
            "translated": false
        },
        {
            "author_name": "Patrick Duryea",
            "author_url": "https://www.google.com/maps/contrib/109225751940476661024/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJKLN2whkV76I2lnI_IPRawRPGVmZpJYsorhT8W1hGfkEA1XA=s128-c0x00000000-cc-rp-mo",
            "rating": 4,
            "relative_time_description": "in the last week",
            "text": "This is a hostel AND hotel geared towards younger crowds. The bar and games are great but if you want to go to bed early on the weekends it is loud even on 6th floor. If you like to party you will love it here. Location and staff were solid—for the price. Room got the job done but a bit small and beat up.",
            "time": 1732916837,
            "translated": false
        },
        {
            "author_name": "ibrahim türker",
            "author_url": "https://www.google.com/maps/contrib/117924186216514896929/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXrBKEQe8lYQ43ZvHGY70e77QqBaqxPAUsZ6kv8K43EyBUbTwg=s128-c0x00000000-cc-rp-mo",
            "rating": 2,
            "relative_time_description": "2 months ago",
            "text": "There is no air conditioning in the private rooms with double beds. If you close the window, you won’t be able to sleep because of the heat. If you open it, you won’t be able to sleep due to the street noise. We knew it was a budget hotel, but we didn’t expect such poor conditions. There were not enough elevators for hundreds of guests, staff, and cleaners to use. If you’re staying on the sixth floor, you’ll have to wait several minutes just to leave the hotel or get back to your room. All of this might still be acceptable since we were only staying for two nights, but I want to share the main issue that disturbed us. On the last night of our vacation, we were waiting in the lobby for our flight. Unfortunately, our flight was canceled, and we had to sleep somewhere until morning. Despite having available rooms, they charged us nearly double for a room from 2 a.m. to 10 a.m. Since we couldn’t find another hotel at that hour, we had no choice but to accept. From their perspective, perhaps we should have been grateful to find a room, but to us, this was nothing more than taking advantage of their own guests. We wish we had stayed somewhere else; there were much better places in the city for the same price.",
            "time": 1725956162,
            "translated": false
        },
        {
            "author_name": "Damien Smith",
            "author_url": "https://www.google.com/maps/contrib/102532743857255353039/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIuoMqvVyYp2NAREsINDNucyjlMmeL_uguvJx2yZZEBCVS8aw=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 3,
            "relative_time_description": "2 months ago",
            "text": "This is a backpackers first and foremost. The staff were all super friendly and helpful. The online check in and pit facility is helpful. The room was small, we had a self contained room on the sixth floor. There are a lot of people partying in the street lot which can be pretty loins at times. The location of the place is really central to everything and everywhere in Copenhagen. They have a cool bar on the 1st floor.",
            "time": 1727498620,
            "translated": false
        },
        {
            "author_name": "Giovanni Tesoriero",
            "author_url": "https://www.google.com/maps/contrib/115666652798061998925/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLPvUIfOWBKjDzM5HgTtiyNzEjfqWX7vSgfBz3Nt0z6KHEa-Q=s128-c0x00000000-cc-rp-mo",
            "rating": 3,
            "relative_time_description": "a month ago",
            "text": "Nice hotel, amazing staff and good location. Cozy atmosphere during the weekend, too. However, rooms and bathrooms are not the most comfortable (considering the price), but they're ok. The bar is not that cheap either, and lockers for the luggage are not for free.",
            "time": 1728671574,
            "translated": false
        }
    ]
}