{
    "name": "Axel Guldsmeden Hotels",
    "rating": 4.3,
    "reviews": [
        {
            "author_name": "Jennifer Toce",
            "author_url": "https://www.google.com/maps/contrib/112372005933623145276/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJJAfYnPgJGy2ktvXUdXyhU7XETX3amTQqqEL-iGEGkSGuiGg=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 5,
            "relative_time_description": "in the last week",
            "text": "My stay at Axel Guldsmeden was really lovely. I booked a spa package which included daily use of the spa and gym as well as the breakfast buffet. When I travel, I never choose the hotel breakfast but in this case, I'm so glad I did. The breakfasts were top-notch!\nSpa was lovely and never too busy. I booked a double room and found it to be comfortable and spacious. For folks used to a large bathroom, be warned, the bathroom was small, but I did not find it to be a problem. Hotel location was extremely convenient to Central Station and taking the train from the airport and then walking with luggage could not have been simpler. Without a doubt, I would absolutely stay in this Hotel again.",
            "time": 1732969864,
            "translated": false
        },
        {
            "author_name": "Kathy Weston",
            "author_url": "https://www.google.com/maps/contrib/107545136887573333729/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ7fRmZJEL5YyN7-pg5lBPPBrPoS3XAqgEjs6IMvKMEA8LrGg=s128-c0x00000000-cc-rp-mo",
            "rating": 4,
            "relative_time_description": "a week ago",
            "text": "Lovely hotel, really nice staff and ambience, and a good (although VERY expensive!) breakfast. I’d definitely come again but there were two things to fix. The room was nice and the bed comfortable, but it was really dark! I couldn’t read or work effectively at the desk as there was no desk lamp and the room lighting wasn't adequate. And the shower had sacrificed utility for style - you had to crouch or sit in the bath to wash, which is just silly.",
            "time": 1732527934,
            "translated": false
        },
        {
            "author_name": "Colin Barry",
            "author_url": "https://www.google.com/maps/contrib/116151677764255463821/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKg3FuDOHQ1CZxkwR-PgyUebih8YDqOaTmSKeAl2s84wdb-Og=s128-c0x00000000-cc-rp-mo",
            "rating": 4,
            "relative_time_description": "a month ago",
            "text": "Nice hotel, warm and friendly staff! Lovely cabin style room with super comfortable bed. Location great, 10-20 min walk to all museums. Maybe they can improve the basement spa level, as you have to walk through the laundry room before entering which isn’t a good look! Gym was nice but always occupied as it fits only two people, they should have bookings for 40 min sessions. Breakfast was amazing!! Spa sauna hot tub really nice for a city centre hotel.",
            "time": 1729150268,
            "translated": false
        },
        {
            "author_name": "Pauline",
            "author_url": "https://www.google.com/maps/contrib/113001026900303950461/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUtvm7j91IkZ9oBrYuLCqUY13xoGX0YxOnrFgN3DwvFTiDO6U4=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "2 weeks ago",
            "text": "This is the coziest hotel I‘ve ever been at! Although I had the smallest room category it felt spacious and not at all cramped. The bed was really comfortable and the bathroom had everything one might need and so much more. Also: The location is literally perfect, just a 4 minute walk to the main station and just a little more to the Tivoli, and the streets were actually rather quiet. 10/10 experience, I hope to return one day!",
            "time": 1732193402,
            "translated": false
        },
        {
            "author_name": "Jacob Crittenden",
            "author_url": "https://www.google.com/maps/contrib/110503500734120815430/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLUgi0xP4vqOO1qOW3-nw33lMFLlXIGjh6yYNovhmPuK_71HA=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "in the last week",
            "text": "Great room, nice amenities, well located for public transportation.  We really enjoyed our stay.  Spa looked nice, but we did not find any time to spend I. It as our stay was short.  Weight room was a little cramped.  We will definitely stay here again when we return for a longer visit!",
            "time": 1733147294,
            "translated": false
        }
    ]
}