{
    "name": "Hotel SKT. Annæ ApS",
    "rating": 4.3,
    "reviews": [
        {
            "author_name": "Theo Frot",
            "author_url": "https://www.google.com/maps/contrib/111881217917269163329/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUTMZngFPjqd1LEIF9K4AuCuAdJ7sNbYLGJKkaXE9Lo6YuQhoo=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "in the last week",
            "text": "Great hotel to stay for a family trip to discover Copenhagen.\nStaff was universally friendly and ensured we were well taken care of. We had some booking issues so Caroline went above & beyond to fix the situation.\nThe hotel location is ideal to reach most of the Copenhagen landmarks within 20min walk.\nWe highly recommend renting an apartment if you come with family. Most rooms in the main hotel are for 1 or 2 people only due to their size.\nDon't hesitate to go to the top floor terrace after dusk to enjoy beautiful city views.",
            "time": 1732896057,
            "translated": false
        },
        {
            "author_name": "V C",
            "author_url": "https://www.google.com/maps/contrib/103147419356842045253/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLLaXh7414ZnJ7FCmMmEHL_Fux4hvxb63NHtC7osb84TgpFgUo=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "3 weeks ago",
            "text": "I stayed at this hotel for 4 days and overall had a decent experience. The hotel is in a fantastic location, making it convenient for sightseeing and getting around. The property is new, and the decor is beautifully done, creating a modern and inviting atmosphere.\n\nHowever, the staff was a bit disappointing. Most of them were rather rude and unhelpful, with the exception of the Indian lady who was very kind and went out of her way to assist us.\n\nThe rooms were very nice and clean, but quite small. For the price, I was expecting a little more space. One thing I found lacking was the absence of a bottle of water or milk for the coffee in the room—small details like these would have made a big difference in the overall experience.\n\nIn conclusion, while the hotel has a lot going for it in terms of location and design, the customer service and room amenities could definitely be improved.",
            "time": 1731320032,
            "translated": false
        },
        {
            "author_name": "Savannah Montgomery",
            "author_url": "https://www.google.com/maps/contrib/113423533459514783828/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXDyF2vPTNlx7F8R60_uDn8sxQwuyb4U00-pNXh2hVNqz70Uxil-w=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "4 months ago",
            "text": "My partner and I loved staying here! The location was great, by the touristy stuff but not too crowded, with lots of cool stuff in reach. The rooms are well designed and very thoughtful. (And very Danish.) The general design of the hotel is stunning. The staff were very kind and we had zero problems. Also, LOVE those gosh darn duvets. Felt like sleeping under a luxurious cloud.",
            "time": 1722459421,
            "translated": false
        },
        {
            "author_name": "L",
            "author_url": "https://www.google.com/maps/contrib/115517269483345971839/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLfD8V6UeDc0CeP-NdefQwSwrsOGXLLS-exivG5Iq6D06tJUA=s128-c0x00000000-cc-rp-mo",
            "rating": 1,
            "relative_time_description": "a month ago",
            "text": "We checked into hotel on Saturday, October 26, and we are scheduled to check out on Tuesday, October 29. We have a total of three rooms booked.\n\nOn the day we arrived, while two of our rooms were given with courtyard views and were more spacious, our room, despite booking at the same time, was located in what felt like a basement level. Our window faces a small gap between two buildings and is very dark. We requested a room change and were told, “We have one more room, but it’s right next to the restaurant, so it’s very noisy.” We agreed to stay in our current room. Due to the lack of ventilation in the room, I woke up with a stuffy nose every morning.\n\nWe went to sleep, and at 7:00 AM, construction noises started coming through the window. I am pregnant and came here for a restful and enjoyable holiday. In my condition, sleep is a major need. How can you rent out a room where construction noise begins at 7:00 AM? We paid the same as our friends in the other rooms, and we came here to REST as well. For two days now, I’ve had a headache from sleep deprivation in a hotel where we’re supposed to be able to relax. I feel like I’m on a survival camp, not on holiday. It’s impossible to sleep after 7:00 AM. As a pregnant woman, this has been a truly awful experience.\n\nI’ve recorded all the construction noise with timestamps. This was the worst hotel experience I have ever had.",
            "time": 1730205417,
            "translated": false
        },
        {
            "author_name": "Conor Randolph",
            "author_url": "https://www.google.com/maps/contrib/116582542024553303370/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVrs0xvZgqbdjvMF-BwNS_xLn31Po7EDlHFr1Y_Gf1glKO4BQ=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "4 months ago",
            "text": "Brilliant mid week stay. Modern, compact but stylish room had everything you need for comfort. The hotel itself is extremely quiet and peaceful, full control of room temperature and comfortable bedding. The hotel is in a busy part of town, very short walk to the waterway and surrounding cafes, restaurants and bars. I read that the Danish are some of the happiest people on earth and fully understood why the minute I arrived.",
            "time": 1722684251,
            "translated": false
        }
    ]
}