{
    "name": "Hotel Astoria, BW Signature Collection",
    "rating": 3.8,
    "reviews": [
        {
            "author_name": "Dušica Milinković",
            "author_url": "https://www.google.com/maps/contrib/106044398378302496657/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWox0VFTXR3UajMqx_mSF8dQbbZTJuT8vH6YtRzjWMfy-zNRoAk=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "2 weeks ago",
            "text": "Room with view on the train station is a little bit noisy in the morning, but location of the hotel is perfect.\nBreakfast is great, the services are very polite.",
            "time": 1732137661,
            "translated": false
        },
        {
            "author_name": "Craig Lewis",
            "author_url": "https://www.google.com/maps/contrib/104334085549074962703/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXpBEv2nooBmx7v8CC0HqI5hWaQhgT4NgTh_2f_eVwBOO8cwLuy=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "Yes, it's old, and worn, but for a hotel literally just out the front door of the train station, it's pretty cool.  They run it well enough, the breakfast is excellent, and the rooms and beds are adequate.  An extra star to rebut the people bagging on them because they have chosen to save the period decor!  If you can get rooms on the 3rd floor, do; they're set back from the edge which I expect quiets the noise.",
            "time": 1728340281,
            "translated": false
        },
        {
            "author_name": "Jose Ramil Padere Carillo",
            "author_url": "https://www.google.com/maps/contrib/101524236199881231763/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWsVjROIwjVvB3KCswCvFBEMOJxENKwsvAYh1966NiHc3lEo5qu=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 4,
            "relative_time_description": "a week ago",
            "text": "A bit old hotel but still very comfy and is just in the heart of Copenhagen very near to the Metro Central Station. Just bring your own slippers and toothbrush/paste coz they dont have it.",
            "time": 1732793206,
            "translated": false
        },
        {
            "author_name": "Tim Oosterwijk",
            "author_url": "https://www.google.com/maps/contrib/111436150611764868776/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUEIgEvesO0lQTgOrGQaqpWPOx8__ykeJ1c58Uy84og5lV_U0xz=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 3,
            "relative_time_description": "5 months ago",
            "text": "This is a difficult hotel to rate. If I would have received this quality for this price in another place, I would be extremely disappointed. However, compared to other hotels in Copenhagen, it is apparently not so bad.\n\nThe room is much smaller than what I am used to. The curtain does not 100% close, which is also true for the shower curtain in the small bathroom. It's a bit noisy. It's far more expensive than I usually pay in a hotel though - but when I heard colleagues about what they paid for their hotel in Copenhagen and what quality they got back, this hotel is very reasonable.\n\nThe location is superb at a 1-minute walk from the central train station. The breakfast is fine. There is something that resembles scrambled eggs, but there's only bacon one day a week. There are boiled eggs, but only soft boiled. There is yoghurt, but only plain. There are cucumbers and tomatoes and such things, but no oil. The bread, cereal and fruit are nice, as are the pancakes.\n\nYou need to ask one day in advance to get your room cleaned, which is fine, but then somehow it didn't happen. When I notified the reception, they were very sorry, came to my room personally to give me new towels, and the room was cleaned the next day, so that was handled very well. The reception staff is very friendly and they do their best to accommodate you.\n\nAll in all, I paid much more than I usually do, for a much lower quality. But other hotels in Copenhagen seem to be even more expensive, or lower quality. This, I think, is a borderline 3-star hotel. Let me therefore give it 3 stars.",
            "time": 1720246475,
            "translated": false
        },
        {
            "author_name": "Peter Hartin",
            "author_url": "https://www.google.com/maps/contrib/100464255056851194147/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWyPrPQYSdrJEdXh0bTgQ1HBZycEwJZX8lohrJYQZR7VskxdFp8Rw=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "I chose to stay at this hotel on my first trip to Copenhagen. I was looking for convenience of being close to Tivoli Gardens, the train station, and similar. I could’ve easily chosen a modernized traditional hotel, but I wanted a more immersive experience and the history in this hotel alone is so charming. The rooms while they don’t have air conditioning offer fans in the room to cool you down, and if you have the Family Room like I booked, you can easily open the balcony doors all the way and get in a very nice breeze. I really enjoyed the layout and decor of the hotel, as well as how they still try to stay true to its original history where possible. The breakfast each morning was so fresh and delicious to experience a more European style breakfast.\n\nOutside of the hotel, I must also mention the entire staff at this hotel are all so friendly and welcoming. I reached out to them in advance via email communication to get recommendations on restaurants to dine at while in Copenhagen and Beda, the Service Manager, was a huge help with recommending a few restaurants (Frk Barners Kælder, Skagen Illum, and KØD to name a few) were all wonderful restaurants featuring cuisines for all tastes. Beda happened to be the one who checked me in and whom I departed the hotel with on my last day as well. I was thankful to be able to leave them with a large box of extra pastries from my pastry making class nearby that I took where I couldn’t imagine eating them all myself in the 24 hour limit and having worked in the hotel industry myself gave the box to the staff to enjoy. Another morning I mistook the breakfast start time from weekend/weekday and I arrived earlier, and the gentleman working that morning was kind enough to send me on my way with a breakfast box to go.\n\nA brief summary of my review is it’s a great hotel, centrally located, that while it lacks air conditioning which is not common in Europe to begin with (I’ve been used to this before), they make up for that in their amazing staff and their beautiful old world charm. Definitely look up this hotel next time you travel!",
            "time": 1724881413,
            "translated": false
        }
    ]
}