{
    "name": "Scandic Copenhagen",
    "rating": 4,
    "reviews": [
        {
            "author_name": "Jules TABURIAU",
            "author_url": "https://www.google.com/maps/contrib/111497323947101190640/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX6myDD6wNCGOmrPzyAMcJaKTZpIUFS6KrnitsJrdAyktvbL7d8=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "The rooms are clean and exactly as described in the listings, and the bathroom is excellent. The service is impeccable, late at night I requested an extra blanket, and it arrived within five minutes. The breakfast is delicious, and the location is fantastic. It’s perfect for grabbing a drink in the city center, which is just a short walk away.",
            "time": 1728481249,
            "translated": false
        },
        {
            "author_name": "Bhishma Desai",
            "author_url": "https://www.google.com/maps/contrib/110993592571456439553/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU72rfdrH9zUG4lsJWhHBm7tzqzHg5TA6g-5lT8xQjmT_iSALEhVw=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 4,
            "relative_time_description": "2 months ago",
            "text": "Good room for the location. The queen bed was nice and the room had a view of the lake. Centrally located to train stations and bus stops. The included breakfast is good too. It’s a good room for 2-3 nights.",
            "time": 1727596717,
            "translated": false
        },
        {
            "author_name": "Silvia",
            "author_url": "https://www.google.com/maps/contrib/100919180635320606730/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW1Hw9cha7qK0FzQYpXbEIHI_9Wmbs_TegMuXJT0CzKz2-Gz9Q=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 3,
            "relative_time_description": "a month ago",
            "text": "The hotel looks nice from the outside. Inside is also quite nice. To be able to go up the room you need to have a card that would be your key and also activate the lift. That gave me a sudden problem as I was going up the room with my son rushing to the toilet and the card wouldn't work in the lift ( I still prefer the old keys 😭).\nThe room were fairly clean, the temperature was ok but during the night we felt quite hot at some point for then feeling ok again without touching the temperature. There's no fridge.\nThey don't come to clean the room unless you ask to. I have asked one night after. When we went back to the room we had two shower towels instead of 4 and the boxes of pizza we had the night before were still there. Strange cleaning.\nWhen we left there was a bit of miscommunication with leaving the suitcase in their storage room. I had to ask for a ticket to make sure no one would take my luggage. I was expecting them to offer the ticket instead of me asking. And when I went back to collect they only opened the room and didn't check the ticket. Thanks God the suitcase was still there.\nExcellent breakfast.\nI have asked for an espresso at the bar, more than £4, and I had two drinks, one non alcoholic, the other just a juice with a pack of crisps and some coated peanuts, I paid about £23. Prices unfortunately are high, but as everywhere in Copenhagen.\nWe were four of us, we had a bed which was very comfortable and a sofa bed which unfortunately was very noisy and uncomfortable. I slept with my little son and every time I was getting out to go to the toilet he would move or wake up.\nIf I would recommend I am not sure, probably so overall but next time we will be there I will ask my husband to possibly try somewhere else.",
            "time": 1730070671,
            "translated": false
        },
        {
            "author_name": "Gönül Aziz-Saltnes",
            "author_url": "https://www.google.com/maps/contrib/117136671155261083413/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJDC9-MD-1GzPSKw2xIBQc1iXhHOe5irPuddZq7JbxtREB8FA=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 1,
            "relative_time_description": "3 months ago",
            "text": "Really regret our choice. We have been to Copenhagen before and this time the hotels we stay in was full so ended up here!\nFor a vegetarian in the group and one that doesn’t eat pork it was barely anything else then bread and chia for breakfast. So many stations - yes- but the same options. Looks like a factory breakfast. The cantina in the schools are more cozy and more options. Even if we had to order the cleaning service the day before they didn’t  came. Telling the reception they said that it hadn’t gone through and neither the one for the next day. No fridge in the rooms, over mattress with blood stain, ventilation with black dust/mold. Smelly rooms. Old and worn out. I would guess a 2 or 3 star hotel standard.",
            "time": 1723543986,
            "translated": false
        },
        {
            "author_name": "Anup Sam",
            "author_url": "https://www.google.com/maps/contrib/107812929800721086389/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWm0xDL_PtWH7NeBg9QeWykcrclrI8V7dWJKN5OGL8BfJ1zQQeP=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 4,
            "relative_time_description": "a month ago",
            "text": "Scandic is centrally located.. There rooms are extremely small even by European standards . The rooms are well maintained.. If you are checking in late please keep in mind that the kitchen closes by 10.30pm..",
            "time": 1728628372,
            "translated": false
        }
    ]
}