{
    "name": "Scandic Palace Hotel",
    "rating": 4.1,
    "reviews": [
        {
            "author_name": "Louis Mackenzie-Smith",
            "author_url": "https://www.google.com/maps/contrib/104352943110826949652/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVqmXz5TVIndNlO6-KUrHkVqI7Hp03G8MEuBc39lN7Ke6Trp0X7=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "4 weeks ago",
            "text": "We stayed here 5 nights, and we got married in the Town Hall across the street :)\nThe location is absolutely unbeatable - you cross one quiet road and you get the Town Hall - so if you are in a wedding dress / suit it's super easy! The staff there are also so nice and supportive - it was really lovely.\nThe breakfast is a MUST TRY. It's absolutely delicious and full of freshly homemade stuff, and the room is very nice where you eat. Seriously recommend getting the breakfast too.\nThe hotel and rooms are very grand, and a touch older, so keep that in mind I suppose. But I really recommend this one. I also recommend getting married in Denmark :)",
            "time": 1730896564,
            "translated": false
        },
        {
            "author_name": "Reddy Jane",
            "author_url": "https://www.google.com/maps/contrib/110286770703595442089/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLFXi6_A04_hqm-puHfuqHEqrbVZsGzeqsGUzC__gdE746qjw=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "The Scandic Palace Hotel in Denmark is an excellent choice for travelers looking for a strategic location. Situated near the bustling Long Street market, you'll have easy access to a variety of shops, restaurants, and local food options. The hotel is also conveniently located near the train station, making it easy to explore the city and beyond.",
            "time": 1730475515,
            "translated": false
        },
        {
            "author_name": "Josephin Galla",
            "author_url": "https://www.google.com/maps/contrib/101261337810483860423/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWm0ykGWQ8vRdeUItdiCFE912cw_6G7N5im9bX-ErERMaVxJ-QY=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 4,
            "relative_time_description": "3 months ago",
            "text": "The hotel is the absolute center of- there is no better location for any activity than being g in this hotel. It give a little worn down vibe in the lobby and with some of the furniture inside the rooms - I am sure that can be easily fixed. Staff was throughout friendly, helpful and professional. We didn’t try the breakfast - so we can not comment on that. We would absolutely stay here again - mainly for the location - you can literally walk to any good restaurant in the city center.",
            "time": 1723285794,
            "translated": false
        },
        {
            "author_name": "Jamie Kuratek",
            "author_url": "https://www.google.com/maps/contrib/118044365395743286443/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW2PZMns0U5VyAs4ToKIr3CeA6xGyvOUwz98q-BrKTf4_bTaiZNDw=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 3,
            "relative_time_description": "4 months ago",
            "text": "The location is excellent and the breakfast delicious. Unfortunately, it appears a lack of investment has left the facilities in disrepair. The air conditioning was not working and only one elevator was running. Water was cut off at night, and my room had no hot water for one day. The final morning, there was ONLY hot water. This is a beautiful and historic building that needs investment from Scandic to reach its potential.",
            "time": 1721377096,
            "translated": false
        },
        {
            "author_name": "David Hong",
            "author_url": "https://www.google.com/maps/contrib/112866363156274159086/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW_U96_QxF_6t7rInkDw007JTHZuvBzlHLnaJCRzgvyX7budb12yg=s128-c0x00000000-cc-rp-mo-ba6",
            "rating": 3,
            "relative_time_description": "3 months ago",
            "text": "Decent hotel in a nice location by tivoli Gardens and central station. The location is great. The breakfast is amazing. The service is OK\nRooms are a bit small. The AC is outdated. The views are bad unless you get an upgrade. The gym is tiny. Also you might hear fireworks from tivoli or just drunk people outside.\n\nOverall good hotel but for the price I was expecting a bit better.",
            "time": 1725219708,
            "translated": false
        }
    ]
}