{
    "name": "Comfort Hotel Vesterbro",
    "rating": 4,
    "reviews": [
        {
            "author_name": "awl4",
            "author_url": "https://www.google.com/maps/contrib/101621291514468718795/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKeEmfmaR1mzMtpaBwsZ5uxrC5jty7LfnT6HWp8V3_gUwkNgA=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "THIS HOTEL IS GREAT FOR LONG STAYS.\nI came to Copenhagen for a two week period for work, and from the first minute on staff were extremely welcoming and helpful.\nThe breakfast set up is great (can get very busy at some times, but a lot of space), nice small gym, washing machine service which is affordable (as opposed to other hotels), and the rooms are great.\n\nThe only downside is that the replacement of toiletries is down to the tenant and not room service. Therefore when your soap and shampoo are finished, you have to go to reception, pick up some bottles and replenish the dispenser yourself. Very minimal detail though that didn’t affect our experience at all",
            "time": 1729621030,
            "translated": false
        },
        {
            "author_name": "Jan Bradley",
            "author_url": "https://www.google.com/maps/contrib/100951879030449926759/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKaPa6Wiv7iUQiMLqI3gB6-w2V1kjC6YGc7r4EXqXFSfRp-LQ=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 4,
            "relative_time_description": "2 months ago",
            "text": "We stayed one night before joining our cruise ship.\nCheck-in was efficient and friendly.  The room was clean, and the bed was very comfortable.\nWe wished there was tea/coffee making available in our room.\nBreakfast was amazing.  The variety, quality and quantity of food was excellent.\nCan recommend this hotel.",
            "time": 1725954568,
            "translated": false
        },
        {
            "author_name": "Madison Dautle",
            "author_url": "https://www.google.com/maps/contrib/109926757015250597300/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIerjte_JHblYwI-cQWo6MlEm8VVBZP7sUIitNHCKHX8Oe1Lg=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "Super close to Copenhagen central station!! My boyfriend and I were there on vacation using the Copenhagen card for all the museums and transit. It was so easy to get everywhere, both in the city and outside of it.\n\nThe hotel is clean and generally quiet. Breakfast is included, but get there before 9am if you want a seat! The AC doesn't work super well, but that's minor because most of the time you don't need it. Would definitely stay here again!",
            "time": 1725208845,
            "translated": false
        },
        {
            "author_name": "Richard Jacques",
            "author_url": "https://www.google.com/maps/contrib/118346002912113349700/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIoWyWLKU98rgHYxgdg0ESOh7II5o-VbRAaM_Pbd9NVNjc2VA=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "I stayed here when attending a conference at the Bella Centre. It's a great central location close to multiple options for public transport and a short walk to some of the tourist parts of Copenhagen. The price was very reasonable with clean rooms and all the amenities I needed. Breakfast was included in the price with a good selection of food. I would stay here again.",
            "time": 1729069036,
            "translated": false
        },
        {
            "author_name": "Gracie Gralike",
            "author_url": "https://www.google.com/maps/contrib/100679890817855489296/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUgUrKYnxyrGdiAnXJDpoG4-3DfCGyDveVDbAvtQbds3qaemm4L=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 3,
            "relative_time_description": "3 months ago",
            "text": "Location is awesome, but rooms left a lot to be desired. Honestly felt more like a hostel stay versus a hotel stay. Beds weren’t the best and only 1 pillow is provided. AC does not work at all, so beware if you are coming in the hot summer months. Was hard to sleep as I don’t like to sleep when I am hot. Shower got water everywhere when used. Window opened, but was broken so it would not stay in place and flapped with the wind. I loved how close the hotel was to the central station. The staff I interacted with were always pleasant. Also I should note that the hotel did listen to my requests and gave me a very quiet room. Overall an okay stay, wish the rooms were more comfortable.",
            "time": 1725346035,
            "translated": false
        }
    ]
}