{
    "name": "Maldron Hotel Parnell Square",
    "rating": 4.2,
    "reviews": [
        {
            "author_name": "Ekta Dade",
            "author_url": "https://www.google.com/maps/contrib/100649632737946290319/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUO7-Zz3_zzaU4TypEURSZpxUKDyxgFWESAheBrb-3ppujgrsrs=s128-c0x00000000-cc-rp-mo",
            "rating": 4,
            "relative_time_description": "a week ago",
            "text": "The hotel room was great, spacious and good amenities in room. The heating didn’t work as well as needed, as it was freezing.\nThe front desk staff, every single person we spoke to, (3-4 diff people) were all RUDE. No one was friendly, no one had a smile and everyone was very short and dry. For my first trip to Dublin, this was a turn off. But turned out it was not all of Dublin that’s like this, just the staff at this hotel.",
            "time": 1732798660,
            "translated": false
        },
        {
            "author_name": "Marcia Taylor",
            "author_url": "https://www.google.com/maps/contrib/113699014365498728267/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXZG9dr02VegcBWQdsMbU1O7OAaa56WxYrcIhRzPR2RKHfrZEhu=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "2 weeks ago",
            "text": "We LOVED staying at the Maldron on Parnell Square. Starting with the location, which was walking distance\nfrom many sites with historical and cultural importance. Our breakfasts there were feasts: whether you're looking for traditional European style breakfasts of good sliced meats, cheeses and vegetables and breads, to healthy cereals with choices of nuts, dried fruits, seeds and yogurt or milk. Of course Irish/English breakfasts with sausages, bacon, three styles of eggs, beans, roasted tomatoes are also present, with juices, croissants, pancakes and other options. The staff were wonderful, really helpful, professional and genuinely nice. Our room was clean, sufficiently large enough, with a great shower head and comfortable bed and plenty of storage options. We felt safe, secure and comfortable there. I would highly recommend the Maldron at Parnell Square.",
            "time": 1731692113,
            "translated": false
        },
        {
            "author_name": "Debbie Deehan",
            "author_url": "https://www.google.com/maps/contrib/113523862215905344728/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKqRSOHM4vw5pxM6xxaqN915df0ZiMBuYvLARZkU4KWMmTHjw=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "3 weeks ago",
            "text": "I had a very enjoyable stay.  The staff were excellent.  My room was clean, housekeeping was excellent except for a few times when the tea & coffee facilities were not replenished but this was no big deal.  The choices for breakfast were amazing!  Excellent gluten free options. The water refill station at reception is added value!  As is the snack machine, should you need a late night choccie bar 😁  Overall I had a great stay and hopefully will return in the near future.",
            "time": 1731035617,
            "translated": false
        },
        {
            "author_name": "issy rose",
            "author_url": "https://www.google.com/maps/contrib/108678405037823571527/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWD7xYSTBZRJyzWSpyrh7eFIPWS84zPUaUyFaH-rZCNFnhAArs=s128-c0x00000000-cc-rp-mo",
            "rating": 4,
            "relative_time_description": "3 weeks ago",
            "text": "Lovely hotel, staff are amazing and really helpful and rooms are nice. One thing is that our bathroom was quite outdated, our sink was leaking and pipe was obviously blocked as sink would fill up with water even when the plug wasn’t in, the shower door didn’t close properly (not sure if this is intentional) and the toilet seat was broken. The bedspread was slightly questionable as well.  The overall room was lovely though and the hotel itself is nice. I would bear in mind that there’s no drop off point round the hotel for if you’re getting a taxi to and from and will likely have to get out at their one way system traffic lights.",
            "time": 1731327761,
            "translated": false
        },
        {
            "author_name": "Joshua Schaule",
            "author_url": "https://www.google.com/maps/contrib/108057242791295813636/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLIYPGXF8y1GiS7Cv3rf75B6SAOWrPPZEca_PnT3Rbp0KBfDQ=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "First let me get the easy stuff out of the way. The hotel is beautiful! The breakfast is everything I would have wanted out of a true Irish breakfast (so filling and delicious). The room feels like a much more expensive room than what you pay for. And now the staff! The staff is very good at what they do and make you feel like the number one guest while providing this to all guest. There is one other person however, Jess at the bar/restaurant is the best of the best at this hotel! She went out of her way to not only make the experience exceptional but fun!!! I would personally come back just to have a conversation with Jess while enjoying a drink or dinner, she does her work while making you feel like she never left the conversation! Hats off to the hotel for acquiring staff like Jess!!!",
            "time": 1728251764,
            "translated": false
        }
    ]
}