{
    "name": "Camden Court Hotel",
    "rating": 4.4,
    "reviews": [
        {
            "author_name": "Deirdre Fitzpatrick",
            "author_url": "https://www.google.com/maps/contrib/105486427100022372742/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL591QEdGy7swqmNzZN85Y2xgUiDsxM4uUsrWLK-sJXg4nOZw=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "We had a great stay at Camden Court Hotel. The room was perfect, staff were lovely and service was great. The pool and jacuzzi etc open at 8am which was great for post marathon tired legs!\nA group of 20+ wanted to eat in the restaurant on Sunday evening without a reservation. The staff were extremely accommodating and managed to seat us together and provide a meal. It was fine with a very positive approach and much appreciated.\nGreat staff, great service, great location. Thank you!",
            "time": 1730150394,
            "translated": false
        },
        {
            "author_name": "Richard Topping",
            "author_url": "https://www.google.com/maps/contrib/100859428793579209583/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVhns7wTx_zHyrAsUfI1KBBgiyO2smh33nCYfhbvNFUP0VFuWNH=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "I recently stayed at the Camden Court Hotel in Dublin, and I couldn’t have been more impressed. The staff were incredibly welcoming and attentive, making my stay feel truly special from start to finish. The hotel’s location is ideal, with easy access to all the major attractions and transport links. My room was comfortable and well-appointed, and the quality of the breakfast was excellent, with a wide variety of delicious options to start the day.",
            "time": 1729494786,
            "translated": false
        },
        {
            "author_name": "Sally Macnamara",
            "author_url": "https://www.google.com/maps/contrib/102042040695775981643/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXeWsA2DBp7di4yV5hxgjan4zYzVOBdDX3CXo9p2d6seKvFTes=s128-c0x00000000-cc-rp-mo",
            "rating": 4,
            "relative_time_description": "a month ago",
            "text": "The staff and location were first rate! Front desk staff was always helpful. Rooms were very clean and neat. Could not regulate the heat and I was a bit cold. Also had a hard time getting in and out of the shower. But I was able to walk to most of the sites I wanted to see and had choices of coffee shops and cafes for meals.",
            "time": 1730065177,
            "translated": false
        },
        {
            "author_name": "Louise Dagg",
            "author_url": "https://www.google.com/maps/contrib/112014039845783022605/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXBVwS75qlPDGbeO0jOuNFnRsK17DgxSpJO4wpfkkAL4qMmJGzB=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "We stayed for 1 night, the staff from the moment we arrived were friendly and extremely helpful. Our room was ready on arrival,  and spotless. Had everything you would need and more for a night away. Breakfast was delicious. Fantastic location. Big Thank you to Stephen and Rebecca, who went above and beyond to make our stay memorable. Cant wait to return.",
            "time": 1730815883,
            "translated": false
        },
        {
            "author_name": "Caroline Egan",
            "author_url": "https://www.google.com/maps/contrib/118157889513669587517/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLAZZ5UATNmUBKlDetQcWQSO75VThVQ95KeYw4xtXVrtH_bZA=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "I was impressed with this hotel.  The majority of staff were courteous and friendly.\nThe room was ideal, very comfortable night's sleep, plenty of sockets and charging ports.  Loved the bathroom, and like the bedroom, it was spotlessly clean.\nWe were very happy to see a mini fridge in the room.\nThere was a fan provided if we were too hot, but we didn't need to use it.\nMade use of the pool, steam room and jacuzzi. The breakfast was exceptionally good.\nI would definitely book this hotel again, despite the one member of staff at reception in the evening who was very abrupt when I asked for water to take my medication. He said there were 2 complementary bottles of water in the room (these were gone - one was sparkling. He said I could either use the bathroom tap water, or buy water at the bar. Maybe that is the hotel policy, but he was quite condescending, all other staff in the bar, reception, housekeeping, etc. were very friendly and helpful.",
            "time": 1724435453,
            "translated": false
        }
    ]
}