{
    "name": "Maldron Hotel Smithfield",
    "rating": 4.2,
    "reviews": [
        {
            "author_name": "Viktorija Naughton",
            "author_url": "https://www.google.com/maps/contrib/106071975228721742393/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUg6vawBm8WFmJ2VF56ASaZ1lInYFSP24yA-tRWYphjrrOOdbQ-=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "Very clean and cozy hotel. Very central, but still in a quiet enough corner, no issues with outside noise. We booked executive king, wasn’t a big room but had a balcony and extra seating area, handy for working or just having tea/coffee comfortably.\nStorage just about enough. Bed was so comfortable, I always have problems adjusting to the new mattress, that wasn’t an issue at all, slept like a baby.\nRoom was very clean and equipped with all the essentials. The only minus was no extraction in the bathroom and no towel racks to dry them.\nDidn’t have breakfast there, but popped for dinner one of the nights. Service was absolutely impeccable and food was another lovely surprise. Chicken wings absolutely recommended! Fish and chips was the nicest I had in a while, batter light and super crispy, fish cooked to perfection, husband left delighted with his burger.\nOverall a great stay, perfect for business or leisure.",
            "time": 1727555189,
            "translated": false
        },
        {
            "author_name": "Nicky Hart",
            "author_url": "https://www.google.com/maps/contrib/111011324626614068295/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKLalBUWQJsA_q4eGaOXywzXUj5KeodCPiTzGqnwwv5gYxNXw=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a week ago",
            "text": "Pleasant stay.  Friendly knowledgeable staff no matter what time of day.  Room clean. Great breakfast, plenty of choice.\n\nOnly criticism the room could have been warmer especially this time of year.",
            "time": 1732562285,
            "translated": false
        },
        {
            "author_name": "Cassie Brown",
            "author_url": "https://www.google.com/maps/contrib/117755830105047859771/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXREofUzV6cxo0xgbNNJclxULinQPcg560PkrDoRn1PZhawqt5zJA=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "We had a nice family room that slept three adults and two teens. It was a decent size with a balcony. Beds were good, the area was quiet.\n\nThe hotel is located near a tram stop, and there were multiple places all of the row to grab a meal at. There was a small grocer nearby also, which was great for snacks and quick simple meals.\n\nVery pleasant stay and would book again.",
            "time": 1728232004,
            "translated": false
        },
        {
            "author_name": "I. N.",
            "author_url": "https://www.google.com/maps/contrib/116015608155461247758/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWd7oQPEJRA2oqIbri1oRxG25JkATIxNJceTYPs06WC9M9XHxml=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "Would recommend this hotel to anyone interested for a stay in Dublin. Well located, you have loads of restaurants and supermarkets a minute away. Jameson's distillery is just behind it.\nThe tram is only 2m away and many buses to go to the center are only 4m away from the hotel. Neighbourhood is super calm and far enough from the noise of the center.\n\nStaff is friendly, resourceful and helpful.\nRooms are clean and spacious. Love the fact that you can buy packages for various things like early check-in or late check-out.\nRestaurant is good and convenient.\nThanks a lot for my stay at your hotel, my parents were happy!",
            "time": 1729923430,
            "translated": false
        },
        {
            "author_name": "E D",
            "author_url": "https://www.google.com/maps/contrib/112339471392783058917/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKJ1Rv5E_cGaNLvjOKf0o4ERpggA8caZmLPXq3wf6wsB1dGWxE=s128-c0x00000000-cc-rp-mo",
            "rating": 2,
            "relative_time_description": "3 months ago",
            "text": "Stayed here for four nights and left feeling quite disappointed. Price was €1.6k for a “deluxe triple room” which was small for three persons and felt like a total ripoff. The only way to enter the hotel is through a small revolving door which you would need to push manually which is ridiculous for a four star hotel. The room had an air conditioning system which barely works and there was no mini fridge and no balcony which is a let down. However, the beds were very comfortable and the housekeeping staff did a good job cleaning the room.\n\nThe breakfast had little variety and the scrambled eggs were tasteless. However the cakes and pastries were excellent. Restaurant staff were nice and hospitable. However, during one night the receptionists were being obnoxiously loud and disruptive. They left the reception area to go chat very loudly with the bar staff, even yawning loudly, which was not professional at all and is unacceptable for a four star hotel.\n\nLocation is great as it is an approx. 20 minute walk to the centre and roughly 30 minutes to Croke Park which is always hosting various events. However, I cannot say that I would recommend this hotel to my friends and family as it’s simply not worth the price. Some of the reception staff need some proper training as they appear to be confused most of the time.",
            "time": 1725110978,
            "translated": false
        }
    ]
}