{
    "name": "Bonnington Dublin - 4 Star Hotel",
    "rating": 3.8,
    "reviews": [
        {
            "author_name": "Elaine",
            "author_url": "https://www.google.com/maps/contrib/104842684431248097950/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI9x7g50_fEJDKBYMNK7RS3Qg1hb06-D2lWrbUWOOmEa9zRQHo=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 4,
            "relative_time_description": "2 weeks ago",
            "text": "Lovely hotel, comfortable beds, both restaurants were lovely and the food was great. Only downfall was the male staff at the reception of the leisure centre asking me to prove I was a guest in the hotel. In all the years I am going to hotels I was never once asked for more than my room number at the leisure centre. I wouldn't be so irritated by it if he actually asked nicely and approached me as a guest to the premises and not a criminal. Also the beauty rooms don't have anyone in there, you must book in advance.",
            "time": 1732134489,
            "translated": false
        },
        {
            "author_name": "Rich Petrelli",
            "author_url": "https://www.google.com/maps/contrib/117786282244854037558/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXWKV_RzxMUF_5IHuk0HE8sFnJIaRiR0M4BxovA55lJnjumWm55RA=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 3,
            "relative_time_description": "a month ago",
            "text": "Very nice staff at the front desk. The room was nice and roomy however we had the AC as low as it would go and the room was still hot.\n\nThere is no fridge in the room, being from the US I am unsure if that is the norm for Dublin hotels or not.\n\nAs far as the food goes, the waiter we had was very nice.\n\nWe both ordered the Pork Belly and were a bit disappointed with the quality of the meat and the sauce.\n\nThe pork belly is prepared with a sweet sauce that is cooked into the skin. The skin was very tough and we needed steak knives to cut through it (we were initially given butter knives which were definitely not up to the task).\n\nThe skin was very tough and chewy. The combination of the sweet sticky sauce and tough skin leads to every bite sticking to one’s teeth in an annoying sort of way. It was probably the toughest pork belly I have had in quite some time. We would not order it again.\n\nThe meal presentation was nice and the vegetables were cooked perfectly. Do yourself a favor and skip the pork belly though and choose something else or bring a water pic for your post meal activity!",
            "time": 1728648429,
            "translated": false
        },
        {
            "author_name": "TJ N",
            "author_url": "https://www.google.com/maps/contrib/108425100548709739576/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW-QIgQv9u9I_Hrh9YTasMaFYNrSx04n3qvLR0riZWCfh809UCb=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 4,
            "relative_time_description": "in the last week",
            "text": "A lovely hotel, it's not looking great from the outside.. it really needs a face-lift BUT inside is lovely. Had a lovely stay. Easy access to bus route including the airport.",
            "time": 1733139529,
            "translated": false
        },
        {
            "author_name": "Mary Colyer",
            "author_url": "https://www.google.com/maps/contrib/113798889818325432415/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKHV8QjsDYLjAcfdc9l1zNCr6qc-9CZHdecnUqbMfl5NrTymg=s128-c0x00000000-cc-rp-mo",
            "rating": 1,
            "relative_time_description": "2 weeks ago",
            "text": "A dismal stay in a room with no heating, when the outside temperature was 7 degrees, and a shower with water just slightly above cold. I was literally shivering, with teeth chattering. Four trips to reception and numerous delays resulted in a heater that made little impact on the room, and numerous promises of a visit from maintenance to fix radiator that never materialised. Plenty of opportunity for hotel to rectify the situation, but clearly not bothered. Initially, I was told the heating didn't come on until 6pm, but I met another guest from a nearby room and his heating had been on since his 3pm check in. I felt they were telling me anything just to stall me until I checked out. We had to wear our coats in bed, and had a very restless night's sleep. The stay cost 133.85 Euros, which was taken on arrival. I told reception at check out I would be complaining when I got home, but no acknowledgement to the email I sent to the manager 4 days ago. We may have been unlucky with getting a room with no heat, but I feel the response is indicative of a lack of concern for the paying customer. Hotel was nice and room decorated nicely. Sure you could have  a lovely stay - unless you have a problem, and then you're on your own.",
            "time": 1732018948,
            "translated": false
        },
        {
            "author_name": "Courtney Campbell",
            "author_url": "https://www.google.com/maps/contrib/110494036313950950405/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLQuRtlPFN_bAlmVH_TGmcBiKwK8sETboRJPjg62OEtyEEP=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 4,
            "relative_time_description": "2 months ago",
            "text": "The staff and the food at the restaurant are fantastic. The beds are super comfy and the rooms are spotless, shout out to the cleaners! Only issue I'd say is, it is hard to get parked. Everything else is perfect, would definitely recommend to friends and family.",
            "time": 1726353460,
            "translated": false
        }
    ]
}