{
    "name": "Grand Canal Hotel",
    "rating": 4.3,
    "reviews": [
        {
            "author_name": "Anita B",
            "author_url": "https://www.google.com/maps/contrib/111219172834918911373/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIHNfY_IMBvcuu_Ewv-1a3w5TaVG1m0iWayxt9GQ72D6KsX5w=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 2,
            "relative_time_description": "2 months ago",
            "text": "One of my biggest regrets with my trip to Ireland was picking this hotel. Firstly the location is great if you have something to do in the vicinity but if you are there on a leisure holiday and want to explore Dublin, the hotel is 25 minutes walk away to the fringe of the city with limited food and entertainment options around. The chair and head board in my room was peeling. The front desk staff are friendly but not helpful or guest centric at all. They seem to be getting by on doing the bare minimum and that had nothing to do with that location as suggested the the reply below. Like simple things like helping to call a taxi when I collected my bags post check out. I had said I needed one and had previously discussed this with 2 different staff members and while the same person was on duty there was nothing done on their part. While it is stated they are happy to share knowledge, there was nothing proactively shared. I picked up my in room feedback card to provide feedback and guess what, it was already completed by a previous guest in another room! How did that get placed there? There was part of a chocolate wrapper on the floor as well so that made me really question the cleanliness of the room as well. I only stayed one night and I'm glad I did, one of my worst hotel experiences.",
            "time": 1727225272,
            "translated": false
        },
        {
            "author_name": "MJohn",
            "author_url": "https://www.google.com/maps/contrib/100834005002994256187/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUD-l6HuRhMjJ9D9WlJdc31VsX4A4ptivAj2JzKU_cnHzkxPdyo=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "We stayed here for the second time and will be pleased to return again next year!\nThe rooms are spacious and VERY clean and  comfortable. Thanks to the service staff who do a really great job!\nStaff at reception is very friendly and pleased to help.\nBreakfast is great and fresh: a good choice of everything for everyone. The chef is continuously checking quality and quantity of the buffet which is very appreciated! absolutely nothing negative to mention and this hotel is recommended absolutely!",
            "time": 1725120225,
            "translated": false
        },
        {
            "author_name": "Andre Blanchet",
            "author_url": "https://www.google.com/maps/contrib/103966526317698651724/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWTfSK5uV_mWpx591ryoOilFPyF4sWvwMJ6n5jKIn7HW2dap0Km-A=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 3,
            "relative_time_description": "a month ago",
            "text": "The Grand Canal Hotel had a couple things great going for it. First, it was walking distance to many great spots. The breakfast restaurant was a nice little place, and the attached restaurant/bar has a very good vibe.\n\nThe rooms were decently sized. The water pressure was Amazing! Having a shower with that much water pressure is heaven. But the two single beds in my room wasn't that pleasurable. I didn't order a room with two singles.\n\nThe service was near horrible at check in. It was as if it was a burden to them I was checking in. I thought it was just me, then my group of 16 were all saying the same thing, that the check in staff were curmudgeonly.\n\nSome stuff to work on.",
            "time": 1728954821,
            "translated": false
        },
        {
            "author_name": "Gloria Malone",
            "author_url": "https://www.google.com/maps/contrib/116407766408947321834/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXTLDzvQQCgdHecLSjMTtsU1zj5SGqD4aO9x10WoB3k4-4dvfL9=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "Stayed here at the beginning and end of our Ireland trip. Staff were very friendly.  Nice size room, comfortable beds.  Very clean and there was a fan available which was much appreciated. There is a small place in the lobby that serves wonderful food. There was also a restaurant that served a delicious breakfast. We were able to leave our bags at the desk since we arrived early. We took a short taxi ride to a pick up point for the hop-on, hop-off bus tours, but most would be able to walk the distance. Nice neighborhood.  Would definitely stay here again!",
            "time": 1723216490,
            "translated": false
        },
        {
            "author_name": "Mozy Adless",
            "author_url": "https://www.google.com/maps/contrib/109288130006990788567/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKmm-2tGW0nGt0Xe_n2_NpVr_NS1sbQG9koI3WwaW8CDbyxJA=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "4 months ago",
            "text": "Great place to stay if you're willing to walk a little. Close to Dart and downtown Dublin. Perfect to explore the city and very conveniently located for either business or vacation. Good for every occasion. Extremely friendly and accommodating staff, beautiful rooms, and great options for eating. I strongly recommend.",
            "time": 1722325859,
            "translated": false
        }
    ]
}