{
    "name": "Castle Hotel",
    "rating": 4.3,
    "reviews": [
        {
            "author_name": "Teddy Graham",
            "author_url": "https://www.google.com/maps/contrib/103116746347340118163/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVWAtEDCyt2wJNjncPrE5j3leiopSs4GmkLQ18CU9jS1hPAFQww=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "We booked into one of the quad bedrooms at the Castle Hotel, which accommodated our family nicely. The beds in the quad room are proper, full sized, standalone beds (and not a pull-out or fold-away bed like often hotels will provide in \"family\" rooms).\n\nAll the staff we encountered were super friendly and helpful, especially the reception staff who couldn't do enough for us.\n\nThe hotel has a secure luggage check facility which we made use of, both on our early arrival and late departure from Dublin. This made life much easier as it meant we could make full use of our first/last days without worrying about carting luggage around the city.\n\nThe hotel is in a great location, on the doorstep of O'Connell Street.\n\nWhilst the hotel is an older building, it's full of charm and the room we had was clean, tidy and had a nice bathroom.  Room service was also great.\n\nWe dined in the hotel restaurant on our first evening and had a very enjoyable evening meal. Breakfast (both full Irish and continental) was also excellent, with a good selection of continental and cooked options, which we enjoyed each morning of our stay.\n\nI wouldn't hesitate to stay here again when visiting Dublin based on our first experience. We even got to meet the owner of the hotel on our way out, who was lovely and took the time to chat to us and even gave us some ideas of places we could visit on our final day.",
            "time": 1729329122,
            "translated": false
        },
        {
            "author_name": "Max Valadzko",
            "author_url": "https://www.google.com/maps/contrib/114515647149318156283/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK8raSUvh7qrIxx68dGeGGeHhTwQaPDmwrP6lcWCjBJFIj4TDEs=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "The location was great and the staff were friendly. The Irish breakfast was very yummy and filling. The parking at the hotel was very tight but there’s hotel staff to assist if help needed. Our room had no view but the we didn’t spend much time in it. The live music at the restaurant and Irish dancing was awesome and made our Ireland experience very memorable!",
            "time": 1729423765,
            "translated": false
        },
        {
            "author_name": "Mike Goldstein",
            "author_url": "https://www.google.com/maps/contrib/110662857222236878568/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUKxtUYVEIFC0nCUMVHOznMZG5hI2U0PzuxBo-_yp-usf8cE7Ho=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 4,
            "relative_time_description": "2 months ago",
            "text": "We really liked this place. Its neat and clean and creaky old wood carpeted floors the place has a lot of charm. Rooms are basic but efficient and comfortable. It’s in a quieter part of the city but very close in. Meaning it takes 10 min to walk from Temple Bar but you pass some great landmarks along the way and you aren’t woken throughout the night by late night crazy. The rooms are good. The breakfast is a choice of served Traditional Irish / Vegetarian / Vegan Irish or a continental buffet. We did the traditional one morning and the buffet the other. Both were great. Service was wonderful. Pragmatic, helpful, and friendly.",
            "time": 1726162885,
            "translated": false
        },
        {
            "author_name": "Tracey M",
            "author_url": "https://www.google.com/maps/contrib/102312136108897527158/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL76efDcffwbDewhxPiAti0ruEZH9d98lZa_FYYkekZfVPB3A=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 4,
            "relative_time_description": "3 months ago",
            "text": "The hotel staff is the best! They were so kind and helpful. The room was a perfect size for my husband, teenage son and I. They have two different breakfast locations and types (continental and full) and both were great! The evening restaurant food was good and reasonably priced. When we were there they had entertainment each night that was fun to be a part of. The only thing that wasn’t great was that the elevator was broken our entire stay, but they did offer to carry our bags up for us. 💗",
            "time": 1725343008,
            "translated": false
        },
        {
            "author_name": "Tiffany Logan",
            "author_url": "https://www.google.com/maps/contrib/113292353803198304072/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLKx-0GCa7TPILEwnj6U34V-YKggHyexgMwYfs3r-A2qIH7eg=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 5,
            "relative_time_description": "4 months ago",
            "text": "Beautiful old hotel with tons of history.  It’s been converted to a hotel from old Georgian townhouses.  The architectural details and decor in the main spaces is absolutely stunning and the food at the Vaults is some of the best we had during our time in Dublin.  Additionally, it was one of the only hotels we found that could accommodate our family of 4 comfortably with one double and two twin beds in the room.  Be aware, it is an old building (or rather several old buildings that have been joined) so there are a few quirks, including some hallways on upper floors that are a bit of a ramp, but honestly, that adds to the character, especially if you look at how the different buildings were joined.\nLastly, we met the proprietor, who was able to tell us about the history, his family’s part in the revolution, and who made some great suggestions for our stay.  Would definitely recommend.",
            "time": 1721936411,
            "translated": false
        }
    ]
}