{
    "name": "The Address Hotel Connolly",
    "rating": 4.1,
    "reviews": [
        {
            "author_name": "dan behrens",
            "author_url": "https://www.google.com/maps/contrib/104887224926246461735/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLk54zxChBYl1S2KRdsp1I3sdr00bDSwk5oDorUhQfzFqe8vg=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "I had a wonderful stay at this hotel despite some concerning reviews. I found that good experiences often go unshared, so I wanted to share mine. I arrived at noon, and the staff allowed me to check in early without any hesitation. My room was modern and impeccably clean, with a courtyard view that ensured a peaceful night's sleep away from city noise. The employees were also helpful in arranging my taxi back to the airport on time. The hotel is conveniently located near the train station and within easy walking distance to Dublin’s vibrant nightlife, all at reasonable prices. I would gladly stay here again!",
            "time": 1728114532,
            "translated": false
        },
        {
            "author_name": "Andrew Rogerson",
            "author_url": "https://www.google.com/maps/contrib/106499487335139998382/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWp8g9e0NjrBdUQLiXNFmIUIlZ_iAB4gknhpTTi11deGHD1pIE=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 4,
            "relative_time_description": "3 months ago",
            "text": "Very nice hotel. Stylish entrance and quirky feel. They do however still use menget strips for the door cards and the lift is unlocked using the magnet strip. RFID would be a smarter choice and more secure. The beds are wonderful. Sadly our bathtub plus will not hold the water in the bath so it was disappointing to come to the room after walking the city all day and not being able to have a bath. Breakfast is great too.",
            "time": 1724155966,
            "translated": false
        },
        {
            "author_name": "Jemina Semakula",
            "author_url": "https://www.google.com/maps/contrib/111252961824714902449/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKMWwQmbbLtPowIKF9OyXW5kOkCfcQ8Ec9EhPdoh48MFYOKhw=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "in the last week",
            "text": "Had lovely stay at this hotel, the rooms and general ambience is amazing. The food in the restaurant was also great. Special shout out to Chucks who was really attentive and helpful.",
            "time": 1733143427,
            "translated": false
        },
        {
            "author_name": "Neil Cade",
            "author_url": "https://www.google.com/maps/contrib/100445145788154491171/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKPVFjnGAs4HsP48YF5_ZdETdntRt2F3RSTHyDNiOxt3IrVQg=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "My wife and I took a trip to Ireland for our honeymoon and The Address Hotel Connolly was our first and last stay on the trip touring the country. We were met with smiling faces and exceptional service from the time that we arrived until the time we left. The night manager Patrick was absolutely wonderful in making our trip special. He went above and beyond making the stay amazing. He also set up a special surprise for us to congratulate my wife and I on our recent marriage. Overall, given the chance to stay in Dublin again, I would definitely make The Address Hotel Connolly our place to stay.",
            "time": 1727684657,
            "translated": false
        },
        {
            "author_name": "Man bites Life",
            "author_url": "https://www.google.com/maps/contrib/100173366340624961565/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVlp0NDJSaIe7YfpeOmRjJ6VVP-WttmQezS_znZMPp2u5Do4OuC=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 4,
            "relative_time_description": "3 months ago",
            "text": "Decent hotel, beautiful rooms. Staff is helpful. Location isn't that great, the area can be very sketchy at night. But it's good that it's next to the trains. Breakfast could use some more variety for a 4 star hotel and it needs better coffee. Gym is sufficiently equipped for a nice full body workout if you know what you're doing with variety of dumbells and top of the line treadmills.",
            "time": 1724750894,
            "translated": false
        }
    ]
}