{
    "name": "Together Florence Inn",
    "rating": 3.9,
    "reviews": [
        {
            "author_name": "Michael Uzmann",
            "author_url": "https://www.google.com/maps/contrib/102310126330311462271/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVr9CBEqsB0gvep0KEC5iy0QyMq9UopswlN76a1588aqdTW00M=s128-c0x00000000-cc-rp-mo-ba8",
            "rating": 4,
            "relative_time_description": "6 months ago",
            "text": "Located roughly 2.5km from the center of Florence the Together Florence Inn offers great value on the dollar thanks to comfortable beds, free parking, a 24/7 fitness center and morning breakfast including a variety of good items plus great Espresso.  Easy access to downtown by car or public transport.",
            "time": 1716298552,
            "translated": false
        },
        {
            "author_name": "L D",
            "author_url": "https://www.google.com/maps/contrib/110820842354250916929/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL_B-oan6h6JdFTlBtzPFgLEDDtTd2jBeHWBTZWDBmDcb3_fmg=s128-c0x00000000-cc-rp-mo",
            "rating": 2,
            "relative_time_description": "a year ago",
            "text": "Stayed here in June 2023.\nBooked by travel agent. I had no idea how far it was from the city. Had to cab to city daily. Cabs were very difficult to come by even with letting reception know the night before that you had a need for cabs in the AM. Took bus one time but it took longer than we thought -- user error most likely but that's why we relied on cabs.\n\nAir conditioning wasn't working and it was HOT. Could open windows but mosquitos would help themselves to a human buffet. They told me multiple times the AC was being fixed. LIES, LIES, LIES. They also told me if windows are open the AC won't work and they have windows on sensors and told me my bathroom window was open when it wasn't. Basically blamed the guest for their non acceptable AC.\nSmall shower but room was an adequate size.\n\nBreakfast buffet was decent. Tables weren't reset when other guests left so you'd have to scrounge for some flatware and a napkin. Had American breakfast.\n\nPool needed a cleaning. Green growth between the pool tiles. It's a nice little courtyard but lacks anything welcoming. Could be much better if they gave it some thought. Door handle to courtyard from lobby FELL off when someone in our group touched it.\n\nStaff was nice enough. I'd have loved to stay IN the city but it's not the hotel's fault.",
            "time": 1695927423,
            "translated": false
        },
        {
            "author_name": "Ilia Kritiuk",
            "author_url": "https://www.google.com/maps/contrib/109762142448999652952/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJAb2S3X_hA5TaR_Z0dd9kuDSGJgDVFkiCD8FpS3ewjjzKXww=s128-c0x00000000-cc-rp-mo",
            "rating": 1,
            "relative_time_description": "a year ago",
            "text": "Nothing, impolite personal who didn’t provide us a room that was booked and lied a few times.\nWhen we come to the room we noticed that there is no second bed. We went to reception and asked about it. The receptionist told us that there is only one room and there was a kind of mistake from the hotel or booking. We asked about refund and he said that it will be done next day. The next day there was another person on the reception and she said that the partial refund is not possible and said that she can give us coca-cola from the bar to resolve the problem. We wanted a normal room with two beds. We are friends from an orthodox country and from us it’s not are good to sleep at one bed.",
            "time": 1696665944,
            "translated": false
        },
        {
            "author_name": "Shayan Bokhari",
            "author_url": "https://www.google.com/maps/contrib/101953958816299875605/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXF-JiBQlbHEJkyONO5J8uvRGrXIKTT6ps7Io1rksbCj27CS1h0-w=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "Great stay, the front desk is very hospitable and caring, breakfast is amazing!",
            "time": 1726879970,
            "translated": false
        },
        {
            "author_name": "Britgirluk",
            "author_url": "https://www.google.com/maps/contrib/102875034836375013101/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVUhncRYpKxgUNazpUwS1nQR0nIOwQru1VcVIoLYbaAf40pk-I2dw=s128-c0x00000000-cc-rp-mo",
            "rating": 3,
            "relative_time_description": "2 years ago",
            "text": "The hotel is rated as a four star hotel but unfortunately once inside the hotel and rooms you can see it is definitely not, at least to the standards I have been used to. The decor is in need of redoing and is quite basic. The hotel has air conditioning but having it on didn’t make any change to the room temperature. On day four of our stay it completely stopped working. Bear in mind outside in June it is over 90 degrees so the rooms get hot!\n\nOn a positive note the staff are extremely helpful and friendly even lending me an adapter because the one I had didn’t fit the plugs. Side note Italy has two types of plugs so make sure to get an adapter that fits them both! The rooms are a really good size which is nice. Breakfast is fantastic as are the ladies who serve in the restaurant.\n\nSo all in alll our experience was good. Perhaps it’s more of a three star hotel but space, staff and breakfast make up for that. Proper AC would have made the stay more comfortable. If you book this hotel be aware it is a 15-20 min bus ride into the city as it is in a quiet neighbourhood. Shops locally are closed on Sundays so make sure to purchase enough bus tickets beforehand so you are not stuck at the hotel!\n\nSumming up it’s a reasonably nice hotel for the money in a quiet area.",
            "time": 1655147929,
            "translated": false
        }
    ]
}