{
    "name": "Gallery Hotel Art",
    "rating": 4.5,
    "reviews": [
        {
            "author_name": "Danny Da Ponte",
            "author_url": "https://www.google.com/maps/contrib/108351170832011503349/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUvZCjgtM16YcVTYQQwyb_jIwdxhkdz-ZbK54TKQMeQHeNSLcAV4A=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 4,
            "relative_time_description": "a month ago",
            "text": "Great hotel and to me, perfectly situated. Clean and spacious. All the amenities one can ask for. Comfortable bed, great linens. Bathroom has all you need and more. Breakfast area is large and inviting. Food was excellent with a lot of options one can ask for. Staff was friendly and helpful. Noticed a lack of touches one day when I didn't have change for the housekeeping, that was disappointing. Tips should be on what you did not what I hope to get.",
            "time": 1728332530,
            "translated": false
        },
        {
            "author_name": "Chelsea Price",
            "author_url": "https://www.google.com/maps/contrib/116932661379655197075/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWBvp1kgOxaBxb4DI7yAQUaDuy1fatQzz3_Mbgw14brr_gVHzeTTw=s128-c0x00000000-cc-rp-mo",
            "rating": 1,
            "relative_time_description": "2 months ago",
            "text": "Beautiful, clean rooms. Decent location. Uncomfortable beds. Varying prices depending on where you book.\n\nBreakfast may or may not be included, the check-in told us it was included so we sat to eat. Turns out it wasn’t. Subpar breakfast for the cost at best. The service is slow, even for Italian standards. If you add it, be ready for the staff to be even less attentive, cold and rude. We had to wave the service down to get coffees and even then we were questioned what room we were in, even though we had already given it. We had a kettle in our room but not a coffee maker, I’m pretty sure those are only available to the Penthouse rooms.\n\nWe paid almost triple by booking directly through the site vs. what is listed on other hotel sites. Unfortunately too late now, I should’ve done more research.\n\nDo yourself a favor, book somewhere else. If you do stay, don’t book directly, don’t add the breakfast and find a local breakfast stop instead.\n\nOverall, extremely disappointing as we’ve paid much less at other hotels for higher quality service, food and rooms.",
            "time": 1726893370,
            "translated": false
        },
        {
            "author_name": "Louise Richards",
            "author_url": "https://www.google.com/maps/contrib/110973338776656653654/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJAzSLzXDA9K3vYhsOLHMOk6ATheDfR5wVYEMwhBYxZqWzwTQ=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 5,
            "relative_time_description": "4 months ago",
            "text": "Such a warm and friendly atmosphere at the Gallery Hotel Art. The staff cannot do enough. The bedrooms are a lovely size with the most comfortable beds. It is located in the most fantastic location to walk anywhere within a short distance in beautiful Florence. I highly recommend staying here!!",
            "time": 1720708621,
            "translated": false
        },
        {
            "author_name": "George Facchini",
            "author_url": "https://www.google.com/maps/contrib/116624373122837329346/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV2CRKCTESIKUUK99xjHnyNWpaAF4gnz0iEtBRYzcS22kkYn5JOew=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "4 months ago",
            "text": "I can’t complement the staff enough. Everything that was suggested was perfect. The hotel staff assisted us with a rental car, restaurants, personal services, drinks, and laundry services. We so enjoyed our experience in Florence thanks in part to the amazing staff at the Gallery.\nView from 701 roof top bar",
            "time": 1722884074,
            "translated": false
        },
        {
            "author_name": "Richard Lowe",
            "author_url": "https://www.google.com/maps/contrib/109172316299655713170/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW9X3tlnLNO5lRSgpwtx0Lz4cWol1a-kGYFS9p-3lZCt9mzdwT_=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "4 months ago",
            "text": "Stayed in 2 rooms with a family of 4. Amazing hotel located very near all the best Florence attractions, shopping and restaurants.\n\nLocation: 5/5 situated 1 min from the famous Ponte Vecchio Bridge and along the river, and shops and restaurants.\n\nRooms: 5/5 large and modern and clean. The hotel is tucked away to ensure an amazing quiet sleep whilst being in the middle of the hustle and bustle. Enjoy the short clip.\n\nService: 5/5 absolutely standout from the check-in staff, the concierge, and porters. Very happy and professional service.\n\nFacilities: 5/5 small sitting library that doubles as breakfast buffet location. Roof top bar with amazing views.\n\nFood: 5/5 only tried the Italian breakfast buffet. Was small but nice, good selection and fresh and tasty.\n\nAppreciate the small complementary Salvatore Ferragamo gifts from the hotel staff.\n\nWould absolutely stay again. Highly recommended.",
            "time": 1722667868,
            "translated": false
        }
    ]
}