{
    "name": "Palazzo Firenze by Baglioni Hotels & Resorts",
    "rating": 4.7,
    "reviews": [
        {
            "author_name": "Harry Segal",
            "author_url": "https://www.google.com/maps/contrib/105087136554847397190/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUgLsSafDvBdT_zNy1YbEw0LtMw--TKDVtsqsAQXMyfJ9KDjRLR0g=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "Perfect. Elegant understated luxury. Visually gorgeous. Boutique. Authentic Florentine vibe. Service impeccable—I felt totally cared for but never intruded upon. Wonderful central location. Fairly priced for the quality. I loved my room. Good air conditioning and plumbing. Wonderful view of the Duomo. The staff were consistently warm and authentic. Never fake or annoying. Great food! This is an all time favorite for me now. Grateful I chose to stay here.",
            "time": 1729086091,
            "translated": false
        },
        {
            "author_name": "Deepa Mahal iRock Weddings",
            "author_url": "https://www.google.com/maps/contrib/108144589591587432888/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWuNS8XIvlJP0qUubPPt9QrfCMIu-tWDu0ang7XZEyh4Q5nT5A4=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "Our stay at Baglioni Relais Santa Croce was nothing short of extraordinary. From the moment we arrived, we were greeted with warmth and impeccable hospitality. The hotel’s historic charm, luxurious rooms, and elegant ambiance made for a truly unforgettable experience. The attention to detail, from the beautifully curated décor to the exceptional dining, was beyond impressive. The staff went above and beyond to ensure our comfort and satisfaction. As a travel agent, I’ve experienced many luxury properties, but Baglioni Relais Santa Croce is truly in a class of its own. I highly recommend it to anyone seeking a perfect blend of history, luxury, and outstanding service.",
            "time": 1725929976,
            "translated": false
        },
        {
            "author_name": "MagS",
            "author_url": "https://www.google.com/maps/contrib/101763184253012567641/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKYMDfRiz1y3N6Og9H9xRIM99FmfpppmKO8BZxme7Z2pn_x3Q=s128-c0x00000000-cc-rp-mo",
            "rating": 2,
            "relative_time_description": "6 months ago",
            "text": "Feels like the 5 star hotel is the lobby and the restaurants, but rooms are closer to 3 stars.\n\nWe have booked the deluxe room over the long weekend in May.\nThe room looks tired. Stained walls in the bathroom, domaged floors, nail sticking out of the floorboards and a window looking onto a wall. Unfortunately, its disappointing.\n\nOn the bright side, the staff is very lovely and helpful. Excellent location.",
            "time": 1716665427,
            "translated": false
        },
        {
            "author_name": "Kevork Karakashian",
            "author_url": "https://www.google.com/maps/contrib/108070937236628503766/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocILKY7GUWFx5y_NTtOMmNEvxiApEv6glj6TSjrdOK5DF4sV2Q=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 5,
            "relative_time_description": "a year ago",
            "text": "Absolutely beautiful hotel with great staff. All staff members ensured we had a wonderful stay, starting from the concierge who is always present (morning and night) at the entrance of the hotel to the reception desk and restaurant staff members. We received a free upgrade for our 2 night stay and the room was gorgeous. Breakfast was delicious and when asked to buy their own baked cookies, they offered the recipe to make some at home! We received multiple personal notes from hotel manager along with complementary goodies throughout the stay. Very friendly and professional staff.\n\nThe hotel is walking distance to all the major attractions within Florence city center.",
            "time": 1701288399,
            "translated": false
        },
        {
            "author_name": "Sarah Hamilton",
            "author_url": "https://www.google.com/maps/contrib/100694681599855232383/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ0k-ev3JTR_4fcDvvtdgg69Y4oJFLyJkUAXWNhN3NPfYP8UoY=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a year ago",
            "text": "This is by far the best hotel I’ve ever stayed in! We were welcomed by the amazing staff, where they gave us drinks upon arrival, showed us a map of the city and their recommended places to see, then took our luggage to our room while we went to lunch. The breakfast buffet is amazing and the room is perfect. The staff is really what makes this place top notch. Would stay here again in a heartbeat!",
            "time": 1696149090,
            "translated": false
        }
    ]
}