{
    "name": "Italiana Hotels Florence",
    "rating": 3.8,
    "reviews": [
        {
            "author_name": "David Lozada",
            "author_url": "https://www.google.com/maps/contrib/114971939350043684924/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUpALWbOcmB4-8wytQ2CxuOrCDKpWKN2zqslbJgKs2n23trdg-Y=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "Staff were friendly and welcoming. Rooms were very clean and tidy. When it comes to the break fast meal. Hotel has a variety of options to get from so you will be ready for the day.\nAll in all a very good selection when choosing this hotel. If coming back I'd stay again here.",
            "time": 1728842067,
            "translated": false
        },
        {
            "author_name": "Emma Dwyer",
            "author_url": "https://www.google.com/maps/contrib/103666113806047857362/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWapJo4dFk08xlWPCEYxc6OSUg69Gtt4Sxz93Hw4bUlBfx-0yqjDg=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 4,
            "relative_time_description": "2 months ago",
            "text": "We stayed one night and the staff were very friendly. The breakfast was included in our stay and was great. The back of the building is gorgeous and modern which includes the pool area, outdoor BBQ and restaurant. It was difficult to understand it the pool area was open and how to get into it if the restaurant was closed. The hotel from the front appears very worn down but has good bones. There is plenty of parking and a pizza store across the road. There are also a couple different bus stops right beside the hotel that lead into popular areas of the city easily within 10-15 minutes. If someone is looking for perfect rooms, this is not the place. The rooms are good and the beds are comfortable, but there is quite a bit of work to be done in painting and the wallpaper and doors.",
            "time": 1727118902,
            "translated": false
        },
        {
            "author_name": "Donna-marie de Groot",
            "author_url": "https://www.google.com/maps/contrib/116276940984362568415/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXzHKtvKTQDe26S0p4ntr7vkaCgT_uUv4yEke1DNRs-Ja7CP8hX=s128-c0x00000000-cc-rp-mo",
            "rating": 4,
            "relative_time_description": "3 months ago",
            "text": "We stayed at this hotel for 5 nights. The swimming pool and area around it was perfect. We loved it and really enjoyed swimming, relaxing and ordering drinks from the bar. The staff were friendly and helpful. I spoke to the staff members at the restaurant as it was my husband's birthday and they played happy birthday on the speakers and helped me surprise him with candles on his dessert. The rooms and the hotel are quite outdated but it was clean and we were happy with our staff there. There are a few nice shops and restaurants in walking distance and a bus stop across from the hotel. The bus trip is 20 minutes or so to the centre but it is direct.",
            "time": 1723201876,
            "translated": false
        },
        {
            "author_name": "Munira Haideri",
            "author_url": "https://www.google.com/maps/contrib/111326072322976634863/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI_DqcsWRuQgdhjZ4ztYs79mnNgvJW-dSw6BcQ9fJ1faJHuIg=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 1,
            "relative_time_description": "2 weeks ago",
            "text": "Stayed here for 3 nights, absolutely shitty service. The staff is very rude and has a simple answer for everything ‘NO’. The wifi doesn’t work at all, the phone in rooms doesn’t work, so everytime you need something you have to go to the reception.\nWhen I told the staff, they said, they can’t do anything it is like this.\n\nThe first hotel I have seen in my life where the guest has to carry all the luggage in and out.\n\nThere’s nothing called as room service here, nobody will come and even hand room slippers to you if you ask.\n\nI wouldn’t recommend this hotel if you’re looking for good service. Only good point is, breakfast and rooms are clean.",
            "time": 1732206724,
            "translated": false
        },
        {
            "author_name": "Cavan Sheahan",
            "author_url": "https://www.google.com/maps/contrib/114327579842015003443/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJE0N1H0BQRliuejHAYyekjhT0eUc0SV6Ot0vAJgxEHxyFuqA=s128-c0x00000000-cc-rp-mo",
            "rating": 4,
            "relative_time_description": "3 months ago",
            "text": "Staff were amazing, helpful and friendly. The bar and pool area were fantastic (looks like the pictures). Cleanliness was also good. The only downside is that the rooms and general common areas need attention and are old and worn.",
            "time": 1723390013,
            "translated": false
        }
    ]
}