{
    "name": "Villa Cora",
    "rating": 4.8,
    "reviews": [
        {
            "author_name": "Cliff Burt",
            "author_url": "https://www.google.com/maps/contrib/100361404869223238142/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXWYKhaGQ6FremoXcZ8606hD8_xdRn-zmOWkzLOblRwAAzosZus=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "in the last week",
            "text": "WOW, this place is breathtaking. Such an amazing place and hands down the best place we have stayed in Italy. Pictures won't do it justice. This sets a standard for quality and luxury for the Leading Hotels of the world. It's truly a work of art and the decor is captivating.\nThe service is outstanding and top class. From the moment we arrived to the moment we left we felt like we were royalty. They have a shuttle to take you to and from the city, a spa with a wellness center with an underground tunnel to get there, a heated pool, a roof top with a 360 degree view of the city, and an amazing food selection.\nWe can't wait to come back to Florence, which has become one of our favorite cities in Italy.\nPamper yourself and your loved one by staying here, you will be happy you did!",
            "time": 1732966750,
            "translated": false
        },
        {
            "author_name": "Yasamin Bahadorzadeh",
            "author_url": "https://www.google.com/maps/contrib/118210971353170468001/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXovxY9JgKjyQvSXIs0uL7VDfXouaff_mrQzijVR3VmiWoxMU-mpQ=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "An absolutely exceptional property.\nThe hotel is just gorgeous. The rooms are lovely and different from one another. Everything in the rooms from the beds and sheets, towels and toiletry to every little detail, is very luxurious and well thought out with guest comfort in mind.\nThe staff are exceptionally warm and hospitable.\nThe breakfast is wonderful. The other F&B outlets are also great. Wonderful wine list and reasonable priced.\nThe pool is heated, so even until mid October, if not later, you can easily use the pool. The SPA is very well equipped and has many options from treatments to other spa facilities ( sauna, steam room, hot tub,...)\nLorenzo at concierge is very friendly and knowledgeable and can help with anything you need for an exceptional visit to Florence. His restaurant suggestions were right on point.\nThis hotel is a must visit. And don't forget to take your aperitive to the rooftop for an unforgettable view!",
            "time": 1728411834,
            "translated": false
        },
        {
            "author_name": "Hilary Andrews",
            "author_url": "https://www.google.com/maps/contrib/102209023349492488480/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUK_gNUzPMQpRpAMSQvzv1tBVlEngChE0D7PSfJXadbSQB_oYtBJA=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "The Villa Cora is a hotel in a league of its own. From the incredible service and warmth of the hotel staff, to the beautiful views around the property — this hotel really takes luxury and hospitality to the next level.\n\nI would come back to Florence just to stay here.\n\nThe breakfast is out of this world — European style with pretty much anything you could ever want. The dessert table alone is enough to prompt writing a review.",
            "time": 1730471090,
            "translated": false
        },
        {
            "author_name": "BD",
            "author_url": "https://www.google.com/maps/contrib/106957347272492763275/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKvmzPySNFfhA1DRjl6ofslf6ZCiHHbullLnXSxt_H8isbNjg=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "I stayed in Villa Cora with my family in August 24. I have to write this review because I can honestly say Villa Cora delivered the very best a hotel can offer in every respect. The villa itself is breathtakingly beautiful. It is hard to put into words the splendor of the rooms. We ate both in the restaurant and the poolside. The meal in the restaurant was exquisite fine dining and the poolside food very tasty. Finally the thing that possibly stands out more than anything else is a staff all of whom were so friendly, helpful and good humoured. The little touches and attention to detail are delightful and made our stay incredibly special and memorable. Villa Cora is a true five star hotel and in my opinion on another level from the others.",
            "time": 1726158470,
            "translated": false
        },
        {
            "author_name": "Rabbi Tamara Kolton Ph.D.",
            "author_url": "https://www.google.com/maps/contrib/117908153267427275846/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUobMzyivtjj_OXWjDJkR-SPbR4vyIM0FDkcVqdrqJYYIEpUEHR=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "Words cannot express how much we loved our stay at Villa Cora. Thank you to the managers Marco and Fabio. This hotel is a five star experience. The service, rooms, pool and rooftop delighted our souls. If you can, run, don’t walk to get there!",
            "time": 1725730370,
            "translated": false
        }
    ]
}