{
    "name": "Hotel Croce di Malta",
    "rating": 4.4,
    "reviews": [
        {
            "author_name": "Jim Robinson",
            "author_url": "https://www.google.com/maps/contrib/107665926693577049587/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLiFxsd3xzUt3ocMMGl_y0VUa5a9rETTPOsujVkv419COOrkw=s128-c0x00000000-cc-rp-mo",
            "rating": 4,
            "relative_time_description": "a month ago",
            "text": "Hotel is well located in central Florence with easy access to all major attractions/areas of interest.  The room was spacious with a recently renovated bathroom, which was appreciated.  The hot breakfast included in the rate was better than expected and utilized daily before heading out.  The overall state of the hotel and offerings land it in the 4-star category - it is definitely not the Ritz or Four Seasons.   The only notable negative to the stay was in relation to the rooftop terrace, which does have comfortable seating and amazing views.  Unfortunately and illogically, it is apparently the only place in Florence where I could not open a Super Tuscan for enjoyment purposes.  I understand the hotel wants to make money on the rooftop terrace, but guests are paying for this amenity in their room fee and accordingly should be allowed to consume their own wine - especially given the drink menu did not have a comparable bottle of wine available.",
            "time": 1729108245,
            "translated": false
        },
        {
            "author_name": "Glen M",
            "author_url": "https://www.google.com/maps/contrib/102179760745059833095/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIpik_tMrfIsVRbwKLxiDjmtqRFRxBjsccm88xjGkL3pRdM-g=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "Perfect location, just outside of the main tourist areas but easy walking distance from all the main sights. Also close to the main train station and tram stop for easy access to other places and the airport.\nRooms are quite rustic in appearance but still fully functional and the bed was incredibly comfortable. Only downside is the very small bathroom and shower.\nDidn't get to try the outside terrace or rooftop bar due to the poor weather but looked like they would be a lovely place when the sun shines.\nDelicious breakfast with good choices.\n\nI'd definitely stay again.",
            "time": 1727112144,
            "translated": false
        },
        {
            "author_name": "Neven Sopta",
            "author_url": "https://www.google.com/maps/contrib/114905049419340440996/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWgJnpMByxo1gfRkGJkgjVoKdtOslz7uVNhUArYYdCFmOIpboo=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "We were absolutely blown away by this hotel. The rooms were fantastic, with perfectly functioning air conditioning (despite some earlier reviews suggesting otherwise), and the pool was impeccably clean. The service was outstanding—every single staff member went above and beyond.\n\nThe location is also incredible, with everything you need just a short walk away.\n\nWe can't wait to return!",
            "time": 1725364344,
            "translated": false
        },
        {
            "author_name": "John Mousa",
            "author_url": "https://www.google.com/maps/contrib/109891444063118581498/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWpRrcCCHt359Slf8TncLA5i1yPxeIFup8lIpG3eWGI6lxO-CLzvQ=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 5,
            "relative_time_description": "4 months ago",
            "text": "The hotel offered great accessibility to the city. It was near the main train station, which made traveling convenient, but not too near to the busy areas. The hotel is in a quiet street 50m away from the nearest square. Food was great, although the menu remained constant for breakfast for our 5 days stay. Rooms are functional, artistic but not luxurious, we could not find an iron or an iron stand for example. You wouldn’t not imagine yourself staying full day in the hotel, which is nice as this invites you to explore the city. Room furniture is not super comfortable, but our room had nice terrace. Too bad though that the chairs in the terrace were uncomfortable and rusty. The pool and hotel terrace view are much smaller than the pictures but they are well maintained. In a busy summer season you’ll usually need to reserve a spot early on the pool side. Service is very friendly and responsively accommodates guests requests on a 10 to 20 minute notice. Reception is always attentive and provides good guidance.",
            "time": 1722697769,
            "translated": false
        },
        {
            "author_name": "Holly Cristofaro",
            "author_url": "https://www.google.com/maps/contrib/110004265054140611190/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocItQRPLyDxEiN3dTRnytD8QHG30JWcfrOJsUgekvEkEvd74Cg=s128-c0x00000000-cc-rp-mo",
            "rating": 4,
            "relative_time_description": "a month ago",
            "text": "We enjoyed out stay at Hotel Croce di Malta. The staff was attentive and the location was excellent and it was easy to walk to all the areas of the city that we wanted to.  The courtyard/garden was a peaceful break after the busy streets of Florence.  Breakfast was excellent. The room was comfortable. Rooftop bar had great views.",
            "time": 1728723971,
            "translated": false
        }
    ]
}