{
    "name": "Art Hotel Villa Agape",
    "rating": 4.7,
    "reviews": [
        {
            "author_name": "Samantha Freeman",
            "author_url": "https://www.google.com/maps/contrib/100510633933040861883/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLzEvt8W3nGb1iBnxlox6uk3Ndp6vwZTGN4FT0zZWYiMUys6Q=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "If you are thinking of booking this lovely hotel just go ahead and do it. This is one of the best places I have ever stayed. It is beautiful, well kept, the staff is wonderful, and it is just a charming experience. The free breakfast was an amazing perk to have during our stay, and it was delicious (tons of options). The restaurant was great. My only wish was that the shuttle ran until 9pm instead of 8, because it is hard to be able to do a 7/7:30 dinner (normal time) and be able to use the shuttle to get back, but otherwise it is super helpful perk. Book here and enjoy your villa-style stay while still having great access to Florence.",
            "time": 1729019366,
            "translated": false
        },
        {
            "author_name": "Steven Leach",
            "author_url": "https://www.google.com/maps/contrib/108199063881644628822/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVKM_Nn0ttj3ewXe-lGdOYmhdk8AlT8FUoVpyHS7DxI01eY_18=s128-c0x00000000-cc-rp-mo",
            "rating": 2,
            "relative_time_description": "2 weeks ago",
            "text": "Beautiful converted convent well located above Florence, removed and yet very close with a convenient shuttle available during somewhat convenient times (9h to 13h and 16h to 20h). The staff were, without exception, engaging, kind, and attentive. Breakfast was outstanding.\nThe rooms are modest for the price, but the real reason for the rating is that our booking came during some of the hottest days of Summer in early August and the hotel is not equipped for such hot days. The thermostat in our room was set to 19, but the room didn’t reach below 26 our first evening, making for a truly miserable night. The hotel provided a fan, but it just moved the warm air around - we considered moving hotels. Our second and third nights were slightly more comfortable as the weather cooled. I will not book here again for the Summer months, though I would consider it again in other months.\n\nUpdate: I don't like being gaslit. Villa Agape responded to this review by claiming \"Regarding the A/C situation we are really sorry about that but unfortunately during your stay we had extraordinary technical problems that were resolved definitively and after the restart the A/C worked well also during the hottest days of the year, mid August, as is testified from other reviews that we received later on.\"\nWe stayed at Villa Agape August 11-14. August 11 was the hottest day in Florence in 2024. The AC in the room we stayed in was entirely inadequate, as described in my initial review. During our stay, the power went out for several hours. Perhaps other people stayed in rooms that were properly climate controlled, but ours was not. When we addressed the front desk about our room not properly cooling, they brought us a fan and said that was the best they could do. No one mentioned any technical problems, and on the hottest days of the year we found the room to be barely habitable.",
            "time": 1732156548,
            "translated": false
        },
        {
            "author_name": "Zina Scott",
            "author_url": "https://www.google.com/maps/contrib/110758194214799284603/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXwXsQXivRDZfa7pSPuTyPMSEgNm7D6Q5pm59PB9V9jFD3Xy2M=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "This was our favourite accommodation in Italy with our little one. The room was spacious and beautiful. The hotel grounds are also lovely. There is a hot breakfast included every day, which was so convenient with a toddler. There is also an enclosed courtyard where our toddler loved running around. There is a bar at the hotel overlooking a beautiful grove of olive trees. There is is also a restaurant to eat in at night. The food was delicious and the drinks were great. The service was superb. We were able to get fresh milk for our toddler daily, which she loved. The parking was also gated and safe. This hotel is ideal if you have a vehicle. It is not walkable to the centre of Florence, but there is a free shuttle to two locations, where you can then catch a cab or uber where you need to be. This was ideal for us.",
            "time": 1726075303,
            "translated": false
        },
        {
            "author_name": "Sharan Dhillon",
            "author_url": "https://www.google.com/maps/contrib/103313357474162214537/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJVzyzj1y5NTcwVzpX5jFEbLjH7ha3mtL--3qzkn3UkW0Exag=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "5 months ago",
            "text": "Recently stayed at Villa Agape and I must say it was an amazing experience! First I’d like to mention that the staff made the experience one to remember. Everyone was very kind and attentive, and provided exceptional service. Prior to my trip. Via email the staff was so responsive as well.  The villa itself is absolutely beautiful and provides you with a true Italy experience. The property is massive and you don’t have to leave, there is so much to explore. The location is very close to the famous Pizzale Michelangelo and the river. They also offer a shuttle service to both these location which is convenient! I would highly recommend this hotel for your next visit! Nothing but good things to say!",
            "time": 1718912812,
            "translated": false
        },
        {
            "author_name": "Katherine T Cole",
            "author_url": "https://www.google.com/maps/contrib/116281943677892818488/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIZdVj6sy2ZVtRjs-mfff3vzxiIdog4QS3cPqU-d6Hbaiw9caQ=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "Villa Agape was a wonderful experience. The staff were great with our young son, the grounds were beautiful to walk around and lounge in, the food was delicious, and the room was so comfortable and clean. We would go back again! The service was top notch. Grazie!",
            "time": 1728558576,
            "translated": false
        }
    ]
}