{
    "name": "Hotel Villa Olmi Firenze",
    "rating": 4.6,
    "reviews": [
        {
            "author_name": "Moussa Al K",
            "author_url": "https://www.google.com/maps/contrib/114207316655000781690/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW4Ti4MV7BF5Mkdt0h-xISobBttETFlrtqKIgdl5b6w5jCqkGPFtQ=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 2,
            "relative_time_description": "3 months ago",
            "text": "A beautiful hotel... To avoid.\n\nOnce you enter the hotel you feel it's a historical place however you're not greeted with anyone at the door to help with bags until you're at the check in desk, clearly not 4 star level.\nRoom is beautiful and shower is top quality but again you're let down by the service it's not even 3 star level. You'll be charged 9 euro if you ask for an empty glass of wine to be delivered I haven't seen this before.\nParticularly one staff at the restaurant was mean and not friendly at all, I informed him my wife's glass had stains and he wasn't happy that I mentioned it. The staff especially at restaurant make you feel like you're staying there for free and they're giving you a favor.\nI've been in many 4 star even 3 star hotels and the staff are sharp and trained for the job, not in this hotel unfortunately.\nIt has the potential to be a top class hotel but the staff/service is way below the level.",
            "time": 1725561156,
            "translated": false
        },
        {
            "author_name": "bhavik shah",
            "author_url": "https://www.google.com/maps/contrib/114035918764497211877/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJYWpw7Q3EDtUFDVMyX4QE-ke6YutnLU9_miz_Fc86lilDKpA=s128-c0x00000000-cc-rp-mo",
            "rating": 3,
            "relative_time_description": "2 months ago",
            "text": "Villa Olmi is a lovely hotel, the grounds themselves are stunning and it truly is a good getaway from the hustle of Florence city centre.\n\nAs others have mentioned the shuttle into the city is pointless, we resorted to cabs between the group of us as we’d actually reach where we needed to be.\n\nService was poor unfortunately, in general and for what you’d expect from such a hotel. The service charge did add insult to injury as every interaction with a member of the bar / restaurant required a follow up interaction to get anything done.\n\nGood aspects are the pool area and overall grounds, beautiful to say the least. The food we had at the restaurant itself was good and the rooms were lovely.",
            "time": 1726351501,
            "translated": false
        },
        {
            "author_name": "negin razzaghi",
            "author_url": "https://www.google.com/maps/contrib/118107985656120625520/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIBobNZBYijWxzaGkn8XrrIGtwuxojJ-Cw_LvkJAJA80AO-DX4=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "A beautify Tuscany inspired villa which is also close to Florence downtown still (20 minutes drive). Hotel feels like a real castle, rooms are magically gorgeous, staffs are super friendly going above and beyond everything, rooms are spotless clean and cleaners come daily, food was great. The pool is nice and clean, we had a fantastic experience. I’d highly recommend it",
            "time": 1726484567,
            "translated": false
        },
        {
            "author_name": "Samia Iftekhar",
            "author_url": "https://www.google.com/maps/contrib/100502943325471984251/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVrHFGc7wldbqft0UxwZMM5KpDIGi7S4awKEuxYglpNK73u3HUs=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "5 months ago",
            "text": "Stayed in a Superior Double Room in the main building and our room was large and gorgeous, as was the green marbled bathroom. The hotel lobby is classy and beautiful. The gardens outside are well maintained and are great for pictures and walking around. Overall, the hotel exudes luxury and coziness and that’s not a combination you come across often.\n\nI chose this hotel as I wanted to experience Tuscan villa living without being too far from Florence and this ticked the box. We had a car with us so that made it easy to access Florence - I wouldn’t necessarily recommend this hotel to those without a car. Breakfast was very average though and I’d recommend skipping that and going to a local cafe instead.",
            "time": 1719921844,
            "translated": false
        },
        {
            "author_name": "Vasanti Natarajan",
            "author_url": "https://www.google.com/maps/contrib/111992916235267945979/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW_z568s4vD4-7E9YRSi9rW2H8lLWKoJfVXGKQKkdsMMDW0g8szJA=s128-c0x00000000-cc-rp-mo",
            "rating": 3,
            "relative_time_description": "4 months ago",
            "text": "My daughter (12 yrs) & I spent 2 nights at Villa Olmi this July. While the location and grounds are good, and the gardener’s work  fantastic- I felt the hotel lacked something.  Service was fine, the reception were friendly… but having been in Florence more than 7 times… I certainly felt the hotel lacked something. Staff were pleasant but nothing extraordinary. We’ve stayed at hotels like Villa Cora where service has been beyond amazing! An example- despite the pool being closed at 8 pm, my daughter ( then 9 yrs) was allowed to swim until 10 pm! We’ve stayed at “The Place” - a very different Hotel but again a lovely experience. Super service.\nI think Villa Olmi needs to get management to upgrade their offering. A location is only as good as the management are able to take advantage.\nSome issues: housekeeping didn’t do the needful for the evening turndown, towels were not replaced etc. Breakfast is adequate but lacks in quality! It’s a standard offering for “tourists”. So sad.\nI wish the management does the needful to upgrade the offering. Your staff deserve it.",
            "time": 1722524679,
            "translated": false
        }
    ]
}