{
    "name": "Raffaello Hotel",
    "rating": 3.6,
    "reviews": [
        {
            "author_name": "Fr. Christopher Brashears",
            "author_url": "https://www.google.com/maps/contrib/100162575375452793955/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUR-7ak3L4jyQSv989Ss6KT-REXbfx__hJ5RaSLqbe3JvRibGmOwg=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 4,
            "relative_time_description": "2 weeks ago",
            "text": "Rooms: good, but the HVAC systems were wonky.  The showers are small squares.  The toilet is placed weirdly in the corner; might be hard for some larger persons to use these toilets.  Otherwise quite nice; beds are very firm, and the pillows are of a good quality.\n\nService: no major complaints, but no major compliments.\n\nLocation: not great, but for the price it works out alright.  There is a train line not too far away.  Bonus - there is a good gelato place 3 minutes away...and a grocery store.\n\nFood: the meals were good but not something about which to write home.",
            "time": 1731913860,
            "translated": false
        },
        {
            "author_name": "José Fernando Rossi",
            "author_url": "https://www.google.com/maps/contrib/117467626848938710757/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVaAJZ-mye9ttG9lRHeUN2Le9_WUDG8Dui8p4AnKoLmF5gXyPDB=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 3,
            "relative_time_description": "3 months ago",
            "text": "Not a four star hotel at all!!!!\nWe stayed here one night because our flight was cancelled. It was enough to be sure that we aren’t coming back.\n\nFirst, the transfer driver was extremely rude and unfriendly.\nSecond they made us wait 1 hour to get the double room.\nIn the restaurant they refused to give us food (we had a voucher) because according to them the kitchen was already closed. They said the kitchen closed at 21:30 and it was still 21:15, and in the paper informing about meals, it was written we could have dinner until 22:00.\nThe rooms are not well taken care of, the shower glass is broken and the whole bathroom gets wet, the toilet with yellow marks under it, not a place to hang towels, and so on.\n\nAt least the main hall staffs are really friendly, but only them. The restaurant, drivers and so on, they are not.\n\nDefinitely we don’t recommend this hotel and we wouldn’t pay to stay here!\n\nObs: We are not paying to stay here, it’s an accommodation provided by Lufthansa, but if I was a manager of Lufthansa I would like to know that the company’s money is well spent picturing the best value for the money and satisfaction of my clients, and not just thrown away in a not good hotel.",
            "time": 1723233864,
            "translated": false
        },
        {
            "author_name": "Raluca",
            "author_url": "https://www.google.com/maps/contrib/111163086594749349702/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLTna7ytEEwHq7v6513WmK6I3u5K_BLeHiytsw0JtxQuMTRtw=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "I was thinking for a while whether to stay at this hotel, carefully reading the bad reviews. But I risked it and had a pleasant surprise. The hotel is clean, and the price is affordable. I chose it because it is very easy to get to the center with a tram directly from the station next to the hotel. The rooms are very clean and new. The air conditioning works very well. Now, at breakfast, the variety is really small. The very bad part is that there are no vegetables at breakfast, but I think it's a practice throughout Italy, where I notice that breakfast is a coffee, a sandwich and/or a croissant. But this does not mean that you will die of hunger and cannot find something to eat. We were shocked by the resort tax of 8E/person/day, which was paid at the end of the stay. The hotel has a parking lot in the basement, but you have to manage it yourself and watch in the morning when the cars leave so that you can park in the basement. The people at the reception do not say hello when you wish them good morning, which is not normal. A lady who serves coffee at breakfast answered unhappily when we asked her to make us coffee, she was probably having a difficult day. It's possible that this is where the customers' frustrations come from.\nGoing over these aspects, I think it's worth staying at this hotel.",
            "time": 1723796876,
            "translated": false
        },
        {
            "author_name": "Sharon Lai",
            "author_url": "https://www.google.com/maps/contrib/101036515986212962274/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKsYYrFW_LmQlupjaMwdRQA35foOhCjjexGC2LPIgKPKdJb0Q=s128-c0x00000000-cc-rp-mo",
            "rating": 1,
            "relative_time_description": "3 months ago",
            "text": "I recently stayed at your hotel, and I must express my deep disappointment with the service, particularly from some of your staff.\n\nFirstly, the staff at the breakfast restaurant were very impolite, especially an older lady who served coffee in an incredibly rude manner. The way she spoke to me was uncomfortable and, frankly, felt discriminatory!\n\nAdditionally, the room cleaner was also very rude. Around 11 a.m., while my family and I were packing our things, the cleaner came in and insisted on doing his daily cleaning, despite my explaining that we would be checking out soon and there was no need to clean at that moment. He seemed not to understand me and insisted on speaking in Italian, even though I politely requested, \"Sorry, I don't understand what you're saying. English, please.\" He ignored me and continued speaking in Italian, visibly frustrated. This behavior was extremely upsetting, and I’m genuinely curious—shouldn't a hotel ensure that staff who interact with guests can communicate in English? It’s an international language and should be a basic requirement for guest communication, especially when their attitude is so poor.\n\nEven worse, after this man left, another cleaner entered our room about 10 minutes later without knocking. Seriously??? How can your staff just enter a guest's room without ensuring the guest isn't inside? What if we were in a state of undress or otherwise indisposed? This is a severe security concern! To make matters worse, the man entered, looked at us, paused for a few seconds without offering any explanation, and then simply left. This is completely unacceptable and reflects an appalling attitude.\n\nAs for the room itself, the bathroom design was also very poor. Whenever we showered, even with the door tightly closed, water would flood out, leaving the entire bathroom soaking wet. The cleaning staff also failed to refill the body shampoo. My family's and my bottles were empty, and even after we were out all day, they weren't replaced.\n\nThat said, I must commend the receptionists, who were all very polite, welcoming, and had no communication issues👍🏻 The hotel’s location is also good, with a tram stop just a few minutes' walk away.\n\nOverall, aside from the location and the reception staff, the rest of the service at this hotel was terrible. We felt seriously discriminated against, and the incident where the staff member entered our room unannounced raised significant concerns about our safety. This is simply unacceptable.\n👎🏻",
            "time": 1724674915,
            "translated": false
        },
        {
            "author_name": "Susie Gauci",
            "author_url": "https://www.google.com/maps/contrib/104047017159410466216/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXQuWhaHj18uuq8NAh_0aTn_oH-sYSokdH0lUuFvRiaZqGgTLnUSQ=s128-c0x00000000-cc-rp-mo",
            "rating": 1,
            "relative_time_description": "4 months ago",
            "text": "Avoid at all costs. Filthy hotel, extra small rooms. Bathrooms you can't swing a towel yet alone a cat. Sit on the toilet and the basin is ontop of you. Carpets stained throughout the hotel . Do not eat at the restaurant.  Buffet breakfast was sad to say the least. Exit hotel to the left and find cafe on the corner. Wifi you have to log in every time you enter. They broke our clothesline we had and didn't care a bit. Staff were just out right obnoxious and rude and couldn't care. One set of lifts in foyer you had to take bags up 3 stairs. Tell me who puts carpet in the corridors, too hard to push suitcases!. If I could give 0 rating I would. After reading reviews just now I see the management threaten legal department,  please feel free to contact my lawyer back in Australia 🇦🇺. Sadly we didn't have an option staying here as it was an organised tour,others on the tour had ant's in beds and everywhere, air con not working, complants made and nothing done. I don't have 1 nice thing to say about this hell hole 😐",
            "time": 1722310564,
            "translated": false
        }
    ]
}