{
    "name": "Grand Hotel Baglioni",
    "rating": 4.4,
    "reviews": [
        {
            "author_name": "Amy Suddarth",
            "author_url": "https://www.google.com/maps/contrib/105131409221376303289/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWXHTSEywTFqVS1mARdGiWedHwmMRsJrXahj2wf5euKlNPX9Hzlrg=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 1,
            "relative_time_description": "in the last week",
            "text": "I booked my stay in March for a trip in November. We stayed three nights here (Wednesday-Saturday). We booked a patio room and we were shocked to find that it was in a construction zone. As we walked to our room the hall was filled with dust, chemical fumes, and the sounds of power tools. It was also obvious that the workers were smoking cigarettes in the rooms that were being renovated, one of which was directly across the hall from us.\nWe called and asked the front desk how long the construction would go each day and they said 9-5:30. After 5:30 when construction continued we called again and they said it would be another hour (until 7pm), they also said it would start again in the morning at 8:30... They said if we wanted to change rooms we'd have to wait till the morning but that there would be no construction Friday or Saturday. We really wanted a patio, so we made ourselves scarce Thursday to avoid the construction (even though we wanted to relax in our room). In the evening they were vacuuming the hall outside our room at 9:30 pm to clean up the construction mess in the hall. There was no time where we had peace and quiet in our room.\nFriday morning construction started again! We called and said we needed to be moved and we wanted to be able to relax in our room. They told us we couldn't move until after noon because the hotel was fully booked.\nThey \"upgraded\" our room for the final night, but we never should have been made to stay in the construction zone.\nFurthermore, the patio room needed renovations badly. There was an obvious leak from the bathroom and one side of the bed smelled strongly like mold.\nThe staff was kind and attempted to be accommodating, but we were told different details about the construction numerous times.\nWe were sorely disappointed in this hotel. We didn't receive a discounted rate, in fact we paid extra to have an upgraded room (the patio). For what we paid it was truly unacceptable.\nIf you're looking to have a relaxing quiet place to stay on your vacation, seek accomodations elsewhere.",
            "time": 1732980926,
            "translated": false
        },
        {
            "author_name": "Trent Green",
            "author_url": "https://www.google.com/maps/contrib/108570353332076821371/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLxo4NCt4_VCREM9NZ0pURzyA_6elZqgHgJ2sXGUAIaIoo--w=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "Excellent location - walking distance from the train station and most prominent attractions. Professional, friendly, English-speaking staff. Outstanding breakfast with a beautiful view (be sure to go on the terrace). Great service for the room. Lovely traditional decor throughout the hotel. The staff made a repair in our room with no issues or questions. Having such a great hotel room to return to each day was an important part of enjoying our stay in Florence.",
            "time": 1728501699,
            "translated": false
        },
        {
            "author_name": "Suz B",
            "author_url": "https://www.google.com/maps/contrib/111782331570204407865/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIu6MSnAX3hPAgv0XzqC5xoMcwpU0pHQMcVFVpR7YtOrPIPDQ=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "Absolutely beautiful hotel close to the sights. Beautiful rooms with plenty of space and complimentary water, soft drink and tea/coffee plus milk sachets. The breakfast room on the 5 th floor has fantastic views and lovely food. Staff were incredibly nice and helpful. This was one of the best hotels I’ve stayed in during my Italian holiday. I definitely will stay here again!",
            "time": 1724685634,
            "translated": false
        },
        {
            "author_name": "Ravi Venkatesan",
            "author_url": "https://www.google.com/maps/contrib/101866684806853634219/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWXdW_HiTUZwi_gN6XQOtGmmo_1Q6GaYtXdSkR4H_gfwFM1TSHr=s128-c0x00000000-cc-rp-mo",
            "rating": 2,
            "relative_time_description": "2 months ago",
            "text": "The location is very central and convenient. The terrace has magnificent views and a nice bar. Service was decent. I had a room with a tiny window and lots of noise. One lift didn’t work the other was super slow. It was easier to take stairs but getting to 5 th floor is a lot of exercise. Overall a disappointing experience and very expensive at that.  Can do much better",
            "time": 1726412291,
            "translated": false
        },
        {
            "author_name": "miruna croitoru",
            "author_url": "https://www.google.com/maps/contrib/105755124269337496285/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJqTeEK2qPZZwmKMpnNAW4GFTKkRkWFEbej9KpYVPX-NILExQ=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "This place feels special from the moment you walk in. It had a delightful terrace with some of the best views in town where you can have drinks at night and breakfast in the morning. They also have a top floor restaurant which we didn’t try but looked quite sharp. The room had everything we needed and more, and the photographs inside the hotel were loaded with history and beauty. It will make your stay in Florence feel very special.",
            "time": 1723921403,
            "translated": false
        }
    ]
}