{
    "name": "Hotel La Scaletta Florence",
    "rating": 4.4,
    "reviews": [
        {
            "author_name": "Jennifer Langdon",
            "author_url": "https://www.google.com/maps/contrib/110091801233777244242/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXNT9Z_Qn9vRrVmEXQi0DHjI2e7q8wSL_mvT8dxSLtofhdnwa4=s128-c0x00000000-cc-rp-mo",
            "rating": 4,
            "relative_time_description": "a month ago",
            "text": "We had a great stay here! The rooftop restaurant/bar is definitely a highlight. Very helpful staff. Excellent location, walkable to visit the major sights of Florence. The staff is very attentive and helpful, with good advice on airport transit and booked us a taxi for our early departure. We had a garden room on the ground floor, which was very quiet and very clean. The only downside was that our room, because it is under the ancient stone vaults, smelled of damp.",
            "time": 1728410704,
            "translated": false
        },
        {
            "author_name": "Claudia Carta",
            "author_url": "https://www.google.com/maps/contrib/116247454703347518654/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU1f4spcGQ002wXlGQIdHqYrCdAiuumHF2-yt6gjOZwdegJ6OAAYg=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 5,
            "relative_time_description": "2 weeks ago",
            "text": "It's hard to believe this hotel is only three stars... It certainly deserves 5!! It is in an amazing location, walking distance from almost everything. The hotel staff was extremely kind and thoughtful and they even upgraded us to a nicer available room (which was massive!!) after a hard day of travelling which was appreciated. The hotel itself is very nice and I love the style of the rooms and the decor and wall paint. If I'm ever in Florence again I will certainly come back!",
            "time": 1731718909,
            "translated": false
        },
        {
            "author_name": "Kristine Pecora",
            "author_url": "https://www.google.com/maps/contrib/110920414075012807373/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW7r-RgNYoX9b26uimdA87SrXTPBwn6-1JOeQhSsurdXtdwe2D9=s128-c0x00000000-cc-rp-mo",
            "rating": 4,
            "relative_time_description": "a month ago",
            "text": "We really did enjoy our time here. The location couldn't be better. The hotel staff was always friendly.  We loved the rooftop bar!! Our room was excellent except for one thing. It was very damp and musty. I believe it was coming from the air conditioning units. When we arrived, the floor was wet under the units. I did get used to it once I was in the room for a bit but had to get used to it each time we came back to the room. That is the reason why I couldn't give 5 stars",
            "time": 1730731695,
            "translated": false
        },
        {
            "author_name": "Bruton Family",
            "author_url": "https://www.google.com/maps/contrib/109774626370297023670/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLr2cRTduhWUAji1diIzlyHroSdraafhyQzPYVPrkDypXw6mw=s128-c0x00000000-cc-rp-mo",
            "rating": 4,
            "relative_time_description": "3 months ago",
            "text": "The hotel is in a perfect location, with shops, restaurants and attractions at your doorstep. Our room was very large and overlooked the garden. We had stunning alfresco ceilings in our room, which was beautiful. Being a historic building, our bathroom was very small and this was challenging. The breakfasts were very good with lots of options. I would pick again for the location, but the rooms themselves are beginning to show signs of age and may need updating soon.",
            "time": 1725632180,
            "translated": false
        },
        {
            "author_name": "Elizabet Puksto",
            "author_url": "https://www.google.com/maps/contrib/118331640695473997352/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVQkO8vgRUPx2SZTvpaGv9UbIC7t9uriQjcn9HAgcDc9dWBsh0=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "2 weeks ago",
            "text": "Super.\n\nThe enchanting staircase that stole my heart... Walking up and down those stairs felt like stepping into a portal  a world of paintings, stories or perhaps in my mind fairytales. And at night, the top windows created a delightful illusion that had me fooled for quite some time. They resembled the shelves of an old library, and for a moment, I was convinced I’d stumbled upon a hidden, secret library. I spent an absurd amount of time searching for the hidden entrance... Only when the morning light revealed the architectural beauty of the windows did I realize it was just a clever design.\n\nUpstairs, you’ll find a charming terrace with a restaurant that offers great views and a relaxing atmosphere. There is a kind-hearted gentleman who works there daily. His warmth and hospitality were unforgettable.  He’s the kind of person who makes you feel like you’ve known him for years.  He once said to me: \"If you time things in life, you won’t enjoy life.\"",
            "time": 1731866669,
            "translated": false
        }
    ]
}