{
    "name": "Suvadee Thai Restaurant",
    "rating": 4.3,
    "reviews": [
        {
            "author_name": "PaulS",
            "author_url": "https://www.google.com/maps/contrib/115438048143334323105/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVaVE8hLSWwfcC2pKGc-Edi-R46HzRfkHNEYzmcNTtovyJB1QpFaQ=s128-c0x00000000-cc-rp-mo-ba6",
            "rating": 4,
            "relative_time_description": "7 months ago",
            "text": "The food was FINE. Nothing exceptional nor objectionable about it.  Spring rolls - Superb. White Wine - dry white wine was excellent. Wine pours are plentiful and generous. Food- Two different dishes from menu accompanied with exactly the same sauce…. The hospitality was AMAZING, the waitress and manager were both attentive and extremely congenial. I would eat here again. Overall, recommended.",
            "time": 1713861481,
            "translated": false
        },
        {
            "author_name": "Tai Pham",
            "author_url": "https://www.google.com/maps/contrib/113275550637108663016/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ-wnPv5xZtqnAtuRtEjtdHxy8TWFxVHLwVpac-ZMDaG9yU4w=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "3 weeks ago",
            "text": "Found this restaurant as it had the latest closing hour (10:30pm) in town for Asian food. The tom yum clear soup was clean and aromatic, but the portion was to little (could have added more soup to the bowl to make it  more hearty).\n\nThe som tum (papaya salad) was authentic and real comparing to som tum you could buy on Bangkok street food. Usually it’s not easy to find the real of som tum while traveling in Europe or the U.S. / Canada. I like the som tum version here.\n\nThe staff were so friendly and helpful, esp the guy wearing glasses. We had interesting conversations while dining.\n\nOverall, I would highly recommend this restoran when you are in Frankfurt center.",
            "time": 1731472955,
            "translated": false
        },
        {
            "author_name": "Tom Lachowicz",
            "author_url": "https://www.google.com/maps/contrib/108536450950947725361/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXidopRFsfORAEa6Z6nMooJxWmz9Ul_J1GEvfSnixDegKq7WcQ=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "4 months ago",
            "text": "I love this place.  Stopped in for a quick beer , espresso and spring rolls.  Amazing.  People are so nice.  The inside is beautiful.  Clean bathrooms and kid changing station.",
            "time": 1722620019,
            "translated": false
        },
        {
            "author_name": "kerstin abele",
            "author_url": "https://www.google.com/maps/contrib/110060786838754358570/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXGq-kAVO5h5bqEtkeQ5QDXQKj0Ag3P1mHVCjx9MXrRWRHiPc6O7Q=s128-c0x00000000-cc-rp-mo-ba6",
            "rating": 5,
            "relative_time_description": "2 years ago",
            "text": "To me one of the best Thai restaurants in Frankfurt and if you haven't been there, you truly missed out so far and should take the next free opportunity to treat yourself.\n\nHuge menu to pick from, with an impressive amount of vegetarian dishes which is rarely the case at Thai places. Portions are very filling and worth every penny. Their curry is amazing. And they also have plenty of interesting dishes that I hadn't seen before and I am making an effort to try them all.\n\nService is fab, not a single thing to complain about and the restaurant has its own little atmosphere with the typical Thai interior.",
            "time": 1650695397,
            "translated": false
        },
        {
            "author_name": "R K",
            "author_url": "https://www.google.com/maps/contrib/115421791497598186904/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJQmLkFMZ5JT62dHyAL_sHhrofuqgQtVAP9L17r-JAHzSDZlg=s128-c0x00000000-cc-rp-mo",
            "rating": 1,
            "relative_time_description": "2 months ago",
            "text": "Would give it 0 stars if I could!\n\nFirst feeling of trickery was having a menu outside the restaurant with way cheaper prices than the actual dishes. Main courses cost around 19-21 euros per dish and portion sizes are TINY for the price.\n\nWe ordered a beef and chicken dish, both we're EXTREMELY SALTY and the meat tasted defrosted rather than fresh.\n\nWhen it came time to pay the male waiter kept asking for a big tip, when I said I wanted to only pay the price on the bill, he kept mentioning a tip.\n\nWe told him we didn't like the food and it was salty, he refused to negative feedback and kept just saying it's the style of the food here.\n\nNEVER AGAIN! There are lots of bad restaurants in Frankfurt but so far this is the worst I've experienced!",
            "time": 1728137827,
            "translated": false
        }
    ]
}