{
    "name": "Steigenberger Frankfurter Hof",
    "rating": 4.5,
    "reviews": [
        {
            "author_name": "Sunni Lal",
            "author_url": "https://www.google.com/maps/contrib/114699553303388542914/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWUQiG4_XvXWjbXHEbOe7F7EeTuKDQFLmFjvr67e8yfoNQ7Ei5f=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "I stayed here for a few nights a couple weeks ago. Unfortunately there were some issues with the room I had originally booked, so the staff upgraded me to a suite which was sweet! I loved the suite. I also ordered flowers in my original booking which they brought quite soon after checking in. The suite was very spacious, with the highlight being the closet and bathroom. There were also two rooms and I loved how massive the windows were. The closet was super spacious for my massive suitcase. I also just liked the way it looked (nice glossy furnishing, real wood). The bathroom was massive with these colorful lights that gradually turn different colors while showering. There was a jacuzzi with a TV which I never ended up using. There was also a large floor to ceiling mirror outside of the bathroom (helpful). The mattress was also very comfortable (I’m a medium firm gal).",
            "time": 1726104978,
            "translated": false
        },
        {
            "author_name": "LuDster",
            "author_url": "https://www.google.com/maps/contrib/118103232734885705632/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXHDlz4IViltg582vPIRBp5N9T6P3xRSuyqJmRiitSL1CbX-P4=s128-c0x00000000-cc-rp-mo-ba6",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "Really classy hotel, in the center of Frankfurt and just a short walk from the main shops 👍\nThe hotel is very plush, it has a beautiful design and is well laid out.\nThe Bedrooms are spacious and the beds are comfortable, with lots of Wardrobe storage and a Desk to work from.  The Bathroom includes a Bath as well as a Shower which was good👍.  The room has Aircon although it didn't seem great 🫤, but you are able to open the Windows which is great👍\nViews from inside Bedrooms are pretty miserable (like looking from a Prison Cell 🫤) if you're staying there, book/ask for an 'outside facing' room\nBreakfast is very good with a large mix of options, all well prepared 🙂\nThe Bar area is good and also included a nice outdoor area which is very nice and chilled 😎\nI didn't get a chance to try the Gym/Spa, but colleagues who used them said that they were good 👍\nI thoroughly recommend staying there 👍",
            "time": 1729960510,
            "translated": false
        },
        {
            "author_name": "Morgan Jaffray",
            "author_url": "https://www.google.com/maps/contrib/104555179642058477068/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVqq-G8kQ8v79AEeYMoYog9RHOz9IKgDPfb7wrMDkGwPXLfJuQ4lw=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "Excellent service. Location is prime! Especially if you love to shop. Customer service was fabulous and love the Valet service! The Valet was so friendly and welcoming with each interaction plus his outfits were dapper :) Excited to go back and stay again! Rooms were meticulously clean and modern. I wish I could move in!",
            "time": 1728144803,
            "translated": false
        },
        {
            "author_name": "Kinga Szaniszló",
            "author_url": "https://www.google.com/maps/contrib/102999551053078842835/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXiXYfdBdueeC8BvFxCCyB5V0g15eXgU7A_NYKAOo48sIGlvgk=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "We loved the hotel. I can't get over the fact that you can set the water temperature in the shower and in the bathtub also! It was awesome! The view was amazing, we got room service and it was fast and delicious!\nThe crew is super helpful, they even booked train tickets for us so I would give it more stars if I could!",
            "time": 1725334604,
            "translated": false
        },
        {
            "author_name": "Paul Guglielmino",
            "author_url": "https://www.google.com/maps/contrib/105381580789922345842/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU9Heg2Em1PAPoJ4fqptWfgW5yx4UaEk0wVt8w_4WhQRpJqN7RR=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "5 months ago",
            "text": "Overall great hotel and the location is very convenient. We found the staff very cheerful and helpful. The breakfast was very tasty and had a pretty good selection.\n\nThe last renovation was around 15 years ago and the rooms are starting to show some wear. Also when my wife went to check the menu in the Oscar restaurant in the lobby, she saw a mouse hanging around. We decided not to eat there. :)",
            "time": 1720355838,
            "translated": false
        }
    ]
}