{
    "name": "Heimat",
    "rating": 4.6,
    "reviews": [
        {
            "author_name": "Tati Zhemaytis",
            "author_url": "https://www.google.com/maps/contrib/113995268105609073401/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXU7vUM-dlf9461i9P0-05WCYalzyGCBTfrZmEsKQee5Izg74r9=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "6 months ago",
            "text": "I would say that this is one of my favorite places in Frankfurt so far. It is always great to meet here with friends or even have a date😊 the food is delicious, and the menu is constantly changing, which is good if you go there often like I do now.\nThe wine list is impressive, and the sommelier is super nice and friendly .\nThe only disadvantage is that it’s quite small(for me it is also the advantage), and you better book it in advance to be seated.",
            "time": 1717495111,
            "translated": false
        },
        {
            "author_name": "Justin Teo",
            "author_url": "https://www.google.com/maps/contrib/111647011681525182002/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIikpr2q0VaIgZv3yUq4h1ROCdalxmr1DcXOxmRdr_ZKHnZWA=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 5,
            "relative_time_description": "4 months ago",
            "text": "We arrived into Frankfurt on a late night flight arrival after a holiday week in UK and Switzerland, and looking for supper following our arrival into the city. We found Heimat after searching online for German wines and late night dining, but we were informed that the restaurant's kitchen was already closed when we arrived at Heimat just past 10.00pm although the Google listing mentioned their 1.00am closing. However Haimat kindly offered us a mixed platter of sliced meats, cheeses, and spreads despite their kitchen having closed. More importantly, their excellent wine pairing was mind blowing. Heimat far exceeded our dining experiences during our European trips. We each tried 3 different wines by the glass and a full meat, cheese and bread platter. Their service was reserved but still friendly, more actions and fewer words which was refreshing after our holidays. We tried wine bars in London, Thun and Vevey but this Frankfurt establishment came out tops. Perhaps its personal preferences, but Heimat is the best place for regional wines and Frankfurt hospitality. The bosses and their staff were very welcoming despite the late timing on a Monday night. We were looking for good German wine offerings and we were well rewarded by Heimat's selection. If you visit or are based in Frankfurt, do visit Heimat for excellent wines and hospitality.",
            "time": 1720511160,
            "translated": false
        },
        {
            "author_name": "C J",
            "author_url": "https://www.google.com/maps/contrib/104324267504435663478/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK0zLGgZwU1CtKVW00FodmA2gad5Y7rLlAQlOeJerWZ-SOx4g=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "9 months ago",
            "text": "This restaurant is the gift that keeps on giving... my 'must visit' anytime I am in Frankfurt. Oliver (somm legend) and the team are just so welcoming and knowledgeable about their menu and incredible range of wines by the glass. The food is precise and adventurous and amazing what they create in such a tiny space. Ask for a counter seat if you are dining alone. Thank you again and see you very soon!",
            "time": 1708592253,
            "translated": false
        },
        {
            "author_name": "MH Apin",
            "author_url": "https://www.google.com/maps/contrib/110452228832810890235/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWm650uqStsZqkMF471jzBBA1Q48y_sIJoJHkHJ1WJEGz9w79dmxw=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "a year ago",
            "text": "Small restaurant but that is the beauty of it. Very intimate, sat by the food counter. Amazing choices of white and red wine. And menu is simple no fuzz. The starter with the salad with goat cheese was by far my favourite. And the broccoli main dish was excellent.  Definitely a place to visit when in Frankfurt.",
            "time": 1683569059,
            "translated": false
        },
        {
            "author_name": "Julia Jay",
            "author_url": "https://www.google.com/maps/contrib/104397261376624285998/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUPvYyGla84wfZ_3J-QlwMUqGktDkQH4BKhl8MrWTRD4W3zGvaa=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "3 years ago",
            "text": "Really good place for a nice dinner. To make a reservation was very easy and I would give an extra star to the gentleman on the phone, who stayed very friendly and calm after I switched the reservation time twice :) The food & wine were great as well as the atmosphere - we had a table inside, as outside it can be a little bit noisy (see location on google maps). The prices are not cheap, but it was every euro worth. We will definitely come back again!",
            "time": 1631740098,
            "translated": false
        }
    ]
}