{
    "name": "Radisson Blu Hotel, Frankfurt",
    "rating": 4.2,
    "reviews": [
        {
            "author_name": "Darlin Premela",
            "author_url": "https://www.google.com/maps/contrib/102785930057096805415/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI4dHPLKPqIIFFfrNHD6ElDeiYjodVeQZsIRxBmfhGZ05K-=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "I recently had the pleasure of staying at Radisson Blu Hotel, and it was a very comfortable stay. The rooms were neat and quiet. The staff were courteous and extremely helpful. I want to express my gratitude to Sara from the front desk for her exceptional support during a difficult time. Her patience and assistance in helping me print important documents when I lost my passport were invaluable. Thank you once again for your hospitality.",
            "time": 1729934710,
            "translated": false
        },
        {
            "author_name": "Jenna White",
            "author_url": "https://www.google.com/maps/contrib/109761118711024331968/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWy6NyGee-3lmBvOlfT8xpHX2y_RxBc3FaWSN-1ClhyBZjhLmY=s128-c0x00000000-cc-rp-mo",
            "rating": 1,
            "relative_time_description": "3 months ago",
            "text": "AVOID for business travel. No AC, no food, and understaffed. This hotel ruined a business trip for me. AC was out in my room and never got fixed. They did not move me to another room with AC, so I was a hot sweaty mess every day. No food this week for hotel guests. The bar and restaurant are closed off for some kind of conference/show and no room service available. It's not a centrally-located hotel so no restaurants on the block. Understaffed - no one picks up the \"one touch\" call button and the wait in the lobby to talk to a staff member was long because the lobby was filled with roughly a dozen unhappy guests. My room key has stopped working every day, so I've had to get that fixed repeatedly. All of these things add up to a very inconvenient experience for a business traveler. Pay more money and stay at the Marriott. I guarantee you will be happier. (Also, the gym equipment is very outdated). I usually like this chain and have been very happy with Radisson Blu stays elsewhere. Unfortunately this location falls very short of the Radisson Blu standard I've come to expect.",
            "time": 1725552238,
            "translated": false
        },
        {
            "author_name": "Joshua Sompotan",
            "author_url": "https://www.google.com/maps/contrib/112610441182730442728/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK4A4lW6UYiDBuGZdNFSJNCW8cYAbTXZ2YLFXX4AfgNUbQkwQ=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "This hotel is by far one of the best 4* hotel in Frankfurt. I stayed in here last week for business trip. Starting from the lobby, I had great experience with the receptionist where check in process was smooth. The hotel room and its interior were better than largest hotel chain in their category in Frankfurt. Moreover, the gym and pool are also amazing. On top of the hotel, the pool is heated and it has great view towards Frankfurt skyscrapers.\n\nThe only thing that the room lack is ironing equipment which is a must in my opinion for business traveler. In addition, the third elevator on the right side didn't work properly where I stucked for couple minutes and as I asked the receptionist, they were not surprised about this problem. Lastly, the hotel location is bit far from public transportation which is located in quiet neighborhood.\n\nAll in all, this hotel has great value for the service that they offer to their customer.",
            "time": 1723936478,
            "translated": false
        },
        {
            "author_name": "Steven Sciriha",
            "author_url": "https://www.google.com/maps/contrib/108354212958983125031/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLFKYfET8FCG3J_q4QEZzKKwUdu5AurCFZVCO719MuMI1ArVQ=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 1,
            "relative_time_description": "a month ago",
            "text": "I just have to agree with a few reviewers here...simply do NOT book this hotel for Business trips.\n\nI made this mistake last month (09/2024) and paid the price...\n\nI will start by saying the issues were not directly related to the stay itself even though there was an issue with the power supply at that time which meant breakfast and other facilities were limited, as I understand that unexpected problems can occur.\n\nWhat I don't understand is the following:\n\n1. Being promised an invoice receipt for my stay via email but never actually sending it.\n2. Realizing it was never sent as I preparing my monthly expenses and attempting to call the hotel and never getting through even after repeated attempts for over an hour.\n3. Finally getting through to the option for new reservations (of course that one is answered promptly) but being told they cannot assist\n4. Sending an email hoping to have better luck and eventually getting a response that the receipt was going to be sent to my email address.\n5. Realizing the promised invoice never arrived by the next day so I ended up in the same cycle of calling and emailing repeatedly with no response...we're talking hours from my time wasted.\n6. Finally getting the invoice sent accompanied by a curt and unapologetic email \"if you're not getting the invoice please check your spam\"\n\nThis dreadful level of customer experience is completely unacceptable in 2024...I cannot even imagine needing to deal with this hotel on a more serious or urgent topic.\n\nI will be avoiding Radisson Blu hotels in the future for Business travel and will be advocating the same with my colleagues.",
            "time": 1728585721,
            "translated": false
        },
        {
            "author_name": "Dr Charbel Chedrawy",
            "author_url": "https://www.google.com/maps/contrib/116594331615749012405/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUiU3Ba7WH8U5RQFSDrLBJWb-psnziovVXz758JgQw2W4l5he1b8Q=s128-c0x00000000-cc-rp-mo-ba7",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "Well, the Radisson Blu Hotel Chain is really amazing.\nWhether in Europe or in Asia, it's always an upscale place with excellent facilities and one of the best value-for-your-money services.\nThe rooms are spacious and clean, the service is good, and the location is perfect.\nEnjoy...",
            "time": 1724570620,
            "translated": false
        }
    ]
}