{
    "name": "DORMERO Hotel Frankfurt Messe",
    "rating": 4,
    "reviews": [
        {
            "author_name": "Tamar Tsanava",
            "author_url": "https://www.google.com/maps/contrib/102547169078585503557/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV3bLrbORcNeHVJYRwB1KCiUmGIll9wNb2U6t6Nn9Vw0iVyWcWc=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 3,
            "relative_time_description": "a month ago",
            "text": "Room is not worth the price. The room was big, with a nice king-size bed and good tv. But the hygiene of the room was not good. Only the bed was clean and the rest was not. Bathroom had for example many mold spots (of which it is no effort to clean).\nThe common area of the hotel is also lacking attention, rumbly and no love. Staff is friendly, but they are not recognisable as staff-members and so it does not appear as a proffesional service. Check-in was very easy, but the rest of the time we couldn't find anybody to be helped by because the desk is closed several hours a day (we didnt expect that).",
            "time": 1730038551,
            "translated": false
        },
        {
            "author_name": "Hana O",
            "author_url": "https://www.google.com/maps/contrib/105765045424253443001/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIkiRUMBwDhdtsaVxTXxFJUbjUPQ7XQ0hkhefWft4NKRsIM1g=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 2,
            "relative_time_description": "5 months ago",
            "text": "This hotel was a painful experience. Absurdly overpriced considering the services offered. The room was dirty everywhere, with trash from previous guests under the bed. The light in the hallway wasn't working, the adjacent room was missing a door and was under renovation, so there was a smell of paint and adhesives everywhere. In the bathroom, the tiles were loose, and there was limescale everywhere. The room also had a sewage smell. The TV remote was non-functional. The air conditioning was extremely noisy. After exchanging towels, we were only given one set instead of one for each person. Breakfast for hotel guests is provided at a distant bistro, where the staff is very unfriendly, handing out pre-prepared breakfast plates with no choice – some people get eggs, others don't.",
            "time": 1718373271,
            "translated": false
        },
        {
            "author_name": "Tony Yule",
            "author_url": "https://www.google.com/maps/contrib/106760854052128502810/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW5U3XeGRdpQBJHtNUf0KlEMut5lbS-0KDwzThgMowTu-xoacQb=s128-c0x00000000-cc-rp-mo",
            "rating": 1,
            "relative_time_description": "5 months ago",
            "text": "Terrible WiFi and an appalling breakfast room and offering. If this was a hostel at hostel prices it would have been a fabulous 4 star review. But for €400 for 2 nights it was not even in the same galaxy for quality. Only redeeming feature was location. I hope the owners reach out and offer some form of good will gesture as using this hotel for work was completely hopeless.",
            "time": 1720250460,
            "translated": false
        },
        {
            "author_name": "Bogdan Fricosu",
            "author_url": "https://www.google.com/maps/contrib/110081022824812621189/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKHe0--nldxEPjxHuI9q5gyd7Vh9UvrLfANuBV0jU5N_udp=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "5 months ago",
            "text": "Very pleasant hotel with everything you need for a stay during a business trip to Frankfurt. Parking right next to hotel and secure. Staff was excellent, especially Omar from reception, who was very kind and respectful, helping me with advice for my enquiries about the city night life and attractions. Very good value for money and a very good hotel altogether.",
            "time": 1719487149,
            "translated": false
        },
        {
            "author_name": "rashid mwatajiri",
            "author_url": "https://www.google.com/maps/contrib/112711809040815220346/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI267OsW3mdFNtE-x1ZiroiMOtJP9npM6Gr8BS8n2hNDEBKiQ=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 2,
            "relative_time_description": "in the last week",
            "text": "Worn out rooms, disfunctioning TV, smelling beds, dirty toilets and many more. The hotel bar was closed. Breakfast was too expensive and very loud all night long. It wasn't a pleasant stay for us.",
            "time": 1732891902,
            "translated": false
        }
    ]
}