{
    "name": "Flemings Hotel Frankfurt Main-Riverside",
    "rating": 4.6,
    "reviews": [
        {
            "author_name": "English Center Haar",
            "author_url": "https://www.google.com/maps/contrib/112100702777485736981/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLkXMNFWQbzmiGntRs0PlHrP1-u-O2jDrctL0wOzTBRqmFIGw=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "3 weeks ago",
            "text": "I had a great experience in this hotel. The rooms are clean. The service is excellent. The staff are very friendly and professional. I would like to thank Kelly, Laura and Anna for the great service at the breakfast. The coffee tasted wonderful and the smiley faces make us wish to stay in this hotel again. See you soon!",
            "time": 1731228035,
            "translated": false
        },
        {
            "author_name": "Kevin Morales",
            "author_url": "https://www.google.com/maps/contrib/116823601800184936681/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKtxWYbKcW94GWbZ4Z7XWYh04-EVXjvKj_0anbTEwHrOMQrIw=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "3 weeks ago",
            "text": "Recently stayed for five days and would absolutely stay again. The staff went above and beyond to make sure we enjoyed ourselves and that our needs were met. The day-time front desk manager and also the bartender from Turkey, who works in the evening, were awesome and made us feel more than welcome.\n\nThe room was clean and big enough for what we needed, the location is great and near lots of cool things to see… I look forward to my next stay here.",
            "time": 1731428507,
            "translated": false
        },
        {
            "author_name": "Julianna Ekert",
            "author_url": "https://www.google.com/maps/contrib/105403071895685631058/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVE2HCT4-ay-CUyJPGEIu6DIwmEUQ6nVdsA9ylfr4OgSuZJwgFJ5g=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "3 weeks ago",
            "text": "Thank you for the nice stay. The service was excellent. Very friendly staff, taking an extra step to make sure the guests feel welcome. The catering during the conference was delicious. The breakfast service and the bartenders amazing: taking an extra step and making an effort to serve beyound expectations (Kelly, Ana and Laura). Thank you!",
            "time": 1731228180,
            "translated": false
        },
        {
            "author_name": "Rachel Bleasel",
            "author_url": "https://www.google.com/maps/contrib/104593433027592650326/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIUcieUv90JTV8EdnjKaTEvBwUDgfzuzKM1qsl2TU3ighNBkQ=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 4,
            "relative_time_description": "3 months ago",
            "text": "Location was good, very convenient to get to the old town. Air conditioning was great. Beds were comfortable and breakfast being included was a perk though just okay. Hotel staff were extremely accommodating to help us book an extra night when it was needed. However our room lacked both a mini fridge and a direct phone to reception which was an inconvenience.",
            "time": 1724442118,
            "translated": false
        },
        {
            "author_name": "Louise Vicary",
            "author_url": "https://www.google.com/maps/contrib/112557107336246095014/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLrxhteuoqBSCKrsYC_804vwqZ-skoIEsArLIdc2oUe8WDaFA=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "The pictures of the hotel looked too good to be true for the price so we didn’t expect much. Our expectations were definitely exceeded. The room and hotel matched the pictures and were so clean and comfortable.\nThe view from the hotel room should be advertised even more because it was truly wonderful. We were facing the old church and the skyscrapers, so we really got to see it all.\nThe cleaning of the rooms was very efficient and they even provide an option of cleaning everyday or every other day with new towels. In addition they provide complimentary water bottles every day and a “sleep well” package consisting of tea, eye mask, ear plugs, and a hot water bottle. The receptionists were so helpful and kind when we were doing our self check-in incorrectly (but that was my fault since I put my full name on the registration which made it difficult to find). The hotel front door is always unlocked and there is always a receptionist, whom were all very kind and said hello every time we came in.\nThe location of the hotel was in a surprisingly safe and clean area with good connections to public transport and restaurants at walking distance.",
            "time": 1723745870,
            "translated": false
        }
    ]
}