{
    "name": "25hours Hotel Frankfurt The Trip",
    "rating": 4.2,
    "reviews": [
        {
            "author_name": "Briliant",
            "author_url": "https://www.google.com/maps/contrib/112505652019196905048/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV2HRWK3_P3FBdnsdqNt8Dnw5Uelnuqtf3C77pZ-I80Xj8Elh8b=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "I had a pleasant stay at this hotel during my recent three-night business trip. The hotel's unique concept was quite intriguing, and it brought back fond memories of my teenage bedroom. The staff members were exceptionally friendly and accommodating, and the hotel even had an on-site restaurant and bar for my convenience. Additionally, there was a complimentary sauna on the top floor, which provided a wonderful opportunity to unwind after a busy day. The hotel's location was particularly advantageous, as it was merely a three-minute walk from the train station, making it ideal for my business-related travel needs. The bed was exceptionally comfortable, with soft pillows and a cozy blanket that ensured a restful night's sleep.\n\nHowever, I must mention that the surrounding area of the hotel was not particularly pleasant. There were a noticeable number of individuals engaging in drug-related activities in the vicinity, which made it somewhat uncomfortable to walk around, especially during nighttime. Nevertheless, if one is aware of this situation and takes appropriate precautions, such as walking briskly and avoiding eye contact, it is possible to navigate the area without significant concerns. Furthermore, the hotel's bar provided a welcoming and secure environment for those who enjoy staying up late.\n\nOverall, I had a positive experience at the hotel and would recommend it to others.",
            "time": 1727550137,
            "translated": false
        },
        {
            "author_name": "Matt C",
            "author_url": "https://www.google.com/maps/contrib/115088668612510598396/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWBsU0oROUE4V9D14wzIrGvifUZXqVbxXFBQZSDRBEKvCW8HfbT=s128-c0x00000000-cc-rp-mo-ba8",
            "rating": 4,
            "relative_time_description": "in the last week",
            "text": "Enjoyed a nice stay here at 25hours  cosy place with all the amenities you would need including rooftop sauna and chill out area. Restaurant next door is good with many options. Room was clean and spacious. Very close to HBF station, area is a little seedy but didn’t feel that hindered the hotel.",
            "time": 1733044982,
            "translated": false
        },
        {
            "author_name": "Aaron Fleming",
            "author_url": "https://www.google.com/maps/contrib/114301032048484375230/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLjx6tgrnoOdw9mIe3HpK_2FA7lneTvB7ZLiLfYBju4cW9zOcku=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 2,
            "relative_time_description": "2 months ago",
            "text": "As beautiful as this hotel is, I can't recommend it for two reasons. Primarily, it was extremely noisy late at night with loud parties in the courtyard. The main thing I need at a hotel is a comfortable sleep, but the hotel did not enforce any noise control in its own courtyard where all hotel room windows are facing. They should allow loud groups on the roof only. This is in their control.\n\nThe other reason is out of their control - the area outside the hotel is very sketchy. Drugged out homeless people sleeping on the sidewalk. Sketchy people standing around in the shadows. Bad place to be for families and solo travelers.\n\nThe hotel itself is gorgeous. I loved the room, the styling, and character of the hotel. The staff were very nice. I didn't have the breakfast so I  can't speak on it.\n\nSo, it's fine if you're there to party loudly all night and if you don't mind being in a dangerous part of town.",
            "time": 1727430927,
            "translated": false
        },
        {
            "author_name": "SandraCJ",
            "author_url": "https://www.google.com/maps/contrib/112745553411498177583/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWnsTg-dadhRwezBc4hzwz-sLdPZCH-pEG5a8yVEw5ydrzHaxcq=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "I was a little worried when I read some of the reviews regarding the noise. I asked for a ‘quiet’ room as I am a light sleeper and I got the perfect room.\nThe room was specious and decorated with a lot of love and care and some nice original touches. The bed and sheets were very comfortable. The staff was very friendly and helpful! The lobby has cosy seats and a small coffee place.\nThe only downside of the hotel might be the area. Yes, its very close to the train station, but the streets are also filled with groups of drug addicts and pornshops/brothels. I travelled with a male friend but I can imagine travelling alone this might be a little uncomfortable, which is unfortunate because the hotel is a gem and worth a five star review for sure!",
            "time": 1728802096,
            "translated": false
        },
        {
            "author_name": "XXtoro Pluto",
            "author_url": "https://www.google.com/maps/contrib/106842127982973861643/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXa2SozToFnD3KWuie1WST7alZ27fhBFevEi2nU6iVWuuhb6csR=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "4 months ago",
            "text": "Love this hotel. Easy walk from the main station, it is a well designed hotel with comfortable rooms. Service is great, the lounge lobby and courtyard are great places to relax.\n\nReally enjoyed the hotel. The street outside can be a little dodgy late at night, but will definitely stay here again when I’m next in Frankfurt.",
            "time": 1721063088,
            "translated": false
        }
    ]
}