{
    "name": "Kabuki",
    "rating": 4.7,
    "reviews": [
        {
            "author_name": "Nelleke van der Lei",
            "author_url": "https://www.google.com/maps/contrib/117446545844267159478/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKhhMENtmuryS0KNF9_vCuz6uRUYy--IQj63eLlnojZj1jUWQ=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "6 months ago",
            "text": "From the outside you will never guess what a great restaurant is hidden here. The staff of Kabuki ensures that you will have a whole new dining experience. The majority of the food is prepared directly in front of you and it is a lot of fun to watch the chef. The ingredients were very fresh and of high quality, which resulted in very tasty food. The drinks are rather expensive but creative (€8 for a non-alcoholic limo). Overall, we had a great evening and we will definitely come back!",
            "time": 1717224296,
            "translated": false
        },
        {
            "author_name": "Ryan Thomas",
            "author_url": "https://www.google.com/maps/contrib/117459734662866689739/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKanzWL2bBd72hKBQhMJmhAThKwv_GI8xI-Qbmdm3D3_99_vg=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a year ago",
            "text": "One of the best meals I have ever had. Every dish was exquisite. I highly recommend. We felt satisfied when we left. Not too full and definitely not hungry. From the presentation to the taste it was amazing.",
            "time": 1699741667,
            "translated": false
        },
        {
            "author_name": "Polina Ermilova",
            "author_url": "https://www.google.com/maps/contrib/105802012853570311441/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXu-qQ2LLVZhHGqUkftC82vMvXLzzIxD5U2qqzu5KCso9WVFw0S=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "6 months ago",
            "text": "Yesterday, we had dinner at a teppanyaki-style Japanese restaurant in Frankfurt, and it was an amazing experience. This restaurant offers a unique format where the chef cooks right in front of you at a U-shaped table, allowing you to enjoy the spectacle of the cooking process on a large griddle.\n\nWe ordered a set menu that included a variety of small dishes. Despite the small portions, there were decent pauses between them, allowing us to fully appreciate each dish.\n\nThe first course was an appetizer, and the menu included various options – fish, raw, cooked, and meat. The second course was shrimp with a mushroom puree, although I don't recall its specific name. Then we were served a lemon sorbet to cleanse our palates before the main course. The next course was vegetables: potato, pak choi, and mushrooms – all in small portions but very fresh and delicious.\n\nThe main course in our meat menu included wagyu – incredibly delicious beef, tender and delicate, in an amazing sauce with vegetables and egg. It was probably the best meat I've ever tasted.\n\nFor dessert, we had fried ice cream wrapped in rice paper, fried on the grill, and served with fruits and matcha powder. The dessert was fantastic.\n\nThe chef was charismatic and experienced, a true Japanese professional, adding to the authenticity. All the staff spoke Japanese among themselves, which enhanced the genuine atmosphere. The ingredients were of the highest quality. However, it's worth noting that this experience is quite pricey – the set menu costs around 95 euros per person. We tried both set menus – the 95-euro and the 105-euro ones, and we actually preferred the cheaper option, although the wagyu in the more expensive menu was superb.\n\nThis restaurant is perfect for special occasions. As a nice touch, in celebration of our wedding anniversary, they took a photo of us with their mascot – a chubby cat with a fish. The photo was printed on the spot, and the waitress signed it in Japanese with good wishes.\n\nI highly recommend this restaurant to anyone looking for a unique and unforgettable culinary experience. And I will definitely return there again.",
            "time": 1716458034,
            "translated": false
        },
        {
            "author_name": "Klein suke",
            "author_url": "https://www.google.com/maps/contrib/102318107801555940991/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXguJs3N7eur4ozS6llyC2YX-ylG-V4kBDEpI9ymHv8XHdbg04Vlw=s128-c0x00000000-cc-rp-mo-ba6",
            "rating": 4,
            "relative_time_description": "a year ago",
            "text": "I recently visited a Japanese restaurant and had a wonderful experience. I opted for the Sukiyaki and it was incredibly delicious, filling me up completely. The Teppanyaki-style cooking was unique for me as a European, and it seemed to be a popular choice amongst the locals. The restaurant had a great ambiance with a lively atmosphere, and the service was top-notch. The staff was friendly and accommodating, making sure that I had an enjoyable time. Overall, I highly recommend this restaurant to anyone looking for an authentic Japanese dining experience. The food, ambiance, and service were all outstanding, making for a memorable meal.",
            "time": 1681125273,
            "translated": false
        },
        {
            "author_name": "N VB",
            "author_url": "https://www.google.com/maps/contrib/102245738842587004651/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIuJUk1nKYmfTFsBcHRwhGqEZ5Dk35S664ieLAGUpFp4SCYQg=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "2 years ago",
            "text": "Nice experience! You saw the chef freshly cooked all dishes. It was quite expensive but it was fun watching them cooking. The taste was also great (they put so much butter in all dishes, which we love it! But in the end it was too greasy)",
            "time": 1668463741,
            "translated": false
        }
    ]
}