{
    "name": "Savigny Hotel Frankfurt-City",
    "rating": 3.8,
    "reviews": [
        {
            "author_name": "Lucas Schieder",
            "author_url": "https://www.google.com/maps/contrib/102548899476286767695/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUnI4UZv7yYKYAyO0orCvq4eYwFkGKoslBz0n1uYz0AtHsoFZCiMQ=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 4,
            "relative_time_description": "7 years ago",
            "text": "The hotel is in a very convenient location for the exhibition centre and there are many decent restaurants around. The staff seem generally friendly. The room I had wasn't bad but could do with a bit if upgrading and maybe a thorough clean, the floor always felt a bit dirty and the curtains have many stains and there is some mould around the shower. The breakfast in the morning is very extensive and nice. In conclusion this is a decent business hotel and close to the exhibition centre for any fairs or conferences but if I was going on holiday I would not stay here despite the cheap price.",
            "time": 1512065158,
            "translated": false
        },
        {
            "author_name": "Sally Langdon",
            "author_url": "https://www.google.com/maps/contrib/103387960078001340238/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJqzgZmTlCuvukakI--aV5EWYC51S3c_1sb5y9iIdpPXFLuBQ=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "10 years ago",
            "text": "We stayed here whilst on a business visit to Frankfurt and are sad that this convenient hotel will no longer be there as it is closing shortly before Christmas.  Our three day stay was enjoyable, we slept well and ate extremely well, especially the breakfast/  But our top accolade must most surely go to the staff who were  always totally professional and efficient from the porter, the receptionists and the restaurant staff.\n\nOur room  was perhaps in need of a little updating, especially in the bathroom and our pillow allowance could have been more generous, but an extra pillow was readily supplied.  And how nice would it be to have a kettle in the room!\n\nAs most hotels nowadays, the Hotel Savigny uses a card system for the room key and nothing is more annoying than arriving back after a long day, walking along a long passage,going up four floors and along the corridor to your room, to find that the \"key\" will not let you in.\n\nThank you and all good wishes for the future to all the staff.",
            "time": 1414242331,
            "translated": false
        },
        {
            "author_name": "Florian Mueller",
            "author_url": "https://www.google.com/maps/contrib/110594779583429264825/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKKDbH9RHRjNGdvEbO06Vozt_NVca5YirjrfR2L1W5F3wPZiA=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 3,
            "relative_time_description": "5 years ago",
            "text": "The hotel was OK, maybe I was still in a non renovated room as it was really not up to my expectations - bathroom had moldy corners and door must have been broken open once - the frame was held by a wedge and the lock was barely fixed. For the price unacceptable. The breakfast was good and plentiful.",
            "time": 1544257170,
            "translated": false
        },
        {
            "author_name": "Mangesh Agarwal",
            "author_url": "https://www.google.com/maps/contrib/101620500506898459596/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWbVABHVq48eESiK8T8WYAgjb9xTRrZcIXZ2LXWnV6Xlzyevk_Y=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 4,
            "relative_time_description": "6 years ago",
            "text": "Hotel is very close to the Frankfurt main station,  600 m walking distance. Located in a quiet place. The reception staff was friendly. Rooms are very small though. The bathroom looked very old and require a renovation. Room has basic amenities. All in all okay restaurant. However,  if you get a better one for 115€, please go for it.",
            "time": 1513539570,
            "translated": false
        },
        {
            "author_name": "Sascha Giese",
            "author_url": "https://www.google.com/maps/contrib/103586535382827007917/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWKLDAoWXpMQ1q6wivVy3ro39PZgtwnOiRtYQE1IIyAzCGGBlwhTQ=s128-c0x00000000-cc-rp-mo-ba6",
            "rating": 3,
            "relative_time_description": "7 years ago",
            "text": "Very good in the basic things! Rooms spacious modern and clean. Staff friendly. Breakfast OK, location OK, just don't go towards the train station as you will find dozens of Heroin addicts on the streets. WiFi is a bit dodgy and disconnects both in room and reception. Now: stay away from the restaurant. Really bad, worse than Mcdonalds.",
            "time": 1504905901,
            "translated": false
        }
    ]
}