{
    "name": "Panthera Rodizio",
    "rating": 4.6,
    "reviews": [
        {
            "author_name": "Carl Johnson",
            "author_url": "https://www.google.com/maps/contrib/117389836132373210519/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWS8KQZRl4oD9ekrbBRy_vPtmO78SNR8nYNx_vOve-vnXq74lQZ=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 4,
            "relative_time_description": "a year ago",
            "text": "I had such a great experience to dine here. the service was fantastic, food variety, drinks menu was wonderful. the place looks super clean including restrooms. I believe it has wheelchair accessibility inside. the quality of the meats were great. there are many availability on buffet area, salads, sweets,.. the staff were polite and had great sense of humor. Its really recommended by me and I hope they keep it up.",
            "time": 1701387029,
            "translated": false
        },
        {
            "author_name": "Tomasz",
            "author_url": "https://www.google.com/maps/contrib/100430086536508605482/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXBKluyOhkJ3_R3ZwU-JCeGqB5SKQ0TrpU8782KxmvpkR-f9kHC7g=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "great place with atmosphere, delicious food and great service with a sense of humor. If someone is a lover of meat dishes, this is the perfect place for them!",
            "time": 1726173364,
            "translated": false
        },
        {
            "author_name": "V Y",
            "author_url": "https://www.google.com/maps/contrib/101249707317881300897/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXdtkvIBxq8b92YjvVxkUSNINTsn256skrj_pjUifXYFhiN42w=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 4,
            "relative_time_description": "6 months ago",
            "text": "Lots & lots & lots of meat, although I found that taste & texture can be quite hit or miss. If you get buffet — you get access to salad bar&desserts. Staff Rotating not only with meats but also with sides. Although I would recommend to tone down on them and concentrate on the main thing, try grilled champignons, they were exceptionally juicy and flavourful. Sercice can be super quick to super slow depending on luck.",
            "time": 1716059956,
            "translated": false
        },
        {
            "author_name": "Connie Wu",
            "author_url": "https://www.google.com/maps/contrib/103251517332123758118/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWCNWOOKJreUBo1F-LkGZbqex45LjO6vV6t_LctPil-5jJeDBphCA=s128-c0x00000000-cc-rp-mo-ba6",
            "rating": 3,
            "relative_time_description": "a year ago",
            "text": "The staffs don’t really speak german but it’s ok, but we couldn’t really understand what the waitor was saying when he tried to explain us how the restaurant works, and we were confused and he was a bit annoyed that we couldn’t understand and he kept making fun of us since we were a bit confused. Many meat-dishes were very salty to make you order a lot of drinks and they are hard to chew too. The quality of the meat is not so good and most of the meat are lean meat. The grilled vegetables are tasty!",
            "time": 1686289159,
            "translated": false
        },
        {
            "author_name": "jack Lumber",
            "author_url": "https://www.google.com/maps/contrib/103017510410022660268/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKtD7nPbzFTV4DafRRqQ7p9WZsLnyB_qEn5xPA1OLG3hQCzKQ=s128-c0x00000000-cc-rp-mo-ba6",
            "rating": 4,
            "relative_time_description": "a year ago",
            "text": "Our German colleagues had arranged our visit, just as well, as when we arrived there was a large queue outside wanting a table.\nWe had a party of 16 and they were able to sit us all together. Some of our party took the option to just order a meal selection of the menu, the rest of us opted for the all you can eat option. Two things to keep in mind if you go with this option, there is a large salad selection area biggest I have ever seen, which also holds area for puddings, you can go up as you like, the staff walk around with different meats and or sides, but you can end up waiting a while for them to come to your table. The cost April 23 was €32.50 did I have what I felt I paid no, did I enjoy what I had yes, would I go back yes, now I know what I am doing.",
            "time": 1682091209,
            "translated": false
        }
    ]
}