{
    "name": "THE MADISON Hotel Hamburg",
    "rating": 4.8,
    "reviews": [
        {
            "author_name": "Enrico Tumino",
            "author_url": "https://www.google.com/maps/contrib/102700829552937109229/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJLMVZG59Yifb-_rQuIoLZJsqG2adVzZhzkWc1EH_TWv7izRHc=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "2 adults plus an almost 2 years old kid and we loved it. Hotel position was amazing, we went pretty much everywhere just walking with the stroller and the public transportation was incredibly close as well.\nWe used the room service few times too and it was very good, you can place orders using your room tablet which is easy and fast and then you receive a call to confirm the order. Food quality was premium and not too pricey.\nHotel staff was spot on, kind, professional and always ready to help.\nOh, and the breakfast. You must try the breakfast. Like, really, you have to. Amazing.",
            "time": 1725988381,
            "translated": false
        },
        {
            "author_name": "Kanye enjoyer",
            "author_url": "https://www.google.com/maps/contrib/106274462257267906742/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXbnu79YRN9qqO4kluylJKak97WxhfORYKRPDj94JQQrxxCsQBe=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "Really nice place for the price, with great service and accommodating staff. The spa and fitness facilities available on weekdays were a nice bonus. However, if you get a room with an extra bed, be aware that it's quite firm (and that's coming from someone who weighs 80kg). The only thing I would suggest to the hotel is to either lower the price of breakfast or include it in the room rate, so guests don't feel like they're paying extra for it each morning. Overall, a great experience!",
            "time": 1723282109,
            "translated": false
        },
        {
            "author_name": "Sayem al Fayed",
            "author_url": "https://www.google.com/maps/contrib/100288852313827917724/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVbkNf3UMmhpoNc-5O4IWj6gIrxmKyiHPMkFK3BMv9zawxaWkEi=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "a week ago",
            "text": "Whether I am  at the MADISON for a few days or weeks: I want to make my stay as wonderful as possible – in my room, at THE MADISON Restaurant, at the bar and at the Meridian Spa & Fitness. Perhaps my forget now and then I am  away from home!",
            "time": 1732454583,
            "translated": false
        },
        {
            "author_name": "Kevin Bell",
            "author_url": "https://www.google.com/maps/contrib/109355251677314088507/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXQQWApSpd75W335xvqe_PbxvvszdE4x1a1Qoi9UMEtbcTtwGHE=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "5 months ago",
            "text": "I have stayed at The Madison for many years, both on business and for pleasure, and have always been delighted: it is situated in a uniquely quiet, but fairly central, area - with rooms that are extremely well thought out and extremely comfortable: the staff throughout, from reception on arrival to the restaurant, bar and housekeeping are all friendly and very efficient.\n\nBreakfast offers an extraordinary range of choice and provides an excellent start to a long day.\n\nAs someone who has to travel and use hotels all over Europe, this has consistently been one that is a real pleasure to stay in. Quality !",
            "time": 1720427336,
            "translated": false
        },
        {
            "author_name": "Lory Magenta",
            "author_url": "https://www.google.com/maps/contrib/105249233727422326440/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXJxwPwfMxl3AzsZsByDa_FXWQtdhjbUNiRkw5Tya5_KuyTn1Pc=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "5 months ago",
            "text": "This modern hotel is in a great location for walking to most tourist sites. The rooms are clean, large w/some having a small kitchenette. They provide plenty of coffee/tea for the in room enjoyment. The bathroom is large w/a shower large enough for 2. Free WiFi, a nice stereo system & TV also included. The restaurant on site boasts an awesome breakfast buffet w/everything one could imagine. It also serves lunch/dinner. I will definitely return to this hotel whenever I travel back to Hamburg, Germany!",
            "time": 1718115471,
            "translated": false
        }
    ]
}