{
    "name": "east Restaurant",
    "rating": 4.3,
    "reviews": [
        {
            "author_name": "Steven Bieler (Project D.A.D.)",
            "author_url": "https://www.google.com/maps/contrib/112056974245174051572/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUEKr96v9muiMaQP4fHZrqiV9fye7E_u8DgU1YCUQpTqhC6CJs=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 4,
            "relative_time_description": "3 months ago",
            "text": "Today we decided to go out to enjoy some tasty sushi. East was our restaurant of choice. It is a beautiful Building.\n\nThe sushi was great, but not above the competition.\n\nThe service was friendly, but sadly it took more than 10 minutes to bring us our drinks and the sushi took even longer. It was slightly busy, but waitstaff was available and standing around with nothing to do. Drinks should take a maximum of 5 minutes to come to the table and at an upper class restaurant they should serve a little appetiser if the food takes longer than 15 minutes to arrive.\n\nIt’s good if you like to wait, but the food doesn’t justify it sadly.",
            "time": 1725175306,
            "translated": false
        },
        {
            "author_name": "Gee Wa",
            "author_url": "https://www.google.com/maps/contrib/100825471026748806999/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJfcZ_79Q7W7zrc_JaJN30AqxFbwel9lboEXv7VHmDIi5LQ_g=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 1,
            "relative_time_description": "a month ago",
            "text": "East restaurant is NOT worth the detour.\n\nIn my recent stay at the East hotel I decided to experience their restaurant. I have to say it left me thoroughly unimpressed, especially with the sushi. I had heard reasonable things about the place, but my expectations crumbled with the first bite.\n\nTo start with, the Gamba sushi was simply a disgrace. A prawn dish priced at €20 for eight rather modest pieces, perhaps would compensate through taste and quality, yet it did neither. As I bit into it, I was met with a cold, soggy prawn that lacked any trace of the expected crispiness or warmth. For a moment, I wondered if it was intended to be served this way, so I asked the waiter. He informed me it should indeed be warm and crispy and promised to convey my feedback to the kitchen. Moments later, he returned with an almost laughable response: the kitchen was closed.\n\nSo, with my first bite being a letdown, I was offered nothing but an apology and, shockingly, a suggestion of a free coffee as consolation. For a dish at this price point, this felt like an insulting gesture, missing the mark entirely. I wanted my dish prepared correctly, not a pity coffee that couldn’t possibly redeem a botched meal.\n\nMoving on, the tuna jalapeño roll was barely any better. There was almost no distinct flavor; I found myself relying on soy sauce and wasabi just to make it palatable. For €23, I expect some craft and flavour, well…  it lacked both… again!!!\n\nAll in all, restaurant missed the mark on quality, taste, and service. I can overlook minor faults here and there, but when a restaurant fails so comprehensively on both food and the handling of feedback, it’s hard to justify giving it another chance.",
            "time": 1730818079,
            "translated": false
        },
        {
            "author_name": "Ercument Kaya",
            "author_url": "https://www.google.com/maps/contrib/110104042526888514858/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLiQrZFViBNP0doc5N5hX96LoEq-FVCYYmmDIslx8xfhCvOxmA=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "5 months ago",
            "text": "If you like a asian foods sushi and raw fish. Foods are delicious and tatsy. Smile service and weel designed. I offer to book seat at middle site with open air.  We liked the meat.",
            "time": 1719482057,
            "translated": false
        },
        {
            "author_name": "Shady Abushady",
            "author_url": "https://www.google.com/maps/contrib/102799215249264073181/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKR8drMUq6svRN8zhb2tY8BjyLUOFT332c08pvu2yXY6z8zCg=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "6 months ago",
            "text": "Oh la la I was just looking for a sushi place then google said east restaurant and it was amazing from the entrance to the leaving food ambiance service all was great totally a beautiful experience that must be done expensive though but that what it takes to be amazing",
            "time": 1717535229,
            "translated": false
        },
        {
            "author_name": "Ian Jindal",
            "author_url": "https://www.google.com/maps/contrib/101817471051506530589/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUtfZOgC8_fok6TXs0_xuMsR6I4LMmwzmrJfZr1SlnDwEH_rrQe=s128-c0x00000000-cc-rp-mo-ba6",
            "rating": 3,
            "relative_time_description": "5 years ago",
            "text": "Promising venue and food let down by s-l-o-w service and a kitchen that can’t cope when busy.\nWe arrived as a group of 7 and had great service at the bar as we waited for our table. We were seated at 8.50pm and ordered at 9. Nothing happened until 10pm when some edamame arrived.\nWater, lost. Wine, slow and had to be chased. Manager (when I complained) nice enough but weak and ineffective. Apologised, said they were rushed. I asked why he hadn’t communicated rather than just hiding.\nFood when it arrived was very good - worth the higher-than-average price.\nNo adjustment made to the bill. Retired to the bar where once again good service from friendly staff (and a sub-1hr wait for our order!).\nSummary: good food, nice ambience, rubbish and inept service in the restaurant, good bar.",
            "time": 1557332632,
            "translated": false
        }
    ]
}