{
    "name": "Empire Riverside Hotel Hamburg",
    "rating": 4.6,
    "reviews": [
        {
            "author_name": "Gary Bills",
            "author_url": "https://www.google.com/maps/contrib/115755286782607894166/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXUQuSAM0IpkP7ptL-j_cRf0RrXKFDC-qzNWiykwJ9qqVXjFpQ=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 4,
            "relative_time_description": "2 months ago",
            "text": "Quite a long review this.\n1. Location| well if you like prostitution drugs and beers this is for you. If you don’t… then turn left out of the hotel door. There are better locations.\n2. Service| ok it was busy, so fair enough but I was told I had to change rooms half way through the week (I wasn’t the only one) but the room was an upgrade so ok.\n\nThe room key!!!! In 4 days I had to go to reception 4 time because apparently it’s my fault for putting my phone near the key (Germany still stuck in 2005 it seems) the receptionist was always grumpy.\n3. Room service| forget that. There isn’t any of note.\n\nOverall it’s a good hotel that suffers from a bad location. Probably wouldn’t go back for that reason.\n\nOf roof top bar. I see lots complaining here but there is a strict dress code  that’s a good thing. Wear something nice and you’ll be fine. :)",
            "time": 1727602252,
            "translated": false
        },
        {
            "author_name": "roshanaksamadirad",
            "author_url": "https://www.google.com/maps/contrib/108616522380235734973/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLrE8lQERxVA-mrFHUoX3XEFvsabHtm5KcFa8i4waFd4d3lBQ=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 1,
            "relative_time_description": "a month ago",
            "text": "Avoid this hotel. Be very careful when they’re asking for a deposit. Try just to pay cash and receive the cash back.\nThe rooms are very average with no facilities for what you pay.\nThey charged us 100 Euro as a deposit for one night.\nOn the departure, they said that it takes 60 working days to refund the money because they’re working with people’s money.\nIt’s now over 3 months, we still haven’t received the money, after multiple communications, they are now asking for our bank details!!!!!\nSo imagine that if I hadn’t been this much persistent and communicating.\nThey would steal the money, which probably they have done it for many people and they hadn’t noticed. Shame on them.\nI have now escalated this with relevant authorities",
            "time": 1728290707,
            "translated": false
        },
        {
            "author_name": "Max Hogg",
            "author_url": "https://www.google.com/maps/contrib/103321631824363592088/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUHcX8EzdHMJxEGxjcG1Ndo6v5F0MNbiIT-uVPbcM-0Dr6Hocw=s128-c0x00000000-cc-rp-mo",
            "rating": 4,
            "relative_time_description": "2 months ago",
            "text": "Location is ideal for anyone wanting Reeperbahn. Its a 30min walk to Rathaus, and main shopping.\nThe room was spacious, but the bed a bit uncomfortable and the pillows were very thin. No hand soap, only shampoo. No door on the shower. And towels are hanging in the toilet.\nBathtub has no soap available to use.",
            "time": 1727463962,
            "translated": false
        },
        {
            "author_name": "Andreas Gritsopoulos",
            "author_url": "https://www.google.com/maps/contrib/117411085634474330574/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU8dh10ir4ock3acqbLWXbCB-955BMqWVzv-55JDClj89msCzkW=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 2,
            "relative_time_description": "a month ago",
            "text": "A last minute booking proving to be a rip off.\nHotel entrance is rather imposing. However, reception staff would definitely require some more encouragement in engaging with guests, instead of just handing out a tablet asking you to fill in all details on your own to check-in.\nAfter this check-in experience, went to my room, which was indeed spacious with truly breathtaking views over the city and the Elbe and that's all the luxury a little less than 500euro for one night can buy you in this hotel...\nNo kettle.\nNo coffee machine.\nNo phone device; guess room service and/or emergency are not a thing around here.\nNo shampoo/soap in the bathroom dispensers; with no phone in the room, one would have to exit the room amidst a shower to seek for shampoo/soap.\nTowels torn obviously overused.\nBed and pillows rather uncomfortable, most likely overly used.\nNo breakfast was offered for the abovementioned rate.\nLocation may be ideal for accessing the party area of St. Pauli/Reeperbahn and the 20th floor bar may be having the most breathtaking views over the Elbe, but these elements do not compensate for the rest of the above experience.\nSincerely cannot see why to consider ever going back or recommending the hotel.",
            "time": 1729779540,
            "translated": false
        },
        {
            "author_name": "Steen Rasmussen",
            "author_url": "https://www.google.com/maps/contrib/108689091509699078690/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLaT7PTdz-Lc24z8aouREpcRiZMyMww3OYRKUWSy_du_vD7hw=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "Nice hotel, but I had problems by paying for parking at stock -1.\nThe Automat could not accept my MasterCard after trying a few times. Then I had to pay cash 50 Euro. When I came home I could see on my bankaccount that the Automat also had taken 50 Euro from my MasterCard. So I have payed 100 Euro for parking 2 days. I think the Hotel must send me 50 Euro. Kind Regards Steen Rasmussen",
            "time": 1728311793,
            "translated": false
        }
    ]
}