{
    "name": "Radisson Blu Hotel, Hamburg",
    "rating": 4.3,
    "reviews": [
        {
            "author_name": "W",
            "author_url": "https://www.google.com/maps/contrib/102884268032935511826/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW2IDRfCwRSrQevpxUP1Oq-yAqnr8KyaigRGO13Xy-SHrb27CWz=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "2 weeks ago",
            "text": "Great place to stay, wonderful staff. Reasonably priced for massive rooms even during peak times and special events at the conference centre.\n\nA 20 minute walk left or right to the old city or to local food spots. Genuinely quite centre, but doesn't feel cramped/ crowded. It's next to a park which is great for a morning stroll.",
            "time": 1731833595,
            "translated": false
        },
        {
            "author_name": "Dan Mulcahy",
            "author_url": "https://www.google.com/maps/contrib/100522302282506391076/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLbTrGHavtTwJEh3PYSC-331TrAlbV1zPLEkFNdnWwV23Ikiw=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "Very nice hotel. Great breakfast and friendly staff. Great views from the rooftop bar but the service up there is unfortunately not the best, despite the high prices. The 24h self serve shop is well stocked and extremely useful. Would certainly stay here again, room rate is reasonable for what this hotel offers",
            "time": 1726782866,
            "translated": false
        },
        {
            "author_name": "Mateusz SM",
            "author_url": "https://www.google.com/maps/contrib/101497659561506126691/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWCcytbfRbDONVTnxyBPpnUsGt2ZW7gSYNPj4CHclADjGanyi1B=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 4,
            "relative_time_description": "2 months ago",
            "text": "Really nice location of this hotel! Very comfortable beds. Room needs to be renovated as you can clearly see that it is not fresh. Breakfast really tasty and it’s great value of money. I recommend it, however customer service of hotel should take opinion to consideration to make some lifting of hotel rooms.",
            "time": 1726084247,
            "translated": false
        },
        {
            "author_name": "NOUR ZUAITER",
            "author_url": "https://www.google.com/maps/contrib/117857347969685248155/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLSEtGyAMA6d3pLpudw471yGeelKwlmTX0jAU1fN9aW8xYPiA=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 4,
            "relative_time_description": "3 months ago",
            "text": "It has been a beautiful three nights stay with the family. Two kids, myself my wife, and grandparents.\nThe location is fabulous, it's in the heart, you are surrounded by beautiful scenery, in the middle or very nearby to so many things and places. There is a very beautiful park, very vivid, we are August, very beautiful, right next to the hotel. Main train station is just right over, however there is no traffic whatsoever, it is hassle free to load your car from main entrance, or pick an Uber or Taxi.\nIf you k I've walking many out of many and more places are there to see, alleys, many beautiful restaurants in every direction from the hotel. High Street is nearby, it's truly beautiful and well suited when it's about location.\nThe hotel itself is beautiful, modern, spacious rooms, not perfect, however neat, tidy and clean, furniture is beautiful, modern, genuine, neat, bed is great, height, mattress, pillows, sheets are truly great.\nThe hotel has 27 stories or floors, chances are most likely you will have a beautiful sight out of your room.\nThe team we came across are truly fabulous all over, from the moment you arrive, throughout until your departure. They are responsible, they are there to assist you, make you feel comfortable during your stay, truly trying their best and you could sense it and feel it and read it on the faces.\nYou would always find who complains, many people believe the moment they arrive everyone should be free to attend them, many comment about queues, well simply wait, and consider that the team serving you have been on his feet trying to please every case like you all day long.\n\nThank you for such a beautiful stay.\n\nI took some photos on two mobiles, I shall upload in batches.",
            "time": 1723069711,
            "translated": false
        },
        {
            "author_name": "David Haddad",
            "author_url": "https://www.google.com/maps/contrib/103464313721212526360/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVOAT7MNnOU8p5VNmLtDPIZ1BcZINAdqU9DaxTt0b0bm8r4pliu=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 2,
            "relative_time_description": "in the last week",
            "text": "Staff was not welcoming and at times they were actually rude. Furthermore, I left a pair of dress pants and dress shirt in my room. Upon contacting the hotel they informed me that they had found the two items and they would send them to me at a cost of more than 67 Euros. The next time I contacted them the information had changed, this time they tell me that they only had only one p[air of pants. Apparently someone on staff liked my custom Robert Graham stage shirt and decided that my loss was their gain. This time they tell me it would cost more than 50 Euro to send just the 1 pair of pants back. I refused as this price is way too high plus now someone on staff had taken one of my items as their own. I do not trust the staff at this location and they were during our stay. Bye!",
            "time": 1732919293,
            "translated": false
        }
    ]
}