{
    "name": "Fairmont Hotel Vier Jahreszeiten",
    "rating": 4.7,
    "reviews": [
        {
            "author_name": "Heinrich D.",
            "author_url": "https://www.google.com/maps/contrib/109022263655557121327/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWNoapZmUlfONQHoV8Z0Vr5W_hkj48MCXNVMaluWdAnUQpsJnQ=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "in the last week",
            "text": "I only stayed for one night, but it was an outstanding experience. The hotel had an extraordinary, welcoming, and luxurious ambiance. The harmonious, well-balanced mix of colors and styles in the interior created an elegant yet cozy atmosphere that made me feel right at home. The room was spacious, beautifully furnished, and very clean, equipped with first-class facilities that added to the comfort. The staff were exceptionally charming and helpful from the moment I entered the hotel and willing to go above and beyond to make my stay pleasant.\n\nThe different designs of the restaurants were simply captivating, each offering its own unique character and charm. The enchanting Christmas decorations added a magical touch, enhancing the festive atmosphere throughout the hotel. A fantastic stay.",
            "time": 1733126219,
            "translated": false
        },
        {
            "author_name": "Sarah Bkairat",
            "author_url": "https://www.google.com/maps/contrib/103702313529114844492/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJlDmvUNz2dHy6xCFq3BecYwLLxwX6w-U6wetenKPSQ8Fg_oCk=s128-c0x00000000-cc-rp-mo",
            "rating": 3,
            "relative_time_description": "3 months ago",
            "text": "My family and I recently stayed at the Fairmont Hamburg for three days. While we found the rooms to be very nice and clean, we encountered several issues with the breakfast service that were quite disappointing. The gym was well equipped and maintained.\n\nThe process for ordering egg dishes and pancakes/waffles was particularly problematic. When it came to ordering 3 of the staff have told me that they will call their colleague , no one came. .Despite multiple requests, it often took between 45 minutes to an hour to receive our orders. On one occasion, the omelet dishes were notably smaller than expected, and another day, we received the wrong order entirely. Additionally, one time our breakfast was mistakenly delivered to another table. Unfortunately, the staff at the entrance of the restaurant did not provide a very warm welcome. I would suggest implementing a more friendly and inviting greeting for guests.\n\nIn comparison, my experience with Fairmont in Jordan was significantly better. I hope these issues can be addressed to improve the service for future guests.",
            "time": 1724018166,
            "translated": false
        },
        {
            "author_name": "Richard Joseph Ungab",
            "author_url": "https://www.google.com/maps/contrib/108924603028276210778/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWrmFHwgC_8mabg_QjeVCIAjdC1x9KvaDYc7aCjzti8YI2uDvCl=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "4 months ago",
            "text": "Wonderful hotel! You get what you pay for! Staff are very respectful and helpful. They will help you the best they can and if there is nothing they can do, they will make it happen! Breakfast is buffet style but you order the plates (eggs Benedict is to die for) which guarantees freshness and not have to worry about too many hands touching the food.\n\nMy young niece was crying and the bellman stopped what he was doing, played Cocomelon on his phone and she stopped crying immediately. Just comes to show how much they are willing to do for guests!\n\nDefinitely will be back!",
            "time": 1723035625,
            "translated": false
        },
        {
            "author_name": "James Rogers",
            "author_url": "https://www.google.com/maps/contrib/102477764666296573808/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUUEXSFeWXhkDOpFJf0IpURtKnOwe0xs8r0iVw0Cdj70wSx7HpO=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "We walked in for cocktails and were warmly welcomed and offered a lovely table near the window with a view of the fountain. There was a lovely relaxing ambience with the piano playing. Cocktails were served in silver martini glasses and were delicious.",
            "time": 1726484092,
            "translated": false
        },
        {
            "author_name": "Lalou Neynou",
            "author_url": "https://www.google.com/maps/contrib/108625850715049196767/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX7QX1on43PfnhaPkgM5MIMcf7BwTX0WKm0f5wjAx_LXFv4Y7I=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "5 months ago",
            "text": "My stay at the Fairmont Hotel in Hamburg was truly exceptional. The moment I walked in, I was impressed by the elegant decor and warm atmosphere. The staff was incredibly friendly and attentive, making sure every detail of my stay was perfect. My room was spacious, comfortable, and offered a stunning view of the city. The bed was like sleeping on a cloud, and the amenities provided were top-notch. Dining at the hotel restaurant was a highlight, with delicious dishes that showcased local flavors. The hotel's location was ideal, allowing me to easily explore Hamburg's many attractions. Overall, my experience at the Fairmont was memorable, and I can't wait to retun.",
            "time": 1718445501,
            "translated": false
        }
    ]
}