{
    "name": "SIDE Design Hotel Hamburg",
    "rating": 4.5,
    "reviews": [
        {
            "author_name": "Alicia Lind",
            "author_url": "https://www.google.com/maps/contrib/117650380639070086608/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLy5IJnngQtwDsW8b0I1VBbms0v8i8lmIgHmtZwf2TIPy3ERQ=s128-c0x00000000-cc-rp-mo",
            "rating": 2,
            "relative_time_description": "a month ago",
            "text": "I don't understand how this hotel has and manages to keep its 5 star status.  The staff was not friendly.  The room was not cleaned without asking, and requests for breakfast room service were ignored.  The pool is nice, but the hot tub is not hot and both steam and sauna are small relative to the size of the property.",
            "time": 1728418553,
            "translated": false
        },
        {
            "author_name": "Cilia Laug",
            "author_url": "https://www.google.com/maps/contrib/108658752321559588724/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJbLWL31_UNLYfiAbk7jO0sqoVfxsfwrGv8rOs1jTnf46GQdA=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 4,
            "relative_time_description": "3 months ago",
            "text": "From the moment we arrived, we felt right at home. The staff were incredibly welcoming and attentive, making sure we had everything we needed for a comfortable stay.\n\nThe breakfast was a real treat—so many delicious options, and everything was fresh and well-prepared. It really set us up for a great day of exploring the city.\n\n-1 because the wifi was terrible. We were here for leisure so it wasn’t too bad for us but if we were here for work it would’ve been a disaster.",
            "time": 1725130027,
            "translated": false
        },
        {
            "author_name": "Ozlem Yavuz",
            "author_url": "https://www.google.com/maps/contrib/117511473335636399266/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL6Ugd8QVu-Bmn1SJ3U5tVWvHSQWEUG1S_3remOzToNKdVhIw=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 4,
            "relative_time_description": "2 months ago",
            "text": "It is nice hotel in a nice central area but price performance is not okay and they have a super small breakfast room for such a big hotel. It is hardly possible to get a table for 3 without waiting. With the price you pay, it is unacceptable and nothing the staff can do because yehre is simply not enough room.",
            "time": 1728114240,
            "translated": false
        },
        {
            "author_name": "parham kalantari",
            "author_url": "https://www.google.com/maps/contrib/113516193986413617161/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWycEqrJLmCycYOiQJPwIIs18oUwRZBw62DQNeJ-SxFJ_Bb48er=s128-c0x00000000-cc-rp-mo",
            "rating": 1,
            "relative_time_description": "2 months ago",
            "text": "Our stay at SIDE Design Hotel Hamburg was, hands down, one of the worst hotel experiences I’ve ever had. I’ve seen bad service, but this hotel takes it to a whole new level.\n\n**The Room Situation:** Upon arrival, we were given the wrong room—two separate single beds, even though we specifically booked a room with a double bed. When we brought this to the attention of the reception, instead of a simple apology and quick resolution, we were met with an attitude that screamed, “We don’t care.” They initially lied and claimed no other rooms were available. Then they blamed the company that booked the room for us, saying it was okay with separate beds. (News flash: It wasn't, and we confirmed that). After 45 minutes of standing there, waiting like fools, they finally gave us a new room. By that point, the charm of the “5-star” hotel had already faded.\n\n**The Breakfast Catastrophe:** Breakfast was a disaster. The entire restaurant smelled like someone thought it would be a great idea to combine bleach with seafood. The variety of food was okay, but we were so nauseated by the smell that we couldn’t enjoy it. When we brought this to the manager’s attention, she responded with an attitude that can only be described as, “So what?” The level of professionalism here is seriously lacking. Then, while warming up some croissants, she actually had the nerve to blame us for causing the foul smell! Really? How on earth does warming croissants cause a bleach-seafood combo stench?!\n\n**Inconsistent Restaurant Experience:** We dined at the hotel restaurant the night before, and it was great, which just shows how inconsistent the management is. It’s obvious the night staff knows what they're doing—unlike the morning crew, who seem to have no clue about customer service.\n\nIn conclusion, while the hotel design might be impressive, don’t be fooled. The staff, especially management, are absolutely terrible. It’s rare that I leave a hotel feeling more stressed than when I arrived, but congratulations, SIDE Design Hotel Hamburg, you managed to pull it off. I would never, ever stay here again, and I urge anyone reading this to steer clear if you value your time, money, and sanity.\n\nZero stars. Avoid this place like the plague.",
            "time": 1726824799,
            "translated": false
        },
        {
            "author_name": "Paula Murphy",
            "author_url": "https://www.google.com/maps/contrib/117881848418954830375/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWn3xWCUpcvI7tVvx6A8x3ZCHHrJDQgLp8k63UY4SW9uOwsb4U=s128-c0x00000000-cc-rp-mo",
            "rating": 3,
            "relative_time_description": "6 months ago",
            "text": "Great staff, lovely hotel. Food is yummy but not enough items on menu for room service. For the fourth year in a row, our air conditioner stayed at 24 the whole time on the 6th floor, . Way to hot and humid! Previous years they tried fixing and moved us etc. This year we didn't bother asking. We bought a fan, didn't help much. Next year we will stay at a different hotel.",
            "time": 1717422117,
            "translated": false
        }
    ]
}