{
    "name": "Eurohostel",
    "rating": 4,
    "reviews": [
        {
            "author_name": "Miloš Metlar",
            "author_url": "https://www.google.com/maps/contrib/107039772116122762231/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXAktKV4FDsm-CWQZznZcjEfKhcRfrSH0TKrRxEY5aZfeBDwTOV=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 5,
            "relative_time_description": "in the last week",
            "text": "I stayed for 1 night in a single room with breakfast. One of the best hostels I have ever been to. It's 3 min walk from Viking Line ferry terminal, 10-15 min from Uspenski Cathedral and Food Market. Staff at the reception was really outgoing and ready to assist in any way needed. Rooms are clean and basic, with enough space to cover your needs. There is cozy bar within where you can stay until midnight and enjoy some drinks.",
            "time": 1733122136,
            "translated": false
        },
        {
            "author_name": "Innocent Nkemakolam Nwoke",
            "author_url": "https://www.google.com/maps/contrib/109885478154642577936/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXrE1g85H56_t4MfV2lD-aByRuHvzOYTn8Z6jHX8nx8OPKMQNU=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 2,
            "relative_time_description": "a week ago",
            "text": "Rightly named 'Eurohostel' so it's more like a hostel accommodation where tourists needing immediate and serviceable abode could lodge. A 5-story structure, I believe, it's a decent place but not appropriate for a family or group of more than 2 persons. There's a decent restaurant that opens at 5 pm local time. There's also a kitchen where you can make your meals. It has 2 shared restroom facilities - male and female; well kept. I love the location, though - right in the heart of town, close to the ports, with easy access to trams, a tourist bus park, K-Mart, etc. About 25 minutes drive from the Helsinki airport",
            "time": 1732744727,
            "translated": false
        },
        {
            "author_name": "Fathia Ramadina",
            "author_url": "https://www.google.com/maps/contrib/104550148086605032951/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK7-3GqnEqfTS4VI8-7L7xbKBAuQAXJ8T83zFHzSO1SSjj-rok=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 4,
            "relative_time_description": "3 weeks ago",
            "text": "The hotel is pretty old but it is well maintained and the facilities are good enough. Staff were nice and helpful.\n\nRoom and shared facilities are clean enough, but I think it could be better.\n\nUnfortunately, the shared facilities like kitchen and bathroom are very limited given the number of rooms. There are only two toilets and three showers on each floor. It’s too long to wait when all of them were occupied.",
            "time": 1731457271,
            "translated": false
        },
        {
            "author_name": "Mohga Tawfik",
            "author_url": "https://www.google.com/maps/contrib/113474608595323397111/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUlqorSxMQZDZAMNg9zYB3es3cYlN0HAU9_G6ePYjmpKtXVK6hA=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 4,
            "relative_time_description": "a month ago",
            "text": "The location was good as it was near to a tram station. The design of the rooms was a bit different 😁. The room was clean. Showers and toilets were clean. Price was good. Also, it was near a market. Speaking of the design, elevator design was also different 😁",
            "time": 1730134217,
            "translated": false
        },
        {
            "author_name": "Bruce Hargrave",
            "author_url": "https://www.google.com/maps/contrib/106485004754315550341/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVHLQ0O_U3pu5F8CC_8o3KxwKQBvyyPAMll3iArMTT-mletk2eX6Q=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 4,
            "relative_time_description": "3 months ago",
            "text": "OK, the location was ideal for us. We came in on the ferry from Tallinn and walked to the hostel, very close to the port. It is also close to the downtown area, easy to get around, nicely located. We stayed 3 nights and trained to the airport from the hotel --- it worked for us.\n\nThe laundry was appreciated, but did not work well, dryer not available so we hung our clothes. We were there 3 nights, so it was OK.\n\nThere is no air conditioning, and the rooms were hot. We were on the 4th floor and I did not sleep that well. The staff was excellent, very polite and informative.\n\nWhere I to return, I might look for a different place.",
            "time": 1724432021,
            "translated": false
        }
    ]
}