{
    "name": "Lappi Ravintola",
    "rating": 4.5,
    "reviews": [
        {
            "author_name": "Stephen Ragell",
            "author_url": "https://www.google.com/maps/contrib/108429653866905803381/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjURMAKl24xTV7lXUm3OddWTZJ2t7RZmi5FGzWS8aj3cnknWhJUs=s128-c0x00000000-cc-rp-mo-ba6",
            "rating": 5,
            "relative_time_description": "in the last week",
            "text": "Lappi provided a delicious introduction to the Lappish cuisine of Northern Finland.\n\nThe menu is not particularly large but has enough variety to cater to lots of different tastes. There is a focus on reindeer meat and salmon. To start we had the lohikeitto or salmon chowder which had large pieces of potato and salmon, you can even get this as a main if you prefer. For the main course we got various types of reindeer and salmon and all were very good.\n\nService was excellent and the staff were extremely gracious and accommodating, they were even able to add a third guest to our booking which I really appreciated as I understand how difficult it can be when the restaurant is very full.\n\nPrices were reasonable given the uniqueness of their offering and quality of the food. Would recommend for visitors to Helsinki!",
            "time": 1733034144,
            "translated": false
        },
        {
            "author_name": "Alex Dolphin",
            "author_url": "https://www.google.com/maps/contrib/109982992509289790339/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV70trQUeWMCo09fIvmHmQgPBmP0DDUSW7jxYP84douSOtWelXDmQ=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "The food was fantastic. I had the Lappish salad, and the reindeer flank, and both were phenomenal. The service was really great, everyone was attentive and kind, and explained all the dishes well. The decor was very unique, a lovely wooden interior like a cabin.",
            "time": 1729366028,
            "translated": false
        },
        {
            "author_name": "Felix Leong",
            "author_url": "https://www.google.com/maps/contrib/101046505708629243108/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVxTCxFhWtmj7MxH4LRTJgGAyMx5ePwavEi8SrKTmNUboCIH4nFLA=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 4,
            "relative_time_description": "a month ago",
            "text": "Good wine, good apple pie (season dessert), and I love the reindeer sausage, very tasty! The thing that I love the most here was the wooden vintage cozy atmosphere.",
            "time": 1730237678,
            "translated": false
        },
        {
            "author_name": "Saira J. Barlas",
            "author_url": "https://www.google.com/maps/contrib/116259945572620672215/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUBETV4DXzBFX4QvrE8r1-BKDSjV6itBxRL2y3q3DJk8ev1VNu9zg=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "7 months ago",
            "text": "An absolute gem in the heart of Helsinki! Delicious food and amazing service 😀\n\nWe landed and straight up went to this place as we were very hungry. We were given the best seat in the restaurant! The interior looks so cozy and traditional: captures the Finn aesthetic very well. Great place for newcomers to this country! 💯\n\nThe service was LOVELY and it’s great that the menu isn’t massive either. They all speak English there and we had the English menu as well 🫶\n\nThe bread and butter that came before the food was a really good way to leap into Finnish cuisine. I LOVE rye bread and this is exactly what I needed!\n\nWe went with the salad as the starter which surprised us as to HOW DELICIOUS IT WAS. Next came our fish mains and they were cooked really well. Lots of warm flavours came out. The desserts were again very worthwhile. Absolutely recommend the Lapland Farmer cheese dessert!\n\nPlease GO HERE as they serve traditional Finn food 😍\n\nMy husband and I shall be back!",
            "time": 1713017791,
            "translated": false
        },
        {
            "author_name": "Saïd Hadjiat (Zao)",
            "author_url": "https://www.google.com/maps/contrib/110701410466836135873/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWj3U8qDhNY8TuAN8TtGdA4XFaYwkFOiXQZjVTBqKnGX3hmUbLF=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "2 weeks ago",
            "text": "Just …wow 😮! If you’re looking for genuine Finnish food, that’s THE place. The fish was excellent, the atmosphere warm and cozy.",
            "time": 1732044181,
            "translated": false
        }
    ]
}