{
    "name": "Scandic Grand Marina",
    "rating": 4.1,
    "reviews": [
        {
            "author_name": "Kath Angus",
            "author_url": "https://www.google.com/maps/contrib/108677958048610290057/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX90Afb4WMBF9D8yfW2pvVlMerTy7lDEU2ZXdRSyh-X1SbcKM5Ong=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "Spacious room, guest needs well covered without being excessive. Towel warming rail was a real godsend for me. Thoughtfully arranged hanging spaces that I very much appreciated. The bed was unusual with a thin mattress pad but it was surprisingly comfortable. I really liked the commitment to sustainability, including paper bin liners, rubbish sorting, and encouragement to drink Helsinki's delicious tap water rather than bottled. The service is classic Finnish - helpful when you ask for it.\nThe sweet location is near the port, Allas Sea Pool and the old market hall. Trams run very close by and are frequent. There is a well stocked supermarket just around the corner. The views of the port are not romantic but they are pleasant.\nThe included breakfast is wonderfully comprehensive and many traditional Finnish options are offered, like a good array of pickled vegetables.",
            "time": 1729830466,
            "translated": false
        },
        {
            "author_name": "Bence Kovacs",
            "author_url": "https://www.google.com/maps/contrib/110721557457990779017/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLBYhLVnafmej16ovMfIW52g9ov4cS-cwx7E7s2OKTpvHBHew=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 4,
            "relative_time_description": "2 months ago",
            "text": "Enjoyed my stay at the Hotel. Furniture is old, so is the bathroom. Despite These Things this Hotel has somehow a luxurious and calming Vibe.\nBreakfast was excellent, but If you come late, it gets very busy. (It might have been only this Weekend, There was an Open Air Concert and the Helsinki Marathon)",
            "time": 1726565347,
            "translated": false
        },
        {
            "author_name": "Philip Cox",
            "author_url": "https://www.google.com/maps/contrib/101295567787380910873/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIwMRWCEZDYunylcgLdbF_445ShKn5XiVMqdj9GyBdwl9SeYw=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 3,
            "relative_time_description": "2 weeks ago",
            "text": "Nearly always a queue at reception. Key cards temperamental. Was told not to put it near my phone. Room was okay. Minibar crazily expensive, even by minibar standards. Lifts were tricky to operate and sometimes a bit dirty. Breakfast buffet pretty good. Overall not a bad stay but expected a bit more polish for the price point.",
            "time": 1731763704,
            "translated": false
        },
        {
            "author_name": "Annika Raudssus",
            "author_url": "https://www.google.com/maps/contrib/112348416448582052435/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIK9Lg8i_KLunNALq8VOQuJ3OaKldIVN4kuILAr7pwH5xz7lynH=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "It's a very nice place to stay overnight. The room was spacious and bright. The beds were comfortable. Breakfast was offered in a huge display, maybe even a little too much. I could imagine there's a lot of waste being produced there.",
            "time": 1724752332,
            "translated": false
        },
        {
            "author_name": "Luke Solomon",
            "author_url": "https://www.google.com/maps/contrib/114111911552231617846/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX-2UnvM3YwMOylKnLF4iyICf8zc-25W-m88fCX5_pIdAUoQN_4MQ=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "5 months ago",
            "text": "We stayed here recently for a convention in Helsinki and were so pleasantly surprised with the location l. We knew it would be pretty close to the city but the walk in is only about 10-15 min leisurely stroll past some awesome markets and the marina.\nAlso it’s actually on an island so a mince morning stroll around it is a must.\nThe buffet breakfast was awesome so much seating and food was delicious fresh and plentiful.\n\nHas 3 saunas and a decent gym as well. Also washing machine and dryer for guest use.  Out the back is a supermarket to pick up essentials.\n\nJust the rooms could be services a little more thoroughly is the only recommendation otherwise full 5 stars.",
            "time": 1719421657,
            "translated": false
        }
    ]
}