{
    "name": "Premier Kraków Hotel",
    "rating": 4,
    "reviews": [
        {
            "author_name": "Ioe Packwood",
            "author_url": "https://www.google.com/maps/contrib/113675737329247878621/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL_ktx4nwQRZBBBYptsWjw_p_SqhiLhYx8IArioF_UFvpRfPg=s128-c0x00000000-cc-rp-mo",
            "rating": 2,
            "relative_time_description": "3 months ago",
            "text": "The rooms are basic for a four star hotel. We ordered a double room and the bed and it was two singles pushed together.\n\nThe shower was in a weird place so the whole bathroom got soaked when you showered.\n\nThe key card to make the electricity work in the room didn’t work properly and kept cutting out. Which was upper annoying as the lights and charging stopped in the room.\n\nThe room was clean though.",
            "time": 1724961068,
            "translated": false
        },
        {
            "author_name": "Paige Gomes",
            "author_url": "https://www.google.com/maps/contrib/117723830872010102027/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLR3B5gyT9CiC7x-0uyKRW9PcHMIRusFqNQb_QipXfaJ9XP5w=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 4,
            "relative_time_description": "5 months ago",
            "text": "As an US resident exited to travel around, this place provides a lovely place to rest after a long day of exploring in the city. The pool is utterly lovely and is an enjoyable place to exercise or have some fun. The aesthetic of the place is more upscale. The buffet breakfast has a large variety of options and tons of seating. The rooms are fairly large, or at least my room on floor 4. This hotel is very children friendly which is great for some.",
            "time": 1718348307,
            "translated": false
        },
        {
            "author_name": "Neil Sly",
            "author_url": "https://www.google.com/maps/contrib/113334141941324510218/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJHcP5iRQkt-nR7VILSZIz4SeBBF1T2zjuYgzVrQvtGrnX9ug=s128-c0x00000000-cc-rp-mo",
            "rating": 1,
            "relative_time_description": "2 months ago",
            "text": "Stopped for 4 nights, and the sleep got  worse as each night passed. On a really busy Rd, on the main flight path to the airport, and unmanaged groups of teenagers running around the corridors. Night reception is a complete waste of time. Food horrendous,  pet food is the best description, rude staff in bar and restaurant. Over 5km from Krakow. Ignore the sales pitch and stop at your own perile. The worst hotel I, we had ever stopped at.",
            "time": 1728231122,
            "translated": false
        },
        {
            "author_name": "Brie Ziegler",
            "author_url": "https://www.google.com/maps/contrib/109475749362723706822/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWsOJkbXT9z-wugYAjXMkIpkX63n-8y8dbjf_seROTdd7NF_Kzx=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 1,
            "relative_time_description": "4 months ago",
            "text": "Highly disappointed with my stay here. We were moved 4 different times into rooms due to mold, no working AC, and a broken bed. Others that traveled with me had a shower that didn't drain, brown water, mold, and no AC. The front desk was accommodating; however all of the rooms we were moved to all had the same issues so it was kind of a moot point.",
            "time": 1721071180,
            "translated": false
        },
        {
            "author_name": "Tom the raton",
            "author_url": "https://www.google.com/maps/contrib/101937565736118765636/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWWyKtSOoCi-1o3MJta5f9-2Z3xz2qa-mGpP6DTgvY88gOF2DPp=s128-c0x00000000-cc-rp-mo",
            "rating": 2,
            "relative_time_description": "3 months ago",
            "text": "I was expecting a 4 star but when I arrived I was quickly disappointed, in fact a 4 star should not have a large amount of dust on the surfaces, the refrigerator did not work, the cleaning was done very briefly, the towel dryer did not work and it was rusty (same case in the other rooms), the sink was blocked, the breakfast was average the pastries were probably from the day before, for the swimming pool it is also disappointing the jets of the swimming pool did not work, the only positive point was the restaurant which is not bad, in short I do not think it is a 4 star hotel but rather 2 or even 3 stars.",
            "time": 1723752179,
            "translated": false
        }
    ]
}