{
    "name": "Amber Boutique Hotels",
    "rating": 4.6,
    "reviews": [
        {
            "author_name": "Stafford Chamberlain",
            "author_url": "https://www.google.com/maps/contrib/110105215751367776085/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL0V29JrZVxN6JZQ1Z2bc3TN5XBhUgZbT2VW-tMexEYg0pFcUpd=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "Working in the industry and been a chef for 27yrs it's so good to go to a hotel that you feel relaxed and welcomed. We flew in from Dublin arrived at the hotel early monday afternoon. There was a young lady at the desk can't remember her name but she was so nice welcoming and helpful.   She even helped us to book out tour and nothing was a bother to her,  the staffs here are so friendly and helpful. we left Friday afternoon around 3 and I had to say she was an amazing help to us and was a pleasure staying at the Amber. Close to old town and most places I would definitely recommend",
            "time": 1726866157,
            "translated": false
        },
        {
            "author_name": "Simina Sav-Șamata",
            "author_url": "https://www.google.com/maps/contrib/115319172831466652801/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX37Xwy1GS67mU3zc2fXtmuZHg2rooodEugag7ahUON98DikAS1=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "5 months ago",
            "text": "The hotel is located just a couple of minutes away from the city center, close to some tram stations also. Room and bathroom were spacious and clean, mini fridge available. We arrived by car and the parking option they offer is located around 300 meters from the hotel, at an extra charge in a parking lot, but we were able to pull up our car a couple of meters from the hotel entrance, both during arrival and departure. Breakfast was fine, the offered selection was good and varied enough, but the breakfast room felt crowded at times. The staff was overall friendly.",
            "time": 1720086816,
            "translated": false
        },
        {
            "author_name": "Samuel Tervaskanto",
            "author_url": "https://www.google.com/maps/contrib/100635453913677626581/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVsQa7HD4FVQ4TPsbItIIe5wgRDRlB4c1JWWwm4_yboD9BrxSQk=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 2,
            "relative_time_description": "a month ago",
            "text": "Spent three nights exploring beautiful Krakow with my kids, and while the city was fantastic, the hotel experience was a big letdown.\n\nWhat went well:\n\n- The hotel's location was ideal, right next to the old town and within walking distance of major sights. There were also plenty of great restaurants nearby, offering a mix of Polish and international cuisine.\n- The atmosphere was charming, with a lot of attention to small details. The inner courtyard looked lovely, though it was too chilly during our stay to fully enjoy it.\n- We stayed in a studio on the first floor (two connected rooms), which was clean, spacious enough, and had comfortable beds. The decor was a bit old-school, but it worked. The bathroom was standard, but the heated towel rail was a nice touch.\n\nWhat didn’t go well:\n\n- The room’s location on the first floor, right by the street, turned out to be a huge problem. Construction work started every day at 6:30 a.m., waking our whole family :( . My father, who was in a room on the other side of the hotel, didn’t hear a thing, so it seems we just had bad luck with our room. But we weren’t warned about the noise at check-in, and when we raised it with reception, they simply said there was nothing they could do. While it wasn’t the fault of the hotel’s reception staff, they could have handled it better by not renting out rooms on that side during such noisy periods. Paying €350 a night for a room you can’t even sleep in until 7. felt really unfair, and it soured the whole experience.\n\n- Breakfast was another disappointment. Reviews suggested there might be more variety and better quality (maybe summer time?), but during our visit, the “hot” dishes (scrambled eggs and sausages) were always cold, and some of the cold dishes were too warm. The fruits and vegetables, stored at the wrong temperatures, dried out quickly. Rather than trying to offer a lot of mediocre options, I think a small boutique hotel like this would do better focusing on a few high-quality items.\n\nIn the end, while the hotel had plenty of potential with its great atmosphere and location, the noise and lack of sleep made the experience really frustrating. It’s hard to enjoy a €350/night stay when you’re woken up by construction every morning.",
            "time": 1729263118,
            "translated": false
        },
        {
            "author_name": "Ryu Ahsa",
            "author_url": "https://www.google.com/maps/contrib/117026108507043307348/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXxQF2EFM0pS5HlBPjEIzixSA1umaABHUYn1PTve3EnPPeJ0hfkqA=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "Incredible and exemplary service, beautifully tidy, lovely sauna, close to the town. Staff are always there to assist and help. Great attitude overall. We enjoyed our stay very much!",
            "time": 1729153797,
            "translated": false
        },
        {
            "author_name": "Gili Kimel",
            "author_url": "https://www.google.com/maps/contrib/111632243409021588847/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJMr35OCzqeqRpN1pesFX-2TfRn9i6xYlS1CSHGmRtLrvHPBA=s128-c0x00000000-cc-rp-mo",
            "rating": 1,
            "relative_time_description": "3 months ago",
            "text": "Im adding an update: Magdalena, the manager, apologised the day after. She was very kind and professional, she took responsibility and gave us sufficient compensation.\n\nIt was one of the worst hotel experiences I have ever had. It was the most unprofessional hotel I ever had the misfortune to stay in.\nWe arrived at 1100pm with 3 kids, 1 sick, after a very long day.  We notified the hotel that we would arrive late.\nWhen we checked in to the 2 rooms we booked, we only had 4 beds, while we are 5 and booked for 5. The person at the reception said he doesn't have a solution. We told him that unless he expects one of us to sleep in the lobby, we need  a solution. He said he doesn't know where the folded beds are... we again explained that he must  find a solution since we booked and paid for 5 people! From that moment, he started running around the hotel, trying to call housekeeping or other staff. He then found a bed that we couldn't  fit in the room! My husband had to move heavy furniture out of the room at midnight while 2 of my kids were already sleeping. Then, when it was already after midnight, we set and waited for him to find the items to make the bed.  What an awful awful experience.  Don't come to this hotel.",
            "time": 1724496589,
            "translated": false
        }
    ]
}