{
    "name": "Hotel Kazimierz II",
    "rating": 4.3,
    "reviews": [
        {
            "author_name": "colleen stenhouse",
            "author_url": "https://www.google.com/maps/contrib/100119808928309789588/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWtJEdTTr0tCNxCjIEIRSTm7xATDmecLkV_r6iZZKDGOYupTqky=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "We have just returned from a fabulous trip to Poland and stayed at this hotel. The staff were fabulous, breakfast was amazing and the location was perfect....we will be returning!",
            "time": 1723191188,
            "translated": false
        },
        {
            "author_name": "Tanya Rogers",
            "author_url": "https://www.google.com/maps/contrib/111623498609758862621/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWygB8jcwGTCq09UwvCWSG75xK3yYIJMf5JH7rDajqk420MoDh-nA=s128-c0x00000000-cc-rp-mo-ba6",
            "rating": 4,
            "relative_time_description": "a year ago",
            "text": "The hotel is located next to a tram stop which can take you into the old town. It is minutes away from the Jewish district and some fab cocktail bars and restaurants.  Rooms were basic but beds comfortable. Breakfast was ok. Rather limited after 8am and not replacing food. Main problem was outside our room 106 was building works that the hotel was doing. It started extremely early at 6am and lasted til 7pm. Banging, drilling and builders talking. This severely interfered with sleep quality and if you wanted a nap after walking all day! Very annoying",
            "time": 1698570551,
            "translated": false
        },
        {
            "author_name": "Maria Potter",
            "author_url": "https://www.google.com/maps/contrib/108265847520667379107/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXC3N_SwXMl3j8yvEqGlMg5w59WTevXICH2r8asoOVa-o7AeE_Y=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "a year ago",
            "text": "Great location for exploring Krakow - only a 20 minute walk in to the old town. Room was nice and clean. Breakfast was OK and had a variety. Perfect hotel for a city break in Krakow.",
            "time": 1697840261,
            "translated": false
        },
        {
            "author_name": "Miriam Daly",
            "author_url": "https://www.google.com/maps/contrib/117213932016829418279/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJlLC1OU71AbG369-c7fLFT_lASP-AdDQp9He6YWGZ-tsOIwg=s128-c0x00000000-cc-rp-mo",
            "rating": 2,
            "relative_time_description": "a year ago",
            "text": "Stayed here with my friend very recently for 5 nights. Hotel room very dated nothing matched, but clean bed linen and towels. Had to ask reception for coat hangers none in the wardrobe! Bathroom clean but the shower had more water pouring from the back of the shower head than the front!!   One thing if you stay in a room at the front the trams from about 5am are horrendously noisy. The hotel/reception staff 😳...well not very friendly at all you have to speak to them 1st when you walk past they don't even lift their heads to acknowledge you when you pass by, not a hello, goodbye, did you enjoy your stay with us .....nothing!! Appalling....seriously need to be sent on  a customer care course !! Not impressed at all. Breakfast ok nothing special. Would not recommend this hotel looks very shabby on the outside needs a face-lift.",
            "time": 1691423489,
            "translated": false
        },
        {
            "author_name": "Lenka Koňaříková",
            "author_url": "https://www.google.com/maps/contrib/116962458056779420689/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWGjgl1lsz-J663Kt_VKD4UuL-eIJVgDrJLPTOcvogmzzH6_j2w=s128-c0x00000000-cc-rp-mo",
            "rating": 3,
            "relative_time_description": "a year ago",
            "text": "Hotel in a perfect location, at a good price, nice and clean rooms, great breakfast.\n\nThere are thin walls between the rooms, so you can hear very clearly what the people in the next room are saying. If your neighbours get up at 6am, you wake up too, whether you want to or not.\n\nThere was only soap in the bathroom, nothing else. At least shampoo offered to guests is nowdays a standard for a three star hotel. However, there was a sign saying that if you have forgotten any cosmetics, slippers etc. you would get it for free at the front desk. That is not true at all. The ladies at the reception can provide you slippers, but absolutely no cosmetics. They themselves were confused by our request and didn't know about the sign in the bathroom.\n\nThere was only one blanket for 2 people as well so we asked for extra one. This was quite a problem for the staff to arrange (the ladies didn´t seem to care too much about our requests), first they offered us a not very clean looking blanket, but finally they managed to find one with a clean sheet (which we had to put on the blanket ourselves).",
            "time": 1676997062,
            "translated": false
        }
    ]
}