{
    "name": "The Bonerowski Palace",
    "rating": 4.6,
    "reviews": [
        {
            "author_name": "James B.",
            "author_url": "https://www.google.com/maps/contrib/113221549549106233245/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWXbZHXpcbYWeNGJVxWfV2fZi_p3ZTaIs6n0sd6Y67MmV0ip5U=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 3,
            "relative_time_description": "5 months ago",
            "text": "First, the good news. The location is outstanding. Breakfast is very good. Staff are generally friendly.\n\nHowever, after staying in a genuine 5-star property in Warsaw (the Hotel Verte), this hotel was quite a let-down.\n\nOur double bed was 2 twins pushed together. Each single mattress was thin (6 inches?) without box springs. It was about a 5 on the 10 scale of comfort...overly firm, and strangely unyielding when one turns over. And instead of a single large duvet spanning the entire bed, we were given two duvets and two spreads, one for each half of the bed. Weird.\n\nThe bathroom is small, cramped, and lacks any usable surface area as originally designed. To make some, the hotel installed short lengths of walnut-stained 2x6\" planks above the sink and the toilet. I hit my head twice on the one above the toilet, drawing blood the second time.\n\nHuge, heavy drapes \"grace\" the windows and spill onto the floor in large, dense puddles. The drapes show their age and need to be refreshed, the antique atmosphere of the hotel notwithstanding.  In fact much of the fabric decor...the bedspreads, the decorative pillow shams, the area rugs...is old and worn.\n\nThe staff at the front desk try to be helpful but are remarkably ignorant about sites, restaurants, transportation, etc. When one asks tourist-type questions, they go to the same internet sources you or I would go to. Fortunately an excellent Tourist Information Center is right across the street.\n\nElectrical outlets are few and inconveniently located. No USB connections.\n\nThe TV is very, very old. Hint: if you're trying to connect a computer, look for what appears to be a single HDMI port. On the TV's source screen, use the \"Blu-Ray\" option. Really!\n\nThis hotel is ok but, should we ever visit Krakow again, we'll research alternatives.",
            "time": 1720173927,
            "translated": false
        },
        {
            "author_name": "ANDREW GYURE",
            "author_url": "https://www.google.com/maps/contrib/108011758554589449760/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIg_pHX78bQRkYKK_lqoRZU2i0UxD2B9Edy38-URzEE_yvpMQ=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "10 months ago",
            "text": "I can’t imagine a better location from which to explore Kraków’s Old Town — the hotel is situated right on Market Square. The well-appointed, cozy rooms have a sophisticated, old world feel. The staff is friendly and accommodating. Most sights and attractions are within a 20 minute walk, most of them much less than that. An absolutely perfect place to hang your hat in Krakow.",
            "time": 1705548618,
            "translated": false
        },
        {
            "author_name": "Soumi Mukherjee",
            "author_url": "https://www.google.com/maps/contrib/101851494841988114917/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJG_P6PgMnHbHj4bogRcQEIiWw1yB5zCN2IK8I9qhIFThmzHw=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "5 months ago",
            "text": "Fantastic Hotel with great staff. Very attentive and helpful staff. Great location and food as well. Great place to stay in Krakow",
            "time": 1718015471,
            "translated": false
        },
        {
            "author_name": "Gary Wilkins",
            "author_url": "https://www.google.com/maps/contrib/105356503374827101033/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVTtaM5Jw4_RBfP_7u9gqQnUBitHWG02jp_IZKlKtrjXoMgM5sH6w=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "4 months ago",
            "text": "Superb location on the corner of the market place. The food was delicious, served hot and in a timely manner. Great service",
            "time": 1720729537,
            "translated": false
        },
        {
            "author_name": "Vel Palassis",
            "author_url": "https://www.google.com/maps/contrib/110429140036701155605/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJx1BUKaNIVGuLUuA0jhbgiTHqKkdFXyki7iz0pgc-aXHd7KA=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 4,
            "relative_time_description": "11 months ago",
            "text": "Nice hotel in a very good location visited for the Christmas holidays.\nDifficulties with the reception services since we were a group of 6 people.\nAlso the quality of the grill, in this case an Angus steak, was unacceptable for a Christmas eve dinner.\nKrakau is a beautiful city to visit, also from the historical point of view.\nDon't miss the salt mines.",
            "time": 1703755560,
            "translated": false
        }
    ]
}