{
    "name": "Radisson Blu Hotel, Krakow",
    "rating": 4.5,
    "reviews": [
        {
            "author_name": "Ryan",
            "author_url": "https://www.google.com/maps/contrib/108829656391930101502/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL2lNAw-CuY6InxMfDA5PVumcBP2qt5HYW5A3I5JTtjDIV55A=s128-c0x00000000-cc-rp-mo",
            "rating": 4,
            "relative_time_description": "a week ago",
            "text": "Stayed here earlier this month(room 109) and the hotel was good but it lacked in a few areas which were mainly in the room, the tap for the sink wasn't fixed to the counter and could be freely moved and the bath had holes in it which had been very poorly repaired. otherwise the staff we're lovely and helpful!",
            "time": 1732404256,
            "translated": false
        },
        {
            "author_name": "Theodore Biedenkapp",
            "author_url": "https://www.google.com/maps/contrib/115386652534379507947/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVkllLE4HFRaszFZAm3KGA_iLO56rLqeD5z_atJJ_77iETpQE54Dw=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "The service here is excellent. Because I had some issues with my room I was upgraded. The breakfast offers a wide variety of fresh offerings reflecting local and international tastes. You can't beat the location, right near Old Town facing a park. The side street offers markets and an array of foreign restaurants.",
            "time": 1728270394,
            "translated": false
        },
        {
            "author_name": "Gareth McHale",
            "author_url": "https://www.google.com/maps/contrib/114449053537728431959/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLD2Rf9AW-GZ_5Y__65tYqc-w_kQmA5NZQJXO6M9BlgXVVXUQ=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a week ago",
            "text": "A very comfortable and convenient base for a few days in Krakow. Walking distance from all the main tourist destinations; and handy for public transport if you don't want to walk.",
            "time": 1732209185,
            "translated": false
        },
        {
            "author_name": "Kevin Jones",
            "author_url": "https://www.google.com/maps/contrib/102509798248527605885/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU2RyDM52UC40-aixqdw2KRt0iqme0X59sEOwaJpCX2xxXV-GnNwA=s128-c0x00000000-cc-rp-mo-ba6",
            "rating": 5,
            "relative_time_description": "2 weeks ago",
            "text": "The Radisson Blu is a lovely hotel in Krakow that we stayed at for multiple nights on our extended Poland leg of our river cruise. It’s a beautiful hotel in a fantastic part of town with the university park across the street and Wawel castle up the hill. My wife and I adored walking in the peaceful surroundings and green spaces just across the street.\n\nI must say that the food served in the lounge was some of the best food that we had on our trip that included Germany and Paris. We talked about this hotel and its food and compared it to everything that we experienced on the rest of our tour. To us, it was better than what we had in Germany and France.\n\nPoland is a gem and so is Krakow and the Radisdon Blu hotel! We definitely will be back one day!",
            "time": 1731787705,
            "translated": false
        },
        {
            "author_name": "furat Attili",
            "author_url": "https://www.google.com/maps/contrib/102373804291383324302/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK4Mm01Dg5QcYv_SrsM3WcMrQ2MlNI99Sz0Zunw_0SpfKWuKg=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 3,
            "relative_time_description": "3 weeks ago",
            "text": "This is a five star hotel. FIVE STARS.\nBrilliant staff, not so great management, which shows. The location is almost central.. 10 minutes walk away from the old square.\n\nIndeed, your staff are amazing, both on reception like Sopia and in the restaurant and room service, your management on the other hand.. I need to speak to them.\nThe hotel itself - compared to many other 5 star hotels I stayed in- looks and feels tired with nothing special about it. Rooms and corridors have distinctly tired  and occasionally stained carpets (I will spare you the pictures, but Imight post a couple). Dear management, you can easily invest in a carpet stain remover liquid and 5 minutes to clear it.\nOutdated but good quality furniture and decor, with quiet rooms and noise isolation doors, but disorganised feel to the whole place.\n\nI'm often not bothered to leave this kind of feedback, but maybe there will be an appreciation for it on here. For example, it wouldn't hurt to organise a seating system for breakfast, as I couldn't find a table or seat to have breakfast on Friday morning and it was obvious they could've opened the bar area as a spill over seating, or the adjoined hall 🤷🏻‍♂️.\nSpeaking of breakfast, when you pay £37 for it each morning, or almost 180 Polish zloty, which is one of the most expensive across the city, try justifying it with something different, unique, high quality or value for money, not serve pre-packed scrambled eggs hot pots and basic selection of few cheeses or meats which you get in every 3 star hotel. Have a queue system for seating, look at your guest list and if you are fully booked then open the extended halls before people start turning away from your overpriced and under delivered breakfast.\nBetter still, make your price reflect what's on offer.\nAnyway, your staff are amazing, both on reception and in the restaurant and service, your management on the other hand.. I need to speak to them. Also, have a look at the towel provided in the bathroom.",
            "time": 1731231547,
            "translated": false
        }
    ]
}