{
    "name": "PURO Hotel Kraków Stare Miasto",
    "rating": 4.6,
    "reviews": [
        {
            "author_name": "Gee Kay (KayGee)",
            "author_url": "https://www.google.com/maps/contrib/107879376881559885725/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXXjdqJH7VR-L6-shrIWEwWw3zqW1ry8YSIZ1Hci4PA2eVQO9CEQg=s128-c0x00000000-cc-rp-mo-ba6",
            "rating": 3,
            "relative_time_description": "a week ago",
            "text": "Pretty small rooms, couldn't unpack my luggage as there's no space to keep my luggage except on the floor, basic amenities.\n\nNO coffee maker in the room, you have to come to the ground floor for the coffee or tea, not much to order from room service, friendly staff though.\nBreakfast spread is okay not that great.\n\nThe single room is cramped so asked for an upgrade to the double room which was a little bit bigger but small for a double room.\nLong turnaround time for laundry.\n\nThe only good thing is the proximity to the old town!!!!!!!\n\nLots of Indian restaurants nearby for good food, mall opposite to the hotel, public transport in front.\n\nOne more small point, if you have heavy luggage, the path to the hotel entrance from the street is riddled with uneven stones, makes pulling your luggage from taxi to the entrance very difficult if your luggage is heavy!!!!",
            "time": 1732449176,
            "translated": false
        },
        {
            "author_name": "Home Chef",
            "author_url": "https://www.google.com/maps/contrib/106983801461123939199/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIriFJe_WmYHUV6o79c_SCYy-HDuYr0_rpPDS2oLb5iXgZ4fg=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "Nice hotel. Quiet, comfortable room. Railway station and big shopping mall just across the street. Old town within 10 minute walk. Good connection with public transport.\nIn the evening nice to spend time at the bar.",
            "time": 1729590982,
            "translated": false
        },
        {
            "author_name": "Pong Natthwut",
            "author_url": "https://www.google.com/maps/contrib/102799243901755325375/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW9G5dp2KC0y_ijKsyv1eHWJvCGLSLYDlcoeUQ6_651smW2eiH0=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "I was impressed from the moment I stepped in. The hotel is stunning and eye-catching. I stayed in Suite 601, which had a beautiful, peaceful view. The room was spacious, stylishly designed with a minimal and sustainable concept. I could see the rooftops of the old town. The staff were very attentive, friendly, and provided excellent service.",
            "time": 1728052992,
            "translated": false
        },
        {
            "author_name": "Emma Mayer",
            "author_url": "https://www.google.com/maps/contrib/111028569296565667217/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJAmECchxklUUeIcdGjeJFoztpdFr-26uS-OFfhF0kqH93AIw=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "4 months ago",
            "text": "We had a wonderful stay at this hotel. Everything runs efficiently and smoothly from arrival to checking out. The location is ideal (directly opposite the station for transport links, and a large shopping centre, and only a few minutes walk from the old town.)\nThe tablet function for the room was great and meant everything we needed was at our fingertips.\nIt was quiet, clean and comfortable. What more could you want really!\nAbsolutely no complaints with this hotel. We left feeling very well rested.",
            "time": 1722409127,
            "translated": false
        },
        {
            "author_name": "Alain Bednarek",
            "author_url": "https://www.google.com/maps/contrib/111281315580011123095/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI465UW9gmLQoTITcHnTAqpjy74YNw81LDZsIOAVnUu75S7tQ=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 1,
            "relative_time_description": "2 weeks ago",
            "text": "If you like:\n\n-being woken up by the tram (each time the whole room shakes like an earthquake)\n-hearing huge wall shocks all evening (coming from the kitchens just below)\n-or hearing your neighbors through the poorly insulated connecting door (the alarm clock that rings very early in the morning, conversations, etc.). And it works the other way around, people can listen to what you say.\n\nThen this hotel is for you.\n\nIt's unfortunate, because I'm used to going to the Puro Hotel (Stare Miasto, Kazimierz, Poznan) but my last experience at the Puro Hotel Stare Miasto at Kraków disappointed me a lot. This unlivable room was assigned to us by a nonchalant receptionist. Our arrival seemed to bother her. However, the rest of the staff was friendly.\n\nI have never been so tired from lack of sleep when leaving a hotel as this time.\n\nI am disappointed and I think I will not go to the Puro Hotel again...",
            "time": 1732113196,
            "translated": false
        }
    ]
}