{
    "name": "The Art Inn Lisbon",
    "rating": 4.5,
    "reviews": [
        {
            "author_name": "Renae Robert",
            "author_url": "https://www.google.com/maps/contrib/101555451889005079829/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXaQuY5EYQGEdSJnKDN-dOGJbTRrE5UEsARjhNBGjkOUfuuYb4=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "Cool little room! Nice to have a rooftop to go to for drinks and for breakfast. Good location! Easy to get to and not a hill to climb to get to! But lots of stairs to get to the rooms (but there is an elevator although my friends and I didn’t need to use it but it is available for use). Great little breakfast! Had eggs, beans, bacon, yogurt, nuts, bread. Very helpful reception!",
            "time": 1729600032,
            "translated": false
        },
        {
            "author_name": "Brian Forsythe",
            "author_url": "https://www.google.com/maps/contrib/103265297043684172031/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXnVYoh45hry3a0v4h62at_RMeCRWv5gvpU4aEO-cnIgYV8aX8bxw=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "A friend recommended this beautiful hotel in a perfect location! My room was sparkling clean with modern, artistic style. Nice big bathroom and cozy bed. The bonus is the rooftop restaurant with an incredible view of the castle and city skyline. I had a perfect plate of fresh pasta and a few glasses of wine. After dinner I stayed for another cocktail to take in the view. A very nice breakfast was included and is served on the rooftop terrace. What a gorgeous spot!",
            "time": 1727121728,
            "translated": false
        },
        {
            "author_name": "Michael V",
            "author_url": "https://www.google.com/maps/contrib/116550384081198263564/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ2mEDsxQQBtNmYA13D1ra0x_w0oItvJxzEXhF3TrfzjgS55A=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "We had a great stay here, traveling with a 2yo.\n\nQuiet rooms. Spacious. Good AC.\nFriendly staff, helping with any request.\nA great breakfast buffet on the roof, staffed by the hardest worker in Lisbon.\n\nLots of stairs, but worth it. Can use elevator for luggage.\n\nWould 100% return.",
            "time": 1729015864,
            "translated": false
        },
        {
            "author_name": "Dohee Kwon",
            "author_url": "https://www.google.com/maps/contrib/111386540659855311739/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXHPYph5Hj9jouODsXJDD-4h1l2BvgWlYvE4ztRj-GRXPgexzM=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "This hotel is situated in the heart of downtown, offering a very safe environment to walk around, even late at night. The staff were incredibly friendly and went above and beyond to ensure a pleasant stay. We arrived at around 10 AM after an exhausting overnight flight from New York to Lisbon. We had previously requested an early check-in, and despite the hotel’s policies, they accommodated us and made it happen!\n\nI had reviewed many hotel options in the area, and while most reviews mentioned that hotels in Lisbon's tourist areas tend to be small, our room here was surprisingly spacious. We had plenty of room to open and spread out our suitcases. The room also had a great modern bathroom and a huge window/door leading to a small balcony overlooking the street, which added to the charm and comfort.\n\nThe hotel also boasts an amazing rooftop where we enjoyed breakfast with a view and drinks at night. As a traveler in Lisbon, you should be prepared to walk a lot. This hotel has a luggage elevator from the second to the fourth floor, which was convenient for us since our room was on the third floor. It was a bit of a workout, but manageable. The staff offered to help, but since I had my partner with me, we declined. The staff member was very kind and supportive throughout our stay. His warm welcome and helpful tips truly made him the face of our Lisbon trip.\n\nI highly recommend this place if you want to be within walking distance of all the major attractions. This hotel offers both convenience and exceptional service, making it a perfect choice for your stay in Lisbon.",
            "time": 1723053419,
            "translated": false
        },
        {
            "author_name": "Anna Schmitt",
            "author_url": "https://www.google.com/maps/contrib/109333334597810366636/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKgTcrqHgrf_Wmgq5akg3PHJRwSUUr_yJpPsKHraq3SndMg=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 1,
            "relative_time_description": "a month ago",
            "text": "We enjoyed drinking a glass of wine in the lounge chairs and decided to eat something. When the food arrived, they tried to force us sitting at a table, cause they didn't allow us to eat in the lounge area. Although the restaurant was completely empty. Really not the service I expect from a restaurant. So we decided to leave without eating our ordered food.",
            "time": 1729344016,
            "translated": false
        }
    ]
}