{
    "name": "The Great American Disaster",
    "rating": 3.9,
    "reviews": [
        {
            "author_name": "travis butler",
            "author_url": "https://www.google.com/maps/contrib/110852451750456148257/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKdugOblXmKNwxpAH-qUyp8nTXtOZtsHuSN9oC7EXAiXIAUbQ=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "Love this place…once we got in. Outside looking up at but no obvious way in. Literally no signage. Once inside, the booths along the window were reserved but the lady with a lovely smile put us there anyway. I had the Burger with two mustard sauce which was amazing. We sat and watched with some amusement as three separate families came in and threw tantrums because they couldn’t get a booth! AND, that was the parents!\nI love it here though. Simple, tasty food with a great vibe.",
            "time": 1729542668,
            "translated": false
        },
        {
            "author_name": "Joao Diogo Santos",
            "author_url": "https://www.google.com/maps/contrib/110307986522685545817/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKOb0yZe22Ycgdsvh-mS3fdoQaeqDpoaPz9au-uaPSgJh8uzA=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "8 months ago",
            "text": "I had a pretty good experience at this restaurant, it’s themed like an American roadside diner, the food is good and I really liked coming here, the first time I ate here I ordered a burger and the second I ordered a steak, I recommend getting a burger because the steak is more expensive and had a lot of nerves in it so it’s not as good as the burger, which is marvellous, o regret not asking for the strawberry milkshake as the drink, I had it as desert and it was soo good…\nAlso amazing view of the marques de Pombal.",
            "time": 1711806765,
            "translated": false
        },
        {
            "author_name": "Jack Velasco",
            "author_url": "https://www.google.com/maps/contrib/100069149193686946704/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU4TngnOLnFTN2osjqPpVJFtRFva4BwDuWZ49cuMVU4pzeoFgb08w=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a week ago",
            "text": "I was taken back bc of the rating but honestly it's a pretty good place, the food is good I got the chili hamburger (without the chili bc I can't handle the spice but the person I was with said I was pretty good tho) it was a pretty good size!\nI say the price is a little higher bc we got dessert, the Oreo Mess is incredible I definitely recommend.\nThe servers were really nice and welcoming.\nThe decorations are really good too it has a good atmosphere and music.\nThe only \"dark\" side is the entrance it doesn't really look like you should be there but if you have any difficulties it's directly down the restaurant and then there's a staircase and you just go straight ahead and there's the restaurant!\nGive it a try don't let entrance discourage you I promise it's good food and people!",
            "time": 1732214670,
            "translated": false
        },
        {
            "author_name": "André Filipe",
            "author_url": "https://www.google.com/maps/contrib/117957084054806643677/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU1FdUHHIY3bTCNYvJlfAxzkLbs0UeWS1LIPiyi3yn_2rgcpBS3=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 4,
            "relative_time_description": "a year ago",
            "text": "We knew about The Great American Disaster when we were leaving Lisbon, few minutes after we took the road so we decided to visit the place next time we were in the city. So this is what we did.\n\nFirst of all, the restaurant name kinda checks out, according to its location (it's a disaster to find where to go). Although it's placed in a very prestigious place (at Marques de Pombal plaza), its entrance is really hidden (this is why we weren't able to visit the place during our first stay in Lison), making it really difficult to be noticed for those who doesn't have keen eyes. You have to enter some sort of building lobby, which was empty, with no open stores (it was a Saturday). There was a security guard inside a room (who was playing freecell lol) who helped us and pointed the right direction (which was upstairs).\n\nAlthough there were a good number of tables, the place was empty, which was good because it meant quick service. It didn't take long to have our order taken: I ordered a steak with 2 kinds of mustard and my wife ordered a Margherita pizza. We also ordered a portion of fries with cheddar, a vanilla milk shake, a mug of beer and garlic bread.\n\nThe pizza was very good, although I can't help thinking it's a frozen pizza, like those sold in supermarkets. Again, very good and tasty but clearly not homemade/artesanal so, not worth the price charged. The fries were ok, but I felt a mild flavor on it that resembled fish (I think they used the same oil to fry it). My steak was very large (not thick, just large) and, although it was very tender, it really didn't feel like an american steak. The mustard sauce was tasty, but not how I imagined it would be. There was nothing special about the garlic bread. It really looked like frozen breads (those we buy at the supermarket) with butter, garlic and oregano. There was also another portion of fries with the steak so I miscalculated it a little bit, having to take away part of our food.\n\nSo, if the food wasn't that good, why the 4-star rating one might be asking. Well, Portugal is known for not having the \"most polite\" or \"most cheerful\" table service around Europe (maybe around the world), and in this matter, this place rocked! Both waitresses were extremely cheerful and provided top notch service so this rating only because of them.",
            "time": 1681296005,
            "translated": false
        },
        {
            "author_name": "P M",
            "author_url": "https://www.google.com/maps/contrib/109536413503756046925/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKWtotPnm4T8w0p_ZfYCzupkbVK8TkoIQh1S2_sUCZUtZnlfhdE=s128-c0x00000000-cc-rp-mo-ba6",
            "rating": 5,
            "relative_time_description": "2 years ago",
            "text": "Nice place with good service and friendly staff, fair price and a great view over Marquês do Pombal. I had the Gringo go Home it's very spicy but I was told by the waiter. Consider this place to visit at the next opportunity.",
            "time": 1661351602,
            "translated": false
        }
    ]
}