{
    "name": "1300 Taberna",
    "rating": 4.3,
    "reviews": [
        {
            "author_name": "Aristeidis Gogadis",
            "author_url": "https://www.google.com/maps/contrib/107745860343107200250/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIEL3lXKdYJplYDlmQrbmRYz8GvTUQTtfKk2con0-1r0EsDbw=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 4,
            "relative_time_description": "2 months ago",
            "text": "Nice restaurant in lx factory. Very nice starters. Very tasty. We had two main courses. The cod and the ravioli. They were. Wry nice but I would prefer some more seasoning. But that is a personal preference. I totally recommend it if you are in lx factory.",
            "time": 1727764666,
            "translated": false
        },
        {
            "author_name": "Irma Carvajal Puerto",
            "author_url": "https://www.google.com/maps/contrib/104948854752231819321/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVyJS4zFgDcfj8nQkVjH4KNyfFzrRRREiS6iZJSydin-0vhnw9t=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "2 weeks ago",
            "text": "Totally unexpected how good was this place, and it took me by surprise where the restaurant is, everything is unique and delicious, for me the best was the octopus rice and the chocolate dessert, you should come and try",
            "time": 1731713183,
            "translated": false
        },
        {
            "author_name": "Olga Pope",
            "author_url": "https://www.google.com/maps/contrib/112965776433408742516/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUYMOVD5JQsgjMa_9VCus-3oEPOritTnYa45r9eEE2CK4bW_dZ_=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "I first came here nine years ago, in 2015. The dark stout bread blew my mind. I finally got the chance to return to Lisbon this year, and went straight to this place. They still make the same bread, and it’s still the best I’ve had in my whole life. I could marry it and have its babies. Seriously, it’s out of this world. Order the bread basket and try the darkest of the breads in it. It just might change your life.",
            "time": 1729281039,
            "translated": false
        },
        {
            "author_name": "Cristal Ottenwalder",
            "author_url": "https://www.google.com/maps/contrib/103288695323924605608/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKj0QpTP1ku_ny5UDVhro6JcPqW9xfCxtvRAwTm9Az9U0SOfw=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "8 months ago",
            "text": "I visited this restaurant with my boyfriend for my birthday today and we were in AWE with the food and level of attention we received from staff! We’re from New York, so we tend to be tough food critics as we dine out for dinner at home quite often. We ended up sitting outside because it was a beautiful night, but the interior was nothing short of beautiful!  We started with drinks, we both got passion fruit flavored drinks, one of which was their signature drink! They were both super yummy and still had a great amount of liquor, we ended up getting another round of the same drinks! We had the  variety bread as a starter, which was super tasty and I loved the olives and olive oil! But the stars of the show were really our main courses. My boyfriend got the Duck cannelloni dish which was super rich and flavorful. I got the pumpkin and nut ravioli, which as simple as it sounds, definitely exceeded any expectation I had for the dish. Presentation, taste, EVERYTHING was a 15/10. Since it was my birthday, we also ordered 2 desserts: the peanut butter and dulce de leche ice cream sandwich and the cheesecake! Both were so decadent and rich in flavor. The cheesecake is unlike any other I’ve had before, and I really fell in love with the dessert. I loved this restaurant so much that although we only have 2 days left of our stay in Portugal before going back home, we are going to try to dine in again on the last day! It was amazing. We’ve both been raving about this restaurant as it’s not only the best restaurant we’ve visited during our stay, but definitely in our top 3 restaurants of all time!! Definitely recommend!",
            "time": 1711235646,
            "translated": false
        },
        {
            "author_name": "H L Z H",
            "author_url": "https://www.google.com/maps/contrib/112800450674636814085/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUDbQqAYD4-GPf12PBOrOB-L6FuClpqEyCu6PwFXQmoplIurNP2=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "11 months ago",
            "text": "A place that serves good portugese food at slightly above average prices. We had the Black Pork and Cod Fish; the pork was cooked well, the meat was so soft and tender that a fork could easily break it apart. No complaints with the food or service here, but I feel the prices are above average compared to the other place we visited, maybe that is due to the more upscale deco in this restaurant.",
            "time": 1702572952,
            "translated": false
        }
    ]
}