{
    "name": "A Travessa",
    "rating": 4.2,
    "reviews": [
        {
            "author_name": "Capt Bligh",
            "author_url": "https://www.google.com/maps/contrib/112219044700001748395/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVc_aelQlrq_5MuEQeh_8FXx6UB1GQR7qEfgneETJQrH8VbA63Y=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "2 years ago",
            "text": "I am shocked that this restaurant does not have a Michelin star, the dishes are absolutely fantastic. The scallops and octopus were so tender and delicious. The wild bull and lobster were beyond tasty. You must visit this restaurant and try everything on the menu. After eating there last night, my wife and I are considering eating there again tonight, it’s that good.",
            "time": 1656748491,
            "translated": false
        },
        {
            "author_name": "Tal Paca",
            "author_url": "https://www.google.com/maps/contrib/115235966166424742800/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWoFcbOt_7HzHxvsbM2m6IyHbzrv8bQakSOLkbhO90x5qW4IYev=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "a year ago",
            "text": "Remark: if you’re not used to dining within this price range, watch out for the waiters filling your glass of mineral water again (although you didn’t finish it yet), or replacing the breadbasket “they are offering” for a new one, because they charge everything on your bill. Beside that…\nThe food was exceptional. Even the bread was delicious. All dishes were so refined, but the superlative degree of refinement were the desserts.\n\nI had the Mousse de Doce de Leite fumata; It was phenomenal. The mousse had a perfectly balanced sweet and salty flavour, and a hint of smokiness. The mousse was topped off with a coffee flavoured coulis and Tia Maria liqueur, which brought some deeper, slightly bitter notes to the dessert. On the bottom you could find Fleur du Sel and some ground coffee beans, drenched in the delicious coffee flavoured liquid. There was still smoke coming off the dessert when I got it. This smoky sensation, brought very interesting woody tones to the saltiness of the Fleur du Sel and to the sweetness of the condensed milk and honeycomb mousse. The fennel on top brought all the flavours together.",
            "time": 1672309099,
            "translated": false
        },
        {
            "author_name": "Meredith Reynolds",
            "author_url": "https://www.google.com/maps/contrib/106792297260970246851/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVYJYy4mhKQTVDu7F-wXTs7nv-kLTPwDQZNFMjS-gV2Y-qTFFLA=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 2,
            "relative_time_description": "6 years ago",
            "text": "I really wanted to give this a better rating as it came recommended. You will be brought starters as soon as you sit for €15 per person. The Somme is great. The lamb shoulder is average with a lot of salt, but the venison with the truffle is amazing. We had issues with our dessert as we were served what we didn’t order and then ordered what we wanted and in the meanwhile we never received the coffee that we ordered until we reminded them. Overall the restauarent does not deserve the price that is charged, but some of the food is very good.",
            "time": 1540591037,
            "translated": false
        },
        {
            "author_name": "Luzie Kölblinger",
            "author_url": "https://www.google.com/maps/contrib/117877363088669301044/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW6D3_Etw13DFZCkaHqiYefJWqFMBqcLH-dN76ZtXyYtm6jVDZK=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "2 years ago",
            "text": "Wonderful!\nHigh quality food and drink, served with skill and passion.",
            "time": 1657356491,
            "translated": false
        },
        {
            "author_name": "joe MACKEN",
            "author_url": "https://www.google.com/maps/contrib/104970220609977958375/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUwMc8wZhUKE3RJMoshgBc7E3to1clxFRwvhKd4iNT22exAo0MXsg=s128-c0x00000000-cc-rp-mo-ba6",
            "rating": 5,
            "relative_time_description": "7 years ago",
            "text": "They automatically serve 8 appetisers depending on the season, the black pork sercreto and the clams were winners\nThen some one comes to take your order for main course.\nThis could all be explained from the get go, it's not.\n\nThe foods delicious.  But the wine guy here rocks.  Order safe if you want but I'd let him order for me every day.\n\nWould love to return in the warmer months when the terrace is open.  But restos vaulted ceiling is beautiful none the less.",
            "time": 1490428930,
            "translated": false
        }
    ]
}