{
    "name": "Estrela da Bica",
    "rating": 4.5,
    "reviews": [
        {
            "author_name": "Sophie Wong",
            "author_url": "https://www.google.com/maps/contrib/111290099665849366827/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUKeh1e9wifkPE2Mep_tAL0j3V9ETPxswukP8Dl4rUAH98iYgj-=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "Luckily, we got a table for 5 without reservation. It was packed on a regular Tuesday. Service was really good. The nice lady took time to explain the share dining concept and had a lot of knowledge for the wines. The food was excellent! We had a great last night in Lisbon.",
            "time": 1730236768,
            "translated": false
        },
        {
            "author_name": "AC",
            "author_url": "https://www.google.com/maps/contrib/102072422526659582470/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKR46sFx5bIFwmj7Ap0mqlGksUamqtfRFS0J1yOQlt5rwoVT6E=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 4,
            "relative_time_description": "a month ago",
            "text": "A couple people have recommended this place so we decided to finally try it on a whim. I have mixed feelings about it..\n\nService was very slow. We only ordered 4 dishes, but were sat in the restaurant for 2 hours and asked to get the bill / pay our bill 3 times\n\nThe portions are quite small and the prices are a tad higher than other small plates restaurants in lisbon but I will say the quality of the ingredients is high; the flavours were delicious, a standout was the cabbage with blue cheese. 4 stars for the food",
            "time": 1730323047,
            "translated": false
        },
        {
            "author_name": "Ramunė Beniušytė",
            "author_url": "https://www.google.com/maps/contrib/103469116501426614751/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIDdLXtvx_1kwXw07fAqM-nIo0R3nz3cbMp9Grd6H0AvxftDA=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a week ago",
            "text": "Amazing service and delicious food! We found it accidentally because it was nearby our accommodation but highly recommend! It is a cabbage in the photo, definitely worth a try! Also try caipirinhas, it was fire 😝",
            "time": 1732402510,
            "translated": false
        },
        {
            "author_name": "Amanda Rai",
            "author_url": "https://www.google.com/maps/contrib/105562720462922902614/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXuohC9oaEjqx9yOyDFt2LmoCBgteyK7zFiaIoUHDZf58L3W3C7=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "6 months ago",
            "text": "This was a true five star experience as the food, service, and atmosphere were all exceptional. This is not a fancy spot but has pronominal food and service. It was evident it was a popular spot as every seat was filled by 8pm.\nFrom the moment we walked in the door our waitress helped us understand the ever-changing menu. The dishes came out in a timely fashion and each was delicious. The Somalia brought our dining to the next level by letting us try our wine pick before bringing us the bottle and made sure we had wine and food to enjoy throughout the night. This was the most European dining experience I’ve had as we were not rushed to finish our dinner, wine, and dessert. I highly recommend this restaurant as a must-try when in Lisbon!",
            "time": 1716331113,
            "translated": false
        },
        {
            "author_name": "Jerry Zhou",
            "author_url": "https://www.google.com/maps/contrib/108738302921438473747/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWc_4ICfaDBWkHJRaYBlRyJVNC0wHqORTbyabgmzWf5IetLfzPV0Q=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "Great spot for late-night tapas! We rolled in around 11 pm and got lucky—it was Halloween, so the place was surprisingly mellow. Tapas portions here are much bigger than back home, which was a nice surprise. We started with the sardinhas em brioche (sardines on brioche) and the ravioli de bochecha (pork cheek ravioli), both packed with flavor. For tapas, we tried the couve coração (heart cabbage with Stilton cheese), pani puri with Azorean tuna tartare (tuna tartare with truffled egg yolk), and the burrata with beet and smoked almonds. Perfect amount for two. Highly recommend checking it out!",
            "time": 1730460767,
            "translated": false
        }
    ]
}