{
    "name": "Trindade",
    "rating": 4.1,
    "reviews": [
        {
            "author_name": "Marc Berry",
            "author_url": "https://www.google.com/maps/contrib/102648698795054059985/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI5axmHLgPKqa51z3qIU7vY89SrcVzpSi802is5CSs48wc0cA=s128-c0x00000000-cc-rp-mo-ba8",
            "rating": 5,
            "relative_time_description": "a week ago",
            "text": "Lovely seafood restaurant in the higher price range. A few good beers on tap. Beautifully decorated. Has a large garden area, a more formal dining area and the main hall restaurant. Check out the tiled artwork all around the walls. Food was good and fresh. Would recommend for a bite to eat and a beer",
            "time": 1732694036,
            "translated": false
        },
        {
            "author_name": "Erdem Girgin",
            "author_url": "https://www.google.com/maps/contrib/116272337997452168851/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLqZtQdFpMXxBIbTsW8epFOFqKpGi8q1K335BUrUMfnCFI2ow=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 5,
            "relative_time_description": "3 weeks ago",
            "text": "We enjoyed all of the food that we ate. Specially, appetizers we chose(  shrimps and octopus ) were so delicious.\nWe would chose this restaurant if we come back to Lisbon.\nApart from the food and service, the way they communicate during reservation(we did it through their website) and after the dinner was excellent.",
            "time": 1731175360,
            "translated": false
        },
        {
            "author_name": "J. Castillo",
            "author_url": "https://www.google.com/maps/contrib/100696665797759015171/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUvoLuxXyIplnZYK9gaYjJr--DmvbiVxmtGbTf0BstOVgbOv38i=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "in the last week",
            "text": "Trineade Restaurant offers an exceptional dining experience with a warm, inviting ambiance and top-notch service. The menu features innovative dishes made from fresh, locally sourced ingredients, with standouts like perfectly cooked pan-seared scallops. The staff is friendly and attentive, making each meal feel special. Dessert, such as the rich chocolate mousse, is a delightful end to the meal. Whether for a special occasion or a treat, Trineade delivers an unforgettable experience.\n\nHighly recommended for anyone seeking high-quality cuisine and a memorable atmosphere.",
            "time": 1732913701,
            "translated": false
        },
        {
            "author_name": "Karan Afshar",
            "author_url": "https://www.google.com/maps/contrib/117493517905899698839/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW7U7l2eYnCPoL_7KTqi-gue9pxfTNVU3bGQvKU5bQPLFIPqHpK=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "Trindade in Lisbon is a true gem that masterfully blends exquisite Portuguese cuisine with a stunning ambiance. From the moment you step inside, you're greeted by the beautiful and thoughtfully curated décor, which sets the perfect tone for an unforgettable dining experience. The atmosphere is both elegant and inviting, making it an ideal spot for a relaxed evening out or a special celebration.\n\nThe culinary journey began with the octopus salad and eggplant dish as starters. Both were prepared with the utmost attention to detail, offering a delightful balance of flavors. The octopus was tender and seasoned to perfection, while the eggplant dish was a delicious, creative masterpiece that left us eager for more.\n\nFor the main course, we indulged in the lamb cheek, and it was nothing short of extraordinary. The meat was incredibly tender, practically melting in your mouth, and the accompanying flavors were rich and well-balanced. It’s clear that the chefs at Trindade are passionate about their craft, using high-quality ingredients to elevate traditional Portuguese dishes to new heights.\n\nWhat truly sets Trindade apart, however, is the professionalism and kindness of the staff. The team is not only highly knowledgeable about the menu but also remarkably patient and attentive, ensuring that every guest feels welcome and well-cared-for throughout their meal. Their warm hospitality added a personal touch to the entire dining experience.\n\nTrindade is a must-visit restaurant in Lisbon for anyone who appreciates top-notch food, a beautiful setting, and exceptional service. Whether you’re a local or a visitor, dining at Trindade is an experience that will linger in your memory long after the last bite.",
            "time": 1724558819,
            "translated": false
        },
        {
            "author_name": "Diane K",
            "author_url": "https://www.google.com/maps/contrib/102048017751280392830/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJoOJDrgJuw3OU8AG6BH_ykNgyZQk4TK3BFIOthF2DTCemgDA=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 4,
            "relative_time_description": "3 months ago",
            "text": "Very friendly staff.  So nice and helpful.  We ordered a platter for 2 of fresh seafood as well as the grilled cod.  You definitely get a lot of food but more importantly staff who are patient and take the time to explain everything and answer all of your questions.  The platter had a lot of shrimp, barnacles,  and crab. If you are hungry and don't mind working for your dinner,  this should be what you order. Festive environment with a number of happy customers.",
            "time": 1725437617,
            "translated": false
        }
    ]
}