{
    "name": "Gambrinus",
    "rating": 4.4,
    "reviews": [
        {
            "author_name": "Allan Jiang",
            "author_url": "https://www.google.com/maps/contrib/103528866343936652283/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW6KEGbN8fngsEaAa6Ii8HvAZOhuc-RV3qwpw6iPNgtsBWys1M7AA=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 2,
            "relative_time_description": "a week ago",
            "text": "Unfortunately have to give this restaurant two stars.\n\nOne you first enter, you have to walk into the restaurant past the bar to get the attention of one of the staff, where you are then left awkwardly standing there waiting for someone to attend to you, regardless if you have reservations.\n\nI was looking to the traditional Portuguese food but was severely disappointed. Food was underseasoned and just did not taste good. All 3 meat and fish plates were over cooked and dry. The sauce they cover the meat in isn’t enough to save it. This was the only meal on my trip in Lisbon where the food actually disappointed my group. My mothers risotto also gave her food poisoning.\n\nThe restaurant itself is gorgeous, and is very old school and classy. Our waiter made a somewhat edgy joke which I think wouldn’t have sat well with some people.\n\nAt this price point and prestige, I expect much better food.",
            "time": 1732587397,
            "translated": false
        },
        {
            "author_name": "Carlos A.",
            "author_url": "https://www.google.com/maps/contrib/117539467175170843017/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXZ2QbildF1WazKrM1c02_GwTTbz7008NX_U3niENnUECdMVulFLQ=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "Old school classy restaurant. The venue is decorated with wood paneling and heavy chairs, and all the staff are wearing suit jackets. The menu has a lot of good food options and wine selection. We ordered the shrimp Malaguenha, which is spicy in garlic butter sauce. For main dishes, the sole with capers and the Lamb Chops Provençal. And for dessert, we ordered the apple tart  and the cold hazelnut and chocolate tart. All the food was excellent, they served it and presented it in front of the table. The service was top-notch.",
            "time": 1730298416,
            "translated": false
        },
        {
            "author_name": "Clemens Wan",
            "author_url": "https://www.google.com/maps/contrib/109331593848788039624/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUYqONv_RGJuh_A3T-95L9C9MK09MF3fU22Gu1rBsSwZokbb_g=s128-c0x00000000-cc-rp-mo-ba6",
            "rating": 5,
            "relative_time_description": "6 months ago",
            "text": "Definitely a hidden high end experience with suits and traditional paneling walls. This was probably the most expensive lunch we've had in Lisbon, but it was definitely worth it. We ordered like royalty and stayed for almost 2 hours. The whole fish seabass was cooked with garlic and olive oil. The special duck rice and roasted cod were excellent. Definitely get the seafood bisque as it's the best I've had since childhood memories - just pure delicious flavors of the ocean. Service was attentive and incredibly generous. Our food was brought out and plated in front of us. Fish was freshly fileted with perfect plates and split dishes. I would normally reserve these types of meals for special occasions, but it's a holiday and we had the whole dining space to ourselves at 2pm. The seafood looked extremely fresh and bountiful. It was around $300EUR for 6 people, but we ordered quite a bit and a bottle of wine. For full transparency, I believe there was a $15 seating fee.",
            "time": 1717290536,
            "translated": false
        },
        {
            "author_name": "Pallo Manuel",
            "author_url": "https://www.google.com/maps/contrib/107833662832658930940/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX3ZkLKK9uf7LgZ44roIg1eKAb-cng5TbR-eMsuANgn-E_SPKE=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "5 months ago",
            "text": "The first time I have experienced a table side service, where the waitrons are extremely well dressed and very polite. Their dinning theatrics are brilliant to watch. If you would like a true Portuguese, fine dinning experience, I would suggest making a booking here!",
            "time": 1720109514,
            "translated": false
        },
        {
            "author_name": "Mariuccia Pisani",
            "author_url": "https://www.google.com/maps/contrib/105125704496275309913/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUNt-g1TbR56XAwRfRcrynMdFGfZJ6UH2hyCVFpSukWNIgpCrVV=s128-c0x00000000-cc-rp-mo",
            "rating": 1,
            "relative_time_description": "3 months ago",
            "text": "Very disappointing \"fine dining experience\".\nWe ordered 4 red shrimps that were served drowning in a super garlicky oil (90 euros), the taste of the fresh shrimp was covered by the overwhelming garlicky and greasy sauce. The main dish was a sad and bland seafood rice (34 euros), with only shrimps, pieces of fish and a few clams, super tasteless, even adding salt, it felt like  boiled rice and boiled seafood...I had excellent seafood rice in other less pretentious restaurants in Lisbon (for 1/4 of the price). The fried calamari Andalusian style were served cold and had a very rubbery texture, presented with a few strips of boiled pepper, SAD looking and tasting. Dessert was a very heavy egg cake and an extremely ordinary chocolate cake that you would find in any restaurant in the world. We did not finish any of the dishes.\nThe server was unable to explain any of the dishes in English, the only thing he continued to say when we asked about a dish, was the sentence \"it's very good\", which is not an explanation but a point of view. Any fine dining restaurant should have servers able to give a simple explanation about a dish or a wine, especially since 90% of the diners where tourists that don't speak Portuguese (not a good sign anyway when looking for an authentic experience).\nThe wine was a white dry Reserva (56 euros) ,the only thing the server was able to say to us when we asked for recommendations, \"very good\" again...\nI never write reviews about restaurants especially because we are restaurateurs ourselves, but this was one of the worst fine dining experiences I had in my extensive travels around the world and the place was pretentious, very expensive and it felt like a tourist trap. To finish the server asked for a tip, which is very unpolite, and not a custom in Europe.",
            "time": 1724571403,
            "translated": false
        }
    ]
}