{
    "name": "Belcanto",
    "rating": 4.6,
    "reviews": [
        {
            "author_name": "Jenny Fisher",
            "author_url": "https://www.google.com/maps/contrib/112803348496018719743/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUlFJAK7J5mcfCpp0N85l2sVzJCOLL2mGEQ9394bL9RNIhDcPiJ=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 5,
            "relative_time_description": "a week ago",
            "text": "100% recommend the tasting menu! 250€ per person and 150€ to add the wine pairing (250€ for the premium wine pairing). Overall the entire meal and menu was incredible. We enjoyed the presentation and service immensely!",
            "time": 1732304088,
            "translated": false
        },
        {
            "author_name": "olive son",
            "author_url": "https://www.google.com/maps/contrib/108634732725402685594/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLq6N-ke4qSy1yXYgSqVfL3V3FfH4X9dcq49DxKSzW8pODbDw=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "The service is exceptionally good. Restaurant environment not so crowded and not too quite. Compare to other Starred\nRestaurant,  it has much more staffs. Felt surprised when the staff brought us to the kitchen round. The team works successfully.\nFood is quite special and up to standrad.",
            "time": 1730626551,
            "translated": false
        },
        {
            "author_name": "Erin Duffy",
            "author_url": "https://www.google.com/maps/contrib/105337066270190548962/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXtUHUiuQkCKjJKwj5YQsmra8JWm2x6thuZYf83Qkn1oSKfukAb=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 4,
            "relative_time_description": "4 months ago",
            "text": "March 9th 2024, dinner at Belcanto (in Lisbon):\nMy first time at a 2-star Michelin restaurant 🍽️ I couldn’t pass up the opportunity and thankfully 4 of my colleagues were up for the adventurous eating too!\nOne thing we didn’t think about beforehand was that we would all have to choose the same menu 😐 This was a bit of a challenge, but we agreed on the Classic Tasting Menu.\n\nThese places always come up with fun presentations of the food and mix the flavors in a surprisingly delightful way…. Usually. They even had a choreographed way of pouring two people’s water at a time and delivering all 5 dishes on to the table by 5 servers, at the exact same time.\n\nWhile this place was everything I’d expect; both my colleague and I struggled with the gold leaf covered poached egg dish (The Garden of the Goose that Laid the Golden Egg) 🤢 Both of us ended up gagging due to texture and had to put the dish aside. She only got 1 bite in, I got about 4… I so badly wanted to enjoy all of the truffle in the dish, but the texture of that slimy egg 🥚 was just not working for me 😂 They offered to bring her another dish in place of the egg since she barely touched it, which was nice of them.\n\nWe added the Scarlet prawns to our menu selection for €100 for each order, but thankfully you can order as half a serving for €50. And since you’re already eating quite a bit of food, I’d say the half order was the perfect amount.\n\nI’ll never regret trying something new, but I also don’t feel like I’m missing out if I don’t go again. It’s just expensive for food that is pushing my food boundaries and I’m not enjoying all of the textures.\n\nOh and for dessert, they give you a sleeve of a button up shirt in place of a napkin so you can wipe your mouth on the white sleeve, clever 😉",
            "time": 1721253644,
            "translated": false
        },
        {
            "author_name": "Paul van Stempvoort",
            "author_url": "https://www.google.com/maps/contrib/105559210405042507874/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVqm9S96iPyzehJx8nV1Jj2uvwblYYmixncZHN7R0dEgBpbfYQVDg=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "Very nice restaurant in Lisboa, nice touch with the cards on the table to explain the dishes. You will even get a tour through the kitchen to see where all the hard work is put into these dishes. Had a good time here for lunch!",
            "time": 1728119942,
            "translated": false
        },
        {
            "author_name": "Cheri Liu",
            "author_url": "https://www.google.com/maps/contrib/109985622177446473314/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUk13WCvhjVFBGzClIYV5Y_xsKciKIM_DfXQj0Tbz14BLtZVeIX=s128-c0x00000000-cc-rp-mo",
            "rating": 1,
            "relative_time_description": "2 months ago",
            "text": "I visited Belcanto with high expectations given its Michelin star. The food was good, well-prepared, and flavorful, though it didn't stand out as exceptional.\n\nWhat affected the experience, however, was the service towards the end of the meal. When my group asked to split the bill by item, it was met with noticeable impatience, and the overall interaction felt rushed and impersonal.\n\nUnfortunately, this took away from what could have been a more enjoyable dining experience.\n\nFor a restaurant of this caliber, I expected more attentiveness and professionalism in service.",
            "time": 1726092858,
            "translated": false
        }
    ]
}