{
    "name": "Hard Rock Cafe Lisboa",
    "rating": 4.4,
    "reviews": [
        {
            "author_name": "K. Peake",
            "author_url": "https://www.google.com/maps/contrib/100944530734954133589/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVMyslQw-3-a2pTwQyl4E3b3BG4YLH46XKa7OzwPAQ8V4l7Ehx7=s128-c0x00000000-cc-rp-mo-ba7",
            "rating": 5,
            "relative_time_description": "3 weeks ago",
            "text": "This was a brilliant restaurant for dinner, with a quirky theme across the interior! The convertible upside down on the ceiling is a main aspect of this and so are the fancy colours, guitars laid around are a nice touch too. These are accompanied by information relating to their bands and menus are readily available, seating is comfortable too across two floors. Me and my friend had a Nacho's sharing plate bursting with flavours and the staff were so accommodating, placing the jalapenos in a tub at the side when I wanted them but my friend did not!",
            "time": 1731276275,
            "translated": false
        },
        {
            "author_name": "Lovraj Lachhiramani",
            "author_url": "https://www.google.com/maps/contrib/114837240261509879654/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLK1GDr8IBBr80ZQf1xazKvPGnZGyvUpOqjeiyLgv1_d1YBIQ=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "in the last week",
            "text": "We’ve been to Hard Rock Cafes around the world—Paris (twice), Dubai (4–5 times), Brussels (once), and Lisbon (2–3 times)—and every single visit has been exceptional. The atmosphere, food, drinks, and service never fail to impress!\n\nIn November 2024, we visited again, and it was superb as always. This time, we ordered the Messi Chicken Burger, Mac and Cheese, and Mashed Potatoes, and every dish was excellent. The ambiance was amazing, staying true to the signature Hard Rock vibe.\n\nA special shoutout to our server, Mr. Odair, who was outstanding—friendly, attentive, and professional. The service was brilliant, just as we’ve come to expect from Hard Rock Cafe.\n\nCan’t wait for our next visit to this iconic spot elsewhere in the world!",
            "time": 1733068690,
            "translated": false
        },
        {
            "author_name": "Varto Basmajian",
            "author_url": "https://www.google.com/maps/contrib/113913616621158946809/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWpytUd6Up2TeVOLeHpvvtPNTG5JlMNl3iDuNxtLCTI6iBvmbAm=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 4,
            "relative_time_description": "in the last week",
            "text": "The classic American restaurant located in the heart of Lisbon, in the historic Teatro da Rua dos Condes building. Originally opened as a theater in 1738, it was rebuilt in 1755 following the Lisbon Earthquake, later demolished, and reconstructed in 1888. By the turn of the century, it was converted into a cinema before eventually becoming the Hard Rock Cafe. The restaurant boasts a vibrant American atmosphere, similar to Hard Rock Cafes around the world, complete with iconic memorabilia, and features live music on most evenings. You can also shop for souvenirs in the merchandise shop at the entrance of the restaurant.",
            "time": 1733056379,
            "translated": false
        },
        {
            "author_name": "robert barnsley",
            "author_url": "https://www.google.com/maps/contrib/102485265197981053081/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWt6bAj9pfmh3eclWuyMsMg6diVclMg407bYOmJ2r3J9jVfoniF=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "3 weeks ago",
            "text": "Staff were brilliant and the decor was great, as was the atmosphere. However the food was not exceptional, it was good and presented well but it isn’t a Michelin star restaurant, you are going for the experience.",
            "time": 1731358559,
            "translated": false
        },
        {
            "author_name": "Ovidiu Popescu",
            "author_url": "https://www.google.com/maps/contrib/104529394935942703140/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVxxr1ccpuByKwidJ_BtetAeI_0CL8vtyjDxqUmMhOFHA22dXhS=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "4 months ago",
            "text": "I recently had the pleasure of dining at the Hard Rock Cafe in Lisbon, and it was an exceptional experience. The ambiance perfectly captures the vibrant spirit of the city, blending local charm with the iconic rock 'n' roll vibe.\n\nThe highlight of the meal was undoubtedly the food. The burger was cooked to perfection, juicy and flavorful, complemented by a fresh, crisp bun and all the classic toppings. Equally impressive were the chicken wings, which had just the right amount of spice and were wonderfully tender.\n\nThe staff were friendly and attentive, ensuring that every aspect of our visit was enjoyable. Whether you're a local or a tourist, the Hard Rock Cafe in Lisbon is a fantastic spot to enjoy great food and a lively atmosphere. Highly recommended!",
            "time": 1722808056,
            "translated": false
        }
    ]
}