{
    "name": "Austria Trend Hotel Ljubljana",
    "rating": 4.5,
    "reviews": [
        {
            "author_name": "rohit singh",
            "author_url": "https://www.google.com/maps/contrib/111565065209112250355/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUiS5Z3XcYbLy61WymqXo87zNyKwZkLRyt7z2-VYgoKG2TpiClN=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 4,
            "relative_time_description": "3 months ago",
            "text": "Stayed here for 5 nights on vacation trip to Ljubljana. I have chosen the chain because of past good experience.\nFirst of all, the rooms are spacious, clean and well groomed. The room is well furnished and have everything you need. Plus, the room has nice Mountain View. So chose family room.\nThe buffet morning breakfast was good with plenty of options but there was no hot kitchen.\nThe location of the hotel was the only problem point I found, though there is a bus stop just at the exit of the hotel to city and intercity bus station.\nOverall the stay was a  positive experience for my family.",
            "time": 1725566707,
            "translated": false
        },
        {
            "author_name": "Xandre Mo",
            "author_url": "https://www.google.com/maps/contrib/113089719028840252100/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJGhlqOhQnhg1sZHoYCoaer4hFWwhh_vW-xVJFIN2xsCqErP80=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 3,
            "relative_time_description": "3 months ago",
            "text": "I recently stayed at the Austria Trend Hotel in Ljubljana and had a mixed experience. The rooms are quite spacious, well-decorated, and equipped with everything one might need for a comfortable stay. The breakfast was good, offering a nice selection of options to start the day. The staff in restaurant is very helpful.\n\nHowever, I was disappointed with the cleanliness of the room. The bed linens were not changed for two days, and the floor was not cleaned properly. The staff at the reception is unfriendly, which affected the overall experience.\n\nAdditionally, the extra costs for services were quite high. Parking is €30 per day, and access to the gym is €8 per person per day—services that are typically free in most hotels. The hotel’s location is convenient, being close to the highway, but there are no affordable or free parking options nearby.\n\nIf you're staying for just one or two nights, this hotel can be a decent choice. However, for longer stays, the additional costs and service issues might become frustrating.",
            "time": 1723445445,
            "translated": false
        },
        {
            "author_name": "Maja Kavgic",
            "author_url": "https://www.google.com/maps/contrib/102340448905688855695/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLKYt6UU27muNq_U9VZkb0gpZHIq3LU-NnRJlfdW_hIR_YKrQ=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "Absolutely friendly, professional and helping workers. Kids friendly hotel. Breakfast super. Rooms top! Clean, beautiful. It is little away from center but you are here in 7min. Absolutely satisfied with everything :)",
            "time": 1730535238,
            "translated": false
        },
        {
            "author_name": "Liam Avalon",
            "author_url": "https://www.google.com/maps/contrib/107925522926045255767/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUiE1ZDu9pJrPShfwqLI1Zr8RLirjHODPwMPMzXIQ4jl1IVyw8U=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 4,
            "relative_time_description": "4 months ago",
            "text": "The rooms were spacious and service by staff (especially during breakfast) is excellent. The shower doors however, need some work - you can take a quick shower and have all the water on your floor.\n\nAlso, a bit of false advertisement. The advertising for the place makes it look like the amenities (like the gym)are included. Unfortunately, to use the gym is 8 euros per visit. Overpriced.",
            "time": 1723042688,
            "translated": false
        },
        {
            "author_name": "lera arti",
            "author_url": "https://www.google.com/maps/contrib/111530832645915840809/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVX8vq_ftoOKZ_UgwSAtQxMAsvzyTXn6X2bJRqpFW7ONPJ42JFO=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "The hotel Is beautiful, and the staff always ready to help with everything.\nAs someone who enjoys exploring while walking the hotel is a bit far from the city center but if you own a car or go by taxi its no problem)))",
            "time": 1728639672,
            "translated": false
        }
    ]
}