{
    "name": "Ljubljana Resort Hotel & Camp",
    "rating": 3.5,
    "reviews": [
        {
            "author_name": "Valentína Vancáková",
            "author_url": "https://www.google.com/maps/contrib/100757448662045702778/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVfE3Wg2Z72oUtjz8yr4E1ZWTVXJv3EKU3fqvpYqZvHu80qEBNH=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "4 months ago",
            "text": "After reading the reviews we were pleasantly surprised by how nice this camping was! The bathrooms are renovated and look great, with plenty of showers and toilets. You can choose and reserve your spot online, which is convenient. The prices are a bit higher, but it is a capital city after all. There is a bus stop directly to the city centre and an excellent bakery nearby. We definitely recommend.",
            "time": 1721717232,
            "translated": false
        },
        {
            "author_name": "S. W.",
            "author_url": "https://www.google.com/maps/contrib/103063757700228156040/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLbOEP-7RP8ktrkUYFkOzbLIVDScEpufkoaaxoy1NxO6sA1MQ=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 4,
            "relative_time_description": "2 months ago",
            "text": "We had a mixed experience during our stay at this campsite. On the positive side, the receptionist was very friendly and welcoming. The camper spots are on gravel, but the rest of the pitch is grassy, which was a nice touch. The facilities are also very clean and well-maintained, with modern and new sanitary blocks.\n\nHowever, there were several downsides to our stay. The campsite is quite noisy, especially early in the morning. Tour buses started arriving as early as 7 AM, and they left their engines running while passengers disembarked with rolling suitcases, creating a lot of noise. Additionally, there was a wedding event in the restaurant area that went on until 5 AM, which made it difficult to get any sleep.\n\nAnother issue we encountered was the limited number of men's toilets—only five were available. This often led to waiting in line, which was inconvenient.\n\nOverall, while the campsite is well-kept with good amenities, the noise and lack of sufficient facilities are something to consider before booking.",
            "time": 1725967847,
            "translated": false
        },
        {
            "author_name": "Rosalind Hill",
            "author_url": "https://www.google.com/maps/contrib/103271493739027341282/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIZPO9lfXvhXyi_X7u0uD7jLebsV5kFGPoEWhoHdoFhg95Bcw=s128-c0x00000000-cc-rp-mo",
            "rating": 4,
            "relative_time_description": "2 months ago",
            "text": "We were pleasantly surprised after reading the reviews! Pitches were nice and big, reception were super nice and helpful, bathrooms were clean, water hot, good WiFi, really great playground right by the dish washing area so perfect for families! Only issue was the bins being very full. Didn’t get the bus into town so can’t comment on that.",
            "time": 1726677874,
            "translated": false
        },
        {
            "author_name": "Amber de Jongh",
            "author_url": "https://www.google.com/maps/contrib/112544208600670303358/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWmOj0UvvboGslBDhCNp-141dwk_oBrBjfNy6L3W0cvcEOUviXPxg=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 3,
            "relative_time_description": "3 months ago",
            "text": "We are here in August. It's not a bad camping. We just have a bad spot I think.\n\n+ There are a lot of showers, sinks and toilets. I would not call them really clean but they are not dirty, so it's good.\n- There are so many wasps. We can't sit outside without a wasp joining us\n- There is no shade in our place. And in this heat wave we have to flee our van pretty early. Because it gets so hot\n- There are a LOT of children (I'm sure for some people that's a good thing, but not for is)\n+ If you stay a few days you get free entrance to the pool for 1 day\n- Turns out we are not \"laying by the pool\" people 😂 but everything was closed and it was a heat wave so what can you do. It took a long time to score some chairs. Once we got them we were fine laying in the shade of the trees with our books. But still lot a screaming children (they are happy screams as well as crying screams)\n- the pool is €18 to get in. €9 if you are camping. I think that's way to expensive. You can't just go in to cool down and than back to the campside (well, you can but you still pay 9 euros)\n- we wanted to eat at the restaurant but outside there were SO MANY WASPS. So we asked if we could eat inside. That was possible. And then I guess they forgot us. We left after 20 minutes, just went to the bakery (4 min walk from the campside) which was AMAZING and cheap!\n+ There is a bus to the city center and it's €1,30 . That's amazing\n- We had to pay \"night price\" at the taxi back and we had a feeling he did not drive straight to the camping. Don't hail a taxi like us. Use the number they give you at the reception\n\nWe decided to leave a day early, but that has more to do with the heatwave. But if the pool would have been free or there would have been a river we would have stayed the 3 days we planned to.",
            "time": 1723878099,
            "translated": false
        },
        {
            "author_name": "Marcel Prokop",
            "author_url": "https://www.google.com/maps/contrib/106891412547176622351/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIOoq6VmKqsLEuJDCYqds1sGUJiYnmQlMl5wzt4PfgW1HGGVA=s128-c0x00000000-cc-rp-mo",
            "rating": 1,
            "relative_time_description": "3 months ago",
            "text": "We spent the weekend in Camp. The location and also the pitch were great. The toilets are new and nice. From this perspective the camp is fine and recommended.\nBut the overall experience was not good because when we did the booking the confirmation of our reservation was not completed but the payment was deducted from our bank account. For whole 3 days (including Friday) we were not able to speak anyone from management and the receptionists didn't see the payment in their system and also didn't have access to bank account to check the transfer.\nWe urge them to be contacted by the supervisor or manager, but nobody contacted us even when we were several times promised that it will be handled by manager by end of day.\nAfter our departure from camp we still didn't get the response from the manager and calls were not answered. That's a very very bad customer support and this ruined the whole experience.",
            "time": 1724769043,
            "translated": false
        }
    ]
}