{
    "name": "Vander Urbani Resort",
    "rating": 4.1,
    "reviews": [
        {
            "author_name": "Melanie Avila",
            "author_url": "https://www.google.com/maps/contrib/103035782518940312185/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVcZt4-yGUtVt3QaoaT7VYZDWrf48b3WKXkpczPDvAXpSh-NySd=s128-c0x00000000-cc-rp-mo",
            "rating": 2,
            "relative_time_description": "a month ago",
            "text": "The one thing this hotel has going for it is the location. It is on the main stretch where all the restaurants are. However, the room and common areas are not so great. In our room there were stains all over the floors and sheets. Our sink in the bathroom kept getting backed up and there was only one towel hook. The AC in the room also never got cold. I would only stay in this hotel with a significant other as the bathroom is very intimate. There is only a curtain separating the bed from the toilet. The staff also wasn’t very welcoming and got upset when we asked for our breakfast to go. I would not stay here again.",
            "time": 1730543242,
            "translated": false
        },
        {
            "author_name": "Niall Swanwick",
            "author_url": "https://www.google.com/maps/contrib/104798653835851790666/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIzIRE3QsPIGM8UMxZSmZ7Bcxbu58hR2fwezJB9pPvf754pUQ=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "5 months ago",
            "text": "Stayed here twice in two different rooms. Really enjoyed both. Riverside room was spacious and comfortable. Zen room was compact but well equipped. The only problem was the poor position of the light switch on the headboard. Service great, staff remembered us. Location excellent - right in center of old town.",
            "time": 1718449375,
            "translated": false
        },
        {
            "author_name": "Ben Davis",
            "author_url": "https://www.google.com/maps/contrib/118020568444690527818/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVyVPNdpAGh2FYPKR6a6eXse5ZKy2GJU-QZq8ifGi2ak_-zanIy=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "We stayed for two nights at the end of the summer. The (included) breakfast was lovely, the room fab, the roof pool wonderful and service excellent. Alun on reception was particularly helpful and extremely patient with our endless questions.\nHighly recommended and excellent value.",
            "time": 1725027766,
            "translated": false
        },
        {
            "author_name": "Milind Karkare",
            "author_url": "https://www.google.com/maps/contrib/100014624912937363745/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVbzOu5hb5XpQZzz9Q4oN81PUPv052KpUoXp6pYLK_1qtyitfpT=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 3,
            "relative_time_description": "5 months ago",
            "text": "This hotel is near the river and one of the few in the old town. The building is old and the decor is weird and outdated.\n\nThere must be some nicer rooms but our rooms faced close by building walls. The rooms were dungeon like with weird textured walls and a fabric padded wall behind the bed. There was not a single hook to be found to hang your towel anywhere in the room or the bathroom. The bathroom door was clear so the people from the hall could see you on if you opened the door.  The room was full of mirrors in weird places and on cabinets.  The furniture was stained and tired looking. The TV guide was not available and showed wrong time (even though many channels including English channels were available).\n\nThe bathroom was also a weird setup. The shower door does not close properly so lots of water on the floor after a shower.\n\nWe booked through booking.com so maybe got a lower quality room.\n\nThe rest of the hotel decorations were also “designer” type but very old looking and weird.\n\nPluses- easy walking to most attractions; great location; many good restaurants nearby; decent breakfast (a la carte even if it’s included in your package).  The rooftop pool was nice with great views but pretty small with a capacity of 8-10 people max in the pool area— maybe enough for this boutique hotel. You did have pigeons visiting the edge of the pool- although the hotel had installed wires to deter the pigeons, the pigeons clearly did not get the memo.\n\nDid not get to eat at their restaurant - understood that it used to be Michelin…\n\nCan’t recommend for the price. The town is small enough that any hotel is not that far from attractions.",
            "time": 1719837393,
            "translated": false
        },
        {
            "author_name": "steven swinfield",
            "author_url": "https://www.google.com/maps/contrib/109627732744292095878/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIxdvc0ARYFQcCzKjGV8_pCEwaOTBJcqlZsqmAePbFBu59r9w=s128-c0x00000000-cc-rp-mo",
            "rating": 3,
            "relative_time_description": "5 months ago",
            "text": "The room has a nice bathroom but the remainder of the room was a bit tacky. This is the only hotel that I have ever stayed in where I have had to ask for a set of hand towels. They forgot to service our room 1 day. Reception and restaurant staff were quite good. To sum up I would not stay here again if visiting Ljubljana.",
            "time": 1719061782,
            "translated": false
        }
    ]
}