{
    "name": "Gostilna Sokol",
    "rating": 4.1,
    "reviews": [
        {
            "author_name": "Kris T",
            "author_url": "https://www.google.com/maps/contrib/115057586078553661948/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX3_tCK-Xbxvwi7N_hWz2mAcoaAIkny1d9vDhcl74Bug6Fn0VpSJA=s128-c0x00000000-cc-rp-mo-ba7",
            "rating": 5,
            "relative_time_description": "a week ago",
            "text": "It's a bit touristic, but it's also very original, and the food was great. Service was fast and polite. There are several tables on two floors, and there are many local dishes and drinks that you can enjoy. Prices were also okay. The goulash was great.",
            "time": 1732605247,
            "translated": false
        },
        {
            "author_name": "Aleksey A.",
            "author_url": "https://www.google.com/maps/contrib/108583543975144684508/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU0bgeXxToP6TIcEV2ikTjmtKbQiSs8P0jn9KPHgEt01GdAUus=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "2 weeks ago",
            "text": "Dining at this Slovenian restaurant was an unforgettable experience! The mushroom soup served in a bread bowl was a true delight — comforting, flavorful, and presented in such a unique way. It felt like a little piece of culinary magic.\n\nAnd the apple strudel? Simply perfection. It was more than just dessert; it was a moment to savor and remember. Without exaggeration, it’s the best I’ve ever had in my life.\n\nThe atmosphere was warm and welcoming, and the service impeccable. This is a place where every detail feels thoughtfully crafted to create an extraordinary dining experience. Highly recommend!",
            "time": 1731792637,
            "translated": false
        },
        {
            "author_name": "Mey Bodniza",
            "author_url": "https://www.google.com/maps/contrib/100869708053368595960/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL80mSbewQJAgqAFg7A-kJR6TzfqqjAw2NlSBOLUbSm7Y3Sqg=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 3,
            "relative_time_description": "in the last week",
            "text": "We stumbled upon this place because it’s traditional food from the city. The place is nicely decorated and the food looked good in the pictures but is alright. For us was a bit pricey for the quality that you get. In addition, we felt the service is also ok.. not the best. We were expecting the waiters to be more friendly and attentive. So take into consideration that It may take some time to process your order.",
            "time": 1732833914,
            "translated": false
        },
        {
            "author_name": "linda kamchevski",
            "author_url": "https://www.google.com/maps/contrib/111964604330632707291/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX4GMu7V8hGL2suOXcQw1sYtVZSX5R8xlJph8xNhqkSbWEJsoI=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "Wow this food was so lovely u didn’t want it to end!  Luckily we went in early around 630 to 7pm on a Friday night as it seems to be a very popular restaurant. When we were leaving there was a line up of people  outside the door waiting for a table.  Our waiter was fantastic, he was so busy but didn’t miss a beat.  He was super efficient and also friendly considering how busy the place ended up being.  I would definitely recommend having a meal here it was delicious. We are vegetarian and lots of options available.  Heaps of traditional food which is always good when on holiday abroad.",
            "time": 1728066207,
            "translated": false
        },
        {
            "author_name": "C Rod",
            "author_url": "https://www.google.com/maps/contrib/101535987560928874394/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIcDiOb2qRPfoBJ_RS9Bee5FB582oPNM_gHFY9YuWdDR5WAmA=s128-c0x00000000-cc-rp-mo-ba6",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "The place was crawling with people! We checked before coming back and was told, we don't need to make a reservation. We waited about 10 minutes, not very long. We sat outside and it was nice, even with the hustle and bustle, it was just nice to have a meal outside! We put our order in and it was about 10-12 minutes, then our food arrived. Everything was hot and hearty. I haven't had potatoes in a long time and it was so good with the pork loin. The service was great and I definitely ate too much! I will recommend this place, if you're coming to Ljubljana!",
            "time": 1725306009,
            "translated": false
        }
    ]
}