{
    "name": "Hotel Slamič Ljubljana",
    "rating": 4.5,
    "reviews": [
        {
            "author_name": "Lina Vizelman",
            "author_url": "https://www.google.com/maps/contrib/112766632485337217734/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWELP67R-quhKuuLaW-kvOWjFJxlYwwq2NJmo5vjJZ4F88Py7k-=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 3,
            "relative_time_description": "a month ago",
            "text": "I liked the owner who greeted me at the hotel. Unfortunately other stuff seemed to be quite arrogant giving me remarks about my usage of toilet paper or kicking us out of a conference room not in a polite way and than scolding us for continued talking outside of the room cause we might bother someone.\nThe breakfast is quite poor and the system of picking what you’ll have to breakfast up i  front, instead of choosing when you see it, in a buffet form, doesn’t work very well, as it´s hard to know what will be tasty and how much of what are you getting.\nThe coffee is horrible. The vegetables are cooked fine but the fish and meat are heavily over-salted. For a team dinner, although asked to have gluten free options, they bring 3 dishes with gluten and suggested i can eat baked potatoes (that were served in the same dish with chicken nuggets). They tried to fixed the mistake, but the meat the brought was barely edible because of the amount of salt.\nThe mattress and the room overall was fine. The pillows not good.\nAlso on the doors of that hotel, is written 3 stars, not 4, like in google maps. It has a great potential, i liked the building and the location, but some things need to be improved.",
            "time": 1729376675,
            "translated": false
        },
        {
            "author_name": "Jose Camacho",
            "author_url": "https://www.google.com/maps/contrib/100419334542946257091/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWXlvUVgzUd3hcfNTVvt6KDGLlXJUVmncEWP0B2QgrGOsI42EE6=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 4,
            "relative_time_description": "2 months ago",
            "text": "The location is very close to the bus station which is convenient for travelers. The city center is also about a 5-8 minute walk. The hotel staff was very nice, helpful and engaging. The room was big,clean and with all the amenities needed. Coffee maker or hot water jug, and a couple instant coffee would have added an extra touch to the room, but not really a deal breaker. It was looking into the inner courtyard of the hotel with a comfortable bed, hallways were clean. The breakfast works by writing down what you want to eat from the selections given. I thought at first this would be bad but I was very surprised by the fresh and prepared on the spot meal I got! Coffee and juice was also provided.",
            "time": 1726496770,
            "translated": false
        },
        {
            "author_name": "Arlei Wermuth",
            "author_url": "https://www.google.com/maps/contrib/104783870242953608655/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVanJTEVikgnkRrCSlk9xRFZcIcY01MJA0HmeTM58KZTUhCip5m1g=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "Relentless good hotel. We were really surprised by this hotel. The room was huge, clean and cozy. Super friendly service from all the hotel staff. Delicious breakfast and perfect location. I can only say 'stay at this hotel and you won't regret it'.",
            "time": 1723733356,
            "translated": false
        },
        {
            "author_name": "Marko Buljevac",
            "author_url": "https://www.google.com/maps/contrib/105891790937605829957/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWBADGbWQ5R2Rs77WTKHyqXMho5jq1qo4tSdFu9oqDKrvQrvbqX=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "Just perfect! Very clean, perfect healthy breakfast, rooms are perfect. Employees are very polite. Every time I visit Ljubljana I stay in Slamič.",
            "time": 1728376393,
            "translated": false
        },
        {
            "author_name": "J 123",
            "author_url": "https://www.google.com/maps/contrib/117028410259752198761/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIeICAnZB0X2Tt2m7A8FM8X8UgMpSRaRhgthb4_DxMlLpA4hw=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 3,
            "relative_time_description": "2 months ago",
            "text": "If you will arrive at 7pm after 8 hours of travel with a 4 month old baby and a dog, hungry and exhausted, with plans to spend a short evening in Ljubljana, and after 20 minutes of waiting you will get a information  that the hotel is overbooked (you have ua confirmed reservation), you will probably give 1 too. This ruined our stay in Ljubljana. The guy from your staff gave us 30 euros for a difference of price, and sent us to a big, ugly hotel - it was not what we wanted to call a great stopover in Ljubljana (we booked your family hotel for some reasons). We had to look for a place to stay and it took another 2 hours. I hope you understand. I changed my opinion for 3, not to hurt you as much as you hurt us yesterday, I hope one day we will be able to come to your hotel under better circumstances.",
            "time": 1726134645,
            "translated": false
        }
    ]
}