{
    "name": "Best Western Premier Hotel Slon",
    "rating": 4.4,
    "reviews": [
        {
            "author_name": "la clea",
            "author_url": "https://www.google.com/maps/contrib/102652222009852561896/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXBYT8LcHRiZTGi9KE-B7hq0UpkliQ7i5T6w1V3S1HO_GgXlkts=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "a week ago",
            "text": "This is a great hotel for a stay. The staff is friendly and very professional.  The bar is a great place to hang out and have a drink. The bar staff are point This hotel is a perfect location. My room was an upgrade with the city view. Spend a few extra dollars for the comfort and upgraded amenities with your room stay.",
            "time": 1732648419,
            "translated": false
        },
        {
            "author_name": "Lana",
            "author_url": "https://www.google.com/maps/contrib/113623428209406017364/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKRHSawpTzPFgc1QGL5aw_CHvBwUalubNR5-UyVSdAj-vN0BPIa=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "The hotel is old, so rooms are in need of some renovation. Despite the fact that the rooms are old, everything was very clean and neat. The beds were quite new and extremely comfortable. Maybe even some of the most comfortable beds I have ever seen in the hotel. Also, the bed linen and bedding were very good quality. I was impressed by it.\nMy favourite part of staying in this hotel was definitely the service. The staff were kind, efficient, and attentive. When I mentioned that I am checking out early, they offered to pack my breakfast, and when I had an issue with the room they exchanged it right away to accommodate my needs (I have asthma, and they first assigned me the room with freshly cleaned curtains which had a scent).\n\nI have previously stayed in the two \"new\" hotels nearby, and I now prefer Hotel Slon as the service here is much better.",
            "time": 1730046969,
            "translated": false
        },
        {
            "author_name": "Tim Fowler",
            "author_url": "https://www.google.com/maps/contrib/101650871751394281042/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJs4rOiMXNPYfyEmoCLixxAMIjjez28LEtmZCnMwhkkttLxpfXB=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "They say first impressions count and the Best Western Premier Hotel Slon looks great. Lots of outside seating for the bar / cafe area and loads of greenery which is always nice to see. Attentive door staff, super helpful and polite reception staff, in fact every single member of staff we encountered was very nice.\n\nThe hotel is spotlessly clean and smells amazing. The rooms are well equipped and clean, comfortable beds and pillows, loads of quality bathroom products and towels.\n\nThe shower was a little underwhelming, due to angle vs space vs shower screen.\n\nBreakfast was impressive and had a huge range of hot and cold food. The only gripe would be the speed of restocking hot food but the turnover of guests was huge so appreciate making 50 fried eggs at a time isn't easy. The quiche slices were particularly delicious. We were skeptical about the coffee machines but they were surprisingly good for straight up black coffee. Only improvement would be the addition of a toaster.\n\nThe inside and outside bar is perfect for a mid morning coffee and evening beer or cocktail, in fact we had a Margarita that was so smooth and delicious it's going into the Top 10 Margaritas of all time list, and we've sampled quite a few. The biggest down side is the bar closes at 10pm.\n\nLocation wise this hotel is prefect, you are literally a 5 minute walk to the old town. There's a handy SPAR a 2 minute walk round the corner and a 24hr pizza and kebab place over the road which we didn't sample but it would put most of the better places like this in the UK to shame.\n\nOverall you'd struggle to find a hotel this good so close to all the places you'd want to spend time in on your visit to Ljubljana.",
            "time": 1724799293,
            "translated": false
        },
        {
            "author_name": "Asa Higgs",
            "author_url": "https://www.google.com/maps/contrib/115868834283844928608/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX_0X9ELEBxjre1MGJqijHgR-ohXPWafbaUeC3YQyjEi1X1WhTP=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 4,
            "relative_time_description": "a month ago",
            "text": "Very friendly staff upon checking in. Narrow lifts/elevators but stairs also available. The room was spacious and the bed comfortable, with a view straight out into Ljubljana city centre through a large fully-opening window.\n\nThe room had storage, a coffee machine and a small fridge, however the water in the shower quickly went cold and wasn't especially strong pressure.\n\nBefore check-out we had a fantastic buffet breakfast, with options for hot cooked food, cold continental meats, cheese and bread, as well as croissants, cakes, cereal, yoghurt etc. The breakfast room was very busy but delicious.\n\nOverall a great stay.",
            "time": 1730085490,
            "translated": false
        },
        {
            "author_name": "Craig Simons",
            "author_url": "https://www.google.com/maps/contrib/104561759033604562076/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUbqKvWkyuqD1-pUfAfpoKmlg1uOsHyrfp0AOjlClrx9HdKeS762A=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 4,
            "relative_time_description": "a month ago",
            "text": "A supremely comfortable bed, luxurious bedding and large premium room. Bathroom well equipped. Comfortable sofa. Good breakfast with quality products. Plenty choice. In the very heart of the city centre. Downsides were having nonfunctional air conditioning making the room a toasty 25C+. Could open the windows but noise from the workmen would disturb early in the morning.",
            "time": 1730072021,
            "translated": false
        }
    ]
}