{
    "name": "The Royal Horseguards Hotel & One Whitehall Place, London",
    "rating": 4.4,
    "reviews": [
        {
            "author_name": "Peter Leach",
            "author_url": "https://www.google.com/maps/contrib/106168508069180092510/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIf_NJkVRBD_5exIiXE2DPuWxn8Rgty86IaZfP6VmAdlOGzoA=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "2 weeks ago",
            "text": "We would thoroughly recommend this outstanding hotel. Cleanliness, presentation, atmosphere, attitude, customer service were all extremely high. We stayed four nights and nothing was too much trouble. Friendly greetings and chats with the door staff from the very first moment we arrived. An extra special mention and big thank you to Pervez who was exceptional with how he helped us everyday with happy banter about the weather, local attractions and much more. He also went above and beyond as we were checking out to organize a car to the airport at very short notice.  Thank you !",
            "time": 1732077471,
            "translated": false
        },
        {
            "author_name": "Amy Janson",
            "author_url": "https://www.google.com/maps/contrib/105821444395171563550/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWObqbyxE7KnsEZ_6zHm65T-AJCB2w41OJuaXqx67eJMbxdY1Qy=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "This was by far the best hotel experience I’ve ever had! All of the staff went above and beyond to take care of us. The building architecture is absolutely stunning, and the grounds out front are absolutely beautiful! The location is perfect right across the street from the Thames, and an underground station right around the corner. Everything is so accessible, I loved it here so much! Anytime I come back to London I will definitely be staying here and recommending this hotel to everyone I know!",
            "time": 1730137127,
            "translated": false
        },
        {
            "author_name": "Izi",
            "author_url": "https://www.google.com/maps/contrib/110975063832475604781/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVaxJY1s0QlJBqmPxsSpg5v98eHWQt6RloZxGr8xvKl-7mxo2A=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "3 weeks ago",
            "text": "I recently stayed at the Royal Horseguards in London, and I’m absolutely delighted with the experience. The hotel’s location is perfect for exploring central London, close to major landmarks and public transport. A special thanks to Jeny at reception, who went above and beyond to make our stay memorable(we will never forget about you❤️🇧🇬) She kindly provided the best rooms for us and greeted us with such warmth and friendliness that we felt right at home.The rooms were spacious, comfortable, and beautifully decorated, adding a touch of luxury to the trip. The facilities, including the restaurant, exceeded my expectations. Overall, I couldn’t be happier with my stay at the hotel and would highly recommend it to anyone visiting London!",
            "time": 1731366818,
            "translated": false
        },
        {
            "author_name": "S L",
            "author_url": "https://www.google.com/maps/contrib/109091838131594443522/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocISCx-74ptW8UncbzmOHSBYM7yp2k3XXd0ezYfQDWuKv8tx3ukG=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "Upon arrival, we were greeted and seated within 5 minutes. Beetroot salmon was incredible, steak was divine, and dessert was delicious. The service was outstanding, and our wine glasses were refilled before they ran empty. Because it was both my sister's and my birthdays, we were greeted with the cutest birthday slice and a greeting from the staff. 5 stars for service and food all around; can't wait for the next visit.",
            "time": 1730759134,
            "translated": false
        },
        {
            "author_name": "Marie LMU",
            "author_url": "https://www.google.com/maps/contrib/108039230703771708026/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLr8qQFG4STKRngMg5DdPQa-XeiWlUGDO_bcxDKgs3Av-OgSA=s128-c0x00000000-cc-rp-mo",
            "rating": 4,
            "relative_time_description": "4 weeks ago",
            "text": "Excellent location, very quiet too. The room (deluxe double) was large. The bed sheets for our daughter were dirty though. We had to call reception and have them changed. Breakfast was very good. I would have liked the toasts be organised in a different way as we did not like standing and waiting in a queue as if in a gas station! The staff was very nice and helpful in many ways.",
            "time": 1730891862,
            "translated": false
        }
    ]
}