{
    "name": "Covent Garden Hotel",
    "rating": 4.6,
    "reviews": [
        {
            "author_name": "Mohamad Alsuwaidi",
            "author_url": "https://www.google.com/maps/contrib/100303548202153228734/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK8KWC_NnvBkYoL7a18BiA32_V9pcI2azIibCEEbLgjvesEXw=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "I recently had the pleasure of staying at the Covent Garden Hotel, and I must say, it was an exceptional experience from start to finish. The moment I walked through the doors, I was greeted with warm hospitality and a stunning interior that perfectly blends classic elegance with modern comfort.\n\nThe rooms are beautifully appointed, featuring luxurious furnishings and thoughtful amenities that made my stay incredibly relaxing. I particularly enjoyed the spacious layout and the plush bedding, which provided a perfect night’s sleep after a day of exploring the vibrant surroundings.\n\nThe hotel's location is unbeatable; nestled in the heart of Covent Garden, it offers easy access to a variety of shops, restaurants, and cultural attractions. The atmosphere in the area is lively yet inviting, making it the perfect base for both relaxation and adventure.\n\nA special thank you to Haifiiza for the incredible service and attention to detail during my stay. Your warm demeanor and willingness to go the extra mile truly enhanced my experience at the Covent Garden Hotel. I look forward to returning soon!",
            "time": 1729946450,
            "translated": false
        },
        {
            "author_name": "Girl in the green scalf",
            "author_url": "https://www.google.com/maps/contrib/107324093461788548106/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKkXoQjotOgQwBDKl3cks0Mfu3KoOmATGZO4cFqlGDAQzNjeg=s128-c0x00000000-cc-rp-mo",
            "rating": 4,
            "relative_time_description": "2 weeks ago",
            "text": "Always wonderful to be back here, sitting at the bar And people watching is my favourite, the room are lovely but very compact, but the private lounge and bar upstairs for guests is wonderful especially with its fire place in the winter. Outside it’s always busy with great shops and of course you’re right on the action. You’ll alway spot a celeb eating here. The cinema is also wonderful if you get the chance to visit.\n\nIt’s still remains in my top 5 hotels",
            "time": 1731702123,
            "translated": false
        },
        {
            "author_name": "Coconut Sands",
            "author_url": "https://www.google.com/maps/contrib/116266080733585014865/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJwzfx6_vn9SkD8-lDXmY5tCfmP3n3eQ7lLUkl17BgPAEWhBiQ=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "Unbelievable the Stuff all were so friendly, like being in a family Hotel, The outside road parking has been tanked away, I was offered a service by the Dorman to take the car to safe car park and return it at any time I needed it. The room was beautiful minibar was well-stocked including Floyd of snacks,\nA very calm & friendly atmosphere. Small Gym to to have a workout, No pool.\nVery Happy will return for dinner and to stay. Thank you for a wonderful time.",
            "time": 1726033967,
            "translated": false
        },
        {
            "author_name": "Nancy H.",
            "author_url": "https://www.google.com/maps/contrib/110015488300222153955/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVjM6p4klCAeIKSUq5FswXJDbT5-RyFIvvEEsd59xOGOG3pAuqrRw=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "We're on the last night of our 3-night stay and even if I was looking, I couldn't find a single thing to complain about. The service is so genuine and the hotel is pure luxury, without being stuffy or formal. I absolutely love the whimsical style. The breakfast and afternoon tea are amazing and served on beautiful china. I'd stay again in a heartbeat.",
            "time": 1723845621,
            "translated": false
        },
        {
            "author_name": "coryell berke",
            "author_url": "https://www.google.com/maps/contrib/103875170086786600753/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUmWYqN3X8yTRsg2Wd2CQ_IlaW4gPl50HfEMC6GwDZhmoHi39sh=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "This hotel is perfect for a 24 hour layover. The location is great— walking distance to all of the historical sights and close to the tube! The room also comes with complimentary snacks and drinks, which was such a great surprise after coming from a long flight.",
            "time": 1725272040,
            "translated": false
        }
    ]
}