{
    "name": "Premier Inn London Euston hotel",
    "rating": 3.9,
    "reviews": [
        {
            "author_name": "Tami Wiersma",
            "author_url": "https://www.google.com/maps/contrib/112373222163122952779/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVB0gG1Q72cjkNDdaNPDc0W3nmeGEGaU_ElnsbT1vdrG6Kc3Dqx=s128-c0x00000000-cc-rp-mo",
            "rating": 3,
            "relative_time_description": "2 weeks ago",
            "text": "The beds are “full” size (American), not queen or king; it was like sleeping on a small pull-out couch with 2 people.  We are fairly tall; our feet and ankles both hung off the end of the bed.  It was also very low to the ground.  The place was supposedly “sold out” mid-week in off-season November so we couldn’t switch to a room with 2 beds just to get a comfortable sleep. Rooms are basic and dated…. I’m sure they were top of the line in 1985.  There was a thermostat in the room that didn’t control the heat. There was a radiator installed that didn’t not work so an extra portable radiator was plopped in the middle of the room.  Room service would crank a window each visit so it was very chilly upon return.  (It was a degree above and below freezing outside during our stay.)   Accessible bathroom was awkward.  One of the elevators was broken the entire 4 day visit.  Very centrally located to Kings Cross and St. Pancras Stations so it’s quite convenient.  There is a great coffee shop and a nice diner both attached to the property (coffee shop is superb, diner is OK … was out of 2 different items I tried to order).  I’d spend more money and stay elsewhere.",
            "time": 1732192040,
            "translated": false
        },
        {
            "author_name": "Rhys Stickler",
            "author_url": "https://www.google.com/maps/contrib/111003985814860682977/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIxT--HYeLb4T4OIZTI8PdZTky9t8V86l1cwJtxx_bZULZMew=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 1,
            "relative_time_description": "a week ago",
            "text": "Rubbish hotel. Had to book in at a screen, didn't work. Terse girl booked us in, arrive st the room and can't get inn. Back to reception to get a new key card. On returning, notice fresh white paint all over new suitcase. Made complaint and they didn't care. They pointed to small wet paint signs high on the wall that you wouldn't see pushing your luggage around. No barrier to stop you bumping into narrow hallway or give you an idea to stay clear. Wifi is crap. Went to have a shower and only 1 towel in bathroom for 2 people. Back down to reception again and not even the slightest apology. Glad we are only here for one night.",
            "time": 1732565974,
            "translated": false
        },
        {
            "author_name": "Alex Gray",
            "author_url": "https://www.google.com/maps/contrib/111293955075261138765/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVq0oGVbtyY6Y4omtLKOCYVtq6wD_rxEQBlucVznvH-vcKE3Ew=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 4,
            "relative_time_description": "2 weeks ago",
            "text": "Standard comfortable Premier Inn with good, but pricey, full breakfasts.  Excellent location for transport connections if you are okay with walking a few hundred metres to King's Cross. Very close to Euston. Nice quiet walks down the back streets.",
            "time": 1732124164,
            "translated": false
        },
        {
            "author_name": "Macey Wilson",
            "author_url": "https://www.google.com/maps/contrib/115142948262355201264/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVhrwZn66O6Wo6FqMlb86LwhrbGw9rEk7M1Bsg6VWy7dTG2kckNlg=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "After reading reviews of this hotel before I came, I was quite worried as to how our stay would go. I can honestly say I was really pleasantly surprised. The hotel staff were really lovely, and the rooms were very clean. Our main worry was about how hot the rooms were, as this is what most reviews said. Although our room wasn’t cold, it certainly was not hot and it wasn’t uncomfortable for us at all. The windows were left open all the time which allowed lots of ventilation and we were provided with a fan which also made a big difference. We had a room on the side of the building but it wasn’t far from the Main Street at all and we were never disturbed by any noise. We had 3 very peaceful nights sleep. Don’t let the reviews put you off this hotel as it is a premier inn, you know exactly what you are getting and we really enjoyed our stay. The location was also amazing and so central to everything.",
            "time": 1724510026,
            "translated": false
        },
        {
            "author_name": "Tollets TalesAndTrails",
            "author_url": "https://www.google.com/maps/contrib/113502889182100531811/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUEctTFhBFcNXYW3KSzYZ7N3YYkjevp6xcdIQ0KDi4O9mKLVEcSRw=s128-c0x00000000-cc-rp-mo-ba6",
            "rating": 4,
            "relative_time_description": "2 months ago",
            "text": "A very convenient location for those arriving into Euston train station which takes a 10 min. walk. If you take the time to look and walk around, places like China Town, Leicester Square, and other attractions are walkable. As for the hotel itself, the rooms were bigger compared to sites they have closer to the city attractions. There  were a couple of seats and our room fairly quiet over looking the buildings quadrangle. Sadly the air con was not functional but an electric fan was provided. The staff helpful and the plus was usage of the  left luggage room which is securely managed. My thank you to the lovely team .",
            "time": 1727279109,
            "translated": false
        }
    ]
}