{
    "name": "Holiday Inn London - Bloomsbury, an IHG Hotel",
    "rating": 4.1,
    "reviews": [
        {
            "author_name": "James Lowther",
            "author_url": "https://www.google.com/maps/contrib/102191485852037800456/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI-w03-5d-7Ll4fdXJpUMegsIZyfTAESB2wTRpP2lhVHc2HsQ=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "2 weeks ago",
            "text": "We recently hosted a work event at the Holiday Inn Bloomsbury, including hiring a function room and booking hotel rooms for our team, and I couldn’t be more impressed. The service provided by Paul, Alvaro, and the entire staff was absolutely outstanding. I’ve stayed at what are considered higher-end hotels, but none have matched the personal attention and dedication we received here.\n\nFrom the very beginning, nothing was too much trouble for the staff. Every request was met with a smile, and the level of care made all 70 of us feel incredibly valued. The attention to detail and the genuine hospitality ensured that our event went off without a hitch, and everyone had an amazing time.\n\nA massive thank you to Paul, Alvaro, and the team for making our experience unforgettable. We will definitely be returning!",
            "time": 1732184608,
            "translated": false
        },
        {
            "author_name": "James",
            "author_url": "https://www.google.com/maps/contrib/105830493750597090167/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKkrGa2xMgKw60daF1eUUuShlUHkv0IVyeMV2wLG4pgS-KoeQ=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "4 months ago",
            "text": "We were extremely pleased with our decision to stay at this hotel. The staff were exceptionally helpful and attentive, and the cleanliness was impeccable. The hotel’s location was ideal, offering easy access to restaurants, shopping, and public transportation.\n\nThe highlight of our stay was undoubtedly the breakfast. The service was outstanding and the food was delicious with a wide variety of options. What truly stood out was the special care and friendliness of the manager, Robert. He personally visited each table to ensure everything was satisfactory, adding a genuine touch of hospitality that made us feel special. We will definitely be returning.",
            "time": 1722717250,
            "translated": false
        },
        {
            "author_name": "Adi Behar",
            "author_url": "https://www.google.com/maps/contrib/108650461878640867508/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLaf3j51g03-0RqWfwtG06-FIv7acXQ3BHaouZMVn3uWPOY7Q=s128-c0x00000000-cc-rp-mo",
            "rating": 4,
            "relative_time_description": "in the last week",
            "text": "We come back to this place every time! the hotel is close to everything you're going to need - the metro, busses and a variety of shops. On top of that, they serve an amazing breakfast that keeps you full for the day, and have a warm an delightful staff (special thank and appreciation to Ahmed the concierge).",
            "time": 1733132347,
            "translated": false
        },
        {
            "author_name": "Joe Yap",
            "author_url": "https://www.google.com/maps/contrib/111833439200984936772/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWpGJ8XkmIr8DVpq3B-gw_70Rt1oV8QUFnHrQ1VnNYgpuBC8eTX=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 3,
            "relative_time_description": "2 months ago",
            "text": "Convenient location but disappointing stay - I recently stayed at Holiday Inn Bloomsbury and found the location to be its best feature, conveniently situated right across from Russell Square underground. While the hotel’s overall appearance is clean and neat, the room I stayed in, particularly room 449, was old and in need of refurbishment. Essentials like toilet rolls were not refilled by the cleaning staff, although fresh towels were replaced daily.\n\nThe hotel is small, lacking basic facilities such as a fitness room. The breakfast was average, with the same options provided for all four days of my stay, and I would suggest exploring other breakfast options nearby for variety. This hotel might suit budget-conscious travellers looking for a no-frills experience, but for the price paid, I expected more. Overall, I would not recommend it unless you are simply looking for a place to sleep in a good location.",
            "time": 1727765701,
            "translated": false
        },
        {
            "author_name": "Andrea Wright",
            "author_url": "https://www.google.com/maps/contrib/111182551339086025602/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ_fEjrdAouxhTSEECz1A8dWE6ApsrFleotl04OjwSK6VtmCA=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "3 weeks ago",
            "text": "I stayed at this hotel for a night this week. My room was clean, comfortable and quiet (I asked for one without a link door), the staff were friendly and helpful, and there was a great choice of items for breakfast. The hotel is in a convenient location with easy access to buses and the underground.",
            "time": 1731130088,
            "translated": false
        }
    ]
}