{
    "name": "Premier Inn London Leicester Square hotel",
    "rating": 4.1,
    "reviews": [
        {
            "author_name": "Graham Lee",
            "author_url": "https://www.google.com/maps/contrib/109304911575123248845/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKzWS7e8ZsISQMoF-IlqfRMm3B8tV-qR3EsNwfKTxlmYoIe-Q=s128-c0x00000000-cc-rp-mo",
            "rating": 1,
            "relative_time_description": "in the last week",
            "text": "If you want a noisy room that is dirty and has a hair dryer that smokes and breakfast were most things are not replaced and refilled. Then come here. Rooms need a lot of work as no heating or aircon working. Plus the extractors fan not working so bathroom just fills with steam. Oh at 3am you get a free disco in bathroom as the fire warning red light flashing for about 30 minutes. Location is good but that's about it. Nothing premier apart from the name!",
            "time": 1733078118,
            "translated": false
        },
        {
            "author_name": "Hilary Marshall",
            "author_url": "https://www.google.com/maps/contrib/111481651652146663849/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLftUFSw8C7_Is36NCfnQstZgCwgwnxE65Fgb3lMKEnqizcSg=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "Fabulous location for tube and within walking distance of most tourist attractions & theaters.  Staff were exceptionally friendly, pleasant & helpful.  Breakfast good.  We booked a premium room and it was very good and beds was  very comfy.  Our only issue was that there were a number of stains/marks on the carpet of our room.",
            "time": 1723065576,
            "translated": false
        },
        {
            "author_name": "Marc Hollinger",
            "author_url": "https://www.google.com/maps/contrib/109997810736105049473/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKH2w_xt17ZZSqGl00wrztTboQxpJfQy7RFR85xEJ5wKBWJtg=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "Stayed @ Premier Inn back in April while on holiday, staff was very accommodating and allowed us to check-in early for a nominal fee. The location is fantastic - pretty much central to everything in London: close to shopping, West End, Piccadilly Circus, and Trafalgar Square are all right there. Our particular room was quaint and small, but all we needed was a bed and bathroom so it was ideal. Just a block to the nearest Underground station...good chance we stay here again during our next visit.",
            "time": 1729726969,
            "translated": false
        },
        {
            "author_name": "Michael Pearce",
            "author_url": "https://www.google.com/maps/contrib/104561955100079469823/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWdrNqVSYAuPNYIYRLjejzsMLJisuskuLdf6t47M3h_FNwADJyG5Q=s128-c0x00000000-cc-rp-mo",
            "rating": 1,
            "relative_time_description": "2 months ago",
            "text": "Don’t stay here if you want to sleep. There is a night club under the hotel with thumping bass until 3am. Perfect if you are visiting that club but not for anyone else. Rooms are usually premier inn so good standard. Breakfast we very good. Staff helpful and friendly. Just a shame about being in the same building as the club.",
            "time": 1727004197,
            "translated": false
        },
        {
            "author_name": "Petra",
            "author_url": "https://www.google.com/maps/contrib/110437324819569032941/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUzS2Mq3Dl-k6OTglYedq-QcGmv_ZE4yKKvyQ8DAwoylK6ZZ-jA=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "We stayed at the Premier Inn Leicester Square on our last trip for 4 nights. The hotel has a brilliant location, 5 minutes to Covent Garden or Piccadilly Circus, 2 minutes to Soho, Leicester Square on the doorstep. Tube stations are about 200 m and 350 m away, and various bus stops are also within easy walking distance.\n\nThe hotel has 2 lifts, the reception is on the 2nd floor, where the restaurant/breakfast room is also located. Luggage storage is available. The staff are very attentive and helpful and look after the guests. An Extra Star for the friendly staff!\n\nAbout the room: The room was large by London standards, a double bed with a very good mattress, and we were given a second duvet on request. You just have to ask nicely. The fact that the windows cannot be opened - we are in London - is just the way it is, we know that. Not a point of criticism for me, some people wrote about the windows negative in their reviews! Room cleaning service on request, as always in Premier Inn hotels, everything was done perfectly.\nThe breakfast was very extensive, my 15-year-old grandson didn't have to pay for his breakfast, a great offer from the hotel.\n\nAll in all: The hotel is perfect if you want to be in the middle of things but still have peace and quiet. We will definitely book there again next year.",
            "time": 1729751907,
            "translated": false
        }
    ]
}