{
    "name": "One Aldwych",
    "rating": 4.6,
    "reviews": [
        {
            "author_name": "Mani Obhrai",
            "author_url": "https://www.google.com/maps/contrib/107689861986847198536/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUtlWj_g0j--Ztr0PFplgToij2unVuOUKXvu-cuXni6Md9BhzP66A=s128-c0x00000000-cc-rp-mo-ba6",
            "rating": 4,
            "relative_time_description": "in the last week",
            "text": "Haven't stayed here but have eaten in the restaurant many times and have had cocktails in the bar more times than I can remember. It's a lovely building, immaculate and pretty. The restaurant is great, they don't make a big deal of it but it's gluten and lactose free, and honestly, it's easy to forget that sometimes, the food overall is fantastic. The bar is great fun, the staff are knowledgeable and the cocktails are always good. They do the classics too. Recently went along to a fizz and movie event, which, while being fun, did have it's flaws. Firstly, in my opinion the price point is too high for what you get. You get a 3 course meal, a glass of fizz, and a movie, but it's a very limited set menu. Plus there was a hefty booking fee charged by the third party website. We were initially mistakenly given the a la carte menu to peruse, too, which made things worse. At the price though I expected more food options or more fizz, or both. Overall it was a fun experience though.",
            "time": 1733134493,
            "translated": false
        },
        {
            "author_name": "Thiers",
            "author_url": "https://www.google.com/maps/contrib/111879687432324534592/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXQ913_5tPUz6sN6REOtF5ni86hYkt-Mss_liLZKXky5N3gkhk=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "Always a great place to have some nibbles and amazing cocktails. We always go before any theatre or opera we have in the west End. The staff is very friendly and helpful, the decor always stunning with fresh flowers and following a season theme, and everything is sparkling clean, especially the loos. Highly recommended this place to have cocktails and spend some time in their lounge.",
            "time": 1729979289,
            "translated": false
        },
        {
            "author_name": "Jennie Williams",
            "author_url": "https://www.google.com/maps/contrib/109481545381681353601/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVz7zXimzl5SMgJxmKMWOOjveJpbot8CJrzx_qm0ARb9Ts5DLgOOQ=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "Just returned from a long vacation to London and Paris. Spent a fabulous 4-nights at One Aldwych, which was a highlight of the trip. From the moment we walked in, the wonderful staff made us feel welcomed and went above and beyond to make everything feel special.\n\nThis hotel is in a perfect location, central to all the major tourist sights with easy access to the Underground. The front desk was very helpful anytime we had a question and we appreciated that they were able to help with airport taxi arrangements.\n\nMy husband has celiac and we picked this hotel mainly because of it's reputation for handling food allergens. Having the 100% gluten and dairy-free Indigo restaurant on-site was a huge bonus for us. Room service was excellent and took great care in double checking allergens and ensuring that cross contamination risk was minimized.\n\nThe hotel has a lovely spa and well-equipped fitness room. Usually hotel fitness areas are pretty sparse but this one actually has a free weight rack and full cable machines! So nice not to have to go elsewhere to get a decent workout.\n\nI was more than impressed with the cleanliness and comfort of the room. The complimentary mini bar was a nice little treat. Appreciated that housekeeping did their best to ensure that it was stocked with gluten and dairy-free items.\n\nAlready dreaming about going back!",
            "time": 1727806096,
            "translated": false
        },
        {
            "author_name": "Adam Landsman",
            "author_url": "https://www.google.com/maps/contrib/116966471437194876114/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXblS8AKj4kgGCqgOcVbCSUVdMcoc_FHsDgGCC3nY75a9GCCDTv=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "3 weeks ago",
            "text": "This is my second time staying here. I made a reservation for the wrong date and Javier Esparza immediately jumped in and was incredibly kind during a very busy week in London. He got me a room without complaint (in fact was apologetic!), honored my original rate and even checked me in early and walked me to my room. Hospitality is top notch. Alex and Julia in sales have been hyper responsive. Incredible leadership at this hotel. Well done.",
            "time": 1731585073,
            "translated": false
        },
        {
            "author_name": "Tom Linden",
            "author_url": "https://www.google.com/maps/contrib/102070414626098960861/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL4Ca23UdkIBxppIYdUhhD1WVjtn8MKazoENO07s9CqE5euuQ=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "I have been coming to this hotel for 20 years. The quality of the service, rooms, facilities, and food is world class. You can not beat its location. A boutique hotel with ever service you can want. It is amazing that One A is as good today (maybe even better) than when it first opened. We would not stay anywhere else in London.  Tip. Book the studio bridge suite with views over Waterloo bridge and definitely have cocktails in the bar in front of the amazing flower arrangements.",
            "time": 1727600128,
            "translated": false
        }
    ]
}