{
    "name": "The Clermont London, Charing Cross",
    "rating": 4.5,
    "reviews": [
        {
            "author_name": "Monika Romanik",
            "author_url": "https://www.google.com/maps/contrib/100070023319298746159/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUSXRGvwsEd7TOYbJNC_PUOWsYavgcUjaxJYzah_iMZONepYQ8X1Q=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "2 weeks ago",
            "text": "I really enjoyed my stay there, I would definitely come back. The grand, well looked after entrance and hallway set the tone for the rest of the stay. My room was clean,\nquiet and comfortable. The bar had a cool ‚secret cocktail bar’ ambience. And the restaurant was exceptional! I had a three course meal and everything was so fresh, perfectly cooked and super tasty. In addition, every staff member I interacted with was friendly and happy to help. What a great hotel.",
            "time": 1732137248,
            "translated": false
        },
        {
            "author_name": "Cindy Stallsworth",
            "author_url": "https://www.google.com/maps/contrib/114466677508661345205/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKd1OVs08efOCXFmBoeJZGuHo5Gfo5pDk62YGphZG6Ea-gYAg=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "2 weeks ago",
            "text": "What can I say, this is a must do place to stay. Wonderful staff from the front desk, concierge, dining, bar, housekeeping, and Starbucks. Everyone wanted to ensure our stay was perfect.\nConcierge not only gave great suggestions for local places to check out, but arranged our pick up and transfer to the airport.  Wait staff in the bar/restaurant were attentive, without being intrusive, and Tonya at Starbucks was simply Marvelous.\nThe location is a great starting point for adventures throughout London. If you want a place where your needs are met, historic and enchanting you need to pay a visit and stay a while. It truly is magical in all its holiday splendor.",
            "time": 1732126767,
            "translated": false
        },
        {
            "author_name": "Kate G",
            "author_url": "https://www.google.com/maps/contrib/114035366264385940625/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUS354ai9vf5KRm9qkEnt5GmW3VUfa6mc5y8TRf9YAmdNwjav9r=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 5,
            "relative_time_description": "2 weeks ago",
            "text": "Our second perfect experience. Was a 7-year gap between stays and the hotel has been so well maintained - fresh paint, impeccably clean public spaces and hotel rooms. And the breakfast is perfection! Dinner was excellent too. In short, we love this hotel! It’s central to many sights and all transport - and all the staff are lovely! Will be back!",
            "time": 1731975915,
            "translated": false
        },
        {
            "author_name": "Natalia Kolesnikova",
            "author_url": "https://www.google.com/maps/contrib/105912598758032914485/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIGL4V7sAX2GgbhRrZ2Lf0SG6-DjVLOAhbtUvRmRy1CNpb0Zg=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "3 weeks ago",
            "text": "My recent stay at the Clermont Charing Cross Hotel in London was exceptional, and I couldn’t be happier with my choice. Visiting London for the first time, I had high expectations, especially for the hotel, so I did my research before booking. I'm delighted to say I wasn’t disappointed.\n\nThe hotel itself was beautiful, our room was comfortable, spotlessly clean, and offered a breathtaking view. But what made our stay truly memorable was the staff's warmth and professionalism. A special mention goes to Hally, who welcomed us and handled our check-in. Despite our very early arrival after a long flight, she arranged for us to have immediate access to our room, which was a wonderful relief. Her kindness and welcoming spirit set the tone for a fantastic stay.\n\nThank you to the Clermont Charing Cross team for making my first visit to London such a delightful experience!",
            "time": 1731431619,
            "translated": false
        },
        {
            "author_name": "Richard Simnor",
            "author_url": "https://www.google.com/maps/contrib/103956557005508140257/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWxqvGAjxy4A1iI-Ix4CxHOyNiVWgurmyumjxdqiCQPy9j0KAkO=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "A wonderful building, staff were amazing. Breakfast was great.\n\nRooms were very tidy, very comfortable. Shower was one of the best I've ever experienced in a hotel. A great hotel by any standards.\n\nThe building is jaw dropping at times on the inside.\n\nBut ..\n\nExternal sounds were penetrating into the room. From AC units to the subway trains and the people on the street.\n\nHowever, I can't complain... I slept like a log. So just goes to show how the body adapts.\n\nLastly, the TV channels didn't work but I wasn't there to watch TV so it didn't bother me. Just something to bear in mind.\n\nOverall I'd definitely stay again.",
            "time": 1729494893,
            "translated": false
        }
    ]
}