{
    "name": "The Clermont London, Victoria",
    "rating": 4.2,
    "reviews": [
        {
            "author_name": "Livia Eliasova",
            "author_url": "https://www.google.com/maps/contrib/107482725848236222923/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKPIzmZkv4CmjGRYjaX_8NbhADmt-hs6mgei1WS5xzfeUx4lA=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "in the last week",
            "text": "An absolutely delightful experience. I would like to thank the fantastic team at the Afternoon Tea service for the kindness and for finding a table even though I did not have a reservation. They were very professional and the tea experience was impeccable. The Christmas decoration of the team room was particularly nice. As far as the hotel room is concerned, I had a very comfortable stay. The staff at the front desk gave me useful tips for visiting London in Christmas time. Also, I’d like to thank the team at The Soak restaurant: very kind and smiling (Roy) - had a nice late dinner! Would recommend overall.",
            "time": 1732958587,
            "translated": false
        },
        {
            "author_name": "Edison Ortiz",
            "author_url": "https://www.google.com/maps/contrib/110212531984567984335/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVtfQvt5O7q2rZehYiF6lz2SQhX7kElSKUL4-Wx7lje3MtOC6FMiQ=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "Very well appointed Hotel situated in a great location in Victoria. Room sizes vary and we wanted to match the US standard size, thus the Superior room was perfect for us. The room interior was very quiet while having a busy street just outside our windows. Room cleaning was impeccable but I'm docking one star for the service provided in the afternoon tea. I must say, it was underwhelming and left us disappointed on how we were treated.\nI highly recommend the Clermont London, Victoria to anyone looking for quiet and spacious rooms and key location. It's not the cheapest hotel in the area but it's worth its price - just skip the afternoon tea and go somewhere else.",
            "time": 1729004291,
            "translated": false
        },
        {
            "author_name": "george p miller",
            "author_url": "https://www.google.com/maps/contrib/110293847930943901439/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXfDzGOwuGPvmZqc6HdubqHiJkwtlbrCYLNy4Z3mwu1zfCcPRc=s128-c0x00000000-cc-rp-mo",
            "rating": 4,
            "relative_time_description": "2 months ago",
            "text": "We just returned from an 8-night stay at the Clermont Victoria.  We had a very pleasant stay.  The location is brilliant.  We were able to access all of London and beyond via Victoria Station, which was accessed directly from the hotel into the Hall.  We opted for breakfast, which was good, but nothing special. By the last day, we were ready to have different tastes. The staff was very attentive and knowledgeable.  Paddy was extremely helpful and definitely a customer service gem.  The ONLY real criticism and the reason we would NOT stay at the Clermont again is the fact that there is absolutely NO drawer space, and precious little shelf space for clothing storage!  Considering an 8 night stay, we just assumed being able to unpack - not the opposite.  We lived out of our suitcases and packing cubes for the entire time.  We booked an upgraded room that was large and had a sofa - but we never sat on it because our clothing was spread out on it.  So much for the cocktail party we had hoped to host!  PLEASE management - try to address this issue.  We are SURE that this is not the first time you have heard this critique.",
            "time": 1727792068,
            "translated": false
        },
        {
            "author_name": "Jiayi Kong",
            "author_url": "https://www.google.com/maps/contrib/115326868872980882652/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXge5Bs3mndtZ8RyzoSya8GSndNcxZkb_poTw4HFWhGo8IRpw2NVA=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "Highly recommended to any travelers. Beds are super comfy, with soft sheets, and very nice comforter. We stayed for 7 nights and there was not a single night I didn't enjoy my sleep.\nReceptionist and doorman were very friendly and patience with our questions.\nLocation is also very convenient,  right next to Victoria train station (don't worry noise level is very minimal) and underground, also bus stops nearby. Short walk to Buckingham palace and Hyde park.\nOverall we were very satisfied with our stay and would recommend to anyone who's looking for a place to get some good rest during your journey.",
            "time": 1724861429,
            "translated": false
        },
        {
            "author_name": "Brandon James",
            "author_url": "https://www.google.com/maps/contrib/100477986939761262422/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ8xsTDZb8E067RmIArrytRLIOEh3ow9TSaXFMx1JwNPkV-bw=s128-c0x00000000-cc-rp-mo",
            "rating": 4,
            "relative_time_description": "a month ago",
            "text": "Not sure about the other rooms but our is pretty tight, but everything you need for sure.\n\nIf you're an early riser and excited they have a gym, don't get too excited. Gym room is opened at 630 or 7 am.. (we couldn't get a proper time to count on, I'll have to see in the morning). The advice we were given was to go outside for a jog. Thought that was kind of rude. When asked to speak to a manager about it, we were told the manager can't control things like that...\n\nOkay?\n\nThat's my only complaint and thought service there fell super short on all ends.\n\nIn regards to dining and general hotel service, it's fantastic.\n\nWon't be back though for gym purposes, I'll find somewhere that lets me wake up when i want to go workout.\n\nCheers.",
            "time": 1730661853,
            "translated": false
        }
    ]
}