{
    "name": "Premier Inn London County Hall hotel",
    "rating": 4.3,
    "reviews": [
        {
            "author_name": "Maurice Gee",
            "author_url": "https://www.google.com/maps/contrib/103155882403146595680/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKDWEtBfVYvEHvj5Jd3IGGgbBtJwk_qpHiZ-TGahz8EPpNEBg=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "3 weeks ago",
            "text": "The floor of the shower was very slippy, but reception supplied a non-slip mat on request. It is advisable to book a table for dinner as it is very popular. The menu has plenty of choice and is not overpriced for London. The Meal Deal is recommended. The staff were very pleasant and helpful.",
            "time": 1731518806,
            "translated": false
        },
        {
            "author_name": "Andrea Cooke",
            "author_url": "https://www.google.com/maps/contrib/110436248466613010967/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW-oMACeALuJkz_egyxNNUwBZ-yLbAZv8hHmZ56sslc4pvdNhoJBA=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "a week ago",
            "text": "Lovely rooms,  check ins are precise at 3pm,we arrived at 240pm and were told early check in costs 10 quid.  We declined and placed out bags in the storage room.\n\nThe restaurant was closed so breakfast was available quite close but we had meetings so didn't have the breakfast, instead starbucks had a hammering directly opposite.\n\nRooms are cold but the heating is amazing and heats up really good.  Great location and I would stay here again",
            "time": 1732548784,
            "translated": false
        },
        {
            "author_name": "David Rees",
            "author_url": "https://www.google.com/maps/contrib/118214262291471555300/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLMLUT2QLv7vSvhhr0F2AtYyh42APhvKVENQY-5UjxF2BbojA=s128-c0x00000000-cc-rp-mo-ba6",
            "rating": 5,
            "relative_time_description": "in the last week",
            "text": "Very well situated for links to public transport (Waterloo station is only a few minutes walk away) and lots of attractions (The London Eye is right behind the hotel and you can walk to Big Ben in minutes).  Good breakfast and the rooms are very comfortable.",
            "time": 1733138317,
            "translated": false
        },
        {
            "author_name": "Julie Juratowitch",
            "author_url": "https://www.google.com/maps/contrib/105546526332321863768/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLIfAX_7E3MAKmfXiGa8QN1FBoSF17qghnXxfev5r-wYkz1jNI=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 3,
            "relative_time_description": "2 months ago",
            "text": "While in an excellent location the Hotel itself was a disappointment. Beginning with lifting heavy luggage up stairs into reception where we were met with a couple of self serve check in machines. Reception has absolutely no soul and not a single chair to sit down on to relax or wait for your transport.\nEventually a staff member appeared as there were several people waiting.\nAnother irritating thing is you need a staff member to open both male & female toilets unless you have your room key with you. The wait for this can be very long as staff are usually busy doing other things.\nThe room was ok, clean however the bed was extremely uncomfortable. Also you had to speak to staff before 12 if you were wanting your room refreshed. In saying this I felt sorry for the staff as they seemed to be pulled in many different directions and still managed to be helpful & polite.\nWe took the breakfast/dinner meal deal a few times and were happy and thought it was well priced. We enjoyed both dinner & breakfasts.\nThe location suited us but we would most likely not stay here again.",
            "time": 1727938571,
            "translated": false
        },
        {
            "author_name": "Paul Warren",
            "author_url": "https://www.google.com/maps/contrib/107055444276175841154/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVIQe6ylVu5Sydmqag3D-n2tCyRWfhtzgumvZdV3SUEsGG9kojA=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 4,
            "relative_time_description": "2 weeks ago",
            "text": "Premier inn is a pretty safe bet when it comes to a comfortable nights sleep and this was no different.\nRoom was clean, the girl on reception was friendly and welcoming but there was a constant humming drone from something either outside or further down the hall which was a bit annoying.\nBreakfast was advertised at £14 so we didn't bother and instead went over the road to the new Wetherspoons at Waterloo as it's half the price.",
            "time": 1731613903,
            "translated": false
        }
    ]
}