{
    "name": "The Chesterfield Mayfair",
    "rating": 4.6,
    "reviews": [
        {
            "author_name": "Kathryn Wicklund",
            "author_url": "https://www.google.com/maps/contrib/105309612464053459559/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKL24WCUIJe-p8uZ_-zuwflLOZn_tPr--N-DQaVhmQil4evuQ=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "Loved this hotel so much. It manages to bring old world charm with modern conveniences together. The staff were top notch and attentive from the moment you arrive to the moment you depart. I took my first solo trip last year in London, and was a little nervous about being in a foreign country as a solo female traveler. I mentioned this to the lady who checked me in (wish I could remember her name she was awesome!) she reassured me and later went out of her way to check in on me to make sure I had everything I needed. Enjoyed my stay so much I will be returning this September!",
            "time": 1725128696,
            "translated": false
        },
        {
            "author_name": "Emily Hunsley",
            "author_url": "https://www.google.com/maps/contrib/117524934226640350935/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKO-39vN-lgu0jA4ZUT3wFLyNQ7bnjBGj6LOVodfsjlD6gmFA=s128-c0x00000000-cc-rp-mo-ba6",
            "rating": 4,
            "relative_time_description": "2 months ago",
            "text": "We visited the Chesterfield Mayfair as part of a Hen party where we got Afternoon Tea.\nThe Afternoon Tea was sweet shop themed and because we were a bigger group we also got some champagne included.\n\nThe food was lovely.  The sandwiches were delicious and the scones were light and fluffy.  I really enjoyed the chocolate chip cookie scone!\n\nSome of the cakes we weren't as sure on but it was nice to have a try of all of them.\n\nWe booked in advance so I would suggest doing that as it definitely got busy - especially if you have a big group.\nThere is a concierge to look after coats and big bags as well which was very helpful.",
            "time": 1727776928,
            "translated": false
        },
        {
            "author_name": "Ali Forooghi",
            "author_url": "https://www.google.com/maps/contrib/102941238175165760385/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVuLcUq8GCQ08QSuqwnL0y2L8gLJ0If8rdnEQFrlcDcCFREW1-QDw=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "The afternoon tea experience was absolutely phenomenal! Incredible quality and amazing-tasting tea, food, and desserts. So happy we tried our first London tea experience here. On top of all that, the staff were all extraordinary! Our server, Sakib, was THE ABSOLUTE BEST! He made the afternoon 10 times better. Amazing experience all around and highly recommended.",
            "time": 1726507625,
            "translated": false
        },
        {
            "author_name": "Terry Cooper",
            "author_url": "https://www.google.com/maps/contrib/105427834377851158259/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKZdRlXGvRbSoJyySrhUcD5B_M1npDMnk9TzNjUP-CsQcFQgA=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "We had a great stay at The Chesterfield. Staff were very welcoming and nothing was too much trouble. The room was lovely with everything you could need. Location great for the west end and walks Into the parks. We definitely recommend staying here.",
            "time": 1730015451,
            "translated": false
        },
        {
            "author_name": "Stefan Dimov",
            "author_url": "https://www.google.com/maps/contrib/114701161633644876769/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWIHnIkHRPvT2yFe_6HROgWMy98VgtgVwV_gIH1TARJk8G-8C-X=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "I recently used The Library at the Chesterfield Mayfair hotel for a proposal, and I can’t express enough how magical the experience was. The ambiance of the room is truly enchanting—historical and inspiring, as if stepping into a real-life fairytale. It made the moment unforgettable!\n\nThe staff were absolutely incredible. They were not only super kind and supportive but also quick to respond to every request. A special shoutout to Samantha, who went above and beyond numerous times to ensure everything was perfect. She was exceptionally accommodating with all my asks, making sure I had the exact experience I envisioned.\n\nThe Chesterfield Mayfair is ideal for any kind of celebration, from birthdays and anniversaries to elegant afternoon cocktails in the courtyard—and of course, for proposals!\n\nA huge thanks again to Samantha and Jasmine for making this day so memorable. I highly recommend this venue to anyone seeking a touch of magic for their special occasion!",
            "time": 1726574788,
            "translated": false
        }
    ]
}