{
    "name": "The Athenaeum Hotel & Residences",
    "rating": 4.4,
    "reviews": [
        {
            "author_name": "M Uddin",
            "author_url": "https://www.google.com/maps/contrib/115997522572185554098/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI6gQmnmPcGgwRr4hlXaQ1p_aj8B4Sp5AziC5PyC1-xZjVt2A=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 2,
            "relative_time_description": "2 months ago",
            "text": "Came here for the spa day and cream tea.\n\nCream tea was very nice - fresh scones with clotted cream and jam and choice of hot drink.\nThe spa and treatment was OK not great... booked an hour treatment which included 30min back and shoulder massage, 30min body scrub and also booked a 30min Indian head massage. The treatment was either too gentle or too rough, not very relaxing. Probably the most expensive spa day I've booked but no where near as good as any of the other ones I've been to.\n\nThe changing rooms were extremely cramped! There was only 1 other person in there but even still, was very tight for 2 people.\n\nThe hot tub, sauna and steam room was all nice but again quite a small space. Service was excellent as expected. Hotel is visually appealing and luxurious, centrally located however very difficult to find parking nearby(ended up with a ticket unfortunately).\n\nEnjoyed the experience but wouldn't recommend and wouldn't return.",
            "time": 1727627088,
            "translated": false
        },
        {
            "author_name": "Wenn",
            "author_url": "https://www.google.com/maps/contrib/110980240546203851106/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUrkiW7RgVvLe0NkKOPhrdSSlsHOooDkb3Rv77D54FTeid8wfIxDw=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "We had a delightful and memorable stay at your esteemed hotel last month. The suite we occupied was aesthetically pleasing and generously spacious, featuring a sizable bedroom, a dedicated dining area, and a comfortable sitting area.\n\nI especially appreciated the presence of a large mirror in the dining area, which added to the overall ambiance of the space.\n\nWe hold your establishment in high regard and will undoubtedly choose to stay here again in the future. Furthermore, we will enthusiastically recommend your hotel to our acquaintances and associates.",
            "time": 1729973891,
            "translated": false
        },
        {
            "author_name": "A A",
            "author_url": "https://www.google.com/maps/contrib/109180178935756030742/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJEElO9mlrIEVXuaQy72tKWe6h83C4NU-ztBNTbW0Ymxx8Dcw=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 3,
            "relative_time_description": "3 weeks ago",
            "text": "I like the hotel and rooms’ interior. The rooms are spacious and clean.\n\nThe house keeping and the concierge service are super stars. Especially Daniel who was very helpful, welcoming and attentive.\n\nThe process of booking was a bit tricky, prices are widely varied through different channels and sometimes at no sense.\nDuring my stay, I contacted 4 different members of the reception, non of them was welcoming or responsive to my requests (except one for a minor request) .\nThey said the computer system is a bit slow, and they need time to check, unfortunately for 2 days they did not consider my request or even call with an answer.\nI believe that better training is needed for a 5-star hotel reception.\n\nI didn’t like the en-suite bathroom, very classic and old.\n\nThe most disappointing was the spa, it has very small sauna and steam room. They open only after 9 AM, which is too late!!\n\nThe location is fine, but there are no supermarkets or pharmacies close by.",
            "time": 1731572431,
            "translated": false
        },
        {
            "author_name": "Nia Gigg",
            "author_url": "https://www.google.com/maps/contrib/107744947698695415961/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIstmrplvsh0kCrA4jbCSHKN5sjCgChrjnF2OUTTzB8fCWxVw=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "We were kindly gifted the taster experience by friends as a wedding present. The whole experience was perfect. The service was incredible, the waiting staff were so lovely and helpful, and even gifted us an additional celebratory dessert. Each course was beautifully presented, and the food tasted exquisite. Would definitely recommend for a special occasion, and would love to return.",
            "time": 1725609007,
            "translated": false
        },
        {
            "author_name": "Cheryl D",
            "author_url": "https://www.google.com/maps/contrib/106336702245035514270/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIiI-IS2CK4VAFzx1qBsO14st8wwCj0QIJtWzV9zrcInCxwAvQH=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "4 months ago",
            "text": "End to end amazing stay. Absolutely loved it here. Every single staff we crossed paths with went out of their way to be pleasant and courteous. They upgraded our room and gave us access to the rooftop with beautiful views of Hyde park + the complimentary snacks and beverages was so nice.",
            "time": 1722341307,
            "translated": false
        }
    ]
}