{
    "name": "The Cavendish London Hotel",
    "rating": 4.4,
    "reviews": [
        {
            "author_name": "Bull Dogg",
            "author_url": "https://www.google.com/maps/contrib/104694583236609319710/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWPDhDhY38FQfDhYLMi6MA4U3VwZvbvpCarmd7Bbm8wGRRpVVAB=s128-c0x00000000-cc-rp-mo-ba7",
            "rating": 4,
            "relative_time_description": "a week ago",
            "text": "We stayed at the Cavendish Hotel for a long weekend and enjoyed the stay very much. The hotel is located near St. James Park and Piccadilly Circus and is on a walking distance from many museums, shopping, and attractions. There is an abundance of restaurants in the area, and Soho is very near if you fancy some nightlife.\nThe staff is friendly and correct, and one employee in particular stood out - Ahmed, one of the bell men, was incredibly helpful and service-minded, always with a smile and positive mindset.\nThe rooms are good, but haven’t been renovated for a while. We stayed in a junior suite and it was spacious with a nice view.\nThe beds are comfortable with several different pillows.\nWe may stay here again at our next visit.",
            "time": 1732487988,
            "translated": false
        },
        {
            "author_name": "Hedieh Elyasi",
            "author_url": "https://www.google.com/maps/contrib/118175373750994563044/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVl8-8IeDvF1JWZYifCbcddnyh1cQABGoWaOVaBAhU3SmdiKfs-Kw=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "We loved this hotel! The location is perfect, and the staff are friendly and helpful. The room has everything you need, although it is a bit small. It was clean and well-maintained. We appreciated being able to borrow a few US-to-Britain chargers, and they provided scales and helped us weigh our luggage.",
            "time": 1723448050,
            "translated": false
        },
        {
            "author_name": "Debbie Sachs",
            "author_url": "https://www.google.com/maps/contrib/116140389305900309412/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKtbl151cxHTwS35mPBtG9CR-hoX6nFI08jwSRlbuyeCf-_Sg=s128-c0x00000000-cc-rp-mo",
            "rating": 1,
            "relative_time_description": "a month ago",
            "text": "Was looking forward to a stay at the Cavendish but was extremely disappointed. The lobby was beautiful the staff was very nice when I got to the room it was very small and very dirty stains all over the floor, chips in the bathtub and no place to put any toiletries. As the bathroom is extremely small. I looked at three other rooms but they were all very similar there needs to be a major upgrade to this hotel. I would not stay there again spent one night only and then left.",
            "time": 1728302551,
            "translated": false
        },
        {
            "author_name": "Christopher Dickens",
            "author_url": "https://www.google.com/maps/contrib/116634496078030037350/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIbLUSLR1c-TLH5ThDh-LT3sVDRze5ZE-UmraFVnkhmQuBJ3w=s128-c0x00000000-cc-rp-mo",
            "rating": 1,
            "relative_time_description": "3 weeks ago",
            "text": "The worst reception and service experience i have ever experienced.\n1. Turned up and was greeted by a new member of staff who was unable to perform any action without the help of a supervisor, this meant non of my questions and requests were answered. They ask you if you have any preference in room when you arrive and then completely ignore your response.\n\n2. I rang reception 4 times due to an issue with my room and ended up having to go downstairs to reception in person because no-one was answering.\n\n3. The biggest one. This hotel was paid for by my company and i instructed them 3 times to please only take payment on the company card provided. This was confirmed by two separate reception staff - and what do i find a few days later? They charged my personal card and i now cant get through to reception to get this rectified because they don't answer their phones.\n\nDreadful",
            "time": 1731319065,
            "translated": false
        },
        {
            "author_name": "Smita Tiwary",
            "author_url": "https://www.google.com/maps/contrib/114416704009604654402/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXQqcyHZiOwYYj7gsr5u0TfZypuHB1ehmuHZWWMG2JcLDMsRvk=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "I could not be more grateful to have stayed at The Cavendish during our recent trip! Staff were ever eager to help out where possible, making us feel truly at home. Our 11-month-old was greeted with cheery smiles each time we entered the lobby, and was so comfortable throughout our stay. Rooms were well-fitted with helpful amenities, and it's a few steps away from the tube and a stone's throw from the shopping district. The Cavendish would be our go-to every time we stop by London! To the team behind it all, thank you so much for everything :)",
            "time": 1724812703,
            "translated": false
        }
    ]
}