{
    "name": "Holiday Inn London - Regent's Park, an IHG Hotel",
    "rating": 4.1,
    "reviews": [
        {
            "author_name": "Jose Sol",
            "author_url": "https://www.google.com/maps/contrib/106996334643318938960/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWFcqWVmnBYXyLRyR1V3M0vzFpnANoATeOmjAFy-7XkMwnAGdVF=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "2 weeks ago",
            "text": "A great location at a very reasonable price. For work reasons, I spent two nights at this hotel. I think it has a fantastic location. The hotel is very convenient for getting anywhere in London since there is a tube station just a five-minute walk away.\n\nThe rooms are spacious and very clean. Additionally, they are well-equipped with an ironing board and iron, tea, coffee, and a minibar.\n\nI loved the Dove soap.\n\nThe breakfast is very complete, and all the staff are very friendly and helpful.\nI'll come back for sure and I would recommend it",
            "time": 1731609749,
            "translated": false
        },
        {
            "author_name": "Peter Mcgahan",
            "author_url": "https://www.google.com/maps/contrib/102833639560335384234/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUTFr4iz4cXNtWOPkLQs-mb3aYVo2yzMGsXWX8i7M7JGbx4WPEG=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "a week ago",
            "text": "It is no coincidence that the front of house, the reception, the bar staff, the housekeeping, the kitchen are relaxed, smile a lot, all have impeccable manners, and attention to detail and attention to guests. That really is no coincidence. Its also their gentleness and interest in your wellbeing.\n\nYou'll see when you get there.\n\nI would have difficulty booking anywhere else now.\n\nMoreover, food and wine are all a great standard, breaking that need to arrive at a hotel and leave for food. And if you get the big pile of lovely energy that is Sam, as your waitress, your evening is complete. You'll see when you get there!\n\nThe breakfast buffet is...abundant, but I ordered an omelette on my first day here and always had that on my two trips.",
            "time": 1732650288,
            "translated": false
        },
        {
            "author_name": "Victoria Gino",
            "author_url": "https://www.google.com/maps/contrib/101482834338421045073/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLOoewHzBuYy_PLdyGhhvb5LuXRRVMjzeiyySXo2U0XrvdnGSo=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "4 months ago",
            "text": "For London standards, this is a really great place to stay. I would definitely recommend it and intend to stay here again in the future. Firstly, all of the staff we came across during our stay were so kind, from the concierge to the waiters to housekeeping. I find this is a really important because it makes you feel welcome and safe. The rooms were very clean and housekeeping did a great job everyday making the rooms. Also, the location is excellent. Breakfast was included in my rate and it was very good, especially if you enjoy starting your day with an English breakfast. The bathrooms are a bit dated but it was very clean and the views not amazing but honestly when you’re staying in London, it’s not something to prioritise. Overall, a very good first time experience staying at a Holiday Inn. Thank you to everyone who made our stay so enjoyable!",
            "time": 1721239309,
            "translated": false
        },
        {
            "author_name": "Eyal Naaman Tal",
            "author_url": "https://www.google.com/maps/contrib/114996170258786390173/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUl95aieQgHa1LLsKjyeiB3bQIHeTWZfMSrak2-1n7tYzeKBQ4HGg=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 2,
            "relative_time_description": "a month ago",
            "text": "Very good location. They do not pick up the phone when you can from the room, but front desk is busy and they are kind of nice.\n\nPremium rooms are very basic too, this is a good hotel for young travellers or people with limited budget.\n\nVery clean !",
            "time": 1728628895,
            "translated": false
        },
        {
            "author_name": "Victor Djumpah",
            "author_url": "https://www.google.com/maps/contrib/112571104061614589849/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVBjPpOT5x2JMd91oL9IKi-viz2CfnFQgf_jjl4wFHnzethz2v4XA=s128-c0x00000000-cc-rp-mo-ba6",
            "rating": 5,
            "relative_time_description": "2 weeks ago",
            "text": "Stayed here for a Saturday night during a work event. The room my wife and I stayed in was more than adequate and it had all the facilities we needed. We both had a good night sleep and didn't have any issues with noise from the adjacent room or from outside so that was good.",
            "time": 1731856450,
            "translated": false
        }
    ]
}