{
    "name": "Premier Inn London Victoria hotel",
    "rating": 4.1,
    "reviews": [
        {
            "author_name": "Jacqui Welsh",
            "author_url": "https://www.google.com/maps/contrib/117254860406298518647/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI4crPdMYeYr7Ag3lgfdOtSQTgJrOID-JbdXxEKCDo3P-1B3X4=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "3 weeks ago",
            "text": "Stayed for one night in this hotel for a quick trip to London. Haven't stayed at a premier inn before, but was pleasantly surprised. Room was nice and served its purpose without any complaints. The staff were very friendly and couldn't do enough for you. They p\nrovided an all you could eat breakfast for £12.99. Well worth it! Location was great with a lot of attractions within walking distance.\nVery happy to stay again!",
            "time": 1731590256,
            "translated": false
        },
        {
            "author_name": "Helen F",
            "author_url": "https://www.google.com/maps/contrib/101676113947382558942/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKw65Qr0AVpwQmE_vkVresqLw3zL1E9SKqgvcANpCjx2l9rwro=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "a week ago",
            "text": "Staff were very helpful and very kind day and night.Convenient location. Spacious big rooms and accessible. A lift outside the stairs you ring a button and they are on it. I would suggest measuring the chair width for main doors maybe 70cm wide for entry. Would definitely stay here again. Thank you so much!",
            "time": 1732223432,
            "translated": false
        },
        {
            "author_name": "Caroline Brown",
            "author_url": "https://www.google.com/maps/contrib/118355469643895511377/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJCp3zB5xvkGtGlxCAPFjuLwidWA34bu3HwTuJlP37YPrydaUI7=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "We booked this hotel as it was very close to Victoria station which suited us for getting into London from Gatwick airport and back again. Our room was a decent size, with a view over the street, bed was very comfortable. Room was spotlessly clean. We paid for the breakfast and thought it excellent value. Food was good, plenty of it, and a good variety. Staff were very friendly and helpful. We were able to leave our luggage in the luggage room after checkout so we could see a bit more of London before heading for our train. Quite a few pubs and restaurants nearby and also the Apollo theatre. Would definitely use the hotel again.",
            "time": 1729718423,
            "translated": false
        },
        {
            "author_name": "Dory",
            "author_url": "https://www.google.com/maps/contrib/103131245511426207284/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIieOYUfKcKVaGwuAFQrn7hAiG-ehQfQmWetYeJSzGtfCZvUw=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 3,
            "relative_time_description": "a month ago",
            "text": "This is a lovely place, I stayed for two nights with my disabled husband who uses a wheelchair. The entrance was a bit tricky with the lift and the small door ways but the staff were lovely.\n\nOur disabled room was very spacious but the lift down to the restaurant is not very big and we struggled to get myself and hubby in. My husband cant be left on his own.\n\nIt was a lovely stay for my husband and I, while my husband attended his hospital appointment and we managed to see a few of the sights.\n\nWe would go back again and would highly recommend if your not disabled.",
            "time": 1729095161,
            "translated": false
        },
        {
            "author_name": "Gina Galoppi",
            "author_url": "https://www.google.com/maps/contrib/104409686902119207521/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLgKcB5AYWuPyoJhDo_FyJ05Ur9qxQTWW44jyhg4g5kxwgPXg=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "I stayed here in September in room 411. I have stayed here many times over the years and you could definitely tell that the management had changed as the customer service was now very good and they really looked to find solutions to any issues that arose. My room was large enough, clean and most importantly quiet. Its location in Victoria is really central though at the moment there are a lot of homeless near and around Victoria Station so did not always feel safe for a female when it became dark. I would definitely stay here again especially because the staff are very nice and very helpful.",
            "time": 1728156817,
            "translated": false
        }
    ]
}