{
    "name": "Petit Palace Santa Barbara",
    "rating": 4.5,
    "reviews": [
        {
            "author_name": "Netflix Artmachine",
            "author_url": "https://www.google.com/maps/contrib/114523941098852505119/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUcYmPUHCTM3WxuPLS3OadyDL_wjVkRDnkJ7dy_R2Owgkd0bJk=s128-c0x00000000-cc-rp-mo",
            "rating": 4,
            "relative_time_description": "a month ago",
            "text": "Great location and nice breakfast!\nAs others have mentioned, the showers are extremely slippery! We really enjoyed the proximity to all the central Madrid sights.",
            "time": 1729552615,
            "translated": false
        },
        {
            "author_name": "Carole",
            "author_url": "https://www.google.com/maps/contrib/101228935520974133169/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKfUsP39JQh8-FHmTJfArxZQDDRUXRHDwLVwCFyNP9FFI9AMA=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "6 months ago",
            "text": "Great little gem in Madrid!  Excellent location - a block from Alonso Martinez metro which has several lines so it's easy to get around the city.  Only one transfer to get to the airport.  Also, down the block there were many shops - pharmacy, stationery store, ATM, whatever you need.  A small grocery store was about a 4 min walk away.   I interacted with about 5 staff members over the course of our visit and each was friendly and helpful.  Owner takes pride in running an excellent hotel.  He checks in with the guests.\n\nAt first, my room wasn't ready for early check-in but when I showed them I had selected early check-in, they found a slightly better room for me and kept the rate the same.  Rooms were neat and clean.  Shower was fantastic with three different setting - rain head, rain head plus side heads, hand held only.  Two luggage racks which was nice. Mini-fridge and safe. No microwave.\n\nFabulous brunch - at first, I tried to skip brunch and get the fee taken off because we seldom eat a big breakfast but it was included in my rate.  I was glad in the end. There were so many options and the food (fruits, cured meats, 4+ types of cheese,, hot eggs/potatoes/veggies, cold veggies, pastries, yogurt, many types of milk, etc.) was very fresh. I especially enjoyed the cappuccino maker which made at least six types of drinks and had a steamed milk option.  We tended to then have a late lunch near our tourist destination and skipped dinner since we were so full and jet lagged.  Bartender was nice and gave us some nuts/candy with our drinks.\n\nThe clientele behaved well - they were a mix of business and pleasure.  Nobody too loud.  Our room was on the third floor which was away from the street noise.  You will have some street noise since Madrid is a city.  My only negative was that the rates were way high for two of our nights vs. other dates, likely because most hotels raised their rates when Taylor Swift came to town.\n\nEnjoy your stay there!",
            "time": 1717518016,
            "translated": false
        },
        {
            "author_name": "youssef jbida (chef jbida)",
            "author_url": "https://www.google.com/maps/contrib/114932306762191275038/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUKy7QFRBLH27SanxKwBBoYps6XKRVbYIf_TTMZIT94zjnGFLU6=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "Very nice hotel, clean and modern. But the best thing in this hotel is the stuff. Especially the receptionist at day shift. She finds solution for any potential problem. Special thanks",
            "time": 1724075650,
            "translated": false
        },
        {
            "author_name": "2Fast 2Furious",
            "author_url": "https://www.google.com/maps/contrib/116750408499579037351/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW4ck8g71G6SDNrLB2AyPdQwDxFQf6vheims_hhqKYPgKVFCV_n=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "7 months ago",
            "text": "Super place to stay. The rooms were clean, it is not loud, the breakfast was perfect from my point of view. I will select that place again for my short trip to Madrid. Everything is easily reachable because it is in walking distance. Also the area is a good one and in front of the hotel is a space just to relax and grap a coffee",
            "time": 1714480663,
            "translated": false
        },
        {
            "author_name": "Qz Techno",
            "author_url": "https://www.google.com/maps/contrib/112047877123825936952/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXtkvfyssSwtkQQbUD3S26jNTObm1buRJ8E5wWdemrpX7DgwGI=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 5,
            "relative_time_description": "8 months ago",
            "text": "The rooms were perfect for us, we had decent beds a good amount of space and an amazing bathroom.  We were provided with a shower, beds, desk and chair and small balcony.  One of the only downside was the breakfast not being the greatest selection of food.  However, the highlight of the petit palace was the location.  We were surrounded by good restaurants (would recommend Billy’s brunch and cereal hunters).  Most of all we were less than a minute away from a good train station which allowed us to travel to everywhere in the city!",
            "time": 1711907646,
            "translated": false
        }
    ]
}