{
    "name": "Petit Palace Chueca",
    "rating": 4.4,
    "reviews": [
        {
            "author_name": "Karen Sheerin",
            "author_url": "https://www.google.com/maps/contrib/110796998490877915974/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXlksk5ihgBYENX7bIlEhnl9LPq2tAScXREWsAPPmr_796h-mrYBg=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "Stayed for 5 nights, as a family of 4, in a quadruple room. Amazing location just of the Gran Via, good walking distance to all major city attractions. Service and cleaning levels really good. As other reviews have stated decor and maintenance in our room was a little tired and required some TLC, but this did not negatively impact the quality of our stay. Great Wifi for those that require it for work purposes. This hotel offers real value for money. It was our first time in Madrid, we loved the city and would definitely return to Petit Palace Chueca upon a future return.",
            "time": 1730623963,
            "translated": false
        },
        {
            "author_name": "Steve Curulla",
            "author_url": "https://www.google.com/maps/contrib/112330594942578436800/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUHAh7rq1nKhgR7WVimWIUiF1ZMM7NRlus4BLq0KVvIUhZGsXQ=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "Great location just steps off the Gran Villa and a short walk to Puebla del Sol.  Maybe 100 meters to the Metro station.  Hop On-Hop Off buses stop a couple blocks away. The hotel has recently been renovated and is very nice.  The sound proofing was very effective in keeping the street noise out. We paid extra for the breakfast and were so glad we did - it was excellent. Lots of dining and shopping within a couple minutes walk.",
            "time": 1728935901,
            "translated": false
        },
        {
            "author_name": "Carlos Gil",
            "author_url": "https://www.google.com/maps/contrib/113527844221282006811/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXop61illf-xLKAqmD-KsDupimcvAIO-vMPFMm886GmJVzVlJAMdQ=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 2,
            "relative_time_description": "2 months ago",
            "text": "Disappointing Stay at Petit Palace Chueca\nI was really looking forward to my stay at Petit Palace Chueca due to its central location in Madrid, but unfortunately, the experience fell far short of expectations. The hotel’s condition was quite run down, which is disappointing given the price and what was shown in the photos online.\n\nFirst, the carpets in the rooms had noticeable holes, giving the place a neglected feel. The furniture was worn and marked, clearly showing years of use without proper maintenance. The overall decor felt tired and in need of an update. To make matters worse, the elevator was not functioning during my stay, which made it very inconvenient, especially for those with heavy luggage or mobility issues.\n\nWhat really bothered me was that the pictures on the booking websites do not fully represent the current state of the hotel. They give a much more polished and modern impression, while in reality, the rooms and amenities feel outdated and poorly maintained.\n\nWhile the staff was friendly and helpful, and the location in Chueca is unbeatable, I can’t recommend this hotel unless some major renovations are made. It’s such a shame because it has great potential, but right now, it doesn’t live up to the expectations set by its online presence.",
            "time": 1727519070,
            "translated": false
        },
        {
            "author_name": "ekaterina Na",
            "author_url": "https://www.google.com/maps/contrib/111753493167046204632/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKpGNOCZY-5raakRW6OLdyx1a017RY6wQyYx__ML4QcnYZRDQ=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 1,
            "relative_time_description": "3 months ago",
            "text": "Not about hotel rooms. Cafe-bar is absolutely terrible.\nBut beautiful interior is good. coffee had to be thrown away, it's undrinkable. several cakes on display look very old and dry. prices for madrid are slightly above average. total disappointment!",
            "time": 1725563922,
            "translated": false
        },
        {
            "author_name": "Duarte Gaio",
            "author_url": "https://www.google.com/maps/contrib/106053192596034607711/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXQo0zeX7GV_IuT8J5_2SqUnbgNffOVO6Zr9zAqg-SjNhQexOsg=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 4,
            "relative_time_description": "3 months ago",
            "text": "A few details: the rooms are clean, the bed is confortable, the air conditioning works well, the water in the shower is well tempered. The sounds from the street are hard to avoid, since it's a busy area. The localization is great, very close to la grand via. They keep the luggage safe for the rest of the day after check out, and there is a lounge with a toilet where you can relax and have a tea till late.",
            "time": 1725292421,
            "translated": false
        }
    ]
}