{
    "name": "ICON Embassy",
    "rating": 4.4,
    "reviews": [
        {
            "author_name": "Dominik M",
            "author_url": "https://www.google.com/maps/contrib/107164912255195139784/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVDU5LhKMY3UZ4GWKn3lgmlwKH48Y8brNDYtF4Asje_0DXgpeTO=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "Great hotel for a stay right on the upscale shopping avenue Calle Serrano. Well designed throughout all areas, and with staff that shows great care and dedication. Breakfast variety and quality was very good. On the downside, rooms and hallways show signs of wear and tear so I hope the hotel finds ways to keep the experience consistent with the pictures and expectations.",
            "time": 1727939163,
            "translated": false
        },
        {
            "author_name": "Kelvin Sarbah",
            "author_url": "https://www.google.com/maps/contrib/114508697948716524511/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVSA7drn2QaSocSw8QviJ2PWbq0YGmlj52oIMo56tQtGETe2ZI=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "7 months ago",
            "text": "This hotel is in an excellent location. Very posh neighborhood. And very quiet as well. Easy to find taxis etc. The hotel seems to be an older fully renovated building. It is very tastefully done. Very boutique feel. The staff is as nice as they come. My favorite was one of the gents serving at the bar, and of course Noemi at the front desk. Potentially the halls can get noisy as sounds carry, but its not a constant thing. The rooms are spacious, big bathrooms, very neat and clean, as is the bed. The lobby bar is quite quiet, which is wonderous for times I was doing work, but some people watching would also be nice - for that, they also set  up a patio outside. It was far too cold for me on this trip, but im sure in the summer I could be out there for hours. Feel like an Icon, at the Embassy!",
            "time": 1715145978,
            "translated": false
        },
        {
            "author_name": "Lori S",
            "author_url": "https://www.google.com/maps/contrib/101094264293622351446/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV4XgOqnPN92q3Ba8RrOdERjSHqAgtjLlb_yIhC79E7ygp7wcoQ=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 3,
            "relative_time_description": "6 months ago",
            "text": "I personally wouldn't rate this a 4-star hotel. It was okay. Attention to detail lacking. I'd go with the ICON Wipton if you're chain loyal. Otherwise, go with another option in Salamanca. Lots of better choices.\n\nHere's why:\n\nLocation is excellent. Especially if you like to shop!\n\nBed was firm so be forewarned if that's not your favorite mattress type.\n\nFirst two mornings breakfast was ready on time. When we checked out at 7:00 am, there was only some fruit and smoothies available so that was disappointing -- breakfast was the only redeeming feature about this hotel.\n\nCafe on the sidewalk is far too noisy to have a conversation. Service was painfully slow.\n\nBathroom is small and again, details lacking. And our shower drain was clogged. Despite reporting it, never fixed.\n\nAC in one room had a bad sensor so changing the temp meant you had to do the opposite of what you wanted. Maintenance said he'd be right back but he never returned. We knew the trick so managed during our stay.",
            "time": 1717434819,
            "translated": false
        },
        {
            "author_name": "Mariam Dadabhai",
            "author_url": "https://www.google.com/maps/contrib/105777423992210991479/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLSsZzQ464X7ovyF7QCYY6txDQgz1Lz4Ic0IYcGsmTQUPKSRYI=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "10 months ago",
            "text": "I am writing this review to share my experience and recommend this hotel. This hotel is located in the center of Serrano shopping/restaurant spots- 20 min from the airport. Check in process is smooth. I checked in prior to arrival once they sent me a form to complete so this made check in process quicker. Once we arrive check in took about 15 min we where handed keys and then went straight to the room to freshen up. We were welcomed by a clean well organized room. After freshening up we went straight to walk down serrano and goya. So many restaurants, shops to choose and enjoy. After the walk we reached the hotel quickly since its so central which makes it so convenient. The next morning we enjoyed a full service breakfast buffet. We enjoyed the perk of shopping and coming back every now and then to drop the bags and freshen up/ even nap then go out for dinner. Same the following days. One morning I ask my coffee in the room because I wasn’t feeling well this was also to my satisfaction. In summary, excellent location, excellent service, excellent breakfast, excellent clean rooms. Now I understand why this hotel has so many good reviews. Well done.",
            "time": 1706630643,
            "translated": false
        },
        {
            "author_name": "Cory",
            "author_url": "https://www.google.com/maps/contrib/107713133221760570880/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLC7Z7e-baYKum6_CeBUfz84iKaewHOmc5gK5alxB7iBOOteQ=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "a year ago",
            "text": "We’ve stayed here for 4nights. Hotel staffs are all friendly, hospitable and supportive to assist you any needs. They surprisedly celebrated my daughter’s birthday day with a little cake and cute unicorn card with warm bless. That’s overwhelming over expectation…good and deserving 5stars service! And location is no word convenient~",
            "time": 1691344255,
            "translated": false
        }
    ]
}