{
    "name": "ICON Wipton",
    "rating": 4.5,
    "reviews": [
        {
            "author_name": "Myra",
            "author_url": "https://www.google.com/maps/contrib/107693665750473681652/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWrZOOaLDjK81v9yiPe3tIi8fepgSorIGYrSac3M8MVtUUsU5M=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 3,
            "relative_time_description": "7 months ago",
            "text": "Boutique style hotel. Rooms very cramped. No ability to control air temperature, only one setting on air conditioner. Uncomfortable beds. Stains on inner comforter, was not changed. Loud noises from street until 3 AM, had to request room change.  Breakfast was 21 euro. Service was friendly and understanding. Good dining nearby.",
            "time": 1715031810,
            "translated": false
        },
        {
            "author_name": "rafael yturbe",
            "author_url": "https://www.google.com/maps/contrib/109787780290601344273/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK9EL14a1B05FAux7QrVYgdfgLqA7cUHMpNPkFk0ZXB-3Jxpg=s128-c0x00000000-cc-rp-mo",
            "rating": 2,
            "relative_time_description": "6 months ago",
            "text": "Location is the only thing this hotel has going for itself, rooms are tiny, water from shower overspills and floods the entire bathroom, noise from everywhere, doors to the hotel don’t even open automatically so you have to wait for someone at the front desk to figure out you are there…\nDefinetly wouldn’t recommend anyone to stay at this hotel, there are much better options in this area, I know Im not coming back.",
            "time": 1717467530,
            "translated": false
        },
        {
            "author_name": "Tomás Steinweg",
            "author_url": "https://www.google.com/maps/contrib/100397032085720369849/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI9h3yf8ExmhK8rQ7MUz-ONvOb1I7nMZOvxuf-xlHlGpHxRBQ=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 4,
            "relative_time_description": "9 months ago",
            "text": "It is a great area to be in. You are walking distance from almost every shop if you like shooping. You should ask for a room in the Street jorge juan, which is not so loud and the rooms tend to be bigger. I would also ask for a room far away from the elevators. The hotel is modern, the restaurant is good, the breakfast is great and the rooms are equipped and large.",
            "time": 1708119423,
            "translated": false
        },
        {
            "author_name": "Filip Hansson",
            "author_url": "https://www.google.com/maps/contrib/116323529749178833089/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWeNrSl4ieigIOo-ZmWfbDwW8YdAgUNCQRq-iT0aOL_jwvfqibJ=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "a year ago",
            "text": "Cant say enough good things about this hotel!! The rooms were LOVELY, truly some of the nicest rooms I've seen in Europe for their price. The building itself is beautiful, nestled within the rows of trees lining the quaint streets. Plenty of life around, and plenty of food! Staff were extremely friendly and kind. An absolute must stay in Madrid!",
            "time": 1684230458,
            "translated": false
        },
        {
            "author_name": "Cedric Koukjian",
            "author_url": "https://www.google.com/maps/contrib/118386529070276949027/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWUVWrenatNiImJ9IygpKXw5NtsrDxKpwPxlA_99igVqPeEzeOkTA=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 1,
            "relative_time_description": "10 months ago",
            "text": "I recently had a very disappointing and humiliating experience at petit palace, icon wipton, and I feel compelled to share my concerns. The staff exhibited poor manners, which is surprising given the typically warm hospitality found in the city.\n\nAs regular clients, we returned to the hotel's reception 24 hours after checking out to print our boarding passes before our trip back to the Middle East. Regrettably, the staff responded aggressively, denying our request and insisting we leave immediately. To our disbelief, they even raised their voices and threatened to involve the police, creating a scene in the street.\n\nIt's essential to note that we as a family are seasoned travelers who always treat the service industry staff with upmost respect and know first hand the challenges of working in a hotel. The extreme reaction from the hotel's staff was completely unjustifiable.\n\nUpon reporting the incident to the hotel, we were accused of loitering and compromising the security of other guests in the lobby. Apparently our mere presence poses a threat. Furthermore they said that we should be aware of the rules being regular clients and that we are not allowed back in. This was perplexing, as it's the first time in my travels that I've been denied access to a hotel lobby after checking out. Any other establishments would actually come and take my order for a drink when I sit in the lobby.\n\nI hope that this feedback helps address and rectify the concerning behavior we encountered during our stay.",
            "time": 1705762695,
            "translated": false
        }
    ]
}