{
    "name": "Corral de la Morería",
    "rating": 4.4,
    "reviews": [
        {
            "author_name": "V Schultz",
            "author_url": "https://www.google.com/maps/contrib/118369047058144734733/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVpBpD4JyofRRMbApyPuaAiIq2nJWBMfdqUPi-ansEhh31DwakV=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 3,
            "relative_time_description": "in the last week",
            "text": "I had a mixed experience here. Didn't do the dinner so that added to our opinion as you're expected to show up the same time as the dinner guests and wait approximately 45 minutes for them to eat before the show even starts.\n\nEveryone that didn't select dinner as an option was sat in the back corner area. Dinner guests were given definitely better and preferential viewing. However because the venue is so small there really isn't any bad seating and we were able to view the show and hear everything very clearly.\n\nSitting in the back corner it was warmer compared to the other more open areas.\n\nIf I had realized that I would have to sit for so long watching dinner guest be served I might have a better opinion but sitting for 45 minutes just watching people eat was not what I was expecting.",
            "time": 1733096692,
            "translated": false
        },
        {
            "author_name": "Agent 008",
            "author_url": "https://www.google.com/maps/contrib/103068114572452560982/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXM4Ec497SBdxpdg04aH7meOOoDLcLKCz39T2RXXZbeEnk_1C8=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a week ago",
            "text": "The Flamenco is astonishing! Without much knowledge I thought it was mainly the dance but the songs are such an integral part of it. Both songs and dance are very emotional and breathtaking. The main male dancer sings equally well and has very good voice. Several background singers can dance as well and it’s fun. The food is average for a Michelin restaurant but the prices are relatively low (higher than non-Michelin restaurants though).",
            "time": 1732464015,
            "translated": false
        },
        {
            "author_name": "M. F",
            "author_url": "https://www.google.com/maps/contrib/117574341941192445756/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVedrmyvgqtN4ldyr9wfDATKXSvquLSr155GQA98hOGeG4EQnUc-g=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 4,
            "relative_time_description": "a month ago",
            "text": "The singing and flamenco were incredible and the food was truly phenomenal. However the service fell short our table’s order was initially forgotten and we waited quite a while as other tables were served bread while ours was repeatedly overlooked. It wasn’t until the second course that they took our order and brought us bread. Once our order was in the food arrived promptly. Overall, an evening of unforgettable performances with delicious food.",
            "time": 1730810451,
            "translated": false
        },
        {
            "author_name": "Joseph McCluan",
            "author_url": "https://www.google.com/maps/contrib/113897320164132859217/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVH1NC07WO71wYE1Nx_FT9ngUVdXiP-VzSy9_gS333e2RZ-Hg=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "4 months ago",
            "text": "We had an amazing meal here and the show was fun. Went for the 6pm seating. This was booked for us so I honestly don’t know what the food was but it was delicious. I know the main course was a sea bass and short rib and there was a paella. The dessert was a five chocolate dish and the appetizer had three different tapas items. All of it was so good. The show was entertaining and I would definitely recommend if in Madrid.",
            "time": 1720608308,
            "translated": false
        },
        {
            "author_name": "Christine Day",
            "author_url": "https://www.google.com/maps/contrib/106268428978474334824/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW0yLKc4sFFB7crAGLh0ohqE3uGFGnBecBGwO_KE6-L6im6jAM=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 2,
            "relative_time_description": "2 weeks ago",
            "text": "We didn’t have the best experience at Corral de Moriera. We went to the early seating and show on a Saturday night which I definitely do NOT recommend. We arrived on time at 6:30 for the 8 PM show, but the place was so busy that we didn’t receive our 3rd and 4th courses until the show had started, so we ate those in complete darkness and were unable to see our food at all. It didn’t help that not once but three times, the server brought food or drinks to us that wasn’t ours. The tables were a mere hands-width (I measured) from each other - fortunately we had lovely people next to us but it was impossible to have any type of private conversation. The food was okay and nicely presented, but was barely lukewarm when it arrived. In my opinion, the food was not up to the expected standards of a Michelin-starred restaurant. We enjoyed the flamenco show but were seated in the far back corner against the wall so had difficulty seeing the entire stage, and I had to sit with my head turned to the left and leaning forward for an hour, which was uncomfortable. After the show we were rushed to the door so they could get ready for the next seating - this goes against everything we have seen of Spanish culture where one usually lingers after a meal. If the restaurant removed about 1/3 of its tables, it would make the entire experience for more pleasurable for the customer, but it is clear they simply want to make as much money from unsuspecting tourists as possible. I cannot recommend.",
            "time": 1731828516,
            "translated": false
        }
    ]
}