{
    "name": "Restaurante Fathe Pur",
    "rating": 4.4,
    "reviews": [
        {
            "author_name": "sk sabir Ahmed",
            "author_url": "https://www.google.com/maps/contrib/112877907025922025773/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ995j1BAfVe8C__8Kn8_WTMyIslDg5ryT_HWZgSIjJt1KS0w=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 5,
            "relative_time_description": "in the last week",
            "text": "The food quality was really good. Marvellous attitude of Abdul made it more proper. I would recommend others to go there and enjoy. I gave them 5 star for sure but one thing still surprised me that restaurant card like Edenred didn’t work there.",
            "time": 1732924377,
            "translated": false
        },
        {
            "author_name": "Saowaluk Rojpanichkul",
            "author_url": "https://www.google.com/maps/contrib/101901903193147733855/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVOg7DmmJZCRCZ8i5vN8I5ksJW71Fuu_4zIISaCgLFowF1U9BCM=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "I recently dined in with my friend at Fathe Pur and the food was absolutely delicious!!  we enjoyed our meals! Thanks to Abdul and the other guy!",
            "time": 1724583561,
            "translated": false
        },
        {
            "author_name": "bob green",
            "author_url": "https://www.google.com/maps/contrib/102849938044374764997/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKShYFky2c6cGcVXPkAxwzsRwkqBJtiY4V2ej9XmZ-4x7cw=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "We met and lunched with the marvelous Abdul! He provided outstanding service. We had the menu del día and it was the perfect portion of food. I had the chicken soup and my wife the cheese rolls. For the entire we had the chicken madras and vegetable masala dish. Medium spicy was definitely fine. Not too hot at all. The carrot cake and mango lasso desserts were a great finish. Our new favorite place for Indian food! Highly recommend.",
            "time": 1730123641,
            "translated": false
        },
        {
            "author_name": "Kevin William Charles Hunter",
            "author_url": "https://www.google.com/maps/contrib/109594725839207198247/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWnHtjcGgANu_PfgGzRLHFPcE3SfvkewgCyinAXqREeFseuW5U=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 5,
            "relative_time_description": "3 years ago",
            "text": "This is the second time I have been to this Indian restaurant.  It's walking distance from the metro Ibiza or the Gregorio Marañón General University Hospital.\n\nAs can be seen from the photos the decoration is colourful yet tasteful - I have never been to India so I am not sure if their decoration is authentic but it definitely feels like it takes you there. The food was nicely presented with various sauces and/or vegetables on top.\n\nThe service was fantastic both times that I have been here. This time I was by myself near the door and every time someone came in or out, the door was left ajar. I got up to close it once or twice, then the waiters there made sure I didn't get up again and were on the case.  The food was served quickly and piping hot.\n\nNow for the food, I have been here twice now and this time I had the menu of the day. With this, you get a starter (two Chicken Samosas) which were lovely, a main (Chicken Vindaloo), a side dish: rice or a Naan bread, dessert and a drink. I love spicy food  (although there was a time when I couldn't stand it), the hotter the better!  The taste of the Vindaloo is lovely, although both times I haven't found it that spicy - to a lot of people it is / will be spicy. The first time I made the mistake of thinking that the Phal could be ordered with lamb but here it can't and this time, as it was the menu, I knew what I was getting but still content with the taste.  I ordered the rice and, a beer and a Mango Lassi for dessert - I was a little greedy and ordered a Pashwani Naan, also. As it was the menu it was priced reasonable at around 11,50 € plus extra for the Nann bread .\n\nI would definitely recommend this place as it is not overpriced and you get your money's worth. The next time I go, I will be trying the Phal to see if it will blow my mind, as well as, my taste buds!",
            "time": 1636154658,
            "translated": false
        },
        {
            "author_name": "Jamie Gorman",
            "author_url": "https://www.google.com/maps/contrib/110261923316428955078/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKw1qS3zMnOk8HHvz7svE6WIRT97suvMZ2pq-YdDYxVSFnHCQ=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "Dined in Fathe Pur tonight and the food was absolutely delicious! The Korma really was a highlight and the service from Abdul excellent and attentive! Would recommend!",
            "time": 1728678112,
            "translated": false
        }
    ]
}