{
    "name": "Hôtel Kyriad Marseille Palais Des Congrès Vélodrome",
    "rating": 3.9,
    "reviews": [
        {
            "author_name": "C Iracema Morais",
            "author_url": "https://www.google.com/maps/contrib/106279214191082854224/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJxCZkFrVH3_UoQEBywZabDCKZO2JjT1xUgLZAwbA1ZE1dmjOE=s128-c0x00000000-cc-rp-mo",
            "rating": 4,
            "relative_time_description": "a month ago",
            "text": "We were very well received at Kyriad. It’s a cozy 3*. The staff is thoughtful and although not everyone spoke English they were always making the effort for the best communication and to make you feel welcome. Good price-quality relationship. We recommend it.",
            "time": 1729345353,
            "translated": false
        },
        {
            "author_name": "Anne Dio",
            "author_url": "https://www.google.com/maps/contrib/112030221132784445746/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIITMcP__Fm6tOLfP08zfXblogpHFkz_HNWwkIoemn36fEKRUM9=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "Good  facilities and great service ! My daughter has special needs and a wheelchair. And the bathroom was very convenient for her/us. There is the possibility to eat in the evening which is very useful when you get back from busy day. Also a pmr place in front of the hotel",
            "time": 1723815015,
            "translated": false
        },
        {
            "author_name": "Mekelle Revell",
            "author_url": "https://www.google.com/maps/contrib/100134077869546874626/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXdoiAghuwDCu7qXYXOG2fxkT_Lk9PPJaaOMt3vAbozkfzqdI6e=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "4 months ago",
            "text": "Stayed here for 4 nights for the Olympics. Great room, staff were a little intimidating at first but actually were really friendly and incredibly helpful! Room was clean and air conditioned, bed maybe one of the most comfortable I've ever slept in. They provided cold bottles of water in the lobby - a lifesaver in the heat! I didn't have breakfast so don't know about their offerings there.\n\nThe hotel is both conveniently and inconveniently located - if you want the Vélodrome then it's perfect. It's about 15 minutes to the metro station, although at the minute the walk is a bit confusing because of roadworks, and you do have to walk through a dark archway which could be intimidating for some people. You can technically walk to the hotel from the centre of the city, but I wouldn't put myself through that again personally.\n\nOverall I had an amazing stay, and will definitely stay again next time I'm in Marseille!",
            "time": 1722690927,
            "translated": false
        },
        {
            "author_name": "Emily De valk",
            "author_url": "https://www.google.com/maps/contrib/114784745104115598792/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ2lqZGfJHUB6l-8YM5VgSy_g7rFbg4uLb1gBUhKHna9eqtwA=s128-c0x00000000-cc-rp-mo",
            "rating": 1,
            "relative_time_description": "3 months ago",
            "text": "Me and my family had a bad experience here and this is why. The hotel lobby was nice and similar to the pictures, but the staff was not recognizable and not interested in giving you the best service.\nWhen we arrived we were shocked by the neighborhood the hotel was in. Garbage everywhere and dirty, dilapidated buildings. I wouldn’t recommend walking to the city center as we did not feel safe.\nThe rooms clean and provided with airco and the housekeeping does do their job very well. However we did not think the rooms looked like the pictures showed online and were a lot less cute looking than the lobby.\nNext disaster is the breakfast at the hotel. We paid 12,50 per person for absolutely nothing. There was no bread (no banquettes, toast, croissants or chocolate rolls), the egg boiling machine was broken, the fruit bowls were empty  and the coffe machine gives hot coco when you press cappuccino. The one woman that was supposed to refill everything was definitely not in a hurry to do her job. Being slow and uninterested when we noted her that there was no food. The other staff was also not in a hurry to give the service that we pay for.\nAnd by the way, learn French before you arrive because most of em don’t understand English.\nI gave one star to reach the owner of the hotel to make a change and not leave your guest hungry and grumpy.",
            "time": 1723633234,
            "translated": false
        },
        {
            "author_name": "P. M.",
            "author_url": "https://www.google.com/maps/contrib/116876365185537977710/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUvM7te0cFHQYHWSDU5qKZENNj1Jt9A9Mv0nD_4Exhp7ULVrUhW=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 1,
            "relative_time_description": "4 months ago",
            "text": "My Feedback is only for the young guy at the reception. I arrived today 2hrs earlier and wrote in the morning a message, asking if I could check in a bit earlier, no response received, so I asked at the reception when I arrived.\nDespite there was no option for an early check in which is ok, I felt me treated like \"not respected\" and not served well. I travel a lot and especially for french people from what rumors are saying I was suprised how friendly and courteous all so far were to me. Here, this young guy today never learned this job properly and is not understanding that I'm a guest and my experience might be crucial for the reputation of this hotel. I hope he will develop his english skills fir working in a hotel with foreign guest and moreover to use soft-skills when talking to guests. PS: He let check in others before me while I sit their for 2 hours at the lounge ... but nevemind, he didn't do it in purpose I'm sure.",
            "time": 1722947323,
            "translated": false
        }
    ]
}