{
    "name": "Hôtel Maison Montgrand Vieux-Port",
    "rating": 4.1,
    "reviews": [
        {
            "author_name": "Alina K",
            "author_url": "https://www.google.com/maps/contrib/114343606655022556826/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLelHdKhHZGk4-EGXoMgtt5xJFDEzXJoAFIH0RFBGqyNDOVfg=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 4,
            "relative_time_description": "5 months ago",
            "text": "The breakfast is disappointing. I was used to booking the hotel often because of their breakfast. But it seems that it changed. Or maybe my standards changed since I travel more. Anyway, the pain au chocolat are not good (overcooked or dry, other cake wasn’t good either), and the choice is small. I just liked the fruit salad and the bread. For a French hotel the pains au chocolat are very disappointing. Also the breakfast finishes at 10. I wish I have more time to sleep during vacations. If I wake up at 9/9:30 I don’t have time for the breakfast. Also in the rooms there ventilation in the bathroom has dust. Not pleasant to see this when taking a bath. I Hope you guys will improve. Because the location is great and the rooms are good.",
            "time": 1718813574,
            "translated": false
        },
        {
            "author_name": "Ronen Steinberg",
            "author_url": "https://www.google.com/maps/contrib/113172153001766842354/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWXjvRobwmTj0mOOYlWz77H9MYQSEylWSsTfktJpeCs4n32s1U=s128-c0x00000000-cc-rp-mo",
            "rating": 4,
            "relative_time_description": "6 months ago",
            "text": "We stayed here for two nights in May 2024. We were very satisfied. The rooms are simple, but thoughtfully designed. (We had a \"chambre superieure.\") Breakfast was great and reasonably priced (when compared to other hotels we stayed in in the same trip.) The employees and staff were great and helpful. Location is excellent. Overall, a very good quality/price ratio.",
            "time": 1716283087,
            "translated": false
        },
        {
            "author_name": "Anand Enebral",
            "author_url": "https://www.google.com/maps/contrib/111911155679836330920/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX0lA8BcawyjySWk2fiUNVJbn0wfrg7mKf5PhC6_Cn03l-WC4q5=s128-c0x00000000-cc-rp-mo-ba6",
            "rating": 5,
            "relative_time_description": "6 months ago",
            "text": "Wonderful hotel in the best possible part of Marseille, near the old port. The rooms are spread out over several buildings of the street, ours was in Batiment 50. I loved how big and fluffy the towels were. The room is small and so is the shower-room but it’s well designed, organised and comfortable.\n\nTo improve: drawers, there’s a place to hang your clothes but very small space for underwear so if you’re coming for a longer stay it’s difficult to organise your clothes.",
            "time": 1716365992,
            "translated": false
        },
        {
            "author_name": "Siobhan Cox",
            "author_url": "https://www.google.com/maps/contrib/112753263221859991955/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVxGmIi86TX7JTmTIlsObY4-w7Wu2tgBNQ4WiG-kmXvl6PLqOdRrg=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "a year ago",
            "text": "We stayed in building 41vroom 431 MILO. This Hotel exceeded our expectations. The room is spacious with couch, table and stools and very comfortable bed. Location was very quiet and beautiful high ceilings. In Australia we would likely say this was a shabby chic look with its mix of furniture and art.  We asked about where was good to eat and we were invited to eat at the hotel restaurant.  Now at this point we were thinking no way are falling for that trap! Wrong. We came back tired and liked the private courtyard away from the traffic and noise and therefore decided we'd give it a go. OH MY GOSH so beautiful.  The food was absolutely outstanding. Best dinner in France for sure and we came from Paris and had some beautiful dinners there. Thank you for such an amazing experience and stay in Marseille. Everything felt grand and our private air vinditioned space was a retreat from the busy streets.  A few small suggestions 1. Better hair-dryers as those fixed ones aren't great, option to get soap and shampoo conditioner would be helpful.",
            "time": 1692877988,
            "translated": false
        },
        {
            "author_name": "Mariano Tripiciano",
            "author_url": "https://www.google.com/maps/contrib/108739169387518482306/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUquCXVj8GnWvSXe-mPcme9DwN1fl5ymv1n3isgke3e8heq5RNi=s128-c0x00000000-cc-rp-mo",
            "rating": 1,
            "relative_time_description": "a year ago",
            "text": "I had a very disappointing experience during my stay at Maison Montgrand. I was traveling with my pregnant wife and 3 other couples, one of whom was also pregnant. When we arrived, we were shocked to see that the rooms were very dirty. The sheets were stained, the place was very dirty in general, and there were bloodstains all over the place. We complained to the front desk, but they were unable to clean the rooms or move us to another room, except for one couple that did get a new room.\n\nThe next day, we all decided to check out of Maison Montgrand and move to Hotel C2, which was a few blocks away. Hotel C2 was much cleaner and more luxurious than Maison Montgrand, and it was the same price. We were very happy with our decision to switch hotels.\n\nIn addition to the cleanliness issues, we were also disappointed with the fact that the pictures on Maison Montgrand's website did not accurately represent the hotel. The pictures made the hotel look much nicer than it actually was. We felt that we had been misled by the pictures as the place is more like a hostel than a hotel.\n\nWe also had a problem with the manager of Maison Montgrand that promised to reimburse us for the two dirty rooms, but she never did. We called her several times, but it was impossible to talk as she is in an endless meeting. We believe that this is very unprofessional behavior for a hotel manager.\n\nOverall, we had a very negative experience at Maison Montgrand. We would not recommend this hotel to anyone.\nShe will try to put excuses in the reply of my review but what I wrote is the pure truth.",
            "time": 1692807715,
            "translated": false
        }
    ]
}