{
    "name": "Nul Part Ailleurs",
    "rating": 4.3,
    "reviews": [
        {
            "author_name": "Ian Krasovskii",
            "author_url": "https://www.google.com/maps/contrib/117217819306543785165/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU5UCUnyZtjziktC20N90nzMLrEphZHSlsh_RTd2lC87CmL_8EbRw=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "Great atmosphere! The food is very good. Waiters are friendly and professional!\nRecommend!",
            "time": 1723202622,
            "translated": false
        },
        {
            "author_name": "Simon Maingay",
            "author_url": "https://www.google.com/maps/contrib/112401791760979780122/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKlRg1Gunl1zLSxuw7WEl0cLdpZhomoPugqdXu5l-MOK8Lu=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 4,
            "relative_time_description": "a year ago",
            "text": "Good and fast food, only 4 stars because lasagna was stone cold in the middle, no apology from the waitress and they never asked once if it was OK once they'd re heated it. Food tasted good though, I think it's all pre made then heated up, hence the quick service. One waitress was super friendly, the other wasn't.",
            "time": 1693570387,
            "translated": false
        },
        {
            "author_name": "Michael Verzeilberg",
            "author_url": "https://www.google.com/maps/contrib/111560842629424504680/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXFyXPYSSWQabmgPBvZyPJyBhTziyXwrkl0tjNynDuSrnIE2X6_bQ=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 1,
            "relative_time_description": "2 months ago",
            "text": "Do not go here food was horrible. The service was shockingly bad from the start. The waiters were disinterested and rude, by only asking if we could take a seat. Treating us with blatant hostility and impatience.\n\nOur dishes arrived separately, which should be okay because we ordered seperate, if it wasn’t for the second ordered dish to show up earlier and the dishes were horrid—bland. To make matters worse, the water we got showed up only after we finished our meal. The combination of terrible food and abysmal service made this dining experience a complete disaster. I've had more kindness and good service at a fast food restaurant, which ironically outperformed this establishment's so-called “fine dining” approach.\n\nI never complained like this in a review, but this was the most worse experience in a restaurant, we have ever encountered.",
            "time": 1727386479,
            "translated": false
        },
        {
            "author_name": "Edward Sealy",
            "author_url": "https://www.google.com/maps/contrib/103261115036386459120/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJeFL1-oos-KTf62gghB7FAF4KoYj03zLdGBxWBEaRQb2V57Q=s128-c0x00000000-cc-rp-mo",
            "rating": 1,
            "relative_time_description": "a month ago",
            "text": "We had a recommendation for this place from a taxi driver from the airport. He actually gave some great recommendations, but this one was very poor.\nWe sat in the bar next door and enjoyed a few drinks before coming over, and everything looked good. The restaurant looked quiet but we assumed that, because it was off season, it was unlikely to be packed. When we sat down the waiter was courteous and welcoming. We ordered panisses to start, and octopus and entrecôte for a main.\n\nThe panisses arrived and were very obviously cooked from frozen. As this can happen in Marseilles, it didn’t raise any eyebrows. Although, the lack of aioli or any sauce was strange.\n\nThe main arrived and the octopus was very nice. The beef was also good and well cooked. However, the “peppercorn sauce” was based very obviously on mint, so much so that it tasted more like toothpaste than a sauce to be enjoyed at a restaurant. When we notified the friendly waiter, he immediately became hostile and conceded to give us a bottled mustard sauce as a substitute. He then studiously avoided our table until we told him again that the sauce wasn’t peppercorn, but peppermint. Instead of acknowledging the feedback and accepting the mistake, the previously friendly waiter insisted that they had served the sauce TWO HUNDRED TIMES that day and received no complaints. At this point, having been aware of the traffic into and out of the restaurant before arriving, we gave up on trying to reason with them, quietly paid, and left. The staff were very offended by our dislike of their toothpaste peppermint sauce and made their feelings known as they accepted €87 of payment.\n\nI never really understood the phrase “mauvais fois” before this evening.\nSo I console myself that €87 is a small price to pay for my continued french education. Merci, nul part ailleurs.",
            "time": 1730499559,
            "translated": false
        },
        {
            "author_name": "Anawa43",
            "author_url": "https://www.google.com/maps/contrib/103273331897026319808/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXZJsUNY-1RNNAjGKiuB5uDIJ1QobZblBtW0L2qc2Mxqr3LX14=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "3 years ago",
            "text": "Been many times since 2018 finally makes some time to review ⭐️⭐️⭐️⭐️⭐️ excellent place, good view, good people, and the most is excellent service and the food is delicious 😋 🥘  I my self recommend Nul for lunch and dinner 🍽",
            "time": 1632396926,
            "translated": false
        }
    ]
}