{
    "name": "Le Rhul",
    "rating": 4,
    "reviews": [
        {
            "author_name": "Judy Owen",
            "author_url": "https://www.google.com/maps/contrib/104108526425903799901/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWoOBlgsyZNARgNli9novMGcsRa0yFop1Avtyw_HfcRqANgxyw3_Q=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "4 months ago",
            "text": "This was a quirky style hotel with modern amenities, fantastic staff, and the room service breakfast served on the private terrace each morning was a joy! We absolutely loved the location just off the beaten path nestled in a neighborhood. Easy walk to many great restaurants, bakeries, and shops.  Great value for the money.\n\nThings to be aware of (didn't bother us but could be an issue): 1. There is air conditioning, but it's governed at a temp just cooler than outside in July... so the room was warm even with air.  2. No elevators, so up the steps to the hotel built into a hillside and then to the room. For us, this added to charm but could be an accessibility issue.",
            "time": 1722752234,
            "translated": false
        },
        {
            "author_name": "Ceren Demirci",
            "author_url": "https://www.google.com/maps/contrib/102817223533986549625/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ_hPpdwstCMXquh-ZmRFkF71rc7jJlZmKzEEeS8Aza84g4JQ=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "We visited Marseille for a congress and had a wonderful hospitality experience.  Dear Anais helped us a lot, she is a lifesaver and we will never forget her kindness.",
            "time": 1730222494,
            "translated": false
        },
        {
            "author_name": "Hank Mierzwa",
            "author_url": "https://www.google.com/maps/contrib/110974334266144792901/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJNSimMs17KBgOLciY0WOajUuBfZPwABgvc1nPJf-xLKZeupTg=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 3,
            "relative_time_description": "2 months ago",
            "text": "Pretentious wait staff who seemed annoyed to service us. Poured the wine and dripped it over the table after the pour. White wine served with ice. Bouillabaise had to be constantly warmed up as the broth came 1st and the fishes as a secondary.",
            "time": 1726776644,
            "translated": false
        },
        {
            "author_name": "Freddie Jackson",
            "author_url": "https://www.google.com/maps/contrib/107511129297628039411/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLFQ16eRLi9abxVqjNoO-wUw2cHNSXa50Dd5C5Iw-LPNwCh0A=s128-c0x00000000-cc-rp-mo",
            "rating": 1,
            "relative_time_description": "10 months ago",
            "text": "Came excited for a nice meal to find that our waiter was exceedingly rude, the food was overpriced and poor (do not get their signature bouillabaisse). The steak was very nice but the seafood was impressively badly cooked in general given that they are a primarily seafood restaurant.\n\nI’ve had better enjoyed kebabs.",
            "time": 1707142681,
            "translated": false
        },
        {
            "author_name": "Fred M",
            "author_url": "https://www.google.com/maps/contrib/113606585502555690781/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWcVVun90BT1TW69fudKre-B4e0lcwl8yyE-PJrVfYTVAsArHCz=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "a year ago",
            "text": "We spent a memorable day & night at Hotel Le Rhul to leave the crowds around the Old Port behind us, enjoy some well-deserved relaxation in a seaside hotel, and try its renowned restaurant.\nThe place deserves its fame for the restaurant, offering good food, very good service, all at an still acceptable price point. The hotel (officially 3 stars) is fine but less impressive, although we had a Privilege double room with terrace at a hefty 234€ in early August). The room was small (~15 sqm), the terrace large, the air conditioning excellent yet quiet, the bathroom without a window but still in good condition if only for one loose fixture in the bathtub/shower and a couple of ants crawling the floor (no big deal). At this price point, we would have wished for a few more in-room amenities (no slippers, even on request, no toothbrush nor -paste, so don’t forget to bring your own) given the steep price, irrespective of the number of stars. On the plus side, the view of the Mediterranean Sea is amazing, and in theory, descending a stairway outside the premises, you could even take a bath in the sea from a couple of rocks. The breakfast (9,80€), despite a generous pot a good coffee, was disappointing though, especially the pastries (dry), the fruit salad (probably canned), with notable absences milk alternatives and sweetener.\nThe restaurant is of a high level, with almost impeccably professional service. The 3 or so waiters that attended to our needs were all very friendly, humble and obliging.\nThe Bouillabaisse (68€) was really good, the price expected, surely a bit steep but overall acceptable given the level of service and professionalism. The staff made one mistake though as per the restaurant’s own Bouillabaisse Charta, which is that even though we were shown the fish that was going to be served, it wasn’t filleted in front of us. Our verdict: 4/5 for the hotel, 5/5 for the restaurant, 5/5 as a whole.",
            "time": 1691338459,
            "translated": false
        }
    ]
}