{
    "name": "Le Petit Nice Passedat - Hôtel 5 étoiles Relais & Châteaux",
    "rating": 4.3,
    "reviews": [
        {
            "author_name": "Tom G",
            "author_url": "https://www.google.com/maps/contrib/100697819700515164474/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVN45TH5AegQ23ofPG_ETdhN092uARgrYf-kZix5jtbe4JXoy-dww=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "I knew I was in for multi course seafood-focused meal and it was exceptional. One of the finest meals I’ve had and one of the best meals I had along the Cote D’Azur. Course after course was artfully plated and impeccably served. And it was all delicious.  A three-star delight. The room was spare but stylish. Despite being a multi-star establishment it felt relaxed and understated. But if you have the full tasting menu, know you’re in for a few hours for dinner. It was a great dinner and a great evening. A truly memorable experience.",
            "time": 1726143914,
            "translated": false
        },
        {
            "author_name": "H G",
            "author_url": "https://www.google.com/maps/contrib/112561986924038804181/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU76nruImIuv7Nf1XEBiAvpWlBdlNtPNe1iMbxQHkBQIRJrD2xhyA=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 3,
            "relative_time_description": "4 months ago",
            "text": "Disclaimer: I’m not a big fan of fish and didn’t realize the set menu was literally all fish. If you love fish maybe you’d like this place better than me but my experience wasn’t great as I was hoping for more variety in the type of seafood they served. The dishes were just too ‘fishy’ for me as the chef specialized in smoked and cured fish. The location and service was fantastic, we had a really nice window view of the Mediterranean. If you come you really gotta love fish in all its flavours and styles.",
            "time": 1721571802,
            "translated": false
        },
        {
            "author_name": "Jeremiah Bickham",
            "author_url": "https://www.google.com/maps/contrib/117911572859037933702/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVbCetxI9hTmVexnLHMTkJCbzSQ2gCHh1QMiS9JeyrRFeMCbfwL=s128-c0x00000000-cc-rp-mo",
            "rating": 2,
            "relative_time_description": "5 months ago",
            "text": "This was the most disappointing experience at a Michelin * restaurant, at any star level, that I’ve ever had (note: I’ve eaten at dozens of Michelin * restaurants around the world, including 9 different 3 stars). Our experience was so bad it’s actually making me question the fidelity of the Michelin rating system overall.\n\nThe menu is very, very fish forward. In fact, all dishes (on this particular menu) revolve around seafood dishes from the area. Counterintuitively, the WORST part of every plate was the fish. All other ingredients were beautifully selected, prepared and presented, but the fish was either flavorless or unpleasantly pungent (“fishy” one might say). We also had minor service issues, mostly at the beginning, but those were minor enough and the staff recovered enough to where that alone couldn’t not wreck the experience. Usually when I leave a three star I am uncomfortably full; this time I was hungry.\n\nWe spent the 10 days prior to this dinner eating at Michelin * restaurants in the area eating ALL THESE SAME fish and loved them, so it is mind blowing how at this restaurant all the fish we cherished in the days before were so bad.\n\nI’ve never left a restaurant review before but felt compelled to here. Trying new restaurants in one of my greatest joys in life and I plan my vacations around food. I know this is a hard business and these folks are working under tremendous pressure every day but this place needs to figure things out before it can hold itself out to the public as a 3* experience.",
            "time": 1720368467,
            "translated": false
        },
        {
            "author_name": "Johann Dierking",
            "author_url": "https://www.google.com/maps/contrib/100163629288059326937/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK7EJ7t-5wZ1e2_SBZnrmnKighrM1EyacNgksKo6C4tTwzQVw=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "Amazing location with sea views from the rooms, restaurants and terraces. You can borrow towels and mats to go down to the rocky beach (about 20 meters from the hotel’s entrance door). Breakfast is served à la carte with freshly squeezed juices (the green juice is to be mentioned especially!), both cow and plant based milks, and really great Viennoiseries. It is quite a formal environment, so you might feel a little underdressed when you meet the staff in their suits & dresses whilst yourself is on holiday mode. All people I met were great! All in all to be recommended!",
            "time": 1729174576,
            "translated": false
        },
        {
            "author_name": "Harry Cornes",
            "author_url": "https://www.google.com/maps/contrib/111017265409297592462/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUW1db9ou7ZR7c8jdxO9JqMJ4174EnJ9qZK0HovIkJhKlIgY4k=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "Stopped by for a drink and cigar on the terrace with a friend visiting Marseille. 2 x spritz, 1 x rosé and a Diet Coke. Prices for the spritz are to be expected in an establishment as this (around €29 each). But overall the service was great, view even better, and the olives and nuts were a nice addition. Will be back. To note; the door to enter was hidden, signs could be better.",
            "time": 1724620046,
            "translated": false
        }
    ]
}