{
    "name": "L'Épuisette",
    "rating": 4.6,
    "reviews": [
        {
            "author_name": "Chris Lange",
            "author_url": "https://www.google.com/maps/contrib/113280147552564670812/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKn7Jq_XyydjheKJj4ckgyw8pHClbLSahbBH_9IbpPNyQ2E-w=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "Incredible nice restaurant just a little bit outside the bustling city center. We opted for a 9 course menu and enjoyed every single course. The service was very attentive and the sommerlier did an amazing job suggesting pairing wines. I will definitely come back",
            "time": 1728202644,
            "translated": false
        },
        {
            "author_name": "Chang Allen",
            "author_url": "https://www.google.com/maps/contrib/108148778859764206707/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXQoyoZdJ4aEBNH9Scw-8MKCKUQf1-ZHopNi9du7c2OJK66a9a2Rw=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "4 weeks ago",
            "text": "Highly recommended to have your lunch here.\nL’Epuisette is a restaurant right next to Mediterranean Sea.\nYou can see Château d'If by the window seats.\n\nThe service was nice. We are from Taiwan and waitress said “你好” to us with smile.\n\nAnd the most remarkable was their Aspic of Bouillabaisse which was a aspic reach of the flavor of Bouillabaisse.\n\nThe second remarkable was “Red mullet, cooked and raw Tomato water and Kimchi butter.”\nWe are from Asia and familiar with Kimchi. I must say this was the best Kimchi dish. The flavor was balanced and really tasty. It was out of the way how Asian use Kimchi in dishes. Really surprised. And the red mullet was cooked perfectly.\n\nFinally, the petit four cart was cute. You can choose anything you wanted.\n\nReasonable price, high quality cooking, beautiful sea view.",
            "time": 1730966655,
            "translated": false
        },
        {
            "author_name": "Samuele Saini",
            "author_url": "https://www.google.com/maps/contrib/102615448235462438761/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX0_FroJDt8u3JFixjBtHqnkFnmHD9Vf95A831xrdjFwBRkyIS-Ag=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 5,
            "relative_time_description": "5 months ago",
            "text": "On a summer sunny day, L’Epuisette was the ideal venue for a lunch by the seaside. Came for the views of the seawater pool through the floor to ceiling windows, left in love for the bouillabaisse menu. Served in 3 difference dish, as a mousse, a soup with croutons and as 5-fish filets in sauce, this iconic and flavorful seafood dish is a must for everyone visiting Marseille. I found myself thinking how this restaurant or then-kiosk by the sea would have been decades and decades ago… times go by, cuisine evolve, only the sea remains the same.",
            "time": 1718739732,
            "translated": false
        },
        {
            "author_name": "apple apple",
            "author_url": "https://www.google.com/maps/contrib/103784366862694466197/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKM6u2xIOn6ZDMqXkbE_-kqI6hIwJ1bEYw36_w6eayqNkOieA=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 3,
            "relative_time_description": "a month ago",
            "text": "We had the Marius set menu for lunch. The food was ok but definitely not worth a Michelin one-star status.\n\nThe protagonist of the menu is Bouillabaisse but by the forth dish, it gets a bit boring and uninspiring.\nThe Rock fish soup is too salty for our taste and we had to take it with bread to balance it out. The main course, different types of fish poached in soup, is no good; fish was overcooked and had no flavor that you would expect from fresh fish. The soup which the fish is soaked in too similar to the rock fish soup (or is the same?) they served in previous course. The soup’s taste was strong and too salty that it overshadowed whatever little flavor that was in the fish. The two courses were basically the same, except for the fish added to it.\nThe dessert from the trolley are all no good either.\n\nThe staffs were standoffish and pretentious. They had a “get-down-to-business’ attitude and had prioritized the food’s presentation than caring about the customers. Despite the beautiful view, we did not find the atmosphere relaxing nor the lunch enjoyable.",
            "time": 1729574348,
            "translated": false
        },
        {
            "author_name": "Tobias",
            "author_url": "https://www.google.com/maps/contrib/100961276505003219060/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI9jPQWta-yYOS_tCxgesoMUUlrkks1iMfObqVHsEcqqUJgmQ=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 3,
            "relative_time_description": "a year ago",
            "text": "The restaurant has an interesting location almost in the water. It really is a seafood restaurant - the Michelin Guide marked it as offering vegetarian options but this cannot be recommended, they simply leave out the fish, often without adjusting the quantity of the rest. I had a regular tasting menu with fish and enjoyed a few clever surprises such as the cocoa seafood foam and the shrimp with its exquisite texture but I cannot say that overall I was wowed - this week I've eaten at several restaurants \"only\" featuring a Big Gourmand in the Michelin guide that honestly seemed worthier of a star. If you come here during the dark season, lunch probably is best as you then can enjoy what must be a spectacular view of the sea.",
            "time": 1699484549,
            "translated": false
        }
    ]
}