{
    "name": "Rosa Grand",
    "rating": 4.3,
    "reviews": [
        {
            "author_name": "Jeff Flemings",
            "author_url": "https://www.google.com/maps/contrib/118406251005174057852/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJa8i5IqretOi0FPFX4MUKLnn2Kzu5op1SYQJVEGdt5Txn6_xU=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a week ago",
            "text": "We had a wonderful 2 bed/2.5 bath suite for 7 nights last week and had a wonderful time. Very up to date, well appointed, comfortable. A bit of street noise from our 2nd floor location but not enough to really bother us. Wonderful location 5 minutes to Duomo. Very helpful staff. If you go for the more \"upscale\" side of the hotel (which I believe costs more) you get access to a lovely eating/relaxation area with its own concierge. Free breakfast and snacks throughout the day! Can't wait to return. Highly recommended.",
            "time": 1732622143,
            "translated": false
        },
        {
            "author_name": "Tina Baghdasaryan",
            "author_url": "https://www.google.com/maps/contrib/117834295597964132291/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU_5M9YE8s5faJ_SDC64ch6at_AMk8C87pr7OjSiqACIpDgL-iZpA=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "2 weeks ago",
            "text": "The Rosa Grand Hotel in Milan is nothing short of exceptional! This was our third time returning, and it continues to impress us every time. From the moment we booked, the concierge team reached out to assist us with reservations and recommendations—even before we checked in. Their exceptional customer service and attention to detail truly set the standard.\n\nThe location is unbeatable, right in the heart of Milan, making it incredibly convenient to explore the city’s top attractions, shops, and restaurants. Whether it’s for business or leisure, this hotel offers everything you could need.\n\nThe staff are warm, professional, and always go above and beyond to ensure a memorable stay. The beautifully appointed rooms and luxurious atmosphere keep us coming back. For anyone visiting Milan, Rosa Grand is a must—there’s no place like it!",
            "time": 1731785860,
            "translated": false
        },
        {
            "author_name": "Raghu Raman",
            "author_url": "https://www.google.com/maps/contrib/103034102070317838166/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUGrSu3T1ocki9JnZiKxApL7P3W_B1nDYWbEhe_qVmJulTooSgi=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 1,
            "relative_time_description": "a month ago",
            "text": "Trust my review and do not stay in this hotel. If location is important to you then by all means consider it but otherwise run away!!  Firstly, It took us forever to check in because the hotel staff were very slow. We could tell they were taking their sweet time and making small talks to everyone.\n\nWhen we got to the room we noticed that it was really warm. Turned on the AC but it was not working! It was literally a sauna! Called the concierge and they said it was due to the AC getting changed for the winter! They offered a pathetic fan instead and offered no compensation! Imagine paying almost 500 CAD per night and getting this in return!\n\nThe breakfast buffet was just disappointing and disgusting. The scramble eggs tasted like eating a tub of wet cement.\n\nWhen we were checking out we asked for a compensation or at least some service recovery and the lady said there wasn’t anything she could do. So there you go! Stay there at your own risk!",
            "time": 1730703334,
            "translated": false
        },
        {
            "author_name": "Francesca",
            "author_url": "https://www.google.com/maps/contrib/117722299325743429370/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUl5hIxuLhjCyeNJ2Sh40UK5U_6hOpji4ws0fHeT-kv5533AUiH=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "a week ago",
            "text": "Central location, spacious and comfortable rooms, excellent service. great breakfast with a wide choice of dishes, and high quality of products. Very clean, with a pleasant perfume all around. Recommended!!",
            "time": 1732588828,
            "translated": false
        },
        {
            "author_name": "MN",
            "author_url": "https://www.google.com/maps/contrib/109314724234605829203/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV2fGivPHWS9QxOparpcnxg6O8oJp1C57TF7w_E6TxKRVeKnVBK=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "We will be staying at Rosa Grand for 5 nights. This is our first day in Milan. We appreciate the clean rooms, friendly service and in particular, beautiful breakfast. The  coffee this morning 25/9/24 at the breakfast buffet was made with LOVE and SMILE  ( a big smiley face on the foam of the cappuccino) by a very special barista. We thoroughly enjoyed it.  It's the fine details such as this make  our stay memorable 😃!",
            "time": 1727259754,
            "translated": false
        }
    ]
}