{
    "name": "UNAHOTELS Cusani Milano",
    "rating": 4.3,
    "reviews": [
        {
            "author_name": "Eric K",
            "author_url": "https://www.google.com/maps/contrib/110856435371543272720/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL3m-w_jtQsq0m6NEHAl0_OuSU2M-Y65oo4ZUhxpURMyF5hcA=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 2,
            "relative_time_description": "a month ago",
            "text": "I stayed here October 11-14, 2024.  Friday night to Monday morning.  The location is very good for seeing Milan sights.  All staff with one front desk exception were extremely friendly and helpful.  I cannot say the room I was in was good.  It is small.  It is a good thing there are many places to see and roam to because spending any time in the room was miserable.  The air conditioning/heat for the room is controlled by the hotel even though there is a controller in the room.  The room was constantly +24.3C which for me is too hot m, especially when the temperature outside is +19C.  I advised staff the first night (Friday) and was advised they were booked and nothing could be done due to their preparation for Winter.  I turned the air conditioning unit off in my room and opened the window to sleep.  I was covered with Mosquito bites in the morning since they do not install screens on windows in Europe.  You would think a National that is pushing “Green” would be happy people want outdoor air.",
            "time": 1728891833,
            "translated": false
        },
        {
            "author_name": "Olivia H",
            "author_url": "https://www.google.com/maps/contrib/103932089965773867525/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI9ZhEoU4-FBkAmx1J3JCI-ugZE3mf9WNHX_xU1B_ZjeRFT=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "3 weeks ago",
            "text": "We had a pleasant stay at UNAHOTELS Cusani Milano. Upon check-in, we were initially given an upgraded room facing the tram line and street, but due to the noise from trams running until 1 am, we requested to return to our original room. The staff were very understanding and accommodating.\n\nThe hotel itself was comfortable, with excellent service, and was very centrally located, making it ideal for exploring Milan’s attractions. Overall, a lovely experience with a team that genuinely cares about guest comfort and convenience.",
            "time": 1731126658,
            "translated": false
        },
        {
            "author_name": "Anne Rodas",
            "author_url": "https://www.google.com/maps/contrib/114297492556577790392/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJwZfpekScnxRamtMBDhKr3M2uZxyHAbqJpNjeWMi0_fUt5Pg=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "The staff are incredible! Helpful and ready to meet your every  need. The room size was lovely. The bathroom in my room was a little old/run down looking, but everything else was great! Fantastic location, beautiful breakfast, impeccable staff and customer service.",
            "time": 1726499173,
            "translated": false
        },
        {
            "author_name": "Sharon Lambourne",
            "author_url": "https://www.google.com/maps/contrib/101528181226019105403/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXmG4pJRUkomTYklPQOMDwIkgMeqNWsgxPpyH_ZljLyyIebEBw=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 4,
            "relative_time_description": "a month ago",
            "text": "Location is great, can't be faulted. Room is a bit tatty with window view over \"courtyard\" but far too hot in the room with no air con!!\nNice coffee in the room but don't like paper cups... yeah! Call me a snob!!",
            "time": 1729449411,
            "translated": false
        },
        {
            "author_name": "Lærke Voergaard Pade",
            "author_url": "https://www.google.com/maps/contrib/101703854016179057420/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXMoeddZdbv7S4ue-mQyD69DomWmxIjfTEk7gkA3O6Uw0J1jW06nQ=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "a week ago",
            "text": "This place is much better than I thought, especially the reception staff. I was in a bad mood when arriving and were throwing tantrums but they did really everything to make my stay perfect. Actually I’d say this is probably the best staff I’ve encountered in Italy.\n\nThank you for keeping your head cool and serving me plenty more options than I deserved.\n\nGrazie mille.",
            "time": 1732290224,
            "translated": false
        }
    ]
}