{
    "name": "Château Monfort",
    "rating": 4.7,
    "reviews": [
        {
            "author_name": "Gazza. NZ",
            "author_url": "https://www.google.com/maps/contrib/117335123242368558485/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXiVxKKXcyu27wGqtGopwnES6WZt0lf8hFGoUJyUSh8No-u_YpQ=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "3 weeks ago",
            "text": "Highly recommend the Château Monfort. It's ideally located to bus, tram, metro stops and coffee shops with central Milan within walking distance.\n\nIn terms of noise the room was well soundproofed and experienced no interruptions during those peaceful evenings. Fantastic hotel, great style, good service, welcoming and friendly staff.\n\nWe experienced one small friction point regarding changes to a meal to suit dietary preferences (dealt with) but does not distract from the overall enjoyment of being here.",
            "time": 1731254193,
            "translated": false
        },
        {
            "author_name": "Kivanc Turkoglu",
            "author_url": "https://www.google.com/maps/contrib/109090865307266185663/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJjXkO_mAMcdU3YBKVyWGKPGV7bT93Ucmjb2_ZD_Qo_83bC=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "First of all, the staff was incredibly friendly and attentive. They were very helpful in every way. The hotel's architecture is very beautiful and the location is very comfortable. We were very pleased, I definitely recommend you to go. We were worried about parking, but there is parking on the side of the road around the hotel, you don't have to go to the paid parking lot.",
            "time": 1729316809,
            "translated": false
        },
        {
            "author_name": "Chibuzo Obi",
            "author_url": "https://www.google.com/maps/contrib/100526641249533234886/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVjFEHT2yvbrdiGilm6WWFgdS3eWQHgrNSl5HgZLyKqcfILLzPy=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "It has been years since we visited Milano, and I still have fond memories from when we stayed at Hotel Monfort on birthday trip to Italy. This hotel is absolutely amazing, and its service is top notch. It is also close enough to many of the attractions and restaurants - which adds to the excitement. The suite we stayed in was well furnished and beautifully adorned. In addition, they made my birthday special with some little surprises. I highly recommend this place.",
            "time": 1726682180,
            "translated": false
        },
        {
            "author_name": "Lady Invisible",
            "author_url": "https://www.google.com/maps/contrib/117284123355008732689/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLUi3Q0NIPZ5aeJGD3PQsxEWIHqrr5-qlcJElo92ALeBsR84g=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "Beautiful hotel! Our room was gorgeous - unfortunately also quite dusty as it had a floating ceiling design which would make cleaning a challenge. So we sneezed!\n\nOther than that, we couldn’t fault it. The breakfasts were amazing - probably the best I’ve ever had due to the curation and quality of the ingredients.\n\nWe had an issue with the hotel iron which ruined a brand new white shirt, adding to some upset on the holiday. The money for the shirt was eventually refunded.\n\nAll in all, great service, beautiful decor, delicious breakfasts - they just need to brush up on housekeeping!",
            "time": 1730239116,
            "translated": false
        },
        {
            "author_name": "Shirin Manjili",
            "author_url": "https://www.google.com/maps/contrib/102688985972477172718/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVeacs8DctIp71P2x2MExdRmDXzgwwYLlHA0ewV4MiFOqVgfPoG=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "Absolutely spectacular hotel with great service in a prime location. The whole place smells divine and the staff are very friendly and respectful. Spa was a 10/10, the piano player at the lounge wad very romantic, room size is great, breakfast can be improved upon when it comes to variety. Overall very satisfactory stay.",
            "time": 1726668352,
            "translated": false
        }
    ]
}