{
    "name": "Radisson Blu Hotel Milan",
    "rating": 4.4,
    "reviews": [
        {
            "author_name": "Ahmad Al Nabulsi",
            "author_url": "https://www.google.com/maps/contrib/106156272397305320323/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWeoQflq9Om4qEj2wFumF_ZxyOWikr5rxbDl1OsV0tHm5RY4KHr=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "2 weeks ago",
            "text": "I had an excellent experience at this hotel, thanks to the outstanding staff who went above and beyond to make my stay comfortable and stress-free.\n\nA special thanks to Marco, who welcomed me warmly and arranged a room for me immediately upon my arrival, which I greatly appreciated after a tiring journey. His assistance didn’t stop there—he also organized seamless transportation for my guests from the airport to the hotel, ensuring everything went smoothly.\n\nI would also like to thank Tiziana for reserving a fantastic restaurant for me and my guests. Her recommendation was perfect, and we truly enjoyed the experience.\n\nAdditionally, Carla was incredibly supportive and helpful throughout my stay, always ready to assist with anything we needed.\n\nThe staff’s professionalism and hospitality truly made a difference. I highly recommend this hotel and will definitely return!",
            "time": 1732093632,
            "translated": false
        },
        {
            "author_name": "Annred Kavita",
            "author_url": "https://www.google.com/maps/contrib/118303856285296382275/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKjD2XhueVw0uqyfSsVR6fvy1OVNBpAq6zZ-Q3uyXnSgHOnww=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "I’m currently staying at Radisson blu hotel Milano, and I’m absolutely loving every moment! The staff has gone above and beyond to make me feel at home—they’re always friendly and attentive. My room is spacious, beautifully designed, and kept impeccably clean each day. I’m really enjoying the amenities, especially the pool and the on-site restaurant, which has delicious food. The location is fantastic, close to everything I need. It’s been such a relaxing and enjoyable experience so far—I couldn’t ask for more!",
            "time": 1730373955,
            "translated": false
        },
        {
            "author_name": "Aliaa Elsayed",
            "author_url": "https://www.google.com/maps/contrib/102452194361359106470/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKohNgA_eeJfZnV_lNxmA46vPoWXRzT_LlPrWJhK8XNYoUVSvCB=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 3,
            "relative_time_description": "3 months ago",
            "text": "All of the receptionists are extremely professional and helpful and they are trying their best to deliver a perfect service (explains the positive reviews) but the hotel facilities are not up to expectations, especially in comparison to other Radisson Blu hotels. The hotel is in dire need for renovation. The walls are dirty and humidity damaged many corners. The pool was closed one day for maintenance and one of the sauna rooms was not functional. The showers in the room were the worst, the first room we were in the frame was completely coming off and maintenance was not able to fix on the spot so the receptionist changed our rooms. The one we settled in, the shower cabinet door was not stable but the shower was functional (after asking maintenance to unclog the shower as it was not draining). The beds and pillows were super comfortable but the hotel could use new bedding as some were stained.  Room service was really good and provided us with a mosquito repellent device when asked. The staff tried to compensate us as much as possible by offering us free drinks and breakfast which was super nice. But, hotel management should really pay attention to facilities especially the rooms for a better customer experience. Overall, the hotel is functional but not more.",
            "time": 1725102544,
            "translated": false
        },
        {
            "author_name": "Fab",
            "author_url": "https://www.google.com/maps/contrib/113774181719065529524/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIdkBI7tPqSofOm2ada_ZSFtKycplsV-jbB11dxPrxDHie39g=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "We really enjoyed our stay. The area although not central to the city, is quiet but still connected. The rooms are modern and clean. We had two minor inconveniences and they were promptly handled by the staff. We enjoyed a stunning view of the city having a room  on the top floors. The staff was always amazing and especially Alessandro who gave us a really friendly and warm welcome as we checked in!",
            "time": 1730762417,
            "translated": false
        },
        {
            "author_name": "Brooke Beach",
            "author_url": "https://www.google.com/maps/contrib/104048177952313070121/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIeE7KOUlho5WGA_Yzz5EnNaa-4RlODBA2Q5njFrzrYfT5cGQ=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "Stayed here for a work trip.  Can't recommend it enough! It's in a quiet location but close to the City Center.  The staff were so lovely and accommodating (especially the breakfast room staff!).  I would definitely stay here again and will be recommending this hotel to friends/coworkers coming to Milan in the future.",
            "time": 1730282704,
            "translated": false
        }
    ]
}