{
    "name": "Hotel Raffaello",
    "rating": 4.2,
    "reviews": [
        {
            "author_name": "Nabeel Paroya",
            "author_url": "https://www.google.com/maps/contrib/104875561058661822810/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVLSZhG2hkruoAO9_9nzIVSlv7OkEwG7DjCQ-SwHZuS_zroOyNb=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 4,
            "relative_time_description": "2 weeks ago",
            "text": "I recently stayed at Hotel Raffaelo and overall, it was a pleasant experience. The rooms were spacious, clean, and comfortable, which made for a relaxing stay. However, there were a few minor inconveniences. The hotel car park was fully booked, so I had to park on the road, which wasn’t ideal. Additionally, there was no kettle in the room initially, but the helpful staff, especially Mr. Marco, quickly arranged one for us, which was much appreciated.\n\nWhat surprised me most was the lack of complimentary water, something every other hotel we stayed at in Italy provided. This was a bit disappointing and felt out of place. Despite these points, the quality of the room itself made up for it, and I would consider staying here again, especially thanks to the attentive staff.",
            "time": 1732161872,
            "translated": false
        },
        {
            "author_name": "Kirsten Hipsky",
            "author_url": "https://www.google.com/maps/contrib/113013566006217681509/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW4xYsvWDywsfUyjhZL8Gf6zmoCAaA4svNR0oXU4PfbjLjk-Ka1=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "2 weeks ago",
            "text": "Don't let the grim exterior scare you away! The rooms and services were lovely, generous, and so welcoming. The fresh yogurt at breakfast was delicious and all of the floor-to-ceiling windows open fully if you want some fresh air. The location is a bit out-of-the-way, but very accessible by the 12/14 tram. I'm so excited to stay here again!",
            "time": 1731683320,
            "translated": false
        },
        {
            "author_name": "Marco",
            "author_url": "https://www.google.com/maps/contrib/107042130058009592009/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWVFut4DetyknYAzFExlzVCeKsTy3w57ADw8-377oQ8qp-zRUyCXg=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 1,
            "relative_time_description": "a month ago",
            "text": "The air blown by the AC system stinks very badly.\n\nThe 200 euros/night room does not even have a widow, only a locked technical door into a technical area. So it's normally not even possible to get some fresh air from outside.\n\nI asked if it's possible to get a room with a window, but they only sent someone to come and unlock the door, so that I could ventilate using the outside air. However, because it's a door to a technical area I can't safely keep it open at night, cause anyone could walk in from the technical area.\n\nResult: it is the second night in a row that I wake up in the middle of the night because of the bad smell in the room blown by the AC.\n\nThen in the middle of the night I need to:\n1) Get up and temporarily open the technical door.\n2) Wait until the AC stink gets outside .\n3) Close the door.\n4) Go back to bed.\n\nI never had such a bad AC experience in any hotel, not to mention in a four stars hotel. I'm not even sure it currently meets health and safety standards.\n\nOn top of it:\n* There is no sound proofing at all, so I was woken up again when neighbors left at 6:30 am and slammed their door (doors slam).\n* The room was dusty when I arrived.\n* For 200 euros/night they don't even provide a kettle/tea, or a bottle of water.\n\nI would definitely and totally *not* recommend it.\n\nUPDATE: after I complained in written form I was moved to a superior triple room, which was wonderful. AC didn't seem to work, but at least it was not blasting out stinky air. I would also like to add that all the staff were very gentle and professional all of the time. So mostly a big issue with the old and poorly maintained infrastructure.",
            "time": 1729019410,
            "translated": false
        },
        {
            "author_name": "Abhishek Mandal",
            "author_url": "https://www.google.com/maps/contrib/100019303903900349062/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW1T9If0oV7wsPpkBCZDB7sOSbkPl-C38xUhLEuqEzMu5omKMM=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 1,
            "relative_time_description": "2 months ago",
            "text": "The hotel calls itself a 4 star hotel but I will give it zero stars. First the hotel itself is very old. Not an issue if it is well maintained which is not the case here. Everything in this hotel is creaky and faulty. The AC didn't work and when I complained, they simply said that the AC for the entire hotel is not working. The hairdryer didn't work either. The service was okay and the location is nice (about 5km from central station). This hotel is not worth the price it charges and it is definitely not a 4 star property.",
            "time": 1727681309,
            "translated": false
        },
        {
            "author_name": "Raymond Howes",
            "author_url": "https://www.google.com/maps/contrib/118165524927825034753/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLhFGY41B14gzc5vqJ_yRrCyvaWOpgXs2iZc9xeUl0176fWtg=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "4 months ago",
            "text": "Although cool when we arrived our room was unable to maintain a comfortable temperature for sleep. My travelling companions contacted the front desk and we were offered a replacement room, because of the time of night and after a day of bicycle travel we chose to stay put with our travel luggage. On checkout we were offered a complimentary breakfast from Antonio, who I might add was most courteous and genuinely concerned that we chose to endure a warmer than usual room. To add, every member of the staff we encountered were courteous and attentive to our concerns. A dated hotel under renovation but in no way in a state of disrepair, quite the opposite from the sparkling clean lobby, professionally attired  staff including Marco who greeted us on arrival.",
            "time": 1722108605,
            "translated": false
        }
    ]
}