{
    "name": "UNAHOTELS Scandinavia Milano",
    "rating": 4.2,
    "reviews": [
        {
            "author_name": "Chen Kahlon",
            "author_url": "https://www.google.com/maps/contrib/112921876219765710833/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXO338_Xs5m1bi2DnGwWZbnhTcdgijinL34tKD8eTq-RJXejLw9=s128-c0x00000000-cc-rp-mo",
            "rating": 2,
            "relative_time_description": "a week ago",
            "text": "We stayed at this past summer, and unfortunately, it was one of the worst experiences I’ve had for the price. Upon arrival, we found mould in the bathroom, which was a major concern for us. When we brought it to the attention of the staff, they seemed unconcerned, and no real apology. Although they changed our room, we checked the new bathroom, and there was mould there as well. It wasn’t until the third room that we finally found one that seemed relatively cleaner.\n\nAdditionally, the breakfast provided was disappointing—it didn’t meet our expectations considering the price of the stay.\n\nI had hoped for a more comfortable and enjoyable experience, especially for what we paid, but unfortunately, the lack of attention to cleanliness and overall quality was a significant letdown. I hope the hotel can take this feedback seriously and improve on these issues.",
            "time": 1732487044,
            "translated": false
        },
        {
            "author_name": "Adam",
            "author_url": "https://www.google.com/maps/contrib/117684275442871038747/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU5SoNJFgS_zk8_oE8jqzbrRn74baACSUPMpO3Y1_EGglAZTInb=s128-c0x00000000-cc-rp-mo",
            "rating": 4,
            "relative_time_description": "3 months ago",
            "text": "We stayed here for only one night because we booked a cheaper flight that was a day earlier than planned but I was very happy with our stay. The desk staff were very friendly and helpful even coming up to our room to show me how the lights worked. They also allowed us to check our bags at the front desk once we had checked out while we went to explore and pick up our car rental. The room was clean and the bed was comfortable. The lobby and dining area was very nice, they even have a lovely courtyard in the back right off of the dining area. The breakfast was pretty good. They had an instant espresso machine that made cappuccinos and such that was very nice. I can’t speak on the location too much because I only stayed here one night and wasn’t planning on doing activities and what not in Milan.",
            "time": 1723362418,
            "translated": false
        },
        {
            "author_name": "Ian Horncastle",
            "author_url": "https://www.google.com/maps/contrib/117895617641606901268/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI2Mo7ZFM7ufzN-2gkzUu1g6_KlkL1ZMJx7M1b0ii9Xw-COxg=s128-c0x00000000-cc-rp-mo",
            "rating": 4,
            "relative_time_description": "2 months ago",
            "text": "Hotel itself was a little bit dated and tired but the staff were great and really attentive. Special mention for Mohammed and Sara who manage the bar. They really did go above and beyond in taking care of my wife (who is coeliac) and ensuring we were able to comfortably enjoy a lovely meal at the restaurant. Mohammed's travel advice also proved invaluable for our San Siro trip!! Thank you !!",
            "time": 1727518686,
            "translated": false
        },
        {
            "author_name": "Braun",
            "author_url": "https://www.google.com/maps/contrib/105866346078329682123/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKrQyfmgGzPceXCacCDlkJnc5Ueq_YhnSotxChmx86Vz9SsGA=s128-c0x00000000-cc-rp-mo",
            "rating": 2,
            "relative_time_description": "4 months ago",
            "text": "The location of the hotel and the breakfast is good. There is a big supermarket opposite of the hotel, very convenient.\nBut the service attitude is too bad, especially the cleaning is not on time, very rude. You have to wait outside of the room waiting for the cleaning although already informed them one hour ago.",
            "time": 1721910216,
            "translated": false
        },
        {
            "author_name": "Gawayne",
            "author_url": "https://www.google.com/maps/contrib/117046093071235479030/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUm6kxXb_sC0PWaShPXLR2phAb3AW3L1JE_z_q9MUOg0ngjk8I=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "Décor is reminiscent of the 20th century, with high standards to match. The staff all knew enough English to have fluent conversations, and were always willing to please. The included breakfast is excellent, the rooms are clean, and the bed was comfortable. The only issue I had was that the plugs on the walls are not compatible with the European plug. You need to have an adapter that can be borrowed at the desk, or bought across the street. Excellent location near fine dining, the MiCo conference center, and both tram and metro lines to go into the center.",
            "time": 1729528545,
            "translated": false
        }
    ]
}