{
    "name": "UNAHOTELS Galles Milano",
    "rating": 4.2,
    "reviews": [
        {
            "author_name": "C P",
            "author_url": "https://www.google.com/maps/contrib/103518641142924593946/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKphQPGaeBNCxG_OOsMtH6h1Nnwp-cpTVYm-qKcnEgCUbghyQ=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 4,
            "relative_time_description": "3 months ago",
            "text": "Stayed here for a few days in Milan. Reception staff were very nice and accommodating of our requests. Hotel is really clean and the rooms have all the amenities you might need.\n\nBreakfast was delicious and had variety. Coffee tasted great! Dinner menu is a little expensive for the area so we dined out every night.\n\nMy one problem was the hotel's commission for taxis to Malpensa airport. We asked a taxi and he said that prices to the airport are a set price at €114 no matter the time. The hotel charged us €150 saying it was an early hours transfer. The commission in my opinion is far too high.\n\nThat being said, we had a great stay and would definitely return to this hotel. Thanks again to the great reception staff for their professionalism.",
            "time": 1725453335,
            "translated": false
        },
        {
            "author_name": "John Rakes",
            "author_url": "https://www.google.com/maps/contrib/117094427746503775824/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUgxgh4AgqXXXBMy65-s_UvHqf9Flr3uaCx2sluBKC7xcQBMTiMfQ=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "After reading many negative reviews, I wanted to record my experience while staying here recently. First, the hotel is very clean. My room was spotless and tidy, smelled great, and had everything I needed for a comfortable stay. The air conditioner in my room worked fine, but could have been cooler (by American standards). Yes, the walls and doors are thin, so this could be an issue if you are super sensitive to sound or you’re traveling with an infant. It didn’t bother me at all.\nThe spa area was well appointed, but small. Still, it was a wonderful and free amenity included in my stay. Everything was working and the attendant was constantly restocking refreshments and towels, cleaning, and graciously welcoming guests. It was a bit crowded, but that’s no fault of the hotel.\nThe breakfast was very well done. So many offerings and good quality food for the price. Sure, you can find better breakfasts but not at this price point. The staff were constantly cleaning and restocking, so everything was fresh. I didn’t have dinner at the restaurant, so I can’t speak to that experience.\nAll of the staff I encountered were so polite and responsive. When I first checked in, my suite had been set up with the couch made into a bed and another temporary bed placed in the room as well. This makes sense for a family with children, but since it was myself, I asked for the extra bed to be taken away and got the couch bed to be unmade. With ten minutes there were three staff in my room doing just that, and all with smiles and working very quickly.\nFinally, the location is optimal. Very close to the central train station and right in front of the Lima metro station, placing you on the red line to the Duomo and other points of interest. So convenient!\nOverall, this hotel is a great value with excellent staff in an optimal location.",
            "time": 1724000520,
            "translated": false
        },
        {
            "author_name": "Jon TM",
            "author_url": "https://www.google.com/maps/contrib/102916398196644248774/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWASq6ylXnQ3ZyIlX0Y2jwf1Y271-yN1rfPlb9fBi56Yq1hCnsnJw=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "My partner and I recently stayed at UNA Hotels Galles Milano, and we were thoroughly impressed by our experience.\n\nThe hospitality of the staff was exceptional. The reception team was incredibly welcoming and attentive, making us feel right at home. The restaurant staff also stood out for their professionalism and respectfulness. A special mention goes to Gabriella, who always greeted us with a smile and even took the time to teach me some Italian phrases!\n\nI was pleasantly surprised by how clean the hotel was, which added to our overall comfort. The only minor drawback was that the air conditioning could be improved; however, it still kept the room cool enough for us to enjoy our stay.\nAnd a beautiful rooftop terrace to enjoy a cocktail.\n\nOverall, we had an amazing experience and would highly recommend UNA Hotels Galles Milano to anyone looking for a wonderful getaway.",
            "time": 1723103983,
            "translated": false
        },
        {
            "author_name": "Ronda",
            "author_url": "https://www.google.com/maps/contrib/109241749331130200004/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJJYHWzlfcOg4dSfbOgJISB8RN7pzZ4axstnzvvhfjDcTBqUQ=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "We stayed in this Hotel in June 2024 and was extremely happy with everything. I booked 3 rooms as we brought all our family to see Milan. We loved the breakfast and the pool etc to cool ourselves after the heat of the day. We will be back next June 2025 and hoping to stay again although we haven’t made final booking until we have definite dates.",
            "time": 1727092775,
            "translated": false
        },
        {
            "author_name": "Ronan Fennessy",
            "author_url": "https://www.google.com/maps/contrib/106035092988784554197/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIsOQCY07Ol0wnIzQchpRIsYrTMXXr_vQjaW6TSyQpP7l3vjg=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "This hotel exceeded my expectations. The hotel has a very relaxed vibe and the staff are brilliant - so helpful and always in good form. The hotel has a fabulous rooftop for evening drink and the breakfast has an extensive range of high quality products. Rooms have a classic design and I really liked the old school approach.",
            "time": 1725867732,
            "translated": false
        }
    ]
}