{
    "name": "Vietnamonamour",
    "rating": 4,
    "reviews": [
        {
            "author_name": "Jeremiah Goldsmith",
            "author_url": "https://www.google.com/maps/contrib/101975030639318775715/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXfUDFCknhHHM3jXgbKeXVQsrLHX_thIXsNP1y0gP7-0VyaYvD2yQ=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "2 years ago",
            "text": "I had Vietnamese Coffee, Lotus Tea, Earth Menu with Beef. It was my first meal of the day and I ate and drank everything, I was full. The rolls wrapped in lettuce and fresh mint leaf, big spoonful of hot sauce from Vietnam, then dipped in fish sauce, I will be trying to find that again. Very Friendly staff. I need to go again.",
            "time": 1663076111,
            "translated": false
        },
        {
            "author_name": "FranklinLiranzo",
            "author_url": "https://www.google.com/maps/contrib/112455150968953473314/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVBCIseNrVLFThUVGHi2TDaPlVmvIb8Ued6_ogH1vUhW3ApUplM=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 1,
            "relative_time_description": "a year ago",
            "text": "Hear me out: the place has a nice ambiance and look (decoration). There was also this one gentleman who was great. Aside from that; the service was horrible: the waitress had a bad attitude with us, they were slow to take the order, and slow with delivery. We had to continuously remind them we wanted to order something, or that we were missing something. On top of that; the food was far from authentic and far from delicious. I have visited Vietnam 3 times and have tried practically all of their foods. This was not good Vietnamese cuisine. Which was a major disappointment as i had built up my in-laws as to how good vietnamese food is… on top of it all, we had to fork $200 euros for such bad experience - which if you know- vietnamese food is NOT expensive at all to make. And the funny part: they were so anal to not let us in without masks: just to walk literally 6-10 feet, sit down: to then remove the masks. Will definitely NOT be going back, nor recommend this place.",
            "time": 1696799291,
            "translated": false
        },
        {
            "author_name": "Jordi Mori",
            "author_url": "https://www.google.com/maps/contrib/100656671879959081081/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLuUGE6AUY3S2CL1Gg1ovKIsSfnuwkL8gFaNI0kHxlC2a2JTg=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 4,
            "relative_time_description": "6 years ago",
            "text": "Fairly small but cozy Vietnamese restaurant with excellent decor. There is a small patio outside which is well decorated as well as the rather nice interior. The portions are a little on the small side, but their delicate tastes are quite pleasant. I especially enjoyed the chicken dipped in honey which was excellent. Asides from that they have fairly large range of different dishes to choose from.\n\nI would recommend either the \"Menu Terra\", which lets you try a bit of everything or the 13 euro lunch menu which is fairly priced as it offers an appetiser and an entree. Other than that the food is a little pricey and not particularly filling even though it is delicious. The owner was very friendly and talkative which made the experience all the better.",
            "time": 1520584780,
            "translated": false
        },
        {
            "author_name": "Natasha",
            "author_url": "https://www.google.com/maps/contrib/108559036172065893400/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX3r1OvZRbmuCfSeJjZm7O_Pj82SucauCLA52O4la_br3lEn8jb=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 5,
            "relative_time_description": "2 years ago",
            "text": "Small place, good food, a bit pricey but worth it. I recommend you to make a reservation beforehand since it gets fully booked almost all the time",
            "time": 1652609514,
            "translated": false
        },
        {
            "author_name": "deniz yarsuvat",
            "author_url": "https://www.google.com/maps/contrib/103605803207527761477/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU1EOLFre7A04c7dnHxI8LeqQug-NiKqRoIjO3XTPA4QgxPQyvO=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 1,
            "relative_time_description": "8 months ago",
            "text": "The Place Is closed and fully under construction. We booked through THEIR website and it states that they are open. Consider a Saturday night dinner ruined.",
            "time": 1712425510,
            "translated": false
        }
    ]
}