{
    "name": "ibis Milano Ca Granda",
    "rating": 3.7,
    "reviews": [
        {
            "author_name": "Alex",
            "author_url": "https://www.google.com/maps/contrib/115283631800041627623/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKXqHBq4pJysWu7-v1rC8BrSHgnErDn-kDavonY9B_jF36Et2Q=s128-c0x00000000-cc-rp-mo",
            "rating": 1,
            "relative_time_description": "a month ago",
            "text": "Me and my friends did come here with a low expectations because it’s a rather cheap hotel. So we weren’t really surprised about the small room and lack of amenities. But the cleanliness is just terrible, it’s horrendous. It was a complete disaster for me as I have sensitive skin, about 30 minutes after lying on the bed I started getting rashes… even if it’s a budget hotel, cleanliness needs to be on standard and this hotel definitely doesn’t have that.",
            "time": 1729335861,
            "translated": false
        },
        {
            "author_name": "Dr. X",
            "author_url": "https://www.google.com/maps/contrib/109111534047125898330/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJCy-BR3J8BahZ0BVdpXFT0tX3ceKxi6tXLxG53qgqvflrDA4_2=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 2,
            "relative_time_description": "a month ago",
            "text": "Location: good connection to the metro\nBed:  No Large Duvet for double bed!  Cold in the room at night! Noise: OK\nCurtain: OK\nAir conditioner/Heater: Heater doesn't work (Italy law doesn't allow central heating or provide a heater before Oct 22 in Milan region)\nCleanness: Bad\nDecoration: Old\nStaff: good.",
            "time": 1728240844,
            "translated": false
        },
        {
            "author_name": "Andrzej Mikolajczuk",
            "author_url": "https://www.google.com/maps/contrib/110647245363142201761/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJcsM_bm_4spxII1OQT9tMrGPOtbIAYtBrZZ0HTO3i0bmGgmA=s128-c0x00000000-cc-rp-mo",
            "rating": 3,
            "relative_time_description": "2 months ago",
            "text": "My  2 nights stay at this well connected but bit remote from city centre ibis was comfortable and staff was friendly. Albeit the hotel does not correspond to the Regular IBIS standards. It is very tired and warn out and even the best cleaners cannot get it really clean anymore. Old style bathroom equipment is yellowish not white anymore. The curtains have little holes from being used so long. The TV works but looks like a museum artefact. Not much the staff can do about. Connected to WiFi, but felt like it did not exist. Switched bach to my mobile. There are corporate decisions to be made /this cash cow is almost dead.",
            "time": 1726591519,
            "translated": false
        },
        {
            "author_name": "m ka",
            "author_url": "https://www.google.com/maps/contrib/110805795259362339982/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXxerkpRq4iHD7Cv158utCw2C11pYS2wJBy41s6dIEy1bWSx7PQNg=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 1,
            "relative_time_description": "a month ago",
            "text": "Located about 10 minutes from the subway line 5 station. If you take the metro, it is not too far to downtown Milan, which is attractive considering the price.\nIn mid-September when we stayed, the A/C did not work well and we difficult to sleep.\nIt was too hot to sleep, so we were asked to offer about a couple of other rooms, but these were also same situation.\nIt was so cooler with the window open. However, mosquitoes would invade and it was a security hazard, so we refrained from sleeping with the windows open, so we had a morning with almost no sleep.\nI glanced at other reviewers' similar complaints, so I don't recommend choosing this hotel because of the A/C problems.",
            "time": 1728730423,
            "translated": false
        },
        {
            "author_name": "Thomas Beilen",
            "author_url": "https://www.google.com/maps/contrib/103528143633981982023/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXWXRQ_-uGgw23zj6bmrufRggOEZDw-2VrFLZdwVF1NpTumiXfx=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 1,
            "relative_time_description": "2 months ago",
            "text": "This hotel is really not great. While I’m aware that this is an Ibis and I’m not expecting the Ritz-Carlton, there’s a standard you expect from Accor, and this just doesn’t meet that minimum standard. I’m not sure how this even qualifies as an Accor-branded hotel, as the quality of this hotel really brings the brand's reputation down.\n\nWalking in off the street, you’re greeted with a nice promenade and fountain but quickly realize that it hasn’t been maintained at all. There’s graffiti, the shops around the base are vacant, and the garden boxes have dead plants in them and have been vandalized or broken. The Ibis sign has faded. Walking in, I felt like I was on a tour of Pripyat, the ghost town at Chernobyl.\n\nWhile check-in was OK and the receptionist who checked us in was pleasant and friendly, the room was tired. The blind on the window was torn, and the TV looks like it’s from 1998. No kettle. Other than that, the room was OK.\n\nBreakfast was good, with a selection of hot and cold options, and the staff were friendly.\n\nThis hotel is out in the suburbs. There’s nothing around, really. There’s a supermarket 1.3 km away, which is not super close. The subway station is a 650 m walk away. That’s about it. Ok if you had a car maybe.\nThe promenade and fountain area seem to attract locals who sit in the dark and talk at night. This might be OK, but I’m not sure I’d want to walk through there at night. Nothing happened, but it might seem intimidating for some, especially when the next day you see alcohol bottles left behind and never cleared away.\n\nSkip this place",
            "time": 1727249325,
            "translated": false
        }
    ]
}