{
    "name": "Les Terrasses d'Eze",
    "rating": 4.2,
    "reviews": [
        {
            "author_name": "Jade Brignac",
            "author_url": "https://www.google.com/maps/contrib/117387371691734442599/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI9DgUFuwsgZ2n2NK0TAFod0REpZNj7k-dqK7T52jts_vAe8g=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "We stayed for 2 nights as part of our Southern France vacation and loved every minute of it! The views are spectacular, the staff is incredibly kind and helpful, and our room was very spacious and clean. Èze village was less than a 10 minute drive away and Monaco only about 25 minutes. I hope to return soon. We highly recommend this hotel!",
            "time": 1724057384,
            "translated": false
        },
        {
            "author_name": "Selina Li",
            "author_url": "https://www.google.com/maps/contrib/116838390328381860282/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIfOenrRIdteupXi13MdnYhB9TTdF8yi39UMmv9qeGLVyBA7w=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "5 months ago",
            "text": "Had a wonderful stay! We booked a comfort room which was bigger than it looked from the website, it had the most amazing view and private patio. We also really enjoyed their spa which includes numerous sauna, steam rooms, and pool. Dinner was also delicious at the restaurant, best prawns ever! Overall highly recommended!",
            "time": 1720236748,
            "translated": false
        },
        {
            "author_name": "Jedrzej Czarnota",
            "author_url": "https://www.google.com/maps/contrib/112802048562801115020/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWNyT6N3rxDmbTU8n89CgD1qgU2wtVjGGcdKvCu1D6rSue6zEJX=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 3,
            "relative_time_description": "2 months ago",
            "text": "We stayed at the hotel for 4 nights. The staff are friendly, professional and helpful - five stars to them! The location is convenient for exploring Nice, Monaco, Cap Ferret and Eze. It also offers spectacular views! Unfortunately, the facilities themselves - the rooms, the non-heated pool with ice cold water (we visited in mid-September), the rooms' terraces - are aged and overall sub-par. They need care and renovations. This, coupled with very expensive price (in mid-September we paid around 350 euro per night, for two people with breakfast and a dog), means to me that the hotel falls short of the expectations.",
            "time": 1727509196,
            "translated": false
        },
        {
            "author_name": "Mylo Nicholas",
            "author_url": "https://www.google.com/maps/contrib/113364359686039384205/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXrySO0vYf3XZZOtAZfkyPtJom6Jta6qb18vleJnVGmN0iG8gU-oA=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 3,
            "relative_time_description": "3 weeks ago",
            "text": "Nice terrace with a nice view, food is nice but not exceptionnal. Price/Quality could be improved. Everything is fresh and looks nice great presentation, but it lacks flavour, not sure why. Great service.",
            "time": 1731316120,
            "translated": false
        },
        {
            "author_name": "Таня Викторова",
            "author_url": "https://www.google.com/maps/contrib/108921799231427991541/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL9SgT5pq0NiOpPjrJ6EF_euaE2oGshreERbJFSE6xrBBm5rg=s128-c0x00000000-cc-rp-mo",
            "rating": 1,
            "relative_time_description": "5 months ago",
            "text": "We came late at night around 12.30 a. m. and were given a very small room with a connecting door to the next room and everything was heard,. There was no privacy and the room was not sound proof as was stated in the description of the room where I have booked.\nOn the balcony there was a pipe close to the balcony door that was  making a maddening noise like a single drop was falling down on a stone and for me it would have been impossible to sleep like that, as it was clearly heard from inside the room, since the room was really very small with only one bed to fit in and no place for the luggage.\nI went back to the reception to ask for a room change because for me it was impossible to sleep with this constant dripping. In  the past they used to torture people like that and nowadays you pay to a  four star hotel to get the same torture instead of a restful sleep after you have travelled the whole day by car only to arrive and get this “excellent” accommodation. The receptionist Alberto Stoppa first went somewhere saying that he is going to look for another room, which is strange since he should know perfectly well what the availabilities are and there is a computer in front of him to check. When he returned  refused to give me another room saying that he cannot  change my room because there was a noise from the pipe as a result of the rain. When I asked him to come and see himself that there  was really a maddening noise and it was not possible to sleep with the door open, he came and immediately concluded that there was no noise. Then he said it was raining and it was normal to have a noise in the pipe. And I find it abnormal to have a gutter on the balcony of a four star hotel room.  In fact the noise was heard even with a closed door, especially at night when everything was quiet.\nThe offered solution was to close the door and put on the air conditioner, which for me was not a  way out since I don’t use an aircraft conditioner during the summer for health reasons.\nAt some point of time the receptionist said that there  were free rooms, but they didn’t match my room. When I offered him to pay the additional amount of money, he again started saying there were not vacant  rooms and  that he didn’t care, which was quite unprofessional.",
            "time": 1719457529,
            "translated": false
        }
    ]
}