{
    "name": "Il Giardino Monte-Carlo",
    "rating": 4.5,
    "reviews": [
        {
            "author_name": "John Leblanc",
            "author_url": "https://www.google.com/maps/contrib/110454160947723433875/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ229MrwMgcrHP1EkdzzJOrdlg2Gt9hwkd1qP1erTaQ4tOj0w=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "7 months ago",
            "text": "Very good Italian restaurant... near Italy ..15 min in car from Italy to Monaco. Living in Monaco, i was surprised to enter this restaurant filled by Italian people... It was really good. People are really sympatic.. fine service. it was full and they asked me 10 min to find a table... and they find it.. after that we finished our evening perfectly. Was so delicious. Came back some days ago.. same. We taste Pizza.. service by Carmine.. he give us good advise for the wine .. really sympatic. During the tennis tournament you will see .. tennis players... teams of the players,... the place to be !!! But be sure to make a reservation\none year later : same satisfaction 👌",
            "time": 1712693442,
            "translated": false
        },
        {
            "author_name": "Derek J Lang",
            "author_url": "https://www.google.com/maps/contrib/116897772408979521140/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKKcub5ad-mpiREeH6qnIP8jvPuYxDKH8CCBudft1rCISB_3g=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "a year ago",
            "text": "UPDATE: I have returned a few times, most recently now in the middle of November 2023. The standards seem to have been upheld and the food and service are still excellent. Today I had a special pizza topped with slices of mortadella and a hearty amount of burrata, and it was easily one of the best pizzas I've ever had. I had a pasta dish that was also a special, a pesto sauce with bacon and other ingredients I've forgotten; my only regret was that I wasn't hungry enough to eat more than half of it. I'll continue to offer Il Giardino as one of the best Italian restaurants in the area.\n\nFor starters, I arrived close enough to closing time that I would not have been upset if the staff had told me I couldn't eat there; however they still sat me and provided good service.\n\nI had the seared tuna, and it was excellent. In fact I probably could've stopped there; it was cooked perfectly (still rare), seasoned just enough, and quality of the fish was decent.\n\nI also ordered the Pugliese-style pizza, which was very good and cooked the right way. I may stop back for lunch one day before the end of this trip just to get another pizza.\n\nThe wine selection is broad yet chiefly Italian; my bottle kept me occupied throughout the meal. It was going to be my dessert as well, but the waiter wore me down and I had their tiramisu. As it should be, it was relatively light and not excessively sweet.\n\nOverall it was a great experience, and I'd recommend to those looking for fairly authentic Italian food.",
            "time": 1700587447,
            "translated": false
        },
        {
            "author_name": "Krystal Landells",
            "author_url": "https://www.google.com/maps/contrib/100982004149334311726/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWS0B_Mzq9jJS64DNPr8uNB9w2UndceHpN1dhO_JjjZjl_LozfL=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "a year ago",
            "text": "Lovely restaurant with really wonderful and helpful staff. Location is a bit of a trek as there is not a lot out that way, but the pizza here is worth the short detour",
            "time": 1687423109,
            "translated": false
        },
        {
            "author_name": "mali baba juwara",
            "author_url": "https://www.google.com/maps/contrib/105108127289896788426/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLeEQzuw-1Pg-dyB2Sycjuo4AgIiGQPcd-nXk2tTywv3kl4gA=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 4,
            "relative_time_description": "a year ago",
            "text": "Really tasty pizzas. Great for quick pizza take-aways, you just have to call to order and collect in less than 15mins.\nGood place to also dine in but service is superrr long. Waiting time kills a little the dinning experience never the less, loveee their seafood pasta (made with fresh pasta) and their pizzas.",
            "time": 1693781176,
            "translated": false
        },
        {
            "author_name": "Mathis vK",
            "author_url": "https://www.google.com/maps/contrib/101580897977423474394/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL8OigFAuHeSiVZR6pvAnPeryRn2rcn0T_u6MLH81lnaAVQlw=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "5 months ago",
            "text": "It is a bit outside of the city centre, but a relatively short distance from the Monaco beach (find the elevators going up!). Fresh ingredients accompanied by friendly service. There are places both inside and in a half-open outside terrace.",
            "time": 1719927209,
            "translated": false
        }
    ]
}