{
    "name": "Fairmont Monte Carlo",
    "rating": 4.5,
    "reviews": [
        {
            "author_name": "Carlota Grimes",
            "author_url": "https://www.google.com/maps/contrib/102052788695393435646/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXQYmBhFNdhtKzUH21hHM_viML-olCpl_qHpEiihKGJv5pqvTiKNA=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a week ago",
            "text": "My sister and I were there recently and we had a fabulous experience! We checked in with a gentleman named Santiago and he spoke Spanish to us and that made us so comfortable; he is knowledgeable and very professional. We appreciated him. The staff is all helpful and very kind. We also loved the restaurant, the breakfast buffet is delicious. Location could be better. Our room had a beautiful view, spacious, super clean and comfortable beds! Thank you all for making our experience so memorable!",
            "time": 1732629279,
            "translated": false
        },
        {
            "author_name": "Halil Hajdarevic",
            "author_url": "https://www.google.com/maps/contrib/105061222398777507005/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLkyiHB6JbW3-xgyuHOdFl7aGmwraeQ4gPrbpas_5f-SAxmQA=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "We recently had the pleasure of staying at the Fairmont Hotel Monte-Carlo, and we can only say positive things about it. From arrival to departure, the service was exceptional. The staff was friendly, helpful, and always eager to make our stay as enjoyable as possible.\n\nThe rooms were clean, comfortable, and well-equipped. The breakfast buffet offered a wide selection of delicious dishes that catered to every taste.\n\nThe location of the hotel is also excellent. It is close to important sights, restaurants, and transportation options, making it easy to explore the surrounding area.\n\nI highly recommend the Fairmont Hotel and look forward to my next visit.",
            "time": 1728408370,
            "translated": false
        },
        {
            "author_name": "Cory Hrzic",
            "author_url": "https://www.google.com/maps/contrib/103330342361364416502/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIgdx6f1uO2Gz_uHBOU3YXX7Z0xekscWv3NetBxRapGrXNmVQ=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "I recently stayed at the Fairmont Hotel Monaco and had a fantastic experience. The staff were exceptionally friendly and professional, ensuring that our stay was comfortable and enjoyable. One of the highlights was the rooftop pool. Our room also provided a breathtaking sea view, adding to the overall luxury of our visit. I highly recommend this hotel for its excellent service and beautiful amenities.",
            "time": 1726330080,
            "translated": false
        },
        {
            "author_name": "Colleen Garth",
            "author_url": "https://www.google.com/maps/contrib/113467578090413506611/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIJzsGkTeUptEls3L_aqEQ01P6pubKckMp2eZrpZki3LgcdMA=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "We enjoyed a wonderful 4-day stay at this hotel as a family of three. Our initial room offered breathtaking views, but it was located beneath the bar, which made it quite noisy. The hotel kindly relocated us to a suite in a quieter part of the property at no additional cost—a gesture we truly appreciated. Both rooms were beautifully decorated, and the beds were exceptionally comfortable.\n\nWe dined at both Amu and the Lobby Lounge, where the service was consistently outstanding. A special shoutout to Letitia in the Lobby Lounge, who went above and beyond to make our son’s birthday extra special with a surprise dessert, complete with candles and a sparkler. The food in both restaurants was excellent.\n\nThe valet parking was quick and efficient, adding to our positive experience. The hotel’s location is perfect for exploring Monaco, making it an ideal choice for sightseeing. We highly recommend this hotel and look forward to returning in the future.",
            "time": 1723623919,
            "translated": false
        },
        {
            "author_name": "Travelling Light",
            "author_url": "https://www.google.com/maps/contrib/114222705492604781255/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJB--xLMqmN0---XryiOfmh6hPLR8fALNwwl6szGOeV9jybvg=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 1,
            "relative_time_description": "2 months ago",
            "text": "Ideally situated but at €1,500 for a night one might expect a room in which it is possible to sleep. But no, greed has allowed them to rent out function rooms that host extremely noisy disco parties that extend to midnight and sometimes beyond. Avoid this hotel at all costs during the many event weeks in Monaco - unless you are a disco fan and have a party invitation!",
            "time": 1727383473,
            "translated": false
        }
    ]
}