{
    "name": "Le Pinocchio Monaco",
    "rating": 4,
    "reviews": [
        {
            "author_name": "Hannah Pyritz",
            "author_url": "https://www.google.com/maps/contrib/114053339784080604149/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLoixh2AZFzKXN2zKlRdjPqcIxNzprfsk6X9e_a_rUd8FZtYQ=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 4,
            "relative_time_description": "4 months ago",
            "text": "It was a really good lunch there.\nWe were 3 people for lunch.\nWe ate the Fish and Chips, the Greek Salad and the Cesar Salad (the last two you can see in the pictures).\n\nThe restaurant was really good, nice atmosphere. Friendly staff, they can also speak English if they want to.\nThe toilets are as usual mixed so for both men and women, but they were clean.\n\nAll in all we really liked the restaurant and would come back if we return to Monaco.",
            "time": 1722104060,
            "translated": false
        },
        {
            "author_name": "Loris",
            "author_url": "https://www.google.com/maps/contrib/113592235137703093586/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIs63gdyw9BDk8rVNN1tqo-OQx7PYTg3Xm7UZuZAhwUDUZw=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "6 months ago",
            "text": "Well prepared food and very attentative waiter that made us feel right at home. The prices might be considered high but it is Monaco, so do not complain. Would definitely come back!",
            "time": 1715517723,
            "translated": false
        },
        {
            "author_name": "Pratheek Poovaiah",
            "author_url": "https://www.google.com/maps/contrib/108364360776127518306/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW8EK8yj1_5TLM1vpfy9bPqQ9oSfIgMRNuYGhXxyr6otwh5NnHU=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "7 months ago",
            "text": "The restaurant has a great ambiance in the narrow streets near the palace of Monaco. The food was delicious, and the dessert was exceptional. And service and hospitality were great. Would love to visit again for the dessert 😊",
            "time": 1714481433,
            "translated": false
        },
        {
            "author_name": "Henry Saputra",
            "author_url": "https://www.google.com/maps/contrib/104275690136400862206/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXEzTFjS9EuFO4_FXr-H8qiXzSmxGHYgR-fcpOOmzrjPe_4lrxz=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 4,
            "relative_time_description": "7 months ago",
            "text": "Over 50 years in business (the writing on the flag said since 1970’s), this is a hidden gem in Monaco’s palace ludicrously narrow street.\n\nFood wise, I would personally give 6 stars. Not 5 but 6 stars. We ordered :\n1. Shrimp pasta was out of this world. Imagine a sauce made with blendered shrimp stock, garlic, butter, onion, hint of tomatoes tossed with springy and perfectly cooked hand made (assumption) pasta. We had to fight over this pasta. It was soooooo goooooddddddd.\n2. Carbonara was thick with rich and decadent egg yolk, crispy bacon (unfortunately not guanciale), perfectly balanced parmigiano cheese (not pecorino, again I assume), and the marvelously cooked pasta.\n3. Ragu with very savoury and rich passata, complemented with minced veal and sprinkles of cheese. Oh and a God sent well cooked pasta.\n4. Fish and chips (nothing much to comment), its just fish and chips cooked to perfection. Great batter.\n5. Nice pizza diavola. Spicy, crispy, perfect thickness and generous toppings.\n\nThe best italian food we had throughout our 17 days trip in France.\n\nThe outdoor setting with a little garden was the bait that lured us to try. It was nice, green, and serene settings.\n\nThe waitress was OK. Not friendly, not snooty. Just OK. He quickly set up seatings and take our order in orderly fashion.\n\nPricewise : YES it is 5-7 euros more expensive than the restaurant just across it, BUT, food wise, it is a culinary journey. The outdoor seatings also helped the price difference.\n\nRecommended for those we wanted to lick their plate clean. I’ll buy the shrimp recipe if they sell it.",
            "time": 1712996308,
            "translated": false
        },
        {
            "author_name": "Jean-Christophe BRISSET",
            "author_url": "https://www.google.com/maps/contrib/114089993154184085098/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI4mtabEuhVzJQUhXUJ-HTqjDBvukzwcO7Jvv73vbnPrZ1m8Q=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 1,
            "relative_time_description": "4 months ago",
            "text": "This place might have been a good restaurant in the past, but today it is nothing more than a tourist trap that brings shame to the culinary reputation of Monaco. I’ll skip over the fact that they treat us like fools by explaining what an “Italian carbonara” is, when in reality, their version has more in common with a seaside restaurant in Ventimiglia than with the esteemed Roscioli in Regola (and yes, I know what a real carbonara is, with Pecorino cheese and eggs, not cheap cheddar). I’ll also overlook the frozen pizza from a wholesale store and the poorly prepared flank steak (cooked incorrectly and with remaining sinew...) and to be honest, for the price for the price paid we expected for a children's menu a breaded escalope not an XXL Mac do nuggets.\nNo, what really compels me to give this restaurant a bad rating (which is rare for me) is the terrible value for money. 30 euros for a piece of salmon (which I suspect was frozen due to its texture) and less than a handful of vegetables without any additional sides, with a third of them being onions (8 slice of carrots, 9 julienne of zucchini)... No further comments; the photo speaks for itself. In the cartoon Pinocchio wonders what a conscience is, this establishment has surpassed that stage: it simply does not have one.",
            "time": 1721636037,
            "translated": false
        }
    ]
}