{
    "name": "La Réserve de la Mala",
    "rating": 3.9,
    "reviews": [
        {
            "author_name": "Carlien Wassermann",
            "author_url": "https://www.google.com/maps/contrib/103504673064888478032/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXZgoq5E_4Oq1nPPZmVlKLmDKoZHh006Ei4y4E-fKlAw4rPqxO3=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "4 months ago",
            "text": "You have found the place, paradise on earth!\nThe most beautiful beach club in one of the most picturesque places on earth.\nWith its stylish decor and attention to detail, it feels like you’re part of the natural beauty surrounding you.\nSpecial thanks to Marco and Daniele.\nGrazie a voi due per essere gentili, amichevoli e rispettosi!",
            "time": 1720880766,
            "translated": false
        },
        {
            "author_name": "Jodi Tegeler",
            "author_url": "https://www.google.com/maps/contrib/109981232608080319390/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVb45i7hg2nN6IaspisfN_aRRDGkqm9CqmXAWxU4kHCzkADmdk=s128-c0x00000000-cc-rp-mo",
            "rating": 2,
            "relative_time_description": "4 months ago",
            "text": "The cove that this club sits in is absolutely stunning, the beach was great and the water was refreshing and cool..which is the only positive thing I will likely say here.\n\nFor a “premier club” as they seem to market themselves as, this does not pass the test when compared to others of quality caliber in the area.  The service was atrocious even when repeatedly asking for something there was often a snub and an eye roll from the servers.  The food was not great, very limited options and everything that was ordered was sub par at best.. including the summer truffle pizza which is something I thought couldn’t be messed up.\n\nThe prices are higher but I was fully expecting and fine with this based on how this is marketed.  Wine and cocktails are served in plastic cups which really cheapened the 100€ bottle of rose that we ordered.. many other clubs offer better vessels for drinking.\n\nThe club sits between two public beaches which patrons of those public beaches trot through the restaurant all day.  It’s disruptive and honestly if I were to come back to the beaches I would just go to the public beach as it seems just as nice and there’s no chance of disappointment on service.\n\nOverall there were a lot of things about this club that made it feel cheap and frankly a little trashy. If that is your vibe feel free to ignore my review however I wouldn’t come back here if I was paid based on many factors.",
            "time": 1722533042,
            "translated": false
        },
        {
            "author_name": "Dominique Rousseau",
            "author_url": "https://www.google.com/maps/contrib/105210624935584508030/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJPkznQ93O4xXSgEhmyBvPZEAt9tZjBaNVS5bN9gbCldW8uJBfI=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a year ago",
            "text": "We were pleased to eat at this place with family and friends. Great location surrounded by cliffs, with beautiful water as we arrived by boat. A shuttle collected us from our boat. The location of the restaurant is awesome, foods are great and we noticed the special attention from the service! We took sea bass cooked in a salt, it was really delicious. You really feel the restaurant’s team does whatever they can to support your needs, they welcome you with a smile.\nWell done ! I recommend this place !",
            "time": 1691960942,
            "translated": false
        },
        {
            "author_name": "Arthur Becker",
            "author_url": "https://www.google.com/maps/contrib/101734934042438607847/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocImXZri2O9hPDrWE_VlEXbrv1Mf2B4vch_c8BVMvVlgu1D0Ug=s128-c0x00000000-cc-rp-mo",
            "rating": 1,
            "relative_time_description": "6 months ago",
            "text": "The location is great but the prices they are charging are unbelievable. You pay 65€ p.p. for the sunbed and additionally 15€ p.p. for a towel. In my opinion way to overpriced, as the service is not exceptional in any way. I would recommend to lay on the beach next to the restaurant, as it is for free. Highly overpriced!",
            "time": 1716036416,
            "translated": false
        },
        {
            "author_name": "Tímea",
            "author_url": "https://www.google.com/maps/contrib/100069427192033902952/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU7VqqglNU15Qo2IlptYa0-ZJsEcB6gR9f5dmXNrMCUmaAoY7lf=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 4,
            "relative_time_description": "a year ago",
            "text": "Food was nice, waters and waitresses are smiling and kind - if you are alone expect that you will sit on the high chairs to have lunch.\nTook the shrimps with avocado and cucumber (with some bread) and the raspberry with lime zest and whipped cream - everything was fresh and tasty. Also don't miss the yellow smoothie with passion fruit 😉",
            "time": 1690392244,
            "translated": false
        }
    ]
}