{
    "name": "Excelsior by Geisel",
    "rating": 4.5,
    "reviews": [
        {
            "author_name": "Rob Stevenson",
            "author_url": "https://www.google.com/maps/contrib/105139575995827297424/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLp2o5lhCK5cqJJ_Z89nYTrgOp4IYBWEiYWXJaTCGE8FG1JUw=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 4,
            "relative_time_description": "2 months ago",
            "text": "We stayed here for one night en route from the lakes of Bavaria. The hotel itself is lovely. Very clean and comfortable. Our room was large and well decorated in a modern Bavarian style Although the location is very central it is not a very attractive area, however don't let this put you off. I think the area is being regenerated. There were no tea/coffee making facilities in the room which was a shame.",
            "time": 1726326801,
            "translated": false
        },
        {
            "author_name": "Erin Jeckel",
            "author_url": "https://www.google.com/maps/contrib/109748191654285792671/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU8dsSU06YLewNgnjcqaxBTaKY5Rzt47afDZ7VuPaKdZmiSDrVx=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 4,
            "relative_time_description": "a week ago",
            "text": "We stayed here for two nights during our trip in Munich. The location is on the very end of the shopping strip/section. It’s about a 10-15 minute walk to the shops and restaurants. Our room was clean and the staff were friendly and helpful. I LOVED the heated bathroom floor, especially since we stayed in November during the winter. We opted out of the breakfast to explore on our own; it was a bit pricey at 22 Euros per person. The cost was very reasonable too. Although it’s not accessible by car, they did validate parking (half the cost) for the nearby parking garage. The only difficultly we had was trying to locate the hotel among the construction in the area.",
            "time": 1732274823,
            "translated": false
        },
        {
            "author_name": "Luke Caneff",
            "author_url": "https://www.google.com/maps/contrib/111685172658508351290/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJyWKmhfKN-KuJrI0jIvP-okoa61Yst_S1k6o5qpMbWoKwThg=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "What a spectacular hotel! The staff is wonderful and the hotel is perfectly located between HBF Station and Old Town. Many restaurants and shopping areas to choose from as well. The rooms are updated, clean, and very comfortable. We tried the breakfast buffet which was nice, but a little expensive. I’d recommend exploring the local restaurants and coffee shops. We will stay here again without hesitation!",
            "time": 1728795392,
            "translated": false
        },
        {
            "author_name": "Brandon Davin",
            "author_url": "https://www.google.com/maps/contrib/115910017124626540242/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJX8fcBE-LKWlm-3knxF40Yt3aru81h9KV8zhSQgN1fPXakSA=s128-c0x00000000-cc-rp-mo",
            "rating": 2,
            "relative_time_description": "2 months ago",
            "text": "My family and I had a trip to Munich for one night and stayed here. The location is only decent because of its proximity to the main train station. Outside of that, the area around felt a little sketchy.\n\nWe also had a bad experience with the service and room in the evening. There was raw sewage water coming up through the bathtub drain that smelled awful. We called the desk, which tried to come fix it and they seemed to not know what to do.\n\nFirst we were told there was not much that could be done as they had no rooms (however, we looked on the website and saw that we could book rooms for that evening). They then offered us a room key to another floor so that we could “use that bathroom”, but stay in our room that smelled, which made no sense. Finally we had to tell them that we are not staying in this room as it’s a a health hazard and that we were checking out first thing in the morning. They finally “found” rooms for us, one of which did not have AC like our original room did. At this point, it was nearly midnight and we took what we could.  This could have clearly been handled better by the hotel, and I would have been fine if we were moved to another room much sooner by the night desk staff. We mentioned to the front desk in the morning, and were just given a “sorry”.\n\nI would not advise staying at this hotel.",
            "time": 1725741964,
            "translated": false
        },
        {
            "author_name": "Anwin Arifin",
            "author_url": "https://www.google.com/maps/contrib/100362647768344833729/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX66apPlDTn13RWvCIdbIMJjDRwjsuNWZ-xuuQUVSYbYFRyaQY=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "a week ago",
            "text": "Less than 10 mins walk from Munich HBF. Got a Rewe supermarket nearby. Excellent neighborhood. Staff were extremely professional. Quick check in & check out. Clean & big rooms/ toilets. Comfy beds & pillows. Good quality & abundant toiletries. Amazingly clean premises. They even stored my luggage for free after checkout which is a great help. Overall an amazing stay. Would definitely stay here again.",
            "time": 1732268730,
            "translated": false
        }
    ]
}