{
    "name": "Flemings Hotel München-City",
    "rating": 4.5,
    "reviews": [
        {
            "author_name": "Антон Фадеев",
            "author_url": "https://www.google.com/maps/contrib/115717980033560225007/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIiOfBumhECzZxXqSdwVnEy7cvfnxYGpKfjGlwVfo3gUcX-Pg=s128-c0x00000000-cc-rp-mo",
            "rating": 1,
            "relative_time_description": "2 weeks ago",
            "text": "stayed for a couple of nights. well what can I say.. this is the worst experience with 4 star hotels. the rooms do not match those stated in the description (much smaller and very dark), the shower is made of transparent glass... made of transparent!!!! maybe someone is so open... but not me!!! I don't know who and how rated this hotel at 4.6 on Google, but I would give it 3 stars with a stretch 🙈 when entering the room, a pungent smell of bleach hits your nose... we waited an hour for it to disappear... the breakfasts are very mediocre, as in 2-3 star hotels... I will say again that the toilets are terribly made... a small stall with a toilet and a transparent shower... I do not recommend for that kind of money!!!! besides, there were no more parking spaces in the parking lot and they sent us to another parking lot... saying that it was our problem... and there was no reception there...🤪🤪🤪",
            "time": 1731714732,
            "translated": false
        },
        {
            "author_name": "Maria Lavik",
            "author_url": "https://www.google.com/maps/contrib/107436734040410072316/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJPPCRdiu739WVde7LElTCnJm_1IiEaW1eGB8eJFCGKyxAimA=s128-c0x00000000-cc-rp-mo",
            "rating": 3,
            "relative_time_description": "a month ago",
            "text": "Looks better on the pictures, I expected more for 180 euro per night. Half of the lamps in the room did not work, and the promised yoga mat from the room description was not to be found. Workout room did not have good ventilation. Very convenient if you are travelling from Hauptbahnhof though.",
            "time": 1729062872,
            "translated": false
        },
        {
            "author_name": "Max Crow",
            "author_url": "https://www.google.com/maps/contrib/117060427816362755405/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVPsiZv2FuDdfMZHPtcJ_sKqyG8FYh8-jCasMLBiv_TbWFBvWg=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "We found this hotel as a very nice place to stay. It's located right in the city centre of Munich, steps away from Munich Hauptbahnof and walking distance from the Old City and its attractions. Very warm and welcoming reception staff, good-sized and clean room, comfortable beds and delicious breakfast are few of benefits one can get staying there. Highly recommended. We will definitely come back. Thank you.",
            "time": 1725961795,
            "translated": false
        },
        {
            "author_name": "Patrick Robinson",
            "author_url": "https://www.google.com/maps/contrib/105607368350928199852/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWPR4P6vqQMUtsFxFx8oZZGJWjO-DXfJKnVAwS7GBgho036XnIN=s128-c0x00000000-cc-rp-mo",
            "rating": 4,
            "relative_time_description": "4 months ago",
            "text": "We had stayed at a Fleming's Hotel in Frankfurt and expected this hotel to be similar, but were a bit disappointed in the room's appointments.\n\nThe room was of a good size, but the wardrobe was kind of small and inadequate for a stay as long as we had planned. It would have been a good size for a single person staying for a few nights. I ended up requesting a second sling luggage holder so we could operate out of our suitcases.\n\nThere  was  only one chair in the room besides the desk chair. The bed was comfortable, the housekeeping staff did a good job  keeping the room clean. They put out drinks for us at least every other day, including bottled water. I think they may have given us a room for handicapped guests based on the toilet, which had fold down arms that made it throne-like,\n\nWe did not eat at the restaurant except for breakfast. The breakfast buffet was outstanding in my opinion, as was the attentiveness and friendliness of the restaurant staff. On a few of the days, there was a large group of breakfast customers, which had the staff a little overwhelmed, but they certainly tried hard. When the atmosphere was a little more relaxed, they did a very good job of keeping up with customers desires.\n\nOne of the young ladies deserves  particular praise, in my opinion - she saw that i had left my backpack hanging on the back of my chair after breakfast. She ran a block and a half to get it to me as we were on our way with our luggage to catch the Lufthansa Express bus to the airport. I would have figured it out when I didn't have our return tickets for the bus, but she saved us a lot of time and effort. I wish I had asked her name.",
            "time": 1722782230,
            "translated": false
        },
        {
            "author_name": "Thomas Egdorf",
            "author_url": "https://www.google.com/maps/contrib/117003524976117346145/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK-1Hq4pyjJ-H5M7iiSefbOwq4a3rF2zXJfMtg62MwCVE5Qnw=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "4 months ago",
            "text": "Joelle at the breakfast was excellent, while all the staff were good she was great, big smile, efficient and welcoming.  The front desk staff were very helpful with directions.  The location, across from the train station was great! The housekeeping department was bad, I had to ask for things several times.  Each time the room was cleaned there was something missing.",
            "time": 1722255466,
            "translated": false
        }
    ]
}