{
    "name": "Eden Hotel Wolff",
    "rating": 4.4,
    "reviews": [
        {
            "author_name": "Alice",
            "author_url": "https://www.google.com/maps/contrib/113105209548535004819/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLQqNy-pZPALv4uV3Wq5n47cW35oHMJc5o08HVVE5fBYJiF=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 2,
            "relative_time_description": "in the last week",
            "text": "Definitely not a 4-star hotel in my opinion.\nThe standard single room, while clean, was tiny - there wasn’t even a place to set my suitcase. I had to sort of balance it on a stool by the “desk”. There was no kettle or coffee maker or mugs or glasses (except one by the sink) in the room. There was no closet - just a bar about a foot in length with some hangers over the night table.\nThe service was non existent and I don’t know whether it was because I speak very little German (I try my best) or it was because I am a female. After waiting to check in while one receptionist ignored me the other gentleman behind the desk began to serve me, realized I spoke English and just turned away and began to help a man who spoke German. I understand that his English was probably as bad as my German and he wanted someone else to serve me but to just turn away without an explanation was rude.\nThe breakfast food was good, but here again I noticed a difference in service depending on whether the all male staff members were speaking to a male or female. To men it was “please sit anywhere” and to women it was “you sit here”. And to further this point, the only person that seemed cheerful and non-condescending was the FEMALE who help me with the check-out. I’m not sure of her name but she was fairly young and had long blonde hair, and I don’t wish to include her among my assessment of the rest of the staff, she was pleasant.\n\nThe positives? Location is good and there weren’t a bunch of screaming kids running around the hotel.",
            "time": 1733039816,
            "translated": false
        },
        {
            "author_name": "tracey gardiner",
            "author_url": "https://www.google.com/maps/contrib/114999411699423731194/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWNAgXX0tl7zRhSLUEf5-fB1U3FFOUpxi-ckbYBl3GD_zZzD44=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "This was our last stop for two nights after over 3 weeks of travelling. We were hoping for a comfy bed in a spacious room that was quiet. And we got all of that. Forgot to take a video but it was very spacious. Mostly clean except the window sill (had a bird poo on it). With the window closed it was very quiet. Opposite train station so location was perfect and a short walk into the old town. Advised to use the underground walk ways as more pleasant and quicker.\nThe service was excellent. They gave us a kettle to use as we like a cup of tea and offered a coffee because we were missing breakfast. They also let us know about getting the bus to the airport which we would t normally do but was very easy and cheap too.\nThe only problem with the room 324, was the shower was in the wrong place and didn’t go long ways with the bath so the water all went in the floor. I ended up just using the bath.\nWe also had dinner at the restaurant attached and it was lovely and reasonable priced.\nThe breakfast buffet was very plentiful and lots of choices. Great service.\nI also found the history of the hotel very interesting",
            "time": 1725949267,
            "translated": false
        },
        {
            "author_name": "Fabian V",
            "author_url": "https://www.google.com/maps/contrib/109794694525590481159/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL3eKN3wRD9qSRBvR4Px82N-fhac4ydYoBK5q9snw0A4G9q2w=s128-c0x00000000-cc-rp-mo-ba6",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "I really enjoyed staying in this hotel.\nI have recently visited the Oktoberfest and stayed there for the second time. Both times the rooms were clean, the staff friendly and forthcoming and the breakfast great.\nThe location is impeccable as it is right next to the central station.\n\nDuring the Oktoberfest times you’d definitely need to book in advance.",
            "time": 1728198222,
            "translated": false
        },
        {
            "author_name": "Kerrie Gurney",
            "author_url": "https://www.google.com/maps/contrib/108474622290736061789/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWDqaEdhU-AVAvx9I4pVRrNWfb9GEitd-QYdLS-KKEHBhMRYPwP=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "Eden Hotel is a short walk across the road from the train station and so central to walking to all the sites in Munich.\nThe room was fabulous with very comfortable bed and a window we could open for fresh air. Breakfast was great with GF options available",
            "time": 1729412047,
            "translated": false
        },
        {
            "author_name": "Eerik Durejko",
            "author_url": "https://www.google.com/maps/contrib/104431355602247496682/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVL595A7uGdVbX3nP0ha6hf7PRXF9HowWUDc_9Dh5k4pEmjffuFDA=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "We arrived before the check in time and could already get into the room. The rooms and bathrooms are a bit dated but clean and the bed was comfy. Breakfast had plenty of choice. We also ate lunch at their restaurant and the burger, schnitzel and pork were good. The bar looked very classy as well but we didn't have time to visit it. Located close to the central station but not much to do close to the hotel so need to take public transport to visit old town and other attractions. Staff was friendly, we left our luggage at the hotel on the last day.",
            "time": 1724150327,
            "translated": false
        }
    ]
}