{
    "name": "Palazzo Alabardieri",
    "rating": 4.5,
    "reviews": [
        {
            "author_name": "Elisa",
            "author_url": "https://www.google.com/maps/contrib/117971730632267913500/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL9xm9wHAyEidCz8N6eH-Lxf31C1lrf1p6XuQYmT2p2n_bFdg=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "5 months ago",
            "text": "We just stayed 2 nights in Naples and were thrilled with our choice.\nThe hotel has everything you would need and its decor is classic. The beds were large and firm, bathrooms were large ( we finally had counter space during our visit to Italy), and the rooms overall were updated. We had issues with our ac because we tend to sleep in really cold conditions, however we were able to sleep comfortably. Also the room walls seemed thick because it was very quiet during our stay.\nWe had done our research and this location was highly recommended and with good reason. The hotel is blocks from the water where people stroll down the boardwalk. There are so many restaurants, bars and high end shops, it gives a different feel than the other areas in the city. Very safe to walk around during the day and night, the restaurants we ate at in the area were delicious (especially Humberto’s) with great customer service.\nAlso want to mention that the hotel staff, from the front desk to those cleaning the rooms were very helpful and accommodating.  We appreciated the complimentary breakfast to start our day. They had a good variety of food.\nHighly recommend staying here if coming to Naples.",
            "time": 1718701422,
            "translated": false
        },
        {
            "author_name": "Val Hall",
            "author_url": "https://www.google.com/maps/contrib/115184524940192774669/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIhQouVkSAtS5aBqyr8v2RBKvz-N3g-vIWqOXs97xlS77e6HQ=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "Fantastic stay at Palazzo Albardeiri lovely rooms ,we had a balcony ( no view but a great way to have an outside little area) very clean ..great service..fab breakfast with friendly staff .location is excellent just round the corner to amazing shops bars and restaurants would definately stay here again and highly recommend ..beautiful hotel very happy with everything. one down side ..high charge at end of our stay 75 euros for 4 of us for 4 nights seems steep !",
            "time": 1727383725,
            "translated": false
        },
        {
            "author_name": "Anna Din",
            "author_url": "https://www.google.com/maps/contrib/106779467869254846524/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVRKyapPY8v7Hwol9iwXZvF0GWyzftGTU9-GTsFoechR8vU_BA=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "8 months ago",
            "text": "The hotel is located in a really safe part of town. Safety was a concern for us as we were researching Naples.  Restaurant Umberto is walking distance, and is excellent.  There's a super-market walking distance so you can pick up water and other items.  The complimentary breakfast buffet was really great, and had a large selection of items.  We really enjoyed it.  The room was a bit small, but it was not a problem for us.",
            "time": 1712169495,
            "translated": false
        },
        {
            "author_name": "Laura Tedeschini Lalli",
            "author_url": "https://www.google.com/maps/contrib/109858074771812749841/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLxTYZbwmcb2CVLf-geJlW6bFwNDgWkhyMZU60fXeh_IM_aew=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "great hotel, great staff, great breakfast, very confortable bathroom, proper, appropriate and very clean linens.\nstaff at breakfast will go out of their way to accomodate your needs",
            "time": 1726580076,
            "translated": false
        },
        {
            "author_name": "Ange",
            "author_url": "https://www.google.com/maps/contrib/100101179981552057053/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL4ZOwO_OBuv49uJuCmMUfaTZgW3jXhs3X7LdcnHUizNw3cdA=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a year ago",
            "text": "We spent 8 nights at Palazzo Alabardieri and thoroughly enjoyed our stay. It was a lovely oasis to come back to after sightseeing everyday. The hotel room was quiet, spacious and beautifully appointed. The room was serviced everyday to a very high standard. Breakfast was included and provided a wonderful choice of continental & English style breakfast. All the staff were very friendly, professional and very helpful. Martina at reception was especially helpful by organising sightseeing tours for us (some at the last minute). We will definitely be coming back! Highly recommended.",
            "time": 1698585122,
            "translated": false
        }
    ]
}