{
    "name": "Antica Pizzeria Di Matteo",
    "rating": 4.3,
    "reviews": [
        {
            "author_name": "O Okan",
            "author_url": "https://www.google.com/maps/contrib/112601579503292878443/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKH-2YbznVklOp6ZTGRV7hvTexdMuN2xstFBV9Uejc521p4MA=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 3,
            "relative_time_description": "2 months ago",
            "text": "It was a somewhat weird experience to enter the pizzeria from a crowded storefront to find out that there is a second floor reachable through a claustrophobic stairway. I think the pizzas are ok and reasonably priced but nothing outstanding. Incidentally, they have one of the most handsome domed furnaces. This place has an AVPN certification (no: 42, apparently since 1990) which is always a good sign but an earlier certification date is not an indicator of higher quality rank among the certified places. On a final note, they honestly need to improve their service quality because their aura is not genuinely/openly welcoming.",
            "time": 1727977265,
            "translated": false
        },
        {
            "author_name": "Lisa Ciechowski",
            "author_url": "https://www.google.com/maps/contrib/102538300725583745043/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVenlRYCdXunLC3Cvood1cjNlTu67QXnObz3w0JglW-smpf7sU=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 3,
            "relative_time_description": "5 months ago",
            "text": "Poor service quality. There were so many waiters but none of them was attentive. We had to wait for our order to be taken for a while and people who came later were served before us.\nWe ordered a starter (frittatina) and it was almost cold - it didn’t taste fresh at all.\nThe pizza was fine but the dough a bit chewy and hard.\nWe were placed next to the restrooms and we could smell it - disgusting.\nIn general, the pizza was fine but the service requires an upgrade, especially for the fact that they ask 15% from the bill service charge what is hilarious in that case.",
            "time": 1719695833,
            "translated": false
        },
        {
            "author_name": "Tom Groen",
            "author_url": "https://www.google.com/maps/contrib/110986349904340724137/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXeIoK9_iCTSzQh8LHhnLEgBtvmLV0A3dFqDIMksVHpgCJvwSDk=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 4,
            "relative_time_description": "a week ago",
            "text": "Strange entry to the restaurant. We stepped in during a crowd at the front and found out there's a restaurant upstairs.\n\nWe had a Margherita Buffalo and a Margherita Funghi. These were tasteful, but especially Buffalo was filling, due to the amount of oil which was floating on top of the pizza. Service was friendly and fast. Overall a fine experience.",
            "time": 1732433400,
            "translated": false
        },
        {
            "author_name": "Scott Wilezol",
            "author_url": "https://www.google.com/maps/contrib/107772389373297372515/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJBGHWv-xcu2qCHgtjorWZ_FNM97KA_NfBcw2PvvFxmnPRUOg=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 2,
            "relative_time_description": "2 weeks ago",
            "text": "Located in the Centro Storico district of Naples, Italy is Antica Pizzeria Di Matteo was highly recommended by many different sources.\n\nStarting with the food… outside in the grab and go section, people flocked around for the fried street foods…. So you’d assume it was good… WRONG!\n\nWe sat inside and ordered an arancino, some fritter thing and the Nudja pizza. Each of them were truly horrible. The worst examples of each I’ve ever had. The arancino had mushy rice, undercooked exterior and a bland under-filled interior. The pizza was one of the poorest examples of Neapolitan pizza I’ve ever eaten…. It was like a chewy, gummy, rubbery cardboard cracker… lacking the typical high fluffy, puffy light crust. The nudja was actually good and spicy.  I’ve had better Neapolitan pizza in other parts of Italy as well as other countries! An Abomination to what should be a work of art. With so many spectacular pizzerias in Naples, why would you waste your calories, money and time on this slop??\n\nService was abhorrent. Normally I don’t care to much if the server is off… just give me good food like a human being and I’m happy. Here, they are simply angry at the world… slamming things on the table, grumpy, growling, short… obviously unhappy to be there.\n\nApparently Bill Clinton visited in like 1725 or something and that’s all they talk about and are resting on those laurels.\n\nDo yourself a favor and DO NOT GO HERE!",
            "time": 1731937049,
            "translated": false
        },
        {
            "author_name": "Kuba K",
            "author_url": "https://www.google.com/maps/contrib/108378155568122107382/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI_kPcdx3ZEiGx4wbkt_HsinkXIgwb0BmxD8bgV6i_lMRRRhw=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "4 months ago",
            "text": "Great Italian street food.\nPizza portafoglio aromatic on a wonderful dough.\nDelicious arancini and frittatine di pasta.\nAn ideal place for a small snack and further tour of Naples.\nI recommend to try these delicacies.\nYou can also sit at a table inside",
            "time": 1721912709,
            "translated": false
        }
    ]
}