{
    "name": "Millennium Gold Hotel",
    "rating": 3,
    "reviews": [
        {
            "author_name": "Let's Fly",
            "author_url": "https://www.google.com/maps/contrib/114169273451840718273/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLmmILaPHNl-OalHlUCPCUV6MyG6pNDVuTKiMC_MDcfDTyb6nw=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "I’m a flight attendant and didn’t make my flight home. All other hotels were booked couldn’t stay in airport. Called this hotel and they had a room. Walk was about ten minutes wasn’t bad. Got to the hotel he remembered me checked in early. For the price I thought it was a good deal plus free breakfast! Our room was fine and we felt safe and it was clean! Good communication! They saved us from having to sleep on a bench outside the airport. Good place for some sleep and a hot shower. I Reccomend  this place for somewhere  close to the airport and grateful we got a room! Sad I didn’t get the gentlemen name I talked too!!",
            "time": 1728299949,
            "translated": false
        },
        {
            "author_name": "Bruce Johnson",
            "author_url": "https://www.google.com/maps/contrib/110259458177978635508/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVFpQy1uJU5Sdxh7F4egsfyvjsH9VySnzIdLIUeSIdOUiglFwoqWQ=s128-c0x00000000-cc-rp-mo-ba6",
            "rating": 4,
            "relative_time_description": "2 months ago",
            "text": "A nice hotel conveniently located close to the airport, easy walk. The rooms are plain but neat and clean. The breakfast was very nice with a range of food items with excellent servers.",
            "time": 1727876969,
            "translated": false
        },
        {
            "author_name": "D Cilluffo",
            "author_url": "https://www.google.com/maps/contrib/101109200600994203867/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLohsCabFGCoRXx84yvQHUHVUtLo7OVxci5Yvr9aacThR0Dyw=s128-c0x00000000-cc-rp-mo",
            "rating": 4,
            "relative_time_description": "4 months ago",
            "text": "Depends on what your looking for…… Next to the Napoli Airport, location was perfect for late arrival, rental car pick up, and early morning flight. Do not expect a 5 star hotel but let me tell you all the things it did have and why we enjoyed our stay. Our family of 6 could stay in 2 rooms as the kids had bunk beds and could all be together, we’ve stayed here several times. To pick up and return a rental car it’s a 2-5 minute walk, and they have a gated parking lot for you to park your car in. This hotel is also CLEAN, comfy beds, air conditioned, and offers several toiletries so you don’t have to unpack your suitcase completely. If something isn’t right or needed they are helpful and accommodating. Large breakfast selection and a variety of items to select from, eggs, bacon, and pastries. Want an espresso, just ask the lovely staff and they are more than happy to help you. As I said, this is not a fancy place but the simplicity and location are always ideal for our family.",
            "time": 1721054867,
            "translated": false
        },
        {
            "author_name": "Aniko Szabadkai",
            "author_url": "https://www.google.com/maps/contrib/115105398018227033233/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKFr7FL65FrtimppEGU8c3haucmlmLWCcboWLJHiqNdt3XFRA=s128-c0x00000000-cc-rp-mo",
            "rating": 4,
            "relative_time_description": "2 months ago",
            "text": "Convenient for sleep-over after a late night flight. Room was spaceous, clean. Close to the airport (creepy surroundings though). Very noisy, evidently mostly used by people arriving late or must leave early.\nAll in all did the job which was to have a bed before travelling further in this beautiful country.",
            "time": 1726984706,
            "translated": false
        },
        {
            "author_name": "Arvind Siddamshetty",
            "author_url": "https://www.google.com/maps/contrib/103791403018377976801/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ4LwEWMWe7owmBgQbWaafG7rvbjX77pDBuNA9HOaMVMsHpyQ=s128-c0x00000000-cc-rp-mo",
            "rating": 1,
            "relative_time_description": "3 months ago",
            "text": "While checking into the hotel we asked if they had airport drop off service and they confirmed they did it 24/7. Airport drop-off at 3:45 AM was crucial for my early morning flight. We reconfirmed the night before too! However, on the day of my departure, the man at reception refused outright to provide the service, leaving my family stranded and scrambling to find alternative transportation. This was extremely inconvenient and caused unnecessary stress. The man was unhelpful and indifferent to my situation and claimed they never dropped off historically! We expected better customer service, especially for something as important as airport transfers. Very disappointed and won't be staying here again.",
            "time": 1723414220,
            "translated": false
        }
    ]
}