{
    "name": "Hotel Toledo Napoli",
    "rating": 4.1,
    "reviews": [
        {
            "author_name": "Katherine Lee",
            "author_url": "https://www.google.com/maps/contrib/116179583543682093991/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXZsyo81Wpk2KyS1ArZQMzN4eBVPf1quVWWn9F_S7xauelqgB7g=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 3,
            "relative_time_description": "2 months ago",
            "text": "This is in the heart of the old spanish section, great locality but very noisy..  bar bellow window where socialising was until 4 am. Staff are really lovely and helpful. Room was tidy clean towels and sheets, daily room service . However grubby. Needs deep clean. Stains.. build up on taps ect. If you want authentic Italian 1970s then this is it. It has charm to it. Like staying at Nonna's.",
            "time": 1726818505,
            "translated": false
        },
        {
            "author_name": "Ricardo Ventura",
            "author_url": "https://www.google.com/maps/contrib/108222994143384494904/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIMaRk5ye5SAVTKALaJpEaIaZ_2MP8M_WznP-o4Rq_DD1vHFw=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "This place gave us the real authentic Italian vibe that \" modern \" hotels LACK completely. The staff was very helpful and learning a bit of Italian would really help to explore the surrounding area as it will give you the Italian experience to its fullest extent 👌 Those people who complain about the noise why not join them as we drank and ate in the local restaurants but please speak in Italian no matter how rough as they will appreciate it 👍",
            "time": 1728123156,
            "translated": false
        },
        {
            "author_name": "Adventure Coordinators",
            "author_url": "https://www.google.com/maps/contrib/117008889298937416269/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWEScvQJafYXOszniT1xWksTuw3ikHj2LEVglvEG9mXcCUfTLHz=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 1,
            "relative_time_description": "a year ago",
            "text": "I had a client stay here and she was not impressed.  \"As for the hotel…it was a number of things.  It was located in the heart of the old quarter in the middle of a maze of small congested streets, full of people who were all celebrating Naples’ win of La Liguea.  Normally that sort of thing is very energizing and fun to be a part of but it was overwhelming as you couldn’t get away from it.  The location would normally lend character and charm to the hotel but it was tired, dark, dingy and not very clean…cobwebs everywhere.  Stains on the walls and linens and I refused to take a shower as I didn’t have shoes I could get wet.  The bed was old and full of springs that stuck up.  It was loud and noisy.  The party outside lasted until 3am…and the building did nothing to block the sound.  Door locks were not very secure.  The other guests were creepy.  The staff was very nice and did try to accommodate but they were not equipped to answer my touristy questions.  Every member of staff I met asked me if I was alone and seemed quite surprised when I confirmed that I was….which didn’t fill me with confidence.  Some of that might have been cultural with views of women travelling alone but it did seem they were very surprised I would have chosen to stay at their hotel.  There is no way it was worth the money I paid.  I would rather have paid double for a place I felt better about staying at.\"",
            "time": 1680551813,
            "translated": false
        },
        {
            "author_name": "E. S.",
            "author_url": "https://www.google.com/maps/contrib/112554003092263970852/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUl7nBQv2ky0P3GP5b4LwQ5LZhEmKAwZcXd6MYPS_8vIzZsBNbq=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 2,
            "relative_time_description": "8 months ago",
            "text": "I am not a fancy pants traveller, but this room was dirty and old.\nNo decent bedsheets, but only counterpane on the bed.\nNo english speaking person finally organized a spare bedsheet, that had blood stains on it.\nThe noise is terrible from the bar right under window.\nTake your ear plugs with you!\nLocation on map is excellent. Right next to Toledo metro and romantic spanish quarters.\nBut due to cleanlines issues and noise - not recommended.",
            "time": 1711491076,
            "translated": false
        },
        {
            "author_name": "bonne nuit",
            "author_url": "https://www.google.com/maps/contrib/101525595572335273983/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLeDTNKXh4Voldbmujy_tzuAM4B0WhfONa-OqY4SYiHAuFa4A=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 1,
            "relative_time_description": "a year ago",
            "text": "Oh my god !!! Noise until 3 am. Every night. Dirty room. Horrible dirty shower. Hotel \"back to 1975\"... but the young staff is very sympathetic. I had a problem with A/C , he came and fixed it telling me that it sometimes happens... hotel is in a little pedestrian street. A lot of noisy bars and pizzerie all around. It's 1 minute to the metro Toledo. Not expensive hotel, approximately 130€.",
            "time": 1687095704,
            "translated": false
        }
    ]
}