{
    "name": "Hotel Vergilius Billia",
    "rating": 3.7,
    "reviews": [
        {
            "author_name": "Son Tung Nguyen",
            "author_url": "https://www.google.com/maps/contrib/105716481999276326201/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJKAmsql5DZH02Ho6oQjM88w5HTw4X3fn8m8H1-liXpsZO2Cw=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 4,
            "relative_time_description": "4 months ago",
            "text": "The rooms were minimalist but clean. However, there were no glasses provided in the room or bathroom. The air conditioning was only moderately effective, and the rooms were quite noisy.\n\nThe staff were friendly and helpful. There is a restaurant next to the lobby where you can have dinner spontaneously, and it also serves as the breakfast room.\n\nThe breakfast was okay, with a lot of pastries available. You get two complimentary hot beverages, but the third one comes at a cost.\n\nThe location is excellent and very central. It’s a 5-minute walk to the main train station and a 12-minute walk to Pizzeria Da Michele.\n\nOverall, it’s a solid hotel for a fair price.",
            "time": 1721476514,
            "translated": false
        },
        {
            "author_name": "Claire MONTEIL",
            "author_url": "https://www.google.com/maps/contrib/103489587321869434661/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJNJeZqLQxodcbWEVr7CbBMmW-wRjy7-yvfu9gMI5sYwDU9JQ=s128-c0x00000000-cc-rp-mo",
            "rating": 2,
            "relative_time_description": "a month ago",
            "text": "We needed to book 5 rooms, they told us they were available but need to be booked through the site. Room after room, the prices increased and at the end the 5th room was very expensive and the direction told us it is why they ask us to use the website. In my case, very bad smell inside the bathroom and small insects. Minimalist room. Breakfast with paper glass to drink juice and plastic spoon to eat yogurt. Staff was nice and helpful.",
            "time": 1729280033,
            "translated": false
        },
        {
            "author_name": "Ruza Saric",
            "author_url": "https://www.google.com/maps/contrib/116972742627582785029/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJAuvcia8RTWz8c8DAyi3e5Tkg3b7SwNhCOjVizm4GKgQLyog=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "The restaurant is especially great value with 2 types of tourist menus, meat or seafood. We had meat that started with amazing gnocchi in tasty cheese/tomatoes  sauce. The meat was grilled pork large piece, fries, big arugula salad. Water is included, as well as limoncello liquor and coffee, all for 18 euro this October 7, 2024.",
            "time": 1728428260,
            "translated": false
        },
        {
            "author_name": "Maeve O'Toole",
            "author_url": "https://www.google.com/maps/contrib/107741527736084228880/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWxJvwcy0h8eco8cVHURE2QC3dK2_okuQZ49aUv6SmCSHuvdXLb=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 3,
            "relative_time_description": "2 months ago",
            "text": "Near main train station so very convenient.  Rooms very basic. Staff are absolutely lovely. Breakfast was OK..  good choice but bread was stale. Great if you have an early train to catch to get out of Naples.",
            "time": 1726239087,
            "translated": false
        },
        {
            "author_name": "Evija Vanaga",
            "author_url": "https://www.google.com/maps/contrib/111743754399896357586/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWqi-E2VUlsVOEl_BaaSD-ismgpSYbq2OZ626qfuKYeElX6rzU=s128-c0x00000000-cc-rp-mo",
            "rating": 1,
            "relative_time_description": "2 months ago",
            "text": "We had a dinner there yesterday in evening before closing , we asked as it was late if it’s possible to have a dinner there, guys said yes. They showed table , waiters were polite , but food (pasta) was over the top salted/papered  it was hard to eat them because of salt and pepper .(later we had awful abdominal pain from too much salt) We didn’t make a scene there because it was late and we wanted to eat something. Tiramisu serving also was vulgar- they stucked the fork in food side way and then bring it like that. It’s not something what normally you can see in restaurants.And the best (worst part) was when chef come to dinner hall just to laught at us. I can not understand why to take order  if maybe it’s too late or something, we would understand if they would say sorry no more orders,and how a chef can give food like that to anyone?That’s  just so  disrespectful,disgusting and sad experience. Hope that’s not every day practice there.Definitely never come back!\nP.s this is my first worst experience and first time when I leave negative feedback.",
            "time": 1727192491,
            "translated": false
        }
    ]
}