{
    "name": "Royal Continental Hotel",
    "rating": 4.3,
    "reviews": [
        {
            "author_name": "ye gane",
            "author_url": "https://www.google.com/maps/contrib/117815525932332109084/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXeXqjnUpxcSNZw_VkeCAV8pgIj-OreR88j5stotBJHZiDH14-k=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "in the last week",
            "text": "We stayed at the Royal Continental Napoli for five nights and had an excellent experience. The hotel was very clean, and all the staff—reception, housekeeping, and restaurant teams—were extremely polite, professional, and attentive.The view of the Bay of Naples from the hotel was stunning, and the breakfast service was outstanding, offering a wide variety of delicious options.Overall, it was a fantastic stay, and we truly enjoyed our time at the hotel. Thank you to the entire team for making our experience so memorable!",
            "time": 1733056002,
            "translated": false
        },
        {
            "author_name": "Bryn Flohrschutz Peterson",
            "author_url": "https://www.google.com/maps/contrib/114154874370583121056/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUMa11zKWF-5qIECKhhe506kiZLaDoU0qeNyCfq0odO6NGd7xWL=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "Lovely hotel with amazing views of the Mediterranean and the Castle. We had a balcony room for 3 of us and it was perfectly sized, huge bathroom, and sitting on the balcony watching the sunrise and sunset was magical.\n-free breakfast was incredible!\n-rooftop pool is salt water and requires a reservation, we never had an issue reserving and loved the retro style\n-The pool requires swim caps, no exceptions. Everyone is wearing them, just put it on and enjoy the pool!\n-room service food was great, same menu as the lobby bar\n- on-site parking was easy, not expensive, and the attendants were helpful\nDefinitely recommend staying here in Naples.\nOne and ONLY complaint is noise. The floors are all hard, so upstairs neighbors are easily heard. Buskers play music on the walk outside until quite late, you can hear them but it didn’t bother us.",
            "time": 1724312148,
            "translated": false
        },
        {
            "author_name": "Rosa Lopez",
            "author_url": "https://www.google.com/maps/contrib/114306789064122500851/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ5ChHeNqk-xhnXWNDsS9IQHOGIEeiQ8Fn8FU2alJH9ZthF-A=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "3 weeks ago",
            "text": "Centrally located, excellent view from room balcony. Spacious rooms with beautiful scented toiletries. Only 1 flaw was the TV had no service until we requested it and there was only 1 channel in English that after 1 movie the service was lost 🙄 😑. Continental Breakfast was good.",
            "time": 1731229931,
            "translated": false
        },
        {
            "author_name": "Elhadedy Tarik",
            "author_url": "https://www.google.com/maps/contrib/113010012303784049062/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV92D5lORD6924-mV24lavIPZvrg7ejSQwImQwXXo91EjTXwvNc=s128-c0x00000000-cc-rp-mo",
            "rating": 4,
            "relative_time_description": "2 months ago",
            "text": "I recently stayed at the Royal Continental Hotel in Naples, and my overall experience was positive. The location is superb, offering a spectacular view of the waterfront, and the breakfast was very nice.\n\nHowever, the rooms felt a bit outdated, with a crooked TV. On the morning of my stay, the hot water wasn’t working, so I had to take a cold shower. Thankfully, when I mentioned it to the front desk, they kindly removed the €40 garage charge from my bill, which was a nice gesture.\n\nDespite these small issues, the staff was friendly and helpful, and the hotel’s location and views really stand out. With a few updates to the rooms, this could be a top notch hotel.",
            "time": 1726354135,
            "translated": false
        },
        {
            "author_name": "Isabella Artan",
            "author_url": "https://www.google.com/maps/contrib/101241137722784468873/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK0rXG2TO0ksqwtZFXpy1qxreaG5iEA37vquCG0QFh087IMXg=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 4,
            "relative_time_description": "3 weeks ago",
            "text": "Kind of an underwhelming experience. Much better looking hotels in the area for the same price range, chose location blindly. The perfect comparison is a communist hotel in romania renovated a decade ago. You get what you need, service was very nice. Breakfast was ok but we've had much much better at four star hotels. Nothing inherently wrong but won't be staying there again.",
            "time": 1731310798,
            "translated": false
        }
    ]
}