{
    "name": "Scandic Vulkan",
    "rating": 4.1,
    "reviews": [
        {
            "author_name": "Richard M",
            "author_url": "https://www.google.com/maps/contrib/112026271529269252810/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIIQ7KC5H6A_o_6QKOwX4rty58IeGi8RGV8q8tFktMRiTLFDg=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "Love the location. So many great wine bars, restaurants and a running path nearby.\n\nHotel itself is fairly basic. It has a good breakfast spread",
            "time": 1729759515,
            "translated": false
        },
        {
            "author_name": "Jakub “Jay”",
            "author_url": "https://www.google.com/maps/contrib/112062416915093429213/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW_WbRiv2I8-Iqr5Fl2qcKjBgxTvAqSN1oDDryxFexYsv3b2KWY=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "4 months ago",
            "text": "I spent 2 nights at the hotel and I can recommend it. Clean rooms, awesome breakfast and the stuff was very kind. There is a small gym and you can find a bicycle rental station in front of the building.\nIf you decide to walk it takes only 15 minutes to get in city center.\nThey even made me early “breakfast to go”when I was leaving at 5am 👏\nI would like to come back again.",
            "time": 1722745233,
            "translated": false
        },
        {
            "author_name": "L G",
            "author_url": "https://www.google.com/maps/contrib/101611473638829162689/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLqp-A81RUBWgQW-DMmhRrnbOp2AGErPXtgA5jTSvyeoYXnqw=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 2,
            "relative_time_description": "2 months ago",
            "text": "Not quite up to four-star standards—more like a solid three. My first room was noisy, located right next to the road. I requested a quieter room at the front, but was told there were no available rooms or upgrades (apparently, front rooms must be requested in advance).\n\nMy standard room, while clean, was very basic, small and felt quite worn. There were signs of neglect, like painted-over sockets with peeling paint and fixtures that had seen better days. The space overall lacked the attention to detail and comfort expected of a four-star property. For instance, there was no tea or coffee set, and the iron provided was basic, along with a tiny, torn ironing board.\n\nBreakfast was a standard buffet with nothing memorable.",
            "time": 1728051997,
            "translated": false
        },
        {
            "author_name": "Lady Oceanna",
            "author_url": "https://www.google.com/maps/contrib/111737840347048312187/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIwkDfi1CmqQSChfAlPmQOavgee3NS8uazw_86etIC71Yeu3Q=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "5 months ago",
            "text": "Comfort at a reasonable price. Shower pressure a bit low but the facilities are very modern.  Wonderful breakfast included.   I enjoyed the salmon and eggs every morning plus the wide variety of fruit, meats, breads and fabulous coffee. Helpful staff.  Clean. Security is a priority. Great location next to the Mathallen which has a large range of restaurants and bars all under one roof.  Easy access to town centers by bus (cash only or purchase tickets at 7-11).",
            "time": 1718459740,
            "translated": false
        },
        {
            "author_name": "Nigel Collinson",
            "author_url": "https://www.google.com/maps/contrib/112680335383354487310/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV8Fsi1R1cBkNWskwAJ_Nx8ezqslKPMEjMYdeCjcgKJrtQyltC_=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "This hotel was chosen for its location and, for me, the inside carpark.\nA note to any motorcyclist :\nReception casually told me to park in the car park. On day one, i did.\nOn the second day, i met a security guard who looked after the car park.\nHe advised me to move my bike and park it in P2, which was a level below. Motorcycles are free to park on P2. With a dedicated area. If I'd left it on P3, I'd have received a hefty bill.\nWhen you drive into the car park, you are greeted with only one entrance. However, further round are the other entrances.\nThe receptionist knew I was on a Moto, and really should have explained this.\nRooms are nice. Roomy and clean.\nBreakfast is fantastic. Huge selection. Everything you could want. Can get very busy at peak times.\nWe used this hotel for its location. The whole city is within 20 mins walking.\nI will use this hotel again.",
            "time": 1723960978,
            "translated": false
        }
    ]
}