{
    "name": "Quality Hotel 33",
    "rating": 3.8,
    "reviews": [
        {
            "author_name": "Laura Hannevold",
            "author_url": "https://www.google.com/maps/contrib/116679214306591990134/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXPxQd9zIwVgWW8YzxnIpScC1hXLZicJpC0cDhT6m1qgffLhN9T=s128-c0x00000000-cc-rp-mo",
            "rating": 3,
            "relative_time_description": "a week ago",
            "text": "We stayed here a couple of years ago, and we were pleasantly surprised by the breakfast buffet's vegan options. We needed a hotel for a night this week and decided to return here, but the standard on cleanliness and the breakfast have both worsened since our last stay. Most of the breakfast items weren't labeled for allergens, some were cooked poorly, and they had significantly reduced the allergen/vegan toppings available. Considering the price to stay here is similar to a dozen other hotels in Oslo, we won't be staying here again.",
            "time": 1732370871,
            "translated": false
        },
        {
            "author_name": "Aleksandr Rogov",
            "author_url": "https://www.google.com/maps/contrib/104540637052217054396/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXk9jULnQz0gmaeicGTer5eA5Qs_CAWFCEuKyfBjg537z6NMDClbg=s128-c0x00000000-cc-rp-mo-ba6",
            "rating": 4,
            "relative_time_description": "2 months ago",
            "text": "I had a fantastic stay at the Quality Hotel in Oslo! From the moment I arrived, I was impressed by the welcoming and professional staff who made the check-in process smooth and efficient. The hotel’s modern and stylish decor created a comfortable and pleasant atmosphere.\n\nThe room was spacious, clean, and well-appointed, with a cozy bed that ensured a restful night’s sleep.\n\nThe breakfast buffet was a highlight, offering a wide variety of delicious options to start the day right. The location is also excellent, with easy access to public transportation.\n\nOverall, my experience at Quality Hotel was exceptional. It exceeded my expectations in every way, and I would highly recommend it to anyone visiting Oslo. I look forward to staying here again in the future!",
            "time": 1726739739,
            "translated": false
        },
        {
            "author_name": "Marcel Weiskirch",
            "author_url": "https://www.google.com/maps/contrib/116968180057291815585/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKu3EDVD_Hu-A5Fiti9riYgfjslVdCeRzhzU7KfXkLZvD36dlY=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 3,
            "relative_time_description": "2 weeks ago",
            "text": "The breakfast was really good and a huge selection.\nThe Hotel in general is very nice.\n\nThe entrance of the hotel is very dark and nearly not as an entrance to identify.\nGot a single person room (403). Very small.\nNo place for clothing storage.\nThe sink in the bathroom was defect and water could not leave.\nBed is directly next to the window.\nWindow can only opened a little bit.\nThe bed was okay. I slept well.\nClose to the hotel is nothing to visit.\nA supermarket is 10 minutes away.",
            "time": 1731664084,
            "translated": false
        },
        {
            "author_name": "Dag Blix",
            "author_url": "https://www.google.com/maps/contrib/105644789835655902480/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWPDNBpB1hOigpRriTRIT1oP0_hkUGnwPqU_9WF17fHr5Bv7fo=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 4,
            "relative_time_description": "2 months ago",
            "text": "Beginning to show signs of neglect with faulty bathroom fittings etc, missing security links on the windows. Apart from that the rooms are fairly sized and comfortable, quiet on the East side away from the motorway. Good solid breakfast in a spacious building. The building itself is worth a visit from an architectural pov.",
            "time": 1726319935,
            "translated": false
        },
        {
            "author_name": "Raphael Green",
            "author_url": "https://www.google.com/maps/contrib/104446538399090325117/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUhbt4J5vsSLSd1Wma-gjHC33kaT0EpViRAoCLH1BmIxRc4z-yVEQ=s128-c0x00000000-cc-rp-mo",
            "rating": 1,
            "relative_time_description": "3 weeks ago",
            "text": "Unfortunately, my experience at Quality Hotel 33 in Oslo was disappointing. The expectations from a 4-star hotel were not met, and I would rate it a maximum of 2 stars.\n\nFirstly, the rooms need renovation. The furniture looks outdated and worn, and the bathroom was not clean enough. The rooms did not match the photos shown on the website at all.\n\nAdditionally, the level of comfort in the room leaves much to be desired. There were not even basic amenities such as a kettle and an iron, which is very inconvenient for guests. The room also lacked a minibar and a safe, which are usually offered in hotels of this level.\n\nRoom service was also lacking. Bed linens and towels were not changed regularly, and the overall cleanliness of the room did not meet expectations.\n\nIf this hotel were rated 2 stars, I wouldn't have any complaints. For a 2-star hotel, it is quite good. However, given its 4-star rating and the corresponding price, it was very disappointing.\n\nThe one positive aspect of this hotel is the excellent breakfast. It truly stands out and is worth mentioning. The breakfast buffet offered a wide variety of fresh and delicious options, including a selection of freshly baked pastries, a range of cheeses and cold cuts, and a variety of fruits and yogurts. The hot food selection, including eggs, bacon, and sausages, was also very well-prepared. The staff in the breakfast area were attentive and ensured that the food was always replenished and tables were kept clean.\n\nOverall, I do not recommend Quality Hotel 33 to anyone expecting a high level of service and comfortable accommodation. Unfortunately, this hotel does not live up to its 4-star rating and is more like a 2-star hotel.",
            "time": 1731138334,
            "translated": false
        }
    ]
}