{
    "name": "Clarion Hotel The Hub",
    "rating": 4.4,
    "reviews": [
        {
            "author_name": "Egil Østebøvik",
            "author_url": "https://www.google.com/maps/contrib/116600206359111287517/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXRUKPZsw0cbdTr-oFRL5HGp2tMvgDMuYdDurkrjAaKAgOlmEK8cA=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 2,
            "relative_time_description": "a month ago",
            "text": "I'm currently staying in room 500, a twin bed room, and paying about €250 per night. For that price, the room is in rough shape and desperately needs a full repaint.\n\nThe bathroom appears to be designed for accessibility, even though we don't require it. It has the feel of a hospital bathroom, with a low-pressure, water-saving shower head that barely has any pressure. The shampoo bottle was empty, and there were no toiletries provided. While the bed was comfortable, that's about the only positive.\n\nThe TV situation was laughable — no batteries in the remote, meaning we couldn't use it properly. We managed to turn the TV on but had no way to turn it off again.\n\nThe hotel bar is ridiculously expensive and the service was surprisingly poor.\n\nThe elevator system was frustrating. You have to scan your card, select a floor, and get directed to a specific elevator.\n\nI'd recommend staying elsewhere for a better, more affordable experience. Overall, this was a pretty disappointing stay.",
            "time": 1728763586,
            "translated": false
        },
        {
            "author_name": "Robert Waldingbrett",
            "author_url": "https://www.google.com/maps/contrib/115032283927333091277/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLYOfocrJSZtq3QCIpCxSuoT3ZuMCZ_fFFkTMgIT51sfGEZ9Px0=s128-c0x00000000-cc-rp-mo",
            "rating": 1,
            "relative_time_description": "in the last week",
            "text": "I attended an end of year party organised by my employer in this hotel. I had not even had the time to take a low quality drink they served at the bar that cost me 150 NOK when a security agent pushed me seemingly trained to handle junkies at Oslo S instead of hotel guests. I would definitely not recommend this place to stay if you have any reasonable expectations about hospitality.",
            "time": 1732929096,
            "translated": false
        },
        {
            "author_name": "Austin Buettgenbach (aj88buett)",
            "author_url": "https://www.google.com/maps/contrib/112930074568867167017/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUMdSj65uuNjDA67LCDd7SX8EHqrV1bGSAZic3q4o-MpuW0HDpR8w=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "a week ago",
            "text": "Got a last-minute reservation when our flight was redirected yo Oslo. The staff helped us upgrade our room for a ridiculously reasonable fee and gave great advice about seeing the city for the night. Stunning and will stay here if I am ever in Oslo again",
            "time": 1732640076,
            "translated": false
        },
        {
            "author_name": "Gerry Gorman",
            "author_url": "https://www.google.com/maps/contrib/108215853257382376139/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXDpuGtyGXf3rrTAhCTr126jYNHKmNVzjBxNM3H3wiLSztl3ATodQ=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "Brilliant hotel in a superb location in Oslo city centre.\nThe hotel is only a few minutes walk from the train station which also takes you to and from the airport.\nRooms are quite spacious, there is also a sauna/steam room and small pool for patrons to use should they wish to do so.\nThe hotel is very secure with no issues at all about safety etc.\nThe staff were super friendly and polite and would help you whenever you required assistance.\nThe hotel is very big, stylish and very clean, I'd highly recommend the hot and cold buffet breakfast during your stay.\nGreat value for money in a great location.",
            "time": 1723565886,
            "translated": false
        },
        {
            "author_name": "Emily Finke",
            "author_url": "https://www.google.com/maps/contrib/114322084751231325387/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKG29An6eNbcxo9wLrfy0jJN0milRVvrZ7XD8AyM5MIQ7TRkxU=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "4 months ago",
            "text": "The Clarion Hotel The Hub was an overall amazing experience! The location is great because it’s in the middle of the City Centre and right next to the main station for trains. The room was spacious and clean. You can’t turn of the ac because you have no windows and it was quite cold but they immediately gave us a heater. I was so grateful for that! Amazing service! Breakfast was also really nice, definitely would recommend!",
            "time": 1721038001,
            "translated": false
        }
    ]
}