{
    "name": "Engebret Cafe",
    "rating": 4.5,
    "reviews": [
        {
            "author_name": "Tim Lam",
            "author_url": "https://www.google.com/maps/contrib/103465868918428571683/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUYQBIMZrZBt-qHNJPApJhBPkkG5neQed_2cl5tRp9TokrrKS576w=s128-c0x00000000-cc-rp-mo-ba7",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "What can I say about this place..Engebret Cafe is such a gem!  It’s the oldest restaurant in Oslo and there’s so much charm inside.  We were lucky enough to sit at Edvard Munch’s favorite table, which was really cool as we had just left the Munch Museum.\n\nThe food was just as delightful as the ambiance.  We particularly enjoyed The Reindeer Steak.  The meat was really tender and flavorful and the Lingonberry Sauce paired perfectly with the steak.  It was so good that we were still raving about it the next day.  We will definitely be coming back the next time we visit Oslo!",
            "time": 1730171196,
            "translated": false
        },
        {
            "author_name": "Thomas van Vliet",
            "author_url": "https://www.google.com/maps/contrib/112247361194081978731/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLdWRh-0j-PTsjVwyFFpm5_RgQ_XbrR7bUU9ZHid0fH_I9xvg=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 4,
            "relative_time_description": "a month ago",
            "text": "Definitely an institution and glad we selected it for a late lunch!\nAs expected a great interior and overall ambience !\nWelcome was \"reserved\" but we were seated immediately and handed over the limited lunch menu.\nWe selected a plate with a variety of marinated herring, a sandwich with marinated salmon accompanied by a very tasteful mustard dressing as well as a creamy fish & seafood soup\nWhereas the food quality was excellent, the level of service left a lot to be desired....not at all what we expected at the \"oldest restaurant\" in Oslo.....but maybe we were unlucky with the timing of our meal....at the changeover from lunch to dinner ?",
            "time": 1729192728,
            "translated": false
        },
        {
            "author_name": "Faisal Ababtain",
            "author_url": "https://www.google.com/maps/contrib/113527359806785826434/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUk1e_S2_eQrz7N3BWecyDyN8QzDddoALdcgD2LaTHn0j1oNZZWFA=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "Nestled in a historic building, Old Coffee in Oslo offers a truly unique and nostalgic experience. Located on the 18th building. The atmosphere is warm, inviting, and filled with a sense of timelessness.\n\nWhile the menu is relatively simple, it's the quality that shines. The coffee is expertly brewed, with a rich aroma and smooth flavor. But it's the fish soup that truly steals the show. This hearty and flavorful dish is a must-try for any visitor to Oslo.\n\nIf you're looking for a place to escape the hustle and bustle of the city and enjoy a leisurely meal or a cup of coffee, Old Coffee is a hidden gem that should be on your list.",
            "time": 1724750309,
            "translated": false
        },
        {
            "author_name": "Nir L",
            "author_url": "https://www.google.com/maps/contrib/103605423506190316798/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKO0xdNR6PsX-qvQcXvTcOclR5Xr6RauEDY-NHqrvBqs9TlJA=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "A charming Norwegian restaurant set in a beautiful building from the 1800s. From the moment I walked in, I was captivated by the elegant yet cozy décor that perfectly blended rustic charm with modern touches.\n\nThe food was delicious. I ordered a steak tartar and beef tenderloin. Highly recommended.",
            "time": 1726955843,
            "translated": false
        },
        {
            "author_name": "Bill Brown",
            "author_url": "https://www.google.com/maps/contrib/100427030218046344021/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXn8m2v5nSMZ1kbfdiY0Q59fhjyy4U7J2gN7Et2Y8beJ3yHCmKQ=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "We just arrived in Oslo this morning and after a long day of flying and sightseeing we were hungry for some local food. Engebret Cafe was a perfect end of a great day! Our waiter, Sander was perfect. He explained the menu in full was able to take care of some food allergies and his recommendations were great. I had the Boknafisk, a meal they have been serving for hundreds of years, wife had the Ishavsroye which she keep raving about, my son had the Reinsdyrsbiff and he cleaned his plate because the sauce was so good, and his fiancee had the Lammeskank which she also left a cleaned plate.",
            "time": 1728437866,
            "translated": false
        }
    ]
}