{
    "name": "Clarion Collection Hotel Gabelshus",
    "rating": 4.2,
    "reviews": [
        {
            "author_name": "Albert Flo",
            "author_url": "https://www.google.com/maps/contrib/108788137904252978401/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWK2ENJt_vKLY9gJGI_6gzXwvc1T_qTwHznTpjeXUMTl32WEI8=s128-c0x00000000-cc-rp-mo-ba6",
            "rating": 5,
            "relative_time_description": "4 months ago",
            "text": "Very clean & cozy hotel.  Well located in a very nice area with embassies and consulates and easy access by buses or trams.  Very well maintained, well decorated, with elegant and cozy areas.  The food at both breakfast and dinner is good, varied and in quantity.  Excellent attention and service from the reception as well as all the staff who work at the hotel.  Comfortable beds as well as pillows with a set of good sheets.  Relatively large and well-equipped bathrooms.  Highly recommended.",
            "time": 1720698940,
            "translated": false
        },
        {
            "author_name": "Phil Apostolides",
            "author_url": "https://www.google.com/maps/contrib/110427455416921776955/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVZFDbxGtKBrjxt4bjgM4MWhqzMWUlfxsP6b2RJphmTGygrC05Y=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "Charming hotel in a very elegant and quiet area, close to the tram and a walking distance to the center  15 min.\nBoth breakfast and dinner buffet were good and varied . Room and bed were comfortable.",
            "time": 1725448492,
            "translated": false
        },
        {
            "author_name": "Ade ROGERS-WRIGHT",
            "author_url": "https://www.google.com/maps/contrib/106707817494473309437/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW1VN_fycCFQxSlp0aQtoAGpOrGbdr4sqmjnFec5wjqr_ALVeQDUg=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 3,
            "relative_time_description": "4 months ago",
            "text": "First impressions were perfect. Hanne was lovely and welcoming. We had a pram for the little one, and because the hotel is old, they had no wheelchair accessibility. It's 2024; not considering the needs of the elderly and disabled is disappointing.\n\nWe were welcomed with free hot drinks. The hotel was massive and grand, with a Ritz-like feel.\n\nThe rooms were small. For a better experience, avoid the standard double rooms; they had no fridge, no coffee machine, no safe, and no side drawers—terrible.\n\nThe elevator had issues on day one. A lovely member of staff had to go to the fourth floor to switch it on and off to get it working.\n\nWe were told the elevator would be out of service for several hours the next day. My wife was not having that and waited patiently the next morning to give them a gentle nudge.\n\nWe were offered a superior room, which was a lovely gesture as we were on the fourth floor and would have had issues with the pram, aka wagon.\n\nAnyway, the superior room was lush, with everything the standard room was missing: a large bedroom, plenty of light, and all the amenities a room should have.\n\nBreakfast was lovely, with lots of variety. We loved the bacon, eggs, and orange juice.\n\nThe dinner was fabulous as well. Make sure you get half board; it makes sense with the quality and options given.\n\nThe location was great, and the staff were fantastic.\n\nAll in all, a great experience.",
            "time": 1720806950,
            "translated": false
        },
        {
            "author_name": "André Hessels",
            "author_url": "https://www.google.com/maps/contrib/114580709061529453324/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWGgbXnj3P5NWr-M1BquP1mFinhjEEg99SfASgcXsgtfrdx4xYtWw=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 4,
            "relative_time_description": "4 months ago",
            "text": "We had a pretty good stay in this hotel. Friendly staff and great food! The room we had didn't have a temperature regulator or AC, but luckily it wasn't too hot of a day during our stay. The hotel is very close to a tram stop, so you can be in the city center in minutes!",
            "time": 1722751012,
            "translated": false
        },
        {
            "author_name": "Aram Chtchyan",
            "author_url": "https://www.google.com/maps/contrib/103071743785984597814/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKh5PIt0wYpoQh3kDcALBq9XmDhttuwGonrTvPn50LYRbZcDQ=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 3,
            "relative_time_description": "2 months ago",
            "text": "Great location. Outstanding breakfast. Front desk staff very slow. Have to wait ages for assistance. Heater in the room fell off the wall in the middle of the night. Room interior is dated. Bathroom has no heater, hence cold.",
            "time": 1727418224,
            "translated": false
        }
    ]
}