{
    "name": "Scandic Sjølyst",
    "rating": 4.1,
    "reviews": [
        {
            "author_name": "Cole Hafner",
            "author_url": "https://www.google.com/maps/contrib/106133921811390859024/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVi8aq8_nGEB_YeUaU-6lvtcf5tiedCRdmuyPscO8frWUw3g7LfvQ=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "a week ago",
            "text": "Had to switch to a bigger room for my last night and the staff made it hassle free. Was able to switch my stuff early in the morning before checkin to make it extra easy. Thank you Christian at the front desk for making this a great experience!",
            "time": 1732726464,
            "translated": false
        },
        {
            "author_name": "Steve Migliara",
            "author_url": "https://www.google.com/maps/contrib/103985316494205117537/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX3IQnOLI5UBFQakrrJ2hV4ul3g-epk8saM1lFJb_P7lxcHI7ki=s128-c0x00000000-cc-rp-mo-ba6",
            "rating": 3,
            "relative_time_description": "3 months ago",
            "text": "Decent hotel on the outside of Oslo. Easy to get to from nearby train station and airport. This hotel is a basic place, but clean and friendly staff. The breakfast buffet is excellent. The bed is comfortable, the bathroom is lacking amenities such as lotion, mouth wash, toothbrush, but ok still.\n\nLike and follow for more amazing places to see and visit around the World.",
            "time": 1724165402,
            "translated": false
        },
        {
            "author_name": "Mathias Forrisdahl",
            "author_url": "https://www.google.com/maps/contrib/104667321921261109600/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL-9DhSTdcc9GD4L9GyfZAjR515bP-SjVYWC8o8_Z_o8akG7g=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "5 months ago",
            "text": "Lovely modern hotel which has just been refurbished. Its located just a short 5minute walk from the train station offering fast and frequent connections to Oslo City. Rooms are spacious, clean and comfortable. Very friendly staff who also were flexible with check in times.",
            "time": 1719748067,
            "translated": false
        },
        {
            "author_name": "aggelos karabatakis",
            "author_url": "https://www.google.com/maps/contrib/110590777879559015723/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLCESJUhS_60YSQAvMNdCmmsYmzaI0SBUlRGoWBujtonlD3gg=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 5,
            "relative_time_description": "4 months ago",
            "text": "wonderful hotel.  spotlessly clean rooms, comfortable and the breakfast was really fantastic.  friendly and helpful staff.  I highly recommend it.  thank you for your hospitality",
            "time": 1721906383,
            "translated": false
        },
        {
            "author_name": "Mia Timms",
            "author_url": "https://www.google.com/maps/contrib/105143966608026974615/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKeb2DBIk4RFU52Ju__DvAVti6nfu9kn6VBHE2hCLg-W44vTw=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 4,
            "relative_time_description": "6 months ago",
            "text": "We have just returned from a five night stay here (May 2024).\nWe received a warm friendly welcome on arrival. We found all the staff to be great and helpful. We were on the 5th floor and was a quiet spot in the hotel.\nBreakfast was buffet style which was great especially with a young child. There was always plenty of seating. The buffet breakfast finishes quite early each day.\nThere's shops nearby and all transport links around Oslo.\nUnfortunately we were sadly disappointed with our room. When we arrived it had not been cleaned well with evidence of the previous occupant including food crumbs on the table and floor and hairs in the bathroom. There were also stains on the bed sheets and a pillow was missing its case. The bathroom door handle was also broken.\nI was too exhausted with a young child at this point to go down to reception to inform.\nAfter a rest, we ended up cleaning around the room with some wipes and taking fresh bed lining off the trolley outside.\nHousekeeping came in daily and missed emptying our overflowing bin and giving us toilet rolls.\nSadly the housekeeping side of things spoilt the experience of staying at this hotel. Apart from this, we would recommend the hotel. We had a great time in Oslo.",
            "time": 1717233388,
            "translated": false
        }
    ]
}