{
    "name": "Grand Hotel Oslo",
    "rating": 4.4,
    "reviews": [
        {
            "author_name": "Dominik",
            "author_url": "https://www.google.com/maps/contrib/105303260073306093493/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUR70PIB-dIrI0GRgy5yijpsyJdZtsRPBRfknneUdjKb3YE2NuU=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 1,
            "relative_time_description": "2 months ago",
            "text": "Terrible experience ‼️ I’ve been to dozens of 5* hotels around the world and this by far the worst hotel I’ve ever been to.\n\nThe rooms are not only dark and small but dirty - the floor had coffee stains and dirt, the mirrors were stained, desks uncleaned, chandelier full of dust, and overall it was just nasty.\n\nBut also the hallway was dirty and overall common areas seemed to not be maintained properly. The spa/pool needs to be paid extra (!) although this was nowhere communicated. The fitness room is antiquated just as the rest of the building.\n\nHospitality seems unknown here - the room had no vanity kit, no water on arrival or warm welcome at all. Also the reception staff were not very friendly or helpful. Requests are ignored at front desk, employees seem even kind of arrogant. This can’t be a 5* experience on any international standard.\n\nThe only positive was their concierge service that helped us to find a restaurant and the nice employee at the garage. The location is also good but not worth staying here.\n\nIt’s stunning how they managed to receive a 5* rating. I can’t recommend it at all and won’t come back.",
            "time": 1727083656,
            "translated": false
        },
        {
            "author_name": "Aditya Patel",
            "author_url": "https://www.google.com/maps/contrib/103552132297408530560/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV68yAaU75S_C3IrC6zWa7_ns5LHKu9oolCgPCDjpdaowClDjKw4w=s128-c0x00000000-cc-rp-mo-ba6",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "The Grand Hotel Oslo exudes elegance and history in a prime location on Karl Johans Gate. Guests praise the impeccable service, luxurious rooms, and top-tier amenities like the rooftop bar and spa. Its central location makes it ideal for exploring Oslo's attractions, while the variety of restaurants and bars within offer diverse dining experiences. Though some find the price point high, the overall experience is one of refined indulgence, making it a favorite for those seeking a memorable and luxurious stay in the heart of Oslo.",
            "time": 1726333825,
            "translated": false
        },
        {
            "author_name": "Jihane Daif",
            "author_url": "https://www.google.com/maps/contrib/111620976618808441072/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXfL25jieiz2_RnOh9d-LpIAZiKl9Aq7aC3jI-dFhzI0Ir7Ff4=s128-c0x00000000-cc-rp-mo",
            "rating": 3,
            "relative_time_description": "a month ago",
            "text": "The Grand Hotel in Oslo is a beautiful hotel with stunning views and a fantastic location. The staff are very friendly and welcoming. However, the value for money doesn’t quite add up. The breakfast is repetitive and basic compared to other hotels of the same standard, and the housekeeping could be improved—vacuuming wasn’t even done. The bed is very soft and small, and the pillows are extremely flat. Despite requesting additional pillows, they were all the same. While the street view is lovely, there’s a lot of noise from trams throughout the week, and the weekends are even noisier due to people partying late into the night.",
            "time": 1728376788,
            "translated": false
        },
        {
            "author_name": "Charlotte Alloway",
            "author_url": "https://www.google.com/maps/contrib/107656798335718138667/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVMTo_FwKLDR4gg6g-_Y3rUtlE6Sk78KAZlyogEYXoiLyknG79a=s128-c0x00000000-cc-rp-mo",
            "rating": 2,
            "relative_time_description": "in the last week",
            "text": "My job is very physical, so over the last 2 years I have been taking myself away on solo city breaks when I need to recharge my batteries and want a breather from London life.\n\nOne of my close friends recently visited Olso and loved it, so a week ago I booked my flight and was so excited about my Norwegian adventure!\n\nAs a solo traveler, where I stay is super important to me, always opting for a 5-star hotel where you know you will be guaranteed safety, great service, a quiet room, and a good night's sleep. With a spa included in the facilities, The Grand Hotel seemed like the perfect place, so when I saw a great deal on Agoda, I booked it without hesitation.\n\nFirst impressions:\n\nThe hotel from the outside and inside the lobby is absolutely stunning! The Christmas lights were gorgeous and everything had a touch of old world-class about it. I could not wait for this experience!\n\nI checked in and got to my room and, unfortunately, the room was really disappointing. Firstly, it was absolutely freezing, the door had been left open to the balcony, and my room smelt of cigarettes. As it was 4• outside, you so look forward to a nice, cozy bedroom, but it was colder inside the room and the radiator took agesssss to heat up. The carpets were worn, stained and dirty. No automatic locking on the door. There were footprints on some of the wooden furniture and everything was just really dated. The hairdryer, no usb cable port for phone charging, empty lotion bottle, hot water that also took ages to heat up, it just didn’t even meet the basics of a 3 star.\n\nHowever, the bed looked super comfy and the room was quiet, so as long as those things are good, I am happy, but there is no way I would have paid the full price for this room.\n\nAnd then…\n\nAs I go to sleep at 1030pm, looking forward to a good sleep after being up since 3am that morning, I’m woken up at 11:30pm to the loudest base and drum kit pounding through my walls. I rang reception, and they informed me that there was an event going on until 1:30am… why on earth they chose to put guests directly underneath this at a 5-star hotel. I have no idea. After being on hold for 20 minutes, I am given a new room, and have to pack up everything, transport all my stuff in the middle of the night in my pyjamas without help from the 7th floor to the second floor. The room I was given was better than my current one, and there was now no sound, but still absolutely freezing.\n\nUnfortunately, on top of this, although visually very serene, the spa was very dirty and the pool was closed for one of the days I was there. They did, however, discount entrance to the spa on this day.\n\nThe worst part was the staff, which I’m so sad about as they are usually a highlight of a 5-star experience. The lobby staff were always very cold and unfriendly, apart from the lady who checked me out on the last day. But generally, I was wondering if I was reading their energy wrong, and if it was just a difference of cultures, but everyone in restaurants and cafés was so nice, this place was the only place that wasn’t. People are human, and as someone who has worked in hosting a lot, I get that hotel work is tiring, but everyone here just seemed so cold all the time. The general vibe of the staff at the grand hotel was like the Plaza in Home Alone 2.\n\nI absolutely loved Oslo, but this hotel was the only downside of my trip. I’m not sure if it’s because I got a deal and therefore my business was not worthy of receiving the true grand hotel experience, but either way, I still paid a lot of money and the fact it didn’t even meet the basic standards of what it promised is such a shame. I will not be returning to this hotel and advise solo travelers to look at booking the Amerikalinjen or Sommerro instead.",
            "time": 1733063546,
            "translated": false
        },
        {
            "author_name": "Chris Lavish",
            "author_url": "https://www.google.com/maps/contrib/115091769303838618922/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKsXqqgGvY13duXdqiu5zmgCCYDAPt-swzK5YyOjGlCasOg8g=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "The Grand Hotel Oslo is a fantastic choice for fashion events. The venue’s elegant and historic interiors provide the perfect backdrop for runways and photo sessions. The spaces are versatile, making it easy to host everything from intimate shows to larger events. The staff is professional and ensures everything runs smoothly. Whether you’re organizing a fashion event or looking for a beautiful setting, The Grand Hotel delivers on all fronts.",
            "time": 1724711033,
            "translated": false
        }
    ]
}