{
    "name": "THE THIEF",
    "rating": 4.4,
    "reviews": [
        {
            "author_name": "Mike741776",
            "author_url": "https://www.google.com/maps/contrib/109913138208499158340/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW4TS2FGrcgxk42pBFtLNTsSO8FT-c33L0Cu_GuXEGiIkACkvSP=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 4,
            "relative_time_description": "2 months ago",
            "text": "A very cool hotel to stay at before a cruise. Rooms are modern and functional. Service is great. Small balconies to view the harbor. A great rooftop bar with excellent mixed drinks. The restaurant (actually two, one roof top and one downstairs) was very good, and room service was very good. A great breakfast spread too.",
            "time": 1726847145,
            "translated": false
        },
        {
            "author_name": "LOUIS KOMO",
            "author_url": "https://www.google.com/maps/contrib/115851911200925268474/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVfCZkKv-R72DPF5waJUSgNYX-k7PgbDZygeR3sy4jhfe6z2MH1=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "3 weeks ago",
            "text": "An excellent stay period !\n\nThis hotel ticks so so many boxes. My friend and I stayed on an FHR rate and the hotel truly couldn’t do enough for us. From a super slick check in to an amazing upgrade into one of their suites.\n\nThe spa is an outstanding part of the hotel! With a glass elevator that takes you straight down to the basement of tranquility. Just another unique quirk to the hotel. Rooms are well decorated and the beds I must say are probably one of the best if not the best I’ve slept on in all my hotel stays round the world.\n\nThis is an excellent retreat for anyone staying in Oslo. Michelin star restaurants on your doorstep you can’t ask for more.\n\nWe didn’t happen to use the restaurant in the evening but we did use room service food was perfect! Breakfast in the morning you can’t ask for much better. The buffet excellent, service from front of house again outstanding.\n\nWe wasn’t planning to come back to Oslo any time soon but after that stay no doubt I’ll be back in a few months as a weekend retreat!\n\nI’ll leave this review by giving a big shout out to Adrian who made what was a rubbish evening for my friend and I after a canceled flight an exceptional experience. Couldn’t do enough for us and frankly he made everything so seamless quick and efficient. A slick guy who knows how to treat his guests well. So big thanks to Adrian !",
            "time": 1731080591,
            "translated": false
        },
        {
            "author_name": "Shereen Cox",
            "author_url": "https://www.google.com/maps/contrib/106841176317825447584/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX3erl0vgx76NS93BP2yWK3lAfv0MB8EZsfyoY9vNW3I2UUKivrlQ=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "I just spent a day at the spa..then a drink at the bar and dinner at the restaurant. The experience was really awesome.  The staff were kind and responsive.  It was my birthday and although I was away from family and friends...the staff made me feel so special...a complete stranger.  Definitely going back...highly recommend",
            "time": 1729279604,
            "translated": false
        },
        {
            "author_name": "Michael Roberts",
            "author_url": "https://www.google.com/maps/contrib/104480824217436353362/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUvbja85F5Ai5R8wBeQ927-CSMXflaKGaw3w9HrH2Nzmr2Ma3Jh=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "Very much recommended this stunning hotel by the port in Oslo. Very well presented modern hotel. The rooms are spacious and relaxing. On site restaurants and bars are worth visiting. The breakfast buffet is extensive with loads of gluten free options, special mention for the gluten free granola.",
            "time": 1728716523,
            "translated": false
        },
        {
            "author_name": "Dave Franklin",
            "author_url": "https://www.google.com/maps/contrib/107151624355255036787/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXK4ITtOEgH85Sb8hshz8kM8VEHRsHwY9gIw9d-XooAd70yvD8o=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 3,
            "relative_time_description": "4 months ago",
            "text": "Great decor, boutique feel with great location.\n\nRoom was well designed - quiet with great blackout blinds and comfy bed.\n\nShame that the main bar was closed \"for the season\". We were hoping to experience the midnight sun on the rooftop bar, but it was booked out to a party.",
            "time": 1720472291,
            "translated": false
        }
    ]
}