{
    "name": "Scandic St. Olavs plass",
    "rating": 4.1,
    "reviews": [
        {
            "author_name": "Sand Ams",
            "author_url": "https://www.google.com/maps/contrib/107801238896410309760/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIdatrcFVSxiU6TXmoNUdYvgWzSIU-BWm3_lpUMT-vOKGSpCw=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "Wonderful hotel !!\nThe rooms are amazing. Spacious and full of light. Clean and such comfortable beds. We were there with our kids and they had their own room! One of the most original and outbid the ordinary is the view from the room into the breakfast area with that incredible glass roof. I loved it.\nThe breakfast is fuiuuullll!!!! The buffet is gigantic with everything you could wish for. Everything is fresh and tasty and the staff is so kind and patient and so nice with kids !! I definitely want to come back.",
            "time": 1730466146,
            "translated": false
        },
        {
            "author_name": "caleb wood",
            "author_url": "https://www.google.com/maps/contrib/113398443267674847899/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWFeHGqQhQLQHKZVTMAOqJ_il4aBqzbtYYOdy7cAXqKi5nILmFPwA=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "3 weeks ago",
            "text": "A perfect hotel to act as a base to explore Oslo as a family. The rooms had great facilities, many plug sockets, a wide variety of tea and coffee sachets, and a fridge which was perfect to store milk and other perishables which we got from the nearby kiwi store. An amazing breakfast buffet every morning set us up for the day, and the reception staff were a great help. Highly recommended, and as we loved Oslo but didn't get a chance to experience everything the city has to offer it will give us an opportunity to come back and stay here again in the future.",
            "time": 1731097075,
            "translated": false
        },
        {
            "author_name": "isa bombardó",
            "author_url": "https://www.google.com/maps/contrib/110656551724553008452/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKmnH4sYaXQWaDoFP19qga7GCuxVjYiSq6VlPpn3sV7R_n25w=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "It’s an excellent hotel for a trip to Oslo with either friends or family!! We went in October and the weather was amazing!\n\nThe location is great, you can go anywhere by foot or public transport. The room was spacious enough for two people and it was always clean.\n\nI loved how safe it felt having to have a key to get into each floor, and I really enjoyed my stay, every member of staff we interacted with was really helpful and nice.\n\nThe breakfast is SO worth it. It has so many different options to choose from and it’s open for a long time, the food was very very tasty!\n\nHope to come back soon!",
            "time": 1724362751,
            "translated": false
        },
        {
            "author_name": "Anna Gkogka",
            "author_url": "https://www.google.com/maps/contrib/104524036002475620904/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL2TWothCYGhXZxdxkOvCvxP8vpNAkWT0xfYbGSZhjNsp7eag=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 4,
            "relative_time_description": "3 months ago",
            "text": "The hotel is in an excellent location, close to bars, cafes, restaurants, walking distance to most sights and very close to may bus and tram stations. The breakfast was very nice and with great variety, but was very crowded, especially during the weekends, making it hard to find a place to sit. On the ground floor there was a station with water fountains and coffee machines where you could fill in your bottle/thermos before leaving the hotel, which was greatly appreciated. The rooms were pretty average, but they were not missing anything (shampoos, iron & ironing board, clothe rack etc were provided) and they were comfortable. The only minus is the room temperature, which was quite low and I was not able to increase it (had to ask the reception), and there were no additional bed covers in the room. Overall I would suggest this hotel to anyone who wants to visit Oslo and wants a good value for money, especially compared to other hotels in the area.",
            "time": 1724677553,
            "translated": false
        },
        {
            "author_name": "Jana Miskarova",
            "author_url": "https://www.google.com/maps/contrib/111090884313736252935/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWD7mwsQu9PN_aY-yd44iIGaO62VBXDqW_YDOtHIDrOtNHmlL_4=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "I am actually impressed with this hotel as i paid double room for two people £73 including breakfast, and the room was really beautiful. The bed was super comfortable, soft, nice pillows, big TV, everything clean and spacious. The bathroom had shampoo and conditioner, clean towels. I had to leave the hotel at 5 a.m., so i didn't have an experience with a quality of  breakfast there. However, i mentioned at reception that we are leaving early, and upon my request, they made me an amazing gf and lactose free sandwich with orange juice and freshly cut pineapple 🍍 Also their bar is so nice and nice atmosphere.  Additionally, the location is perfect 👌 👍 I am definitely recommending this hotel . It was so quiet at night that you couldn't hear any noise, which is a huge appreciation. I would just comment on one negative thing. I am not keen on glowing evacuation signs in your room door, but the jacket helped to cover it.",
            "time": 1729501613,
            "translated": false
        }
    ]
}