{
    "name": "Grand Hôtel du Palais Royal",
    "rating": 4.7,
    "reviews": [
        {
            "author_name": "R3nnnoc World",
            "author_url": "https://www.google.com/maps/contrib/104352038224775378795/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXBiIHNYfd61DpftP5XIFjxx3M2SmyvueypZCciCQ4SxIIyqadZ=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "My stay at here was absolutely exceptional! From the moment I walked in, the staff went above and beyond to make me feel welcome and comfortable. The room was immaculate, spacious, and beautifully decorated with all the amenities I could need. The bed was so cozy, I slept like a baby each night. The on-site restaurant served delicious meals, and the breakfast buffet was outstanding with plenty of fresh options. The location was perfect, close to all the attractions but still peaceful and quiet. I highly recommend this hotel to anyone looking for a relaxing and luxurious stay!",
            "time": 1729202303,
            "translated": false
        },
        {
            "author_name": "google subscriber",
            "author_url": "https://www.google.com/maps/contrib/116120190973483994001/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocItgOrQByHQXB13eBBwG5t0Ah4uNjiu_TxglYuHK58qr7JGNA=s128-c0x00000000-cc-rp-mo",
            "rating": 2,
            "relative_time_description": "3 weeks ago",
            "text": "Not really a 5 star hotel - rooms are quite small with door jam issues between bathroom door, closet door, and main door. The TV would go on and off and had to be reset multiple times and the hot water would run out by late morning.\nPlan on waiting at least 20 minutes should you decide to order any eggs for breakfast and note that they come with zero garnishes.  A request for some sort of potato was met with a \"That will take an additional 15 minutes.\"\nThe bar is also small with limited selection - nowhere near what one would normally find in a 5 star hotel.\nAll the above, coupled with disappointing and dismissive follow up by hotel management, warranted this review.  I will not be recommending it to my friends or family.",
            "time": 1731058077,
            "translated": false
        },
        {
            "author_name": "Judith Ann Oddo",
            "author_url": "https://www.google.com/maps/contrib/115882876019417439136/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUm8Y4EiVIFNtD6aMoRl8lMraZW9K-qcKYdo5N_Bt4HYF3VG4Z6=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "My husband -little boy (9) & I stayed with you in 1972.  Was a fabulous experience.  You provided a babysitter so we could go out at night.  I bought a beautiful charm that I cherish till today in the gift shop.   Last week my youngest son visited for dinner.  Lovely  memories for me--Thank You.",
            "time": 1723922692,
            "translated": false
        },
        {
            "author_name": "J G",
            "author_url": "https://www.google.com/maps/contrib/101383295196769607156/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKwmIxKHIme0Ccwv--tkgVsHJhvvDfZ7Q9cG30sNjnlcjAvWg=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "Fantastic \"boutique\" hotel! Large enough to offer full services and comfort but small enough to make us feel special. We truly enjoyed our stay at the Grand Hotel du Palais Royal.\nVery convenient to the metro, the Louvre, and great walking itineraries.\nI hope to stay here again!",
            "time": 1724051643,
            "translated": false
        },
        {
            "author_name": "Ben Chung",
            "author_url": "https://www.google.com/maps/contrib/115139357839816413487/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVXrlZKv36WCqIkDJGWCv_sYAdn0LrZcArdOiI8BVDzihabL4ih=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "Outstanding central location next to the Louvre and Metro. Beautiful modern styling and decor inside. The hotel building is elegant with classical limestone exteriors overseeing an intimate courtyard. Service and staff were top-notch, friendly and accommodating. The Michelin Plus benefits elevated the experience and our party really appreciated the upgrades with our stay and other stays while we were in Paris.\n\nThank you Lila and Alexis for such an exquisite check-in experience. Alexis, I really appreciated you taking the time to explain the details of the room and even the fun insight about the nearby office building being the site of the 'Emily in Paris' Netflix series. I also am very thankful for your time and patience in helping me set up my metro card on my phone that first morning in Paris. And on the next morning when we needed to leave for a tour before the hotel's cafe would open for breakfast, I thank you wholeheartedly for arranging to have a beautiful setting of pastries, fresh fruit, coffee and juice ready for us in the lobby. A magical and wonderful moment we won't forget!\n\nLilian and Pierre-Jean, thank you for your recommendations as the concierge. Pierre-Jean, no worries on the misunderstanding at checkout. Your note was well received and appreciated. Farite, thank you for your grace and patience with me on the morning of our departure. The morning wasn't going as I expected but you had done everything you could to make it right.",
            "time": 1723992584,
            "translated": false
        }
    ]
}