{
    "name": "Warwick Paris",
    "rating": 4,
    "reviews": [
        {
            "author_name": "reem m",
            "author_url": "https://www.google.com/maps/contrib/106685573710991021547/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIamLHzgt60odhFz7yHDnQWVgi5Ql3YY1MRBgJdosMFb65uAg=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 1,
            "relative_time_description": "2 months ago",
            "text": "I stayed in this hotel in May 2024. Initially, the staff's attitude towards us was unwelcoming and uncooperative. We made a reservation through Booking.com for a room that accommodates up to three people. Upon arrival, we were informed that the extra bed would be prepared within 20 minutes. However, even after waiting, it was discovered that there was no additional bed, and the room was not suitable for an extra bed as advertised and they told us that they gave us the wrong room.\n\nAccording to the accommodation policy, the extra bed should be provided free of charge. However, we were informed that it would be complimentary only for the first day, and afterward, we would be forced to pay. This information was given to us by their manager.\n\nThe room was dirty, and I had to clean it myself. Additionally, some furniture was already broken, which we immediately reported to prevent any charges being deducted from our account.\n\nThere is no drinking water available in the room, and the glass cups provided were not clean. We requested water, but it has been two hours and we still haven't received it.\n\nAfter several attempts, the room was changed to accommodate the third person, but it required significant effort and exhausting discussions.\n\nThe reception does not respond to any phone calls, and the hotel system is still malfunctioning as we haven't received the security deposit invoice.\n\nOverall, we did not feel comfortable at all because also there is a nightclub next to the hotel and the noise is very loud as fights happen in front of the hotel because of the nightclub customers!",
            "time": 1726688683,
            "translated": false
        },
        {
            "author_name": "Ahmed Alharbi",
            "author_url": "https://www.google.com/maps/contrib/111176719274729878412/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVKzaE5J0ARuXwP83z1H0VF8PthLwSKcYBEg_dZvwkrV6-F-kJN=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "4 months ago",
            "text": "I am surprised by the negative comments. My experience was very nice in everything. The rooms were with a balcony. The rooms were very excellent and the reception staff were very friendly. The location of the hotel is very easy for me to move around as it is close to everything, but I have a question. The insurance that was booked was 300 euros. When will the amount be refunded, knowing that check out the hotel on 7/7",
            "time": 1720573273,
            "translated": false
        },
        {
            "author_name": "Aymen ali",
            "author_url": "https://www.google.com/maps/contrib/109732214771850253537/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVCuEPfiHtXiqKpzbX1unLHufFcIbtYwgCPUPNDbxCkq_UYx9c=s128-c0x00000000-cc-rp-mo",
            "rating": 2,
            "relative_time_description": "a month ago",
            "text": "Poor room service, it's 4 stars hotel but in reality is not ever,\nno coffee machine at room.\nno water supplied everyday.\ntoilet stuff not completed.\nGood and kind people work in reception.",
            "time": 1730758546,
            "translated": false
        },
        {
            "author_name": "M Miller",
            "author_url": "https://www.google.com/maps/contrib/103354142873248579755/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX5cEEGyG7LtxEJJZ85qXjdwx9ODmU70KV6Y1KQQkMOiapuASwG=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "3 weeks ago",
            "text": "Location, location, location all combined into a modern, easy to access hotel right off the Champs Elysees.   Close to Arc du Triomphe.  Large hotel rooms, great staff, quick service in one of the fastest paced places in the world.  They even have valet service for people like me foolish enough to drive into Paris.  If you need to stay in the heart of the tourist action this is the place.  I chose it simply because for various reasons we had to drive there.  Would stay again.  Wonderful employees.",
            "time": 1731419225,
            "translated": false
        },
        {
            "author_name": "ashtar ali",
            "author_url": "https://www.google.com/maps/contrib/109872895114867089126/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXZcYkii4ECP8NGvq0CC0v8wl4PPwOJNDE6huhOFr8C5Ze1vFU=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "3 weeks ago",
            "text": "The rooms are very comfortable. The bathrooms are well equipped, and there is ample closet space\nThe staff is congenial, and the concierge  is very knowledgeable\nHighly recommended",
            "time": 1731124207,
            "translated": false
        }
    ]
}