{
    "name": "Le Relais Saint Germain",
    "rating": 4.3,
    "reviews": [
        {
            "author_name": "Madison Howard",
            "author_url": "https://www.google.com/maps/contrib/100735971633485015973/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXkdhD58a4ml0N7iQANZeMnPRLne4FYJFt4HvhrPWksehpVKb4m=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "I am writing this review a couple of months after my stay here. I keep thinking about how wonderful it was. From the moment my fiancée and I walked in, we were treated so kindly and noticed how beautiful the place is. The receptionist that we saw for most of our stay made sure that we had a great time and knew everything that we needed to know. She also allowed us to keep our bags there until check in time since our flight was so early. The rooms are incredibly comfortable and the aesthetic of them is great. There are drinks, breakfast, and it is in a great location. I can’t think of a way that I would make my experience better. Thank you to the staff ♡",
            "time": 1730660812,
            "translated": false
        },
        {
            "author_name": "Tomás Souza",
            "author_url": "https://www.google.com/maps/contrib/107767222088096192909/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV1OpleT6sTqdsLZA08z-5Su1fPm_fyDhAYKkVKOtwjmpXHLA_A=s128-c0x00000000-cc-rp-mo",
            "rating": 3,
            "relative_time_description": "3 months ago",
            "text": "Great Location, But Disappointing Service\n\nI recently stayed at this hotel and booked my room the same day, which was a great deal for the area. The location is fantastic, right in the middle of St. Germain de Pres and the 6th arrondissement, which is my favorite part of Paris. Opening the window to a quintessential Parisian view was delightful, with the added charm of hearing French songs from the street below in the afternoons—like something out of a movie.\n\nHowever, the experience was marred by poor service at the front desk. While most of the staff were polite and professional, the woman at the front desk during our stay was incredibly disrespectful and unprofessional. Upon arrival, she explained things in a very impolite manner, repeatedly insisting on knowing our entire schedule, including when we planned to wake up, have breakfast, and leave the room. Despite our reassurances that we would follow the hotel’s timing, she continued to insist on its importance.\n\nOur room was another issue—we received two shampoos but no shower gel. When my girlfriend asked for one, the receptionist initially refused to believe us, questioning our word and insisting that the staff never make such mistakes. Eventually, she sent someone to check, and we were proven right, but the interaction left a bad taste.\n\nThe following morning, I chose to fill out the breakfast order form and bring it directly to the front desk. The same receptionist looked at the form with clear disgust and even showed it to the cleaning lady, laughing together. When I confronted her about it, she criticized how I filled out the form and suggested, “Why don’t you have breakfast in the restaurant so it’s easier?”—which is not something you say to a guest. When our breakfast finally arrived, it was incorrect, and when we called to address the issue, she blamed me for filling out the form “wrong.”\n\nWhen my girlfriend called to inform them that our order was completely wrong, this same person started arguing in an extremely informal manner (like a teenager), insisting that it was my fault because I had filled out the form incorrectly—even though she had asked me to redo it with her! My girlfriend pointed out that regardless, this is not the way to speak to customers, and that the essence of her job is not to argue or pass judgment, let alone blame the guests. In response, the receptionist claimed that there were four people in front of her who could attest that she wasn’t being disrespectful, all while verbally attacking my girlfriend with her rapid speech and lack of professionalism. Where are we now? A playground argument? Shocked by such vulgarity and unprofessionalism, my girlfriend decided to hang up. It was truly a shocking and unpleasant experience for her to feel so attacked in this situation.\n\nThis level of unprofessionalism is unacceptable, especially at a hotel of this caliber. Hotel staff should be courteous and focused on finding solutions in a polite manner. Unfortunately, this was not our experience here.",
            "time": 1724918383,
            "translated": false
        },
        {
            "author_name": "glenn follette",
            "author_url": "https://www.google.com/maps/contrib/106734447150674044752/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX5Q-ltxxyhEQxYYNJosTTRa7n-stMrfze30AwyKs09oe-fFRut=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "Fantastic. Large rooms with view to the Plaza. Comfy bed. Great bathroom, large, good shower. Excellent breakfast. And perfect location in 6th, near metro, lots of restaurants and shopping nearby. Easy to get to CDG, Montparnasse,",
            "time": 1725009173,
            "translated": false
        },
        {
            "author_name": "Sovann Sam",
            "author_url": "https://www.google.com/maps/contrib/106335537371446358328/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJOtL8ZlMJ8VS9RCQnOYih4zl-bOItFdOW2EsHH9VISs_w7hw=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "7 months ago",
            "text": "We stayed in the suite on the third floor. It was nice and spacious. The room could use more lighting, but I believe that's the norm for a lot of hotels in Paris. The staff was great and the hotel is close to a lot of restaurants and cafes. There's also a taxi rank within a few minutes across the main street. We would stay here again.",
            "time": 1714221734,
            "translated": false
        },
        {
            "author_name": "Kevin Martinez",
            "author_url": "https://www.google.com/maps/contrib/103175072826631980883/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI02fytOqlFF4T-sn89kaige9HEnM-1dM9SDzMHUDrP1NMCbA=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 4,
            "relative_time_description": "7 months ago",
            "text": "Two locations - one that serves meat tapas and the other fish.\n\nI went to both because one, I loved the vibe and two I needed to try the blood sausage macaroon.\n\nFirst time here , I met a lovely mother and son traveling Europe together that bridge my lack of French speaking which isn't always an issue but I would say that the waiters aren't as nice in general in Paris if you don't speak French so it was nice to feel more comfortable abs really it changed my trip . I was borderline ready to fly back to NY bc I hated paris my first few days and this place and people helped me stay and enjoy the rest of my trip .\n\nA lot of American people here so if you are traveling and don't speak much French and want awesome tapas with a side of wine ; this is the place to visit .",
            "time": 1714722708,
            "translated": false
        }
    ]
}