{
    "name": "Residence International De Paris.",
    "rating": 3.3,
    "reviews": [
        {
            "author_name": "Shlomo Levi",
            "author_url": "https://www.google.com/maps/contrib/108227852217374313347/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW_oW1TM9IcpXhuhrymJUxoVQH6iZSnQinMdftdblbhpgocMGrczg=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 4,
            "relative_time_description": "4 months ago",
            "text": "A reasonably priced place to stay. However some members of the receptionist team require some level of training in customer services. There appears to be another additional charge of 25 euros demanded during check in when one had already paid for tourist fees when booked with Booking.com. The extra charge could not be explained and the guy at the reception took umbrage when asked to explain the extra charge. Totally rude and disrespectful.\nOne of the beds totally damaged which caused me to fall through the side and yet they could not change it in the middle of the night because it required a process. Why the cleaners did not notice that, I wondered?\nThe surrounding facilities for communal sports and activities encouraging. At least families have outdoor activities to engage children - football fields , public parks, track and outdoor pools.\n\nCold breakfast provided but nothing else.",
            "time": 1721836734,
            "translated": false
        },
        {
            "author_name": "Mihai P",
            "author_url": "https://www.google.com/maps/contrib/105479627006584741529/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXzOb7FppBXQRtBRgocjJCII7AGPFklVHa8Q6c4RvrpvpWkEhoNdQ=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 2,
            "relative_time_description": "a month ago",
            "text": "Edit: to the response below.. I did not know this is a hostel, it is not mentioned or written anywhere on booking, so this review stands, until you mention that it's a hostel on booking.\n\nSo I want to start off by explaining that this is a hospital. All the rooms are hospital rooms, they have not been modified in any way to be \"transformed\" into a hotel, the hallways have not been changed in any way.  This is a hospital but with hotel doors at every room. The rooms are barren of any amenity, each bed gets one towel, a blanket and a pillow. There is hand soap and shower gel and that și literally it for amenities. No dryer or anything \"luxurious\" like that.\n\nBreakfast is a very sad affair but it's sufficient to get you started ok the morning. You get slices of ham as the ONLY meat and one type of sealed cheese, aside from that it's cereal, crosissants and jam. It's ok but nothing special, at most you're saving 10eur per day with this as opposed to eating out.\n\nLocation is good, safe place and neighborhood, can't complain.  It was just super weird living in a hospital ( oh and it 100% smells like a hospital ), at least if they'd put in some air fresheners to make it smell different.",
            "time": 1729583192,
            "translated": false
        },
        {
            "author_name": "Kevin Horváth",
            "author_url": "https://www.google.com/maps/contrib/111450171732929587281/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXH03C1DNxNdXELZI9XPwcuUV7-UAN1xaLY0_xVKI4KRHKFQoQV=s128-c0x00000000-cc-rp-mo",
            "rating": 3,
            "relative_time_description": "4 months ago",
            "text": "First time I was in France. The parking even it's included was full and they said go on street and pay there. I get it France many people not speak English but the receptionist was just blablabla didn't understand anything... Later we managed to park inside without letting them know.. Parking is a joke...\nRoom is fine tho, quiet.\nThe place and location kinda Ghetto'ish... It's fine tho 2 days spend here due for business.",
            "time": 1722796139,
            "translated": false
        },
        {
            "author_name": "Ines Marques de Oliveira",
            "author_url": "https://www.google.com/maps/contrib/102766417437066531589/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV0GEVecgHaqRAC4ofereDLg4rY4cuOF2bUaGyH0OcXiys4xGk=s128-c0x00000000-cc-rp-mo",
            "rating": 1,
            "relative_time_description": "2 months ago",
            "text": "In the check in we were informed of the breakfast hour, it was until 10, even if in the card said 9:30. On Tuesday we arrived at 9:45 it was closed and the people working there were very rude, told us to go to front desk and they were all very rude. They don't speak enough English and don't know how to explain themselves. At the end the same lady offer if we wanted coffee but it was very stressful situation.",
            "time": 1725955846,
            "translated": false
        },
        {
            "author_name": "Leon McCloy",
            "author_url": "https://www.google.com/maps/contrib/114491205841931998952/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJE34nsLbqs0cnBNQmrpfNmCpqMFxjc4b8-z3J86um3UO0aUw=s128-c0x00000000-cc-rp-mo",
            "rating": 2,
            "relative_time_description": "5 months ago",
            "text": "Well this is a rollercoaster of emotions staying at this hotel. We will start with the good, the breakfast accommodation was relatively alright, many coco shells and cereal. There was just barely ham and yoghurt, it must be a french thing. The croissants tasted pretty good. The vending machines are pretty well priced, mainly the drinks are a good price. HOWEVER, our room had stains on the roof and the plugs were loose. The towels were okay but we were missing one and they occasionally give you new ones, I am NOT wiping myself after a shower with a musty crusty towel that i’ve used multiple times days in a row. The drain in the shower is horrible, it basically doesn’t work. I could’ve drank the water and I would’ve been quicker. It goes from 0 degrees to 100 degrees with one breath on the handle. The guys are the front are not good at english and are basically just speaking stupid french. I hate the french. It’s positioned in the middle of a hood that makes\nme feel like i’m going to be jumped by many thugs, and it has gates like an asylum which it basically is. This place is so bipolar. I hate the french people at reception, mainly because they’re french. Cheers",
            "time": 1719597064,
            "translated": false
        }
    ]
}