{
    "name": "Hotel Vernet, Champs - Élysées",
    "rating": 4.5,
    "reviews": [
        {
            "author_name": "Raksha Rao",
            "author_url": "https://www.google.com/maps/contrib/100807421784355988043/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU4MVfLq0fxLIjIY_BjCMDJJL4IMMMwSiLDAKj3y_RR2GV-Ho5u=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "A++++ Experience\nWe took a trip to Paris for my 30th birthday (myself, my spouse, and our two toddlers), and Hotel Vernet exceeded our expectations in every regard. The kindness of the staff, the responsiveness of the concierge services, the hospitality and the rooms…we absolutely loved our stay here. A+ location as well!\n\nIt was also our first trip with kids to Paris, and the staff went above and beyond to put the most delightful, thoughtful touches in our adjoining rooms. They thought of everything, and the welcome notes + gifts (even for my little ones) were absolutely priceless.\n\nHighly recommend that you book here for your Parisian stay! Thank you, Hotel Vernet! We will be back :)",
            "time": 1729824608,
            "translated": false
        },
        {
            "author_name": "Farshad A",
            "author_url": "https://www.google.com/maps/contrib/107188364091465044893/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX3KbFHH32gIrubhHL1h5v3ec0-ODqgi2yBtC6E5H3boKkB3ivy=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "We had a great stay at Hotel vernet. Location is the best, staff are genuinely friendly and helpful and make you feel home. Room was beautifully designed, decorated and absolutely clean. They went beyond to make us feel comfortable, Parisian hospitality at its best.",
            "time": 1726807462,
            "translated": false
        },
        {
            "author_name": "Elizabeth",
            "author_url": "https://www.google.com/maps/contrib/102086154256219917599/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKK6l_JrBkWLgwSyc8YaceotTsA7jbwG33YdlYyYDY_2nR32Q=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "We stayed recently for 5 nights and had a wonderful experience. The rooms are very spacious, hotel is in a great location and service is impeccable. We will come back!",
            "time": 1725391954,
            "translated": false
        },
        {
            "author_name": "Ryan Bac",
            "author_url": "https://www.google.com/maps/contrib/109227480696717583542/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX4wIipPxN20LGoCpJKyXy3Tld-ad7AETY7NHMqmOkeuTnsWaXr=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "What a wonderful place to stay! My partner and I absolutely loved staying at this traditional yet stylish Parisian hotel. The service is truly superior. The food and the amenities were amazing.\nA month prior to arriving, the concierge worked to book chauffeur service from Gare du Nord to the hotel for my partner and I. They were patient with all of my questions, as I had many about the service. Upon checking in, where we got an upgrade thanks to American Express, reception was very happy to give my partner and I a tour of the hotel room. Also, dinner in Le V was an experience worth taking. Complements to Chef Baldassare for making a delicious dinner! Lastly, my partner had lost his hotel room key somewhere in the city, and the staff were glad to deactivate the old cards and give us new ones. “It only costs a ‘Thank you’”, said Nicholas from reception (it was free).\nNicholas Steinberg (who saw to us upon arrival) and Kevin Sultan from reception were so kind. Also, Kayes Hossain and Julien Aubert were great concierges to work with. Lastly, our room service team were extremely accommodating and attentive and wonderful to be around. I’ll add that the staff were happy to speak English at first, but were nevertheless accommodating to me practicing my French when speaking to them.\nI wish I could’ve stayed in this hotel longer. I cannot wait to stay here again the next time I’m in Paris. Merci et á bientôt, Hôtel Vernet!",
            "time": 1726393530,
            "translated": false
        },
        {
            "author_name": "Nayiri Alexander",
            "author_url": "https://www.google.com/maps/contrib/115420367098289353184/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW7nh39NBOBICuoYodFIPOwoExspcI7szIOeJx6IvAdcctXecfUSA=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "6 months ago",
            "text": "We loved our stay at Hotel Vernet during our trip to Paris! One of the many things that stood out to me was the excellent service, every single employee at the hotel went above and beyond to make sure we were comfortable and had everything we needed. A big shoutout to the concierge, specifically Julian and Harris who were so wonderful and helped us out with everything and were so hardworking and provided us with over the top customer service. Each employee there worked really hard to make sure we had the best stay, especially those working at the front desk, concierge, restaurant staff, and bell boys/doormen. The interior and architecture of the hotel is beautiful and location is 10/10 as you are walking distance from Champs-Elysees, Arc de Triomphe, Eiffel tower, Louvre, and more! Rooms were clean and amenities provided on the daily. Cannot praise this hotel and the wonderful staff enough!",
            "time": 1717534644,
            "translated": false
        }
    ]
}