{
    "name": "Hotel Edouard VII",
    "rating": 4.5,
    "reviews": [
        {
            "author_name": "George",
            "author_url": "https://www.google.com/maps/contrib/103065898936615450242/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUhIxiIn1HoXtFLTXsvgRam4OQDaf1AKVSW_Tz9hFLpNiwjXumg=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "We visited on a family vacation near the end of August and had a great stay. The location is a central area that is close to a lot of tourist sites such as the Louvre and also subway stations. The staff were extremely friendly and helpful and offered plenty of recommendations and tips during our stay. And the rooms were spacious, which I wasn't expecting for Paris. When we arrived, the main elevator was broken for the first day and thus we had to rely on the staff elevator, which wasn't too bad. In general, we were all pleasantly surprised especially after a not so pleasant stay in London at a seemingly 4-star hotel.\n\nFrankly for the price, it's pretty darn good.\n\nPros:\n- Convenient location\n- Friendly and helpful staff\n- Spacious rooms for Paris\n- Windows that actually open with little balconies. Very neat.\n\nCons:\n- Elevator is small. But, that's kind of expected for the city.\n- Breakfast isn't worth the price, especially with so many walkable places to eat near you.",
            "time": 1729266370,
            "translated": false
        },
        {
            "author_name": "Patool A",
            "author_url": "https://www.google.com/maps/contrib/110726312046783642830/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUuXwVyzw5Bl3-QmqquRmODfqj34A_ciLyhiuSjUDRH0oQtpHIR=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "The hospitality we experienced here was world class. From the moment we arrived we were made to feel so welcome and the staff was so attentive to all of our needs. Helen and Hugo at the front desk were so helpful and answered any questions we had.  They really went above and beyond. The rest of the staff was also incredible. The location is also ideal and very close to the metro station as well as lots of places to eat and shop. Not to mention the beautiful view of the Opera! The rooms are charming, clean and comfortable. I slept so well every night after long days of walking and sightseeing.\n\nWe accidentally left a couple of valuable items in our room after checking out and we were stressed out trying to find them. Renaud reached out to us after finding them and has been so helpful. We are truly so appreciative.\n\nI can’t recommend this place enough. We look forward to staying here again if we ever find ourselves so lucky to be back in Paris.",
            "time": 1724746353,
            "translated": false
        },
        {
            "author_name": "Max",
            "author_url": "https://www.google.com/maps/contrib/101464755381300230442/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI_049Int1vE9fjV3kpp69bAjb1FRq2qQ8LPwlhUvOQqQoCEr5y=s128-c0x00000000-cc-rp-mo",
            "rating": 1,
            "relative_time_description": "a month ago",
            "text": "Review\n\nI feel obligated to warn anyone considering this hotel. During our stay, my girlfriend’s Van Cleef Perlee Rose Gold necklace—a treasured and extremely valuable graduation gift from her parents—went missing from our room. We discovered the loss the day after we left Paris and immediately called the hotel. The manager listened but took no meaningful action, deflecting responsibility by explaining that room service is outsourced to a third-party company, as if that absolved them of any accountability.\n\nWhat’s even more disturbing is that the cleaning staff repeatedly entered our room while we were out, often without reason or permission. On one occasion, we returned to our room unexpectedly and nearly walked in on the cleaning lady as she exited. This raised serious red flags at the time, but we didn’t anticipate just how significant it would become.\n\nThis experience shattered any sense of security we expected from a hotel of this supposed caliber. To anyone planning to bring anything of value: think twice. The lack of accountability, coupled with questionable practices by staff, makes this hotel a risk to guests’ belongings. We left with a profound sense of loss and disappointment in this establishment’s indifference to guest welfare and security.",
            "time": 1730465833,
            "translated": false
        },
        {
            "author_name": "christine johnson",
            "author_url": "https://www.google.com/maps/contrib/105183624999632572563/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJEO9NsdC2EqYzNsoOnEmbeH56qyqmwNcCfp0iAOv98cgLT9Q=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "This was a fabulous stay at the Hotel Edouard 7! We came to Paris for our Honeymoon and this was a superb experience, the hotel is central to town we walked almost everywhere, but you have the metro and bus stops nearby. The concerige was acceptional! The laundry service was very convient. Our beds were comfy, every night they gave us chocolates and turned down the bed. The breakfast buffet's fresh baguettes and croissants were magnificent with my cappuccino. They care very much about the details, our bathroom was almost bigger than the bedroom! I will return to this hotel, I am now a lifetime customer. Merci for making us feel at home is Paris",
            "time": 1725442558,
            "translated": false
        },
        {
            "author_name": "Ashley",
            "author_url": "https://www.google.com/maps/contrib/115315247406866152747/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXOWf_a_Jo9TEm8X5WDWWV3ZGcVYtILdcHxoWBbttuG-elHOMaH=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "Our family stayed here for the Olympics. We were warmly welcomed by the incredible front of house staff, and our young daughter was delighted to find a kids coloring and sticker kit along with a little stuffed animal on her bed. Additionally, it was my husband's birthday and they later surprised us with a thoughtful cake!\n\nDuring our entire stay the staff were always friendly, accommodating, helpful and we soon felt like we were staying with family. We'd like to personally thank Laurent and Polina at the front desk, all of the restaurant staff and the housekeepers. The hotel was booked full of American foreigners during the August month of French vacation, and everyone was kind and gracious.\n\nWe enjoyed breakfast daily and found the buffet to be diverse and delicious. We also dined for lunch twice and greatly enjoyed our meals and the service. While we attempted a little French, luckily most of the staff were polyglots.\n\nThe housekeepers took excellent care of tidying our family's mess and making the rooms fresh and clean. They always made sure we had enough water, fresh towels and crisp bedding. Being Paris, we were delighted to have wash clothes, though with the warm nights would have liked a flat sheet also on the bed.\n\nWe thought the beds were a bit hard like when in Japan. Having been there nearly two weeks, we started to notice a moist odor with the plumbing near the end. Maybe it was the connected drainage, or maybe the shower needed the caulking refreshed, or maybe the room AC condensation wasn't able to drain away.\n\nWe loved the location and the charming style of the hotel and were delighted to have a large balcony overlooking Av. de l'Opéra.\n\nIt was immensely charming to walk around and explore the neighborhood. The various metro stations were all so very close. There is Little Tokyo nearby, the Louvre Museum, Jardin des Tuileries, Galerie Vivienne, Colonne Vendôme and of course Galeries Lafayette Haussmann. Our favorite shops were Pierre Hermé and Brentano's.\n\nOf special note of how the staff go above and beyond, Laurent walked my husband and my daughter one night to the best crepes nearby at Chez Suzette so that they wouldn't get lost. Additionally, one of the bellmen also went above and beyond to take us and our luggage to the metro and got it on board in the August heat, ensuring we got all of our things onto the correct train for our departure.\n\nWe will look back fondly on our Olympic holiday in Paris at Hotel Edouard VII thanks to the wonderful staff, the beautiful hotel and historic location. We would be very happy to return and would also seek out the other B Signature Hotels. Merci beaucoup.",
            "time": 1724570988,
            "translated": false
        }
    ]
}