{
    "name": "Hôtel Campanile Paris Bercy Village",
    "rating": 4,
    "reviews": [
        {
            "author_name": "Daniel Sánchez",
            "author_url": "https://www.google.com/maps/contrib/116876686666057590424/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVTiozUcbNPXDRtCvTMsNJNtVPRjvkCZfa83dUPXV9xOrxIHZnMoQ=s128-c0x00000000-cc-rp-mo",
            "rating": 4,
            "relative_time_description": "a week ago",
            "text": "Quite surprised with this hotel.\nNot bad for a 3 star hotel.\n\nThe room is very nice, the only downside is the bathroom. It's not dirty, but it's badly kept, ugly, the shower joints are rusty... it needs a renovation.\n\nThe buffet is simple but tasty, with juices, coffee, waffles, bread, cereals, yoghurt, etc.\n\nThe location is quiet and safe. It is a residential area with a very nice area nearby for shopping and eating.\nThere is nothing touristy nearby, except the stadium where sometimes they do concerts, but luckily Paris is very well connected with the metro and the hotel has a stop 5 minutes away in the direction of the Trocadéro, perfect.",
            "time": 1732271183,
            "translated": false
        },
        {
            "author_name": "Sonja Stojicic",
            "author_url": "https://www.google.com/maps/contrib/100948843878481298181/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLm5rp3_P3g7_eS71kQPRxRtVXNkhnI2I56f6k9I-cakhhb7g=s128-c0x00000000-cc-rp-mo",
            "rating": 2,
            "relative_time_description": "2 months ago",
            "text": "Room are very small, outdated, unpractical for one person and even worse for two adults. Not enough space to store luggage. Check in was unpleasant, staff unfriendly and no warm welcome at all.\n\nRoom service poor, you have to ask for towels, coffee cups and creamer. I also asked to take one straw from downstairs caffee and lady yelled at me.\n\nOverall experience not good, so not coming back for sure.",
            "time": 1728209037,
            "translated": false
        },
        {
            "author_name": "Juliana Dabalos",
            "author_url": "https://www.google.com/maps/contrib/112691632617834815313/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIjqOR_3sXRrgV2GV1on03V-Dq1W3wO5Xc4EYE4aadzChF0bw=s128-c0x00000000-cc-rp-mo",
            "rating": 1,
            "relative_time_description": "2 months ago",
            "text": "200€ for a singular night, you would hope to have decent service. modern and clean lobby, the rooms could use a bit of updating. the lights flickered and the bathroom could be better maintained.\n\nwe checked in after a long day and missing a train on September 21 around 23h00. after receiving our cards, we went all the way to the 7th floor to room 715 and opened our room only to find there were already people inside! they were just as shocked as we were. not only is that an insane security risk to either party if the circumstance was escalated, but when we went back down to the front desk, the man working there did not even apologize. he just issued us new cards (for room 714 - right beside the people who had just been interrupted!) and dismissed us by blaming his coworker for the mix up. there are no extra boltage or locks inside the rooms, which is why our cards easily opened the door. we checked out the next morning at 06h30 and he had a very smug look on his face and said “everything was okay? sorry about last night” while eating a pastry and LAUGHING. I wish our circumstances were different and we could have stayed somewhere else.",
            "time": 1726984550,
            "translated": false
        },
        {
            "author_name": "Piotr Filipowicz",
            "author_url": "https://www.google.com/maps/contrib/109362829184679232368/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLAijbuEzU88C-sgljxf7EYRGrFVr7QgNtT-JXy-1Kf0bYDTw=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 2,
            "relative_time_description": "a month ago",
            "text": "What the hell is it?! This hotel is really poor quality. The bathroom -stinks. The room - very tiny, not celaned properly. AC - doesn't work. Walls - thin as hell (you can hear everything from the corridor and other rooms). Iron board - maybe smurfs could iron their clothes on it. In the morning I was woken up by the fan in the room, that I coulnd't turn off. And all that for riddiculous price for night. The only advantage is front desk, lovely staff working there.",
            "time": 1729683423,
            "translated": false
        },
        {
            "author_name": "Tatiana Papastoitsi",
            "author_url": "https://www.google.com/maps/contrib/108840899724249102939/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK-XPXg3G_4UmlFKhBxm6ff8-9neI0JJ-YUSYbuABWoacg7zQ=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "2 weeks ago",
            "text": "We made some group reservations to Hotel Campanile, and all our guests were very happy with the rooms!\n\nStéphanie was our contact person and she made everything with the reservations very smooth. She was very polite, and she made the most to accomondate all requests received.\n\nI definitely recommend the hotel, especially in case organisers of events need to arrange several bookings.",
            "time": 1731752583,
            "translated": false
        }
    ]
}