{
    "name": "Le Pigalle",
    "rating": 4.6,
    "reviews": [
        {
            "author_name": "Patrick Daniels",
            "author_url": "https://www.google.com/maps/contrib/108480243113344329706/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV4VDKOFPLtW_S_Wj44_wjNQxTHJ7kWp4uEBVsobmQ-dOAkqZNkvA=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "What an amazing and welcoming staff. They are all very knowledgeable about the area and Paris. The breakfast is perfect (parfait). The room we had was small but it is to be expected in a big city. Each room is different and some of the other rooms on our floor had a better outline.\nThe location was easy for a traveler. The neighborhood is lively but felt safe.\nI can't wait to come back.",
            "time": 1723965453,
            "translated": false
        },
        {
            "author_name": "Nidhi S",
            "author_url": "https://www.google.com/maps/contrib/118117496385236215772/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUrkCF3mQOeHqx7qwbCkztGEpBfgmb7pMNDS1QUc6pXovSbEGKBbg=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "3 weeks ago",
            "text": "Offers an authentic and charming French dining experience. The bistro boasts a cozy, Parisian-inspired ambiance, making it perfect for a romantic evening or a casual meal. The menu features delicious, classic French dishes, prepared with fresh ingredients and full of flavor. With friendly service and a relaxed atmosphere, Le Pigalle is a must-visit for anyone looking to enjoy true French cuisine.",
            "time": 1731510305,
            "translated": false
        },
        {
            "author_name": "TravelingGayPanda",
            "author_url": "https://www.google.com/maps/contrib/103879372002906173234/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWQJck_pV3WAB1ErIrGMhefyTblqJ__AVZFissu2zOJN-DZn0dl=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 4,
            "relative_time_description": "a month ago",
            "text": "I stayed here for 3 nights. I didn’t have any issues with the hotel but it’s definitely not a 4 star hotel. It’s a small, boutique hotel that I would classify as 3 stars. First, there isn’t even a lobby with a reception area. There’s a communal dining table with a staff member and a laptop who checks you in. I completely didn’t even realize they were staff because they blended in with the other patrons who were using the dining table. I had room 31 which is fine for a solo traveler, but definitely not for a couple. It’s small and inconveniently designed. There’s no door from the sleeping area to the shower and sink. The toilet is a separate, closed off area, away from the sink which I would find awkward if I was sharing with a partner or a friend.The lobby also hosts a club and many DJ’s so it tends to get quite loud and packed at night. There are also plenty of clubs on the same street that I could hear at night when I’m trying to sleep. It wasn’t really an issue for me because I can sleep through anything, but I can see how that would be a problem for other guests.",
            "time": 1730479998,
            "translated": false
        },
        {
            "author_name": "Greg Welch",
            "author_url": "https://www.google.com/maps/contrib/102569260796649376109/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWF9F8AmfIMgwkvf1tLyXbHMrL7ZPhZDc4kugqXhLA50ULnxC3y=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "I came to Paris for the Olympics and Paralympics and had a long stay. The staff were very accommodating and willing to help in any way. They offered directions to events and things to do but the most amazing thing is that they were so genuine and caring, I will certainly visit and stay here again.",
            "time": 1725467166,
            "translated": false
        },
        {
            "author_name": "Steph Doll",
            "author_url": "https://www.google.com/maps/contrib/114941223974772546371/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUv4rTh7jH1clN3pQ4gcYw5oA9n07MRotILo2KlyFZFZVxL95pbsw=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "5 months ago",
            "text": "Our 5-night stay at Le Pigalle Hotel was exceptional. The hotel's design strikes a perfect balance between classy and chic, creating a welcoming atmosphere throughout. The rooms were tastefully decorated and boasted incredibly comfortable beds. The service was outstanding; from the friendly front desk staff to the attentive kitchen and coffee area team, everyone ensured we felt well taken care of. Breakfast was a highlight with delicious food options. Overall, Le Pigalle Hotel offers excellent value for money and made our stay truly memorable.",
            "time": 1719046042,
            "translated": false
        }
    ]
}