{
    "name": "Le Royal Monceau - Raffles Paris",
    "rating": 4.5,
    "reviews": [
        {
            "author_name": "Renee Gindi",
            "author_url": "https://www.google.com/maps/contrib/102278578290357061733/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLkkvc0Lf1Vz3Qt5_MgbuUQFkaxCY94THb3i6SZBbB9N2tw5Q=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "3 weeks ago",
            "text": "What a fabulous hotel! My family and I had the most amazing 9 night stay at the Royal Monceau. The hotel is beautiful & the staff is beyond helpful. From the moment you arrive, the amazing bellman are so helpful and nice. The front desk staff is amazing, (Melanie, Antoine, Hannah & everyone else too) the concierge team, Amaury, Elise, Leah, daisuke, & all others. We had such a great stay thanks to Xavier who helped us & made us happy no matter what it was about. He was amazing & we love coming back here year after year. The beautiful breakfast buffet is something spectacular. Special credit to the amazing chefs & pastry chefs because WOW! Everything was visually beautiful & extremely delicious! Thank you to Sultan who is the food and beverage manager for ensuring that we have everything we need at breakfast & beyond. I would also recommend checking out the pool / hot tub and gym. I loved going to the gym every morning. It was beautiful.\nI definitely recommend the Royal Monceau for your next Paris trip!",
            "time": 1731586435,
            "translated": false
        },
        {
            "author_name": "Anoud G",
            "author_url": "https://www.google.com/maps/contrib/116215107579722824699/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIRKX0NVrBwjdZ3mf0T6Y-3t7SqDNgTp-pC747CSKXLa7QNtA=s128-c0x00000000-cc-rp-mo",
            "rating": 4,
            "relative_time_description": "3 weeks ago",
            "text": "I recently stayed at the hotel and had an overall great experience. The room was clean, spacious, and well-furnished, and the amenities were top-notch. The staff was friendly and responsive, making sure everything during my stay was comfortable and pleasant.\n\nHowever, one issue has left me a bit frustrated: the hold they placed on my card during check-in still hasn’t been released, even though it's been over a month since my stay. I've reached out multiple times, but there hasn’t been a clear resolution. While I understand holds can sometimes take time to process, this delay feels excessive.\n\nAside from this inconvenience, my experience was positive. If they can address this issue, I would have no hesitation in recommending this hotel to others.",
            "time": 1731014103,
            "translated": false
        },
        {
            "author_name": "Bjorn Schuurmans",
            "author_url": "https://www.google.com/maps/contrib/116412864351732508582/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJPo6rcN3RulxWHX9C5ws2CHzCDZtlg9csgkOQ0EVbmdNQuRA=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "Our favorite hotel in Paris. Rooms are quiet and spacious. Breakfast is really recommended. Bar in the evening has a cool vibe. Staff friendly and hospitable",
            "time": 1730624377,
            "translated": false
        },
        {
            "author_name": "Abeer Almunajem",
            "author_url": "https://www.google.com/maps/contrib/114994202519632835064/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLuVxL2TB31vyXj8lR7ohGg-k7jXWGdhMH4aLD511ncEST1aQ=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 4,
            "relative_time_description": "5 months ago",
            "text": "What really fascinated me about this hotel was the friendliness of all the staff at the front disk,, they were very friendly and cooperative.\nThe hotel rooms are nice and clean but a little noisy, you can hear everything in the corridor from running children to people chatting and housekeeping.\n\nThe one thing i found it really unsatisfying was the housekeeping it took them forever to send an iron to my room, and during my stay they never came for a turndown service and never put a drinking water and when i ask for water they send it to me in a dust bag???!!!!!! + they never remove any dirty dishes in the room.",
            "time": 1718807948,
            "translated": false
        },
        {
            "author_name": "Mary Kroeger",
            "author_url": "https://www.google.com/maps/contrib/108632127817851435075/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLdL82HlJJBkWRIjNMwb9k91JM_0-5z0-1gwYky_I2R36SOew=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 5,
            "relative_time_description": "6 months ago",
            "text": "We had a delightful stay at Le Royal Monceau. From check in to check out everyone was kind and helpful. We were here for the French open and they left hats and fans for us to take to the match! The room was beautiful and though we didn’t eat at the restaurants the bar service and food was exceptional. Thanks for a great stay!",
            "time": 1717665989,
            "translated": false
        }
    ]
}