{
    "name": "Hôtel San Régis",
    "rating": 4.7,
    "reviews": [
        {
            "author_name": "Ligia Paraiso",
            "author_url": "https://www.google.com/maps/contrib/117170580582196660614/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW4pHSJTndAE4f75D8u7auCQnSk4gNy3vsaFtcrXwqWo_6mWD9vPA=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "For our anniversary, I was treated to this wonderful surprise. We spent two days and one night at the San Regis Hotel. Originally built in 1957 and opening its doors in 1923, the hotel has been completely renovated, offering an exquisite blend of history and modern elegance. I highly recommend this destination for those who appreciate the finest in comfort and luxury.\n\nThe staff were exceptionally attentive, the room was magnificent, and dining at Les Confidences (I’ve also reviewed it—do take a look) was an absolute delight.\n\nIn short, this hotel truly lives up to its 5-star reputation, making our celebration even more special with its remarkable attention to detail.",
            "time": 1727075706,
            "translated": false
        },
        {
            "author_name": "Heather Lee",
            "author_url": "https://www.google.com/maps/contrib/103929527907063907688/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVUU7pSzJYbQUQvbCzTr1FgREUa2sUgwKEHbEYeacdsjoXngpc=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "We recently spent a few nights in Paris and stayed at this wonderful hotel. From the time we walked in the doors, exhausted from our trip, we were greeted warmly by all the staff. Jerome provided us with a map and highlighted some things we might want to do. The porter was gracious and so friendly as well. Our room was beautiful and the balcony provided an amazing view of the city and the Eiffel Tower. Highly recommend!",
            "time": 1723146976,
            "translated": false
        },
        {
            "author_name": "Katerina",
            "author_url": "https://www.google.com/maps/contrib/102896721017991320372/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVM0pEIpdNwB_4ZAIb35lZUtUFVYjiUyeKpqfzbmARrs5TcNm3qtQ=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "A lovely boutique hotel in a great location. The area itself is nice and a 20 min walk to Eiffel Tower, 10 min drive to the Louvre without traffic. Rooms are very cute and cozy, the restaurant is lovely and the stuff is very helpful and friendly. Great experience.",
            "time": 1730140703,
            "translated": false
        },
        {
            "author_name": "Chase Sampson",
            "author_url": "https://www.google.com/maps/contrib/113797871911848679414/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWF5fjmSUT4OU5geLwJPxOutBIgdZ-WZLPigB18wbxKN1ITaGHd=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "The best review I can give is that I would return to Paris just to stay at this hotel.\n\nA truly luxury experience in a unique, boutique-style hotel, with world-class service that you would expect to pay double the price (or more) for.\n\nWe were there for4 nights celebrating a 5th wedding anniversary and the staff went above and beyond to take care of us and make our stay special.\n\nAt the end of long, hard walking days seeing the city, there was nothing like walking through the doors of the hotel, walking through the beautiful lobby, getting back to the room and taking a hot bath, putting on a plush robe, being fully relaxed, and getting a fantastic sleep in one of the most comfortable beds I've ever slept in.\n\nOn top of that, you are just a few minutes walk from two Metro stations and all of the shopping you could ever want, plus just 5 minutes from a great view of the Tower and the Arc.\n\nWe stayed in 3 wonderful hotels on this trip and this is the only one I'm bothering writing a review for because it was so memorable.\n\nThank you San Régis!",
            "time": 1730815613,
            "translated": false
        },
        {
            "author_name": "Chris Haffner",
            "author_url": "https://www.google.com/maps/contrib/107896929040758764184/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX5i5KPn1HDr7udwoe5lY2YfILiquxXAJeNwT6Af03DPqAeJ4c=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "5 months ago",
            "text": "There are not enough words to describe how exceptional this place is. We stayed in the gorgeous junior suite with views of the Eiffel Tower, a stunning spot for a special occasion. What sets this hotel apart is the highly personalized service. Unlike other hotels of this caliber, everybody knew our names and it felt like a luxurious home rather than a fancy hotel. The concierge Jerome was incredibly kind, hospitable, and skilled. The team here is the reason why we wouldn’t stay anywhere else when we come back to Paris.",
            "time": 1720252817,
            "translated": false
        }
    ]
}