{
    "name": "Belambra Hotel \"Magendie\"",
    "rating": 3.8,
    "reviews": [
        {
            "author_name": "Sundeep Gulati",
            "author_url": "https://www.google.com/maps/contrib/114192600651680742543/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWZhNO3YpsJpB2PvyjBczgZOyzAaeC_-0n_CmH3fQHBzUzHC6MBug=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "Belambra city Hotel Magendie in Paris is an excellent choice for anyone looking for convenience, comfort, and affordability in the heart of the city. The location is perfect, with easy connectivity to all major attractions via metro and bus, making it ideal for sightseeing. The hotel staff is friendly and attentive, always ensuring a smooth and pleasant stay. Rooms are spotless, and the overall cleanliness is impressive. Plus, with metro and bus stops just a short walk away, getting around is a breeze. For the price, the quality and service make this hotel an exceptional value for money. Highly recommended for a memorable Parisian experience!",
            "time": 1730237643,
            "translated": false
        },
        {
            "author_name": "Nausica Aldeghi",
            "author_url": "https://www.google.com/maps/contrib/116592279022421313395/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIA-jKshXiTqKM5pbBvlpJ3C2UQ_Qc6H1MQi6CzInF8hO6CDw=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "I stayed here in July 2024 and I was honestly a bit worried after reading the reviews (but I booked very late and it was the only reasonably priced option other than some very dated and dusty looking hotels). But it was great, especially seen the price!! The room was small but modern, clean and welcoming, the breakfast was quite abundant and I really liked the position in a quiet neighborhood but still close to the heart of Paris - I could walk to notre dame in half hour. One of the few times when the google review doesn’t match the experience.",
            "time": 1730596716,
            "translated": false
        },
        {
            "author_name": "Constantin Meili",
            "author_url": "https://www.google.com/maps/contrib/112060071709641522714/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX7PEE3U3vR6-MTjIj89e40nTZTWXQPHwoKCBn68aIR-dG0FAA1=s128-c0x00000000-cc-rp-mo",
            "rating": 1,
            "relative_time_description": "4 months ago",
            "text": "Overall: expensive for what it is. You’re better off finding a much nicer AirBnB even more central in Paris for the same price or spend a bit more to get a MUCH nicer hotel. Otherwise the location was pretty good, 5 minutes from metro and bus. Breakfast buffet was a low ok. The food itself wasn‘t especially good or bad quality but there just wasn‘t much choice. I know a lot of other people give it good reviews on here but I honestly think that’s because people don’t know that there are MANY better options for similar pricing out there.\n\nUpdate: I forgot to write that the LOBBY STANK like molded tuna fish. It was BAD.\n\nThe positives:\n-Good location\n\nThe negatives:\n-Cleanliness (our bedsheets and curtains had stains)\n-Room size. That is something nobody else talks about it seems but it was a really annoying issue as it made even just opening your suitcase difficult.\n-Breakfast choice very small (basically just bread, eggs, cornflakes and a few jams, honey and such) and I expected more for such a relatively high priced hotel…\n-Doors for the rooms were super thin, you could hear people in their rooms across the hall talking like they were in your room almost.\n-High price for what you get…",
            "time": 1720514384,
            "translated": false
        },
        {
            "author_name": "A B.",
            "author_url": "https://www.google.com/maps/contrib/114006137356208543415/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK8RkMoxKiAF3QgHhCYAYPKMu4w9435UKuGw9GPeY6UuvHwcQ=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "6 months ago",
            "text": "Wonderful stay at this hotel a few weeks ago. Great value considering the location. Staff were very polite and helpful. Bathroom was nice and bedroom was great too. Would highly recommend it.",
            "time": 1716028436,
            "translated": false
        },
        {
            "author_name": "Daniel Bultrini",
            "author_url": "https://www.google.com/maps/contrib/108187221479247986923/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWkdRtn9PkRUvRMtCuSGoLVewOEYMxwVIyfL9-VU4w64OxY74s=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 1,
            "relative_time_description": "2 months ago",
            "text": "Forced me to pay the room at 1am even though it was paid for by a company that invited me for an interview. Even though I tried to explain the situation, they still made me pay, now who knows how many weeks I'll wait for a refund and the amount of trouble and time they have wasted for me and the company that invited me. Bathroom shower was also half broken.",
            "time": 1725643796,
            "translated": false
        }
    ]
}