{
    "name": "Archibald At The Charles Bridge",
    "rating": 4.6,
    "reviews": [
        {
            "author_name": "J D D",
            "author_url": "https://www.google.com/maps/contrib/105141279609924750923/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLbbcv0_UMXicZB6d0irUwdFQCbvwdKNA5FerWUUeYjT8roeg=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "3 weeks ago",
            "text": "Picking hotels when one is unfamiliar with the local terrain can be a challenge. Fortunately this hotel was our pick; we were not disappointed. Located less than 100m from the Charles Bridge access, with a few restaurants and bars nearby, it is a perfect location to explore Prague.\n\nThe check in was very polite and quick. Our single room was in the SW corner of the building with a view of the piazza area and street. The bed is extremely comfortable and separate washroom and shower was very good. The room was made up every day, and coffee/tea replenished. There was a closet to put our clothes away and a small table. The room was also very clean. You have either elevator or stair access, with the elevator being very quick (newer one?).\n\nOur room came with breakfast included, and the breakfast was very good with a nice selection of options. They also had a small soup/salad brunch included which we took advantage of a few times. As a bonus, there is a small restaurant on the river side that we stopped at a few times for a beer - great location and view of the river.\n\nStaff were excellent, friendly and polite. They managed our transport to the airport as we asked.\n\nOverall, we highly recommend this Hotel.",
            "time": 1731433505,
            "translated": false
        },
        {
            "author_name": "Andrew Simpson",
            "author_url": "https://www.google.com/maps/contrib/116544367500334629444/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLQfVz9K0W9nWANgRUcaaSCPqh4YDB63_0WkKQWDSqnmJVjSg=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a week ago",
            "text": "A great place to stay. Comfortable, spacious room. Friendly, helpful staff. Excellent breakfast to set you up for the day ahead. Beautiful setting on Kampa Island. Perfect location for Charles Bridge and the Castle District. Would very definitely recommend.",
            "time": 1732453945,
            "translated": false
        },
        {
            "author_name": "Rob Hart",
            "author_url": "https://www.google.com/maps/contrib/117364098631856444086/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLS-dAIOPyOqQBkWErOtAWDgO2DjD9oobtzCKEmRUII-ZTzPA=s128-c0x00000000-cc-rp-mo-ba6",
            "rating": 5,
            "relative_time_description": "3 weeks ago",
            "text": "I can't recommend this hotel enough. We had room 25 on the top floor with a dual aspect view of the square below and the river and bridge. The room was super clean and bed was very comfy. The roof beams are a great feature of the room. The bathroom is large with a bath and over the bath shower and extremely clean. The room service was superb. Fridge, safe and kettle are an added bonus. The buffet breakfast is great with a good choice of cereal, bread, fruit and hot choice of the usual food. The added bonus of a soup, bread sandwich and sweet cake with coffee and tea from noon until 4 pm is a tremendous bonus. The staff are very friendly and helpful. The lift is also an added bonus after a long day walking around Prague.",
            "time": 1731310940,
            "translated": false
        },
        {
            "author_name": "Eleni Ke",
            "author_url": "https://www.google.com/maps/contrib/114181493726536509316/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXecjUZQuUw983s17zvoNFMlQNkP-WC9SND8nGSxoaQ8aYpV_JA=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "4 weeks ago",
            "text": "Beautiful small hotel. It was soooo clean! I was excited. There was only a kind of problem with the parking. The hotel can ensure you a permission for the blue zone, but doesn't provide you a parking spot. You have to look for parking by yourself. And it's difficult there, because of the small old streets and the many tourists. I think it's like that with all the hotels in Prague. Anyway, the hotel was nice and the breakfast too. The location perfect.",
            "time": 1730837527,
            "translated": false
        },
        {
            "author_name": "Haylee K",
            "author_url": "https://www.google.com/maps/contrib/104286680169881164416/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLM9ONwulP8MP2021rKLxjsX1MROIdqAO-WaF_M3_HlLVPakQ=s128-c0x00000000-cc-rp-mo",
            "rating": 4,
            "relative_time_description": "2 months ago",
            "text": "Great location for the most part. One thing of note is that drivers cannot access the street directly in front of the hotel, so you do have to walk down the street with your bags to get rides or be dropped off. It was minor for us, but could be difficult for others possibly. The staff were friendly and helpful. The breakfast had a decent variety. The room and bathroom were very nice, with an AC unit that blew a good amount of air.",
            "time": 1727986979,
            "translated": false
        }
    ]
}