{
    "name": "The Mozart Prague",
    "rating": 4.6,
    "reviews": [
        {
            "author_name": "Lugen",
            "author_url": "https://www.google.com/maps/contrib/112688814476424819732/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKKHsA-Wmyroe03SQPLL1TrEZOcdIJRa2o_fjhjChBlvjmUebA=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "I recently had the immense pleasure of staying at The Mozart Prague, and I can't say enough about this exceptional hotel. From the moment I walked in, I was greeted by the warm smiles of the staff, setting the tone for an unforgettable experience.\n\nThe service was flawless. The bellman greeted me with genuine warmth, eager to assist with my luggage and ensure I felt at home from the very start. At check-in, the receptionist was professional, efficient, and welcoming, making the process seamless and thoroughly pleasant. The Front Office team went above and beyond to make sure every special request was catered to with care and a personal touch. Their commitment to ensuring that each guest's needs are met speaks volumes about the attention to detail and dedication to service at this hotel.\n\nBreakfast was another highlight of the stay. The breakfast service staff were attentive, friendly, and provided everything I needed before I even had to ask. They kept the ambiance comfortable and inviting, creating the perfect start to each day.\n\nSpecial thanks to the Front Office Management for making my stay feel so unique and catered. Every detail, from handling special requests to ensuring my comfort, was meticulously arranged. I genuinely felt like a valued guest throughout my stay.\n\nIf you’re looking for an impeccable blend of elegance, comfort, and world-class hospitality, look no further than The Mozart Prague. This is truly a gem in the heart of Prague!",
            "time": 1730656588,
            "translated": false
        },
        {
            "author_name": "Clara Gribius",
            "author_url": "https://www.google.com/maps/contrib/100625462833836835824/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXpb_ZNoWtF_KUW21pfrHTKoxARW9liSXDGJIrfguwJqKyBOWEX=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "An experience not to be missed in Prague!\nMy friend and I had an amazing time here! The location is perfect - within walking distance of many sights and right on the river. We were able to explore the city on foot.\nFrom the moment we arrived, the service was impeccable. Dorine, the front office manager, made sure our stay went as smoothly as possible.  The staff were equally attentive, and also gave us excellent recommendations.\nThe decor and spacious rooms were much appreciated and made for a comfortable stay.\n\nWe look forward to returning!",
            "time": 1729689158,
            "translated": false
        },
        {
            "author_name": "Bor Ilovar",
            "author_url": "https://www.google.com/maps/contrib/110765115023360697429/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW_zJHhbfhyqr2NKgjHiDLBbRly8k-zuTaG9E6J58qT4w11XK9l_g=s128-c0x00000000-cc-rp-mo-ba6",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "I had a wonderful stay at this hotel! The atmosphere was warm and welcoming from the moment I walked in. The rooms were clean, comfortable, and well-equipped, making it easy to settle in and relax.\n\nOne of the highlights of my stay was the excellent service. Special shout-out to Budi, a truly outstanding member of the staff who went above and beyond to make sure I had everything I needed. His friendly demeanor and attention to detail made my experience memorable and enjoyable.\n\nI would highly recommend this hotel to anyone looking for a relaxing, stress-free getaway. Looking forward to my next visit!",
            "time": 1730383656,
            "translated": false
        },
        {
            "author_name": "Judy Pegus",
            "author_url": "https://www.google.com/maps/contrib/100593060841099491295/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKMZCDDoBdYYDE5lsTRjwk6RUy7c1Bl0eMD23b5C7xwOhx5KA=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a week ago",
            "text": "We stayed 6 nights.  This is a beautiful hotel and very historical.  It is in an excellent location.  You can walk everywhere and close to the Charles Bridge.  The staff are fantastic and so is the food.  We were given a loft apartment of the 3rd floor which was very large and comfortable.  There are no lifts as it is a palace converted to a hotel.  We climbed the stairs. Our apartment did not have any windows or views, just skylights. The room we had is not shown on the Accor or hotel website.  Will say that all Accor hotels have the most comfortable beds!!",
            "time": 1732209031,
            "translated": false
        },
        {
            "author_name": "Kris Piatt",
            "author_url": "https://www.google.com/maps/contrib/103416862266104319022/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUT38gKW7xqpe0CFYr6xNDbShUUQlvHeQpKHMOkSEaimOo3OFGF=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "2 weeks ago",
            "text": "Location was perfect; great views and steps from the Charles Bridge.\nService was exceptional and personable.\nThe staff recognized and welcomed us every time we passed the front desk.\nThe helped us with tickets and transportation. We felt like we were staying with friends.",
            "time": 1731926201,
            "translated": false
        }
    ]
}