{
    "name": "Jalta Boutique Hotel",
    "rating": 4.2,
    "reviews": [
        {
            "author_name": "K M",
            "author_url": "https://www.google.com/maps/contrib/112179451932143451384/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL-_iWgmRw8HFF7kZailKLEi4dJDftxJBC8sHnpF_fqfhnulw=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "Had a very pleasant stay at this hotel.\nExcellent hospitality and service.\nThere are some road works going on there currently and in few months time when it over, the area will become an excellent place to base your Prague trip. The hotel staff were very kind to accommodate all our needs. Special thanks to the Lady front desk manager.",
            "time": 1729001488,
            "translated": false
        },
        {
            "author_name": "Lee Harding",
            "author_url": "https://www.google.com/maps/contrib/111080522912302993685/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX-TeNlSnVnCWKqksaGvT0gm_3JK7WmMTf4OlvCu7tpSNOxQN7vrQ=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "This place far exceeded our expections. From the moment we stepped into the hotel the staff could not do enough for us. Our room was beautiful, Clean and spacious. We had a great balcony with a great view. There was no noise at all from the busy square below.\n\nWe would like to give a special shout out to the staff in the fat cat restaurant bar who made our stay so brilliant. What an absolutely brilliant team of hard working people. They really did make our holiday with there friendliness and rapport\n\nI would 1 million percent recommend a stay here without exceptions\n\nDavid & Lee",
            "time": 1727943548,
            "translated": false
        },
        {
            "author_name": "Denis Vigo",
            "author_url": "https://www.google.com/maps/contrib/107834068417437137494/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL2E2TEr-dQlunLfsMaZPNNNwj-W-HYykPJDJrK42H60zKv45Y=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 1,
            "relative_time_description": "3 months ago",
            "text": "The hotel's 5 star rating, 4.1 Google review, and description led us to believe this was an upscale hotel. However, upon arriving, we quickly realized that this was not the case. The hotel was far from upscale and could more accurately be described as basic. Every aspect of the hotel, from the outdated furniture and lack of amenities, was disappointing. After being shown multiple rooms with issues such as smoke smell and broken items, we were left feeling disgusted. We ended up booking another hotel last minute and left this dump behind. We strongly advise against booking this hotel as it does not meet the standards of a boutique or 5 star property.",
            "time": 1723075826,
            "translated": false
        },
        {
            "author_name": "Vojtěch Jirásek",
            "author_url": "https://www.google.com/maps/contrib/115130090187605932359/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW0WzbsbOJh1NPas6LX3TpxmLeo_wW-PGAX2_uQJB_aYq154Q=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "One of the highlights is the location—it’s just a stone's throw away from major attractions, making it easy to experience all that Prague has to offer. The staff are incredibly friendly and helpful, always ready with local tips and recommendations. Plus, the on-site restaurant serves up delicious meals that you won’t want to miss!",
            "time": 1728393376,
            "translated": false
        },
        {
            "author_name": "Arun Prakash",
            "author_url": "https://www.google.com/maps/contrib/103384751996345062103/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJyfd99FNpxzUdNCvTjTRRJYNRVpi-_QarxNaUEy8FPUwW85g=s128-c0x00000000-cc-rp-mo",
            "rating": 1,
            "relative_time_description": "2 months ago",
            "text": "I had a stay from 22/9 to 25/9 with family. I choosed this hotel on recommendation of my agent.  I am highly disappointed with rooms,house keeping and breakfast.  House keeping lady starts howling if don't leave your room for cleaning on time as she wanted. Breakfast quality as well as spread was very poor. I recommend that please don't go for this property for stay.  It's lobby size is such that it ends before it starts",
            "time": 1727238155,
            "translated": false
        }
    ]
}