{
    "name": "The Grand Mark Prague",
    "rating": 4.7,
    "reviews": [
        {
            "author_name": "Ashley W",
            "author_url": "https://www.google.com/maps/contrib/106301639334937672491/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKYn65ulrjt3Mrr2prlyBANRKVHHw1bWyvODlpzaxgrWSzPGg=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 5,
            "relative_time_description": "a week ago",
            "text": "Despite having a delayed check-in, the hotel did everything they could to make up for the inconvenience. Lovely staff, fantastic breakfasts every morning and the rooms are awesome. The front of house, back of house and hospitality staff are very well organised, make those staying here their priority and do it in an almost effortless way. Excellent location in Prague too.\n\nWe have stayed in a fair few 5 Star Hotels in our collective time but I don’t think we have ever enjoyed a stay quite like this.",
            "time": 1732649962,
            "translated": false
        },
        {
            "author_name": "Drew Perez",
            "author_url": "https://www.google.com/maps/contrib/111287283437546564610/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV-C-gSBYGMt3NBdJYSvfgF7ag9Aj0JpQdUCGTLmTmTWnGzxQAt=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "Our experience at the Grand Mark was second to none on our trip in Europe. From the moment we pulled up in the taxi the service was out of this world, friendly, & went the extra mile to make our time there special. Front desk, concierge, cleaning staff, spa service, and food services staff were engaging, friendly, and always greeted you with a smile. We spend five nights there & everyday was great there. It’s location makes all of Prague accessible & there recommendations from the staff with have you at the best locations & get a local feel, not just the tourist places. Cannot say enough good things about our time at the GM. Would stay again, no questions asked. Well worth the cost.",
            "time": 1729891751,
            "translated": false
        },
        {
            "author_name": "Julian Crouch",
            "author_url": "https://www.google.com/maps/contrib/115105748417056193444/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXwsMhLGCdxQ3bIO79INeZKQoIyfp1zoBB343-9dGfgrOXEpyCn=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "4 months ago",
            "text": "Really enjoyed the stay here.  The beautiful hotel garden complete with peacocks is a real bonus. Lovely room clean, spacious, and comfortable. Staff are very friendly. Good restaurant both for breakfasts and evening dining. Located about 10 15 minutes from the main square. Would highly recommend.",
            "time": 1720775088,
            "translated": false
        },
        {
            "author_name": "M Kh",
            "author_url": "https://www.google.com/maps/contrib/116896980819357946278/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK--ICyt8_-4sAdrLDz8TIYEzbhSCYiX0oTkvUij9QUttz_SQ=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "This place was the best place I’ve been so far !! Despite everything is so perfect, their service is beyond what you could imagine! My stay was quite long due to business trip , but staying at this hotel made my time worth,  if you’re planning to book this hotel, please please please do not miss their breakfast, and a MUST try their croissant 🥐 and focaccia bread ! Their unforgettable, the view with the peacocks 🦚 is die for , the whole environment is just amazing! I’m not easy person and so picky but this hotel was so perfect ⭐️⭐️⭐️⭐️⭐️",
            "time": 1726426328,
            "translated": false
        },
        {
            "author_name": "Saša P",
            "author_url": "https://www.google.com/maps/contrib/101055657823927454960/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKgbOlepFYKe7lccBY9mS7whbmsWsxUnSg8IqEXAtw5x2QICQ=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "4 months ago",
            "text": "This hotel is superb. Some of the highlights would be: attentive and professional staff, excellent breakfast menu, spacious room and bathroom, good minibar selection, luxurious spa. When we are back in Prague, we will definitely choose this hotel as our preffered place to stay and recommend it to anyone visiting.",
            "time": 1722954192,
            "translated": false
        }
    ]
}