{
    "name": "Hotel KINGS COURT Prague",
    "rating": 4.6,
    "reviews": [
        {
            "author_name": "Carol-Anne Hernon",
            "author_url": "https://www.google.com/maps/contrib/110084393237675028648/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocILppCQ1JE-2XqrFbUi9ZGLtcr7U_LlubNaqGiPANs-wKSDGA4=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "3 weeks ago",
            "text": "What a find! Loved this hotel! Stayed here for 3 nights with a friend in November. From it's excellent location, where all the sites are easily walkable and directly opposite the Palladium Shopping Mall, to its lovely big, spacious comfortable rooms with a pillow menu, to its incredible value Italian restaurant which has a lovely outdoor heated terrace (which as a smoker I appreciated!), to its amazing breakfast selection (the best I have ever seen), to its lovely, friendly, efficient staff - especially Emily and Ana on Reception. We were on the Executive rate which gave us access to a lovely lounge for included drinks and food. Don't look any further than this hotel, it has it all.",
            "time": 1731512248,
            "translated": false
        },
        {
            "author_name": "J",
            "author_url": "https://www.google.com/maps/contrib/102117712738197943292/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJW5kyHDfqx4zpiItc4s9bA79Gs6BNlhzZCW5-NPlpibGza73g=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "This hotel is truly outstanding. All the reception staff were incredibly friendly, and the room was spacious and comfortable. The breakfast was delicious, and I will definitely choose this hotel again if I return to Prague. I want to especially thank the reception staff. When I mentioned that my room was cold, they went above and beyond to ensure I was comfortable. I was deeply touched by their kindness. Thanks to them, I had a warm and pleasant stay.",
            "time": 1729971840,
            "translated": false
        },
        {
            "author_name": "Daniel Laufer",
            "author_url": "https://www.google.com/maps/contrib/111147633052357906113/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJTGffGKEjxstksKfNUwD2w5jAZQ8ovmqAkI1wcdLbyjyQesg=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "Great hotel in a great location. The staff at Hotel King’s Court were extremely nice and attentive and made sure our stay was a great one, from the front desk to the bellmen. The rooms were also beautiful and spacious with a great bathroom. I was sharing a room with a friend and wee never felt cramped or in each other’s way. The location of the hotel is also perfect. Not too touristy but walkable to almost everything you’ll need to see in old town, or with the public transportation right outside.",
            "time": 1727698815,
            "translated": false
        },
        {
            "author_name": "Efrat Murin",
            "author_url": "https://www.google.com/maps/contrib/108782968892769890923/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKhbdzcldM9rZ202m4ap10fAoe261gVjcsCFWujRg0jZaOUng=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "3 weeks ago",
            "text": "This hotel is absolutely perfect! The location is the best it can get, in the center of the city. The service was one of a kind everyone were so kind and helpful, especially Emily and Anna that helped us in checkout and made sure we we had everything we needed.\nThe rooms were amazing and the breakfast was one of the best I ever had in an hotel. Highly recommended!!",
            "time": 1731238130,
            "translated": false
        },
        {
            "author_name": "Amélie Revers",
            "author_url": "https://www.google.com/maps/contrib/107031939931970763334/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX0vAdvvmjWek-mXVRtIy5A0r0ioQKiFlI8vOUrqg0q1Y_GaFM=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "4 months ago",
            "text": "I recently stayed at Kings Court and it was an exceptional experience from start to finish. The ambiance was both elegant and welcoming, creating the perfect blend of luxury and comfort. The staff were incredibly attentive and went above and beyond to ensure every need was met with a smile. The rooms were impeccably clean, spacious, and thoughtfully designed with modern amenities. Dining at the hotel was a culinary delight, with each meal being a gastronomic adventure. The location was ideal, offering stunning views and convenient access to local attractions. I highly recommend King Court to anyone seeking a memorable and enjoyable stay. It truly exceeded all expectations!",
            "time": 1720721341,
            "translated": false
        }
    ]
}