{
    "name": "Grandium Hotel Prague",
    "rating": 4.4,
    "reviews": [
        {
            "author_name": "Hock Sing Tan",
            "author_url": "https://www.google.com/maps/contrib/114282884362985426084/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU5Bg2_cL5WGv2K0b4hp_cyZ48GCVA5u3zrAQhYuS-8NVXRG3d9=s128-c0x00000000-cc-rp-mo-ba8",
            "rating": 3,
            "relative_time_description": "in the last week",
            "text": "We stayed in this 5-star hotel for 2 nights. Location wise, it was within walking distance to old town and shopping district.\n\nThe room was spacious and comfortable. Unfortunately, all the things inside the minibar were chargeable. Even the mineral water was not free.\n\nFood wise, the items in the morning buffet breakfast were the same every day.",
            "time": 1732877732,
            "translated": false
        },
        {
            "author_name": "deepesh s",
            "author_url": "https://www.google.com/maps/contrib/112449323784199053406/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKMw72SyYC5GUv8Pq8nUH1fEIsGauTp3ugFrC8u-DUOMBmhew=s128-c0x00000000-cc-rp-mo",
            "rating": 1,
            "relative_time_description": "a week ago",
            "text": "My recent stay 11/24/24 at this Prague hotel was an incredibly disappointing. I was shocked to see such high reviews, as the customer service was truly terrible.\n\nThe check-in process was handled by an unsupervised trainee, which was frustrating. Additionally, bell boy service was not offered unless explicitly requested. This requirement, confirmed by the rude and sarcastic supervisor name Alex. This lack of proactive assistance and the supervisor's attitude were particularly disappointing in a hospitality setting\n\nRoom service was similarly disappointing. Despite requesting service in the morning, only the bed was made upon our return. Used items, like teacups, tea bags, cutlery, and glasses, were left untouched. When we called to inquire they were very quick to send someone, the individual who arrived was dismissive and rude, falling short of basic room service standards.\n\nI understand that a few individuals can negatively impact a business. However, I hope the management will address these issues through additional training. I sincerely hope that the hotel will improve its service standards in the future.",
            "time": 1732472268,
            "translated": false
        },
        {
            "author_name": "Ashley Kitchener",
            "author_url": "https://www.google.com/maps/contrib/107491148846029808688/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLA69nasxVat4Yt7W7Zm9bwv4bB20T1Tk9NKO3heCpKkC6Ozw=s128-c0x00000000-cc-rp-mo",
            "rating": 4,
            "relative_time_description": "3 weeks ago",
            "text": "Couldn't fault the location very close to the centre of the city. Breakfast was lovely and plenty of options on offer. The room was dated, shower was in the bath and the TV was small and only access to 2 English channels both were the news, definitely didn't feel like a 5 star hotel room.",
            "time": 1731441495,
            "translated": false
        },
        {
            "author_name": "Thair Peterson",
            "author_url": "https://www.google.com/maps/contrib/102551550288890337285/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJWzVABM2DsbJn1jyT9hRASm21_xq5F4A-ysfxSAhvzb2Xhxg=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "Starting with its glitzy lobby, the hotel provides an affordable form of elegance and professionalism, coupled with a true sense of helpfulness, such as their efforts to help our wife locate her missing cell phone. As for the room, the half-door shower still made it too easy to spill water on the floor, but the hotel gets credit for including a real bathtub.\n\nBut the real standout was the breakfast buffet, which was probably the best we had in Europe. It included an omelette bar, waffles, and a very broad variety of other offerings, including a delectable bean dish. I only wish we could have had two breakfasts there, instead of having to take one of them to go.",
            "time": 1730158693,
            "translated": false
        },
        {
            "author_name": "jona jocson",
            "author_url": "https://www.google.com/maps/contrib/117380501070537275936/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ1Rbx-Dg2TV0tJdHMk_MuUwvb4-O9kWnWinWDiX2ibkygjKA=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "Pros:\n*centre location\n*bar by the lobby is great, highly recommend the cocktails specially the pinacolada and great service from the bar staff.\n*front office very friendly, approachable and helpful.\n*breakfast has good selection, but not 5 star quality.\n\nCons: not five star\n* we have twin bed, bed is in a very firm mattress\n*noisy room, we can hear everyone that comes in and out of the their room and walking talking from the hall way,",
            "time": 1729106707,
            "translated": false
        }
    ]
}