{
    "name": "Black Elephant Hotel",
    "rating": 4.3,
    "reviews": [
        {
            "author_name": "Kristin Quebec",
            "author_url": "https://www.google.com/maps/contrib/101936676490227197115/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXW1RnzngmUNHFeiGYQoP8KlgRbJlhNpoJjOvxuOstlzt17bp9VLQ=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 5,
            "relative_time_description": "a week ago",
            "text": "Three-night stay here. Boutique hotel with all the basic amenities that one would need. The location cannot be beat - steps always from the old town square. The location made our stay in Prague extremely convenient. Hotel staff were all very pleasant and helpful. Breakfast included in our stay which was hosted in their restaurant on the main floor. Had a spread of everything that would need to sustain oneself in the morning without having to step out of the hotel and make the most of your time.\n\nThe room was spacious by European standards. Has older furnishings, but I quite enjoyed a break from large, modern hotel chains. It made the trip special and memorable.",
            "time": 1732375710,
            "translated": false
        },
        {
            "author_name": "Mike Bell",
            "author_url": "https://www.google.com/maps/contrib/105368786041217888145/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWz1eGCDTZ0ZHskaKLIny7chv4h1GiGOBIG5xqaOMXprZYWSTGt=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "If I could I would give the location 6 stars. Walking distance to everything. Prague Castle is the farthest and it's 25 minutes. Old town square 1 minute. It was the perfect spot for our visit to Prague.",
            "time": 1726831131,
            "translated": false
        },
        {
            "author_name": ".Jon Chapman",
            "author_url": "https://www.google.com/maps/contrib/105425943455859234544/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK4YccOBOWwUf986fcueMN7kThvA0ub8KYspqI5WlQqGkYBkw=s128-c0x00000000-cc-rp-mo",
            "rating": 1,
            "relative_time_description": "6 months ago",
            "text": "Absurdly horrible service. Went to grab a bite after a day of sight seeing. Had been walking for a while so we wanted to use the bathroom before we started in. Took a look at the menu and decided we’d eat at this restaurant since they had traditional Czech food and beer. Asked the waitress if they were serving, she said yes. We picked a seat and then asked about the bathroom…that’s when it got weird. At first she seemed to not understand. I offered to repeat my request in German, if she didn’t speak English. She said we could use the bathroom. I  waited for my friend to go first, then when he got back I went. This took a few minutes and the waitress never came by to get our order. I went to the bathroom and proceeded to be FOLLOWED DOWN THE HALLWAY AND YELLED AT BY A MAN SCREAMING AT ME THAT THIS WAS NOT A PUBLIC BATHROOM. I was so angry at this behavior we immediately left. DO NOT GO HERE. They have no idea how to treat guests. You’re better off going 100m down to the real square and having a cheaper, better meal where you’ll be greeted with smiles and cold beer rather than jeers and screams. And yes, there they’ll let you use their bathroom.",
            "time": 1717276860,
            "translated": false
        },
        {
            "author_name": "tapas haldar",
            "author_url": "https://www.google.com/maps/contrib/100147859016822739340/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWLmmxnhma6Wuou6dyPScsCFYHeTe1lzu1ulXHYKC8njEBdX1NfBg=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "7 months ago",
            "text": "Location is superb in the middle of the Old Town Square. All the great attractions of Prague are at a walking distance. The Central Railway station is less than 7 minutes walking distance. It is a very fine luxury hotel. We had an early departure and the very helpful and amiable lady on the front desk gladly served us packet breakfast. Memorable experience.",
            "time": 1714332466,
            "translated": false
        },
        {
            "author_name": "osman babayiğit",
            "author_url": "https://www.google.com/maps/contrib/111644921370888536204/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUdZglSK5sbnOjE54ejFFDnh8jp3BkIzaaHG1hrLNTPpVTLJskZ=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "4 months ago",
            "text": "Everything was amazing. We loved everything. Had zero problem. The staff is the best in whole world. Thank you so much for everything.\nBest location, best room, best place",
            "time": 1722801864,
            "translated": false
        }
    ]
}