{
    "name": "Almanac X Alcron Prague",
    "rating": 4.6,
    "reviews": [
        {
            "author_name": "Kerr Millar",
            "author_url": "https://www.google.com/maps/contrib/114313438629753724177/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWiKqva22GMxkfXu1nqt2d5IQ17vyQAK9IPrhgjDyjbgnKjqIbcOA=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "in the last week",
            "text": "We are just finishing our trip to Prague off and the base of our trip was the Almanac, the hotel exceeded our expectations. The hotel was immaculate with very cool decor especially the animal paintings we absolutely loved them..... The hotel staff were very friendly with big smiles day or night and were also very attentive, the room was lovely we had a deluxe which was a good size and very clean and comfortable, the toilet and shower were both working as should with the shower being a good size also. We will definitely be back in the years to come 5 star ⭐",
            "time": 1733130062,
            "translated": false
        },
        {
            "author_name": "Jazmyn Duval",
            "author_url": "https://www.google.com/maps/contrib/104404506713085094592/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWbqhdJRWuvW96yu_wNz1qNWVMFh_I4RHM9efY4veBIf_hvFHU=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "This hotel is absolutely wonderful. The staff is lovely for check-in, house keeping, restaurant/bar. Everything about my husband and I’s experience was nothing short of amazing. My husband and I have stayed here twice and have loved it each time. The rooms are very clean and smell wonderful. The bar and bar staff has/makes amazing drinks and are very friendly. It is located in a great area - close to many bars, restaurants, historical buildings, etc. We definitely recommend this hotel and cannot wait to return again!",
            "time": 1724635678,
            "translated": false
        },
        {
            "author_name": "Ricardo Haueter",
            "author_url": "https://www.google.com/maps/contrib/103387697026300277454/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKK3N2k2PpSozsuaXtoM7ZLUhTjf27OMr34nBj7ufW_xGkdTA=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "I recently stayed at the Almanac x Alcron Hotel in Prague, and it was an outstanding experience. The location was immaculate, just a 2-minute walk from the city center, including the Duplex Club and various restaurants.\n\nThe rooms were gorgeous and definitely some of the most aesthetic we’ve ever stayed in. Bathroom was also stellar and roomy.\n\nThe staff was incredibly friendly and accommodating—every request was met with a smile, even when it came to reheating a pizza!\n\nA special mention to David at the front reception, who was an absolute saint. His exceptional service and that of his team made our stay truly memorable. Highly recommend this hotel for its excellent location and exceptional service!",
            "time": 1725399548,
            "translated": false
        },
        {
            "author_name": "Leslie Munoz",
            "author_url": "https://www.google.com/maps/contrib/102425557857982685110/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLpSlZGXNxaryoGvIZEyMWhLV4YMGcB260viXn73wm4jCnPIAI=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "A must in Prague! Hotel staff and room were beyond amazing. You won’t regret it. Checked in Saturday and checked out Monday. This was the fourth hotel during a mini Europe tour and this one was the most memorable. The breakfast was great, the food was always fresh. The dinner was definitely an experience if you’re open to trying new things! We didn’t know you had to make dinner reservations but they were able to get us a table without hesitation. Definitely add this hotel to your list when visiting Praha!",
            "time": 1725712261,
            "translated": false
        },
        {
            "author_name": "HAIFA RASHID",
            "author_url": "https://www.google.com/maps/contrib/102641503109178115817/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKYKkT4m7W8th8J7AVTQnsSMmGCcpn4X69Q0fOez1iTWj9xjA=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "‏A very beautiful hotel with modern decor and furniture. The location is great, close to Wenceslas Square. The staff is wonderful, from Mr. Kim and all staff at the reception counter, to Mr. Ibrahim in the restaurant, and Ms. Uliana with her constant smile. The room service is fast. you will never forget the beautiful smell when you first enter the hotel.\n\n‏The mattress I wish was of the medical type - The daily cleaning is very good, but I wish there was a deeper cleaning that includes under the bed - The breakfast in the restaurant is very good, but I wish there was more variety with the food items changing daily. In the end, these are just comments that do not detract from the beauty of the hotel accommodation and the wonderfulness of most of the staff members.\n\nI will book again in the same hotel..Thank you very much.",
            "time": 1728918406,
            "translated": false
        }
    ]
}