{
    "name": "Alchymist Grand Hotel and Spa",
    "rating": 4.7,
    "reviews": [
        {
            "author_name": "Christine Farinick",
            "author_url": "https://www.google.com/maps/contrib/113336276735534870268/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWDj4TaAaRmv9ITWFCFHf4HxCFam-2rSHNSp9dBNdkWfG86r6HO=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 5,
            "relative_time_description": "4 months ago",
            "text": "I was a solo traveler this past April 2024.\nI was impressed with the professionalism yet compassionate staff here.\nMy room was impeccably cleaned twice a day. I had a massage and facial in the breathtaking spa. One day I stayed in with a stomach ache. They made me ginger tea without me asking. I felt better to enjoy the experience of Prague. Public transportation is right down the street. It is very safe as there are police stationed outside the hotel for the various embassies close to the hotel.  It was wonderful.",
            "time": 1722271007,
            "translated": false
        },
        {
            "author_name": "Jamie D",
            "author_url": "https://www.google.com/maps/contrib/111378566056365846687/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKn-auMYv4rus5QD1xOcWqoUztyq_78ow6o55xMRhxgPsu-GQ=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "What a wonderful and romantic experience at the Alchymist Grand! The service made me feel so special from arrival to checkout, with prosecco at check-in, turn down service, the delicious and beautiful breakfast spread, to a desperate request for late room service on our last night. The location is wonderful, near the castle complex, and the grounds of the hotel are lovely to walk thru each day. Everyone was so friendly and warm. The sauna and pool were great. The US embassy does check cars on the same road as the hotel, but it was never bothersome in our taxis. We had a top floor room with the exposed beams, and it made me feel like Snow White. Loved every minute at this hotel and would love to visit again in the future!",
            "time": 1728484478,
            "translated": false
        },
        {
            "author_name": "Tanesha Flynn",
            "author_url": "https://www.google.com/maps/contrib/103280444427490684380/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIzqSMwD7b2eWExEleqlPDJMbUNhjIpRyOvtoROAOx_X9ykJQ=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "This hotel exceeded my expectations. It was absolutely beautiful in every way. I booked this trip as a surprise for my mums 60th birthday. From the moment we arrived the staff went above and beyond to make us feel comfortable and welcomed. We were offered wine at check in and even had complimentary cheese and wine the following afternoon in the gorgeous lounge area of the hotel. Our cozy room was more than cosy! It felt like our own private apartment it was that big. The breakfast spread each morning was wonderful and filled us up perfectly for the day as there was such a selection. Again, the staff here were very friendly. I had also booked two 60 minute Alchymist massages for our final evening. I received a massage from Micheal which was excellent! Micheal was extremely friendly, professional and respectful and I really enjoyed my massage from start to finish. I would go as far as saying his service was perfect. I would not hesitate to stay here again and could not imagine staying elsewhere in Prague upon my return! I would 1000% recommend this hotel and spa to anybody. The courtyard cafe also sells delicious coffee and cake. It is safe to say my Mum was extremely happy with her surprise trip and said it was the best hotel she has ever stayed at! Thank you to the Alchymist Hotel and staff for the best stay!",
            "time": 1730806228,
            "translated": false
        },
        {
            "author_name": "Eastern MT",
            "author_url": "https://www.google.com/maps/contrib/115178806724464555120/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK7N_L1pznymYOqFQ32XPdhB05sO7XsYr9VBzGRWoeIbbSroA=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "5 months ago",
            "text": "Quaint, lovely hotel for a romantic stay. The property has a private and cozy feel. It offers the perfect location to explore Prague. All of the hotel staff were wonderful. Their restaurant served a tasty breakfast. One night we enjoyed a tasty dinner there too.\n\nWe booked a Junior Suite. It was huge with a spacious bathroom too. We had a very comfortable bed and thoroughly enjoyed this hotel and the city of Prague. Would definitely return again.",
            "time": 1718488373,
            "translated": false
        },
        {
            "author_name": "T Dater",
            "author_url": "https://www.google.com/maps/contrib/100496552537585609535/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIgym88sHHR7o4K4FeU2ySR9fY5V0T0U-IiNbPu7QTYJ5wVRw=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "Just stay here! Such a beautiful old palace. Rooms and service was amazing. Location is literally next to the US Embassy so it is very safe. I would 100% return to this hotel. The spa is a nice touch.",
            "time": 1725476221,
            "translated": false
        }
    ]
}