{
    "name": "Absolutum Wellness Hotel",
    "rating": 4.4,
    "reviews": [
        {
            "author_name": "Lubomir Duchon",
            "author_url": "https://www.google.com/maps/contrib/106501786348697457420/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVKmVu_vcuva2WHMpEkuuIwmWvQfxbdd0x_G9K0lHcXTDI42qcb=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "5 months ago",
            "text": "The hotel is located nearby metro (underground) and railway station in the quiet area. The stuff is very friendly and rooms are exceptionally clean. Food offer is wide with various options also for vegetarians which is served in the restaurant that is a part of a hotel. They also offer discounts for massage and spa - and the experience with therapeutist is just great and very professional. We will stay there next time too. Recommended!",
            "time": 1719338290,
            "translated": false
        },
        {
            "author_name": "Timon W",
            "author_url": "https://www.google.com/maps/contrib/106990163174985609862/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIEx1I-W9Fh0yj3-_GXgHa0jRsr_EU9KzEmImdL1YyDhpBxnQ=s128-c0x00000000-cc-rp-mo",
            "rating": 1,
            "relative_time_description": "a month ago",
            "text": "Disappointing Experience with Malfunctioning Elevator and Rude Management\n\nWe stayed at Absolutum Wellness Hotel and had a very disappointing experience. The elevator, meant for 8 people, got stuck between floors despite only 7 of us being inside. There were no warnings of overloading, and the fact that it moved from the ground floor before getting stuck between the 1st and 2nd floors shows it’s clearly malfunctioning.\n\nWhen the emergency service arrived, the manager rudely blamed us and immediately demanded 50 euros for the emergency, showing no concern for our safety.\n\nThe hotel needs to fix its broken elevator and seriously improve its customer service.",
            "time": 1728628258,
            "translated": false
        },
        {
            "author_name": "Chari Beri",
            "author_url": "https://www.google.com/maps/contrib/111604553456743557215/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXExUQsYgr5m0wfC2DPj5LK-HrYa36QMxNF3-FhiwinoaUHwu4=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 1,
            "relative_time_description": "a month ago",
            "text": "I booked this hotel as a wellness stay package that included: 1 night, 90 min. wellness world and 50 min. private bath. Paid total of 5000czk for underwhelming and straight up disappointing experience.\n\nDetailed review:\n\nPrivate bath: I was charged ADDITIONAL 400czk for a few drops of essential oil, I blame the staff because upon arrival I’ve been asked if I’ve already selected an oil, the wording of the question made it seem as if it was included in the price. I would absolutely not want 5 drops of some essential oil for 400czk.\n\nThe hotel room/stay:\nBreakfast not included despite the 3800czk for 1 night stay, additional 300czk per person, breakfast was classic buffet style, great selection however the “hot” meals such as eggs were cold. The room was also very disappointing, I don’t understand why instead of  a king sized bed there were 2 single beds pushed together which was very impractical and we basically slept seperated since there was a huge gap in the middle. No tea or coffee station, fridge was not working. Bathroom was nice and the room was clean.\n\nTo clarify this hotel is under the “infinit wellness” franchise so I was very excited for the wellness world since I’ve visited the other branches (wellness hotel step and infinit SEN) and was absolutely blown away. Again I was hugely let down and disappointed because this “wellness world” consists of 1 sauna, cold plunge pool and a “quiet” zone. Max capacity is 30 ppl, there was 16 of us and it was already insanely crowded.\n\nI can’t recommend this hotel for a romantic stay at all, go to wellness hotel step or SEN instead. Absolute waste of money",
            "time": 1729262612,
            "translated": false
        },
        {
            "author_name": "Maximilian W.",
            "author_url": "https://www.google.com/maps/contrib/112892313200311512874/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ7yKc30oipB5oA0v58FEGUsHdfkvMVv1mI_sG_8vQlji1hHA=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 1,
            "relative_time_description": "4 months ago",
            "text": "Air conditioning didn’t work, so it was very hot always, room was kind of shabby and the breakfast was low to medium quality. Overall not at all a 4 star hotel but maybe 2 stars. For what you get also way too expensive.",
            "time": 1721808046,
            "translated": false
        },
        {
            "author_name": "Mehmet Akif Tandoğru",
            "author_url": "https://www.google.com/maps/contrib/102302722346202203368/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWeTQzk5ww143zZ4tZ8N2X6DScdMuf5SbkjDteUQTnQmLP6aDsplg=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 4,
            "relative_time_description": "4 months ago",
            "text": "We stayed this hotel during our vacation at this hotel and generally our opinions is good. Also sauna very impressive you can try it but I think. It could be separate as man and women. Hotel near the transportation and you can reach to city center single train.",
            "time": 1721581336,
            "translated": false
        }
    ]
}