{
    "name": "Majestic Plaza Hotel Prague",
    "rating": 4.4,
    "reviews": [
        {
            "author_name": "Rosalind Cummings",
            "author_url": "https://www.google.com/maps/contrib/111266903264772213326/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLMcqrMsfQnih96Gtphs8CAbbfWizlybml6XkI3Oe7Rk4hGIA=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "A lovely hotel I  a great area.  Fairly central but away from hustle and bustle.  Breakfast is buffet style with plenty to choose for all tastes with a great variety including porridge!  Staff are extremely efficient,  courteous and helpful.  We had a superior room which includes a fridge, bottle opener.  Soap and body lotion dispensed and there were other extras although we did not get slippers with this room which would have been appreciated.  We took advantage of room service which was very good and reasonably priced.  Discount can be obtained if ordering at the bar area or restaurant if you scan a code at reception.   We would definitely come back to this lovely hotel.",
            "time": 1730290697,
            "translated": false
        },
        {
            "author_name": "Nicola Love",
            "author_url": "https://www.google.com/maps/contrib/109778409456933989781/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUW2l4jZ9H0DESGxWJC8ALAwh7Ulzv8oKpUaib9lYSxgCzkxrzlRA=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 4,
            "relative_time_description": "4 weeks ago",
            "text": "Lovely hotel , breakfast was a good selection, mostly continental with small selection of warm options. Make aware bottled water in room isn't free you will get charged at check out and it's NOT cheap !. Staff was accommodating although not very chatty. Every where clean and tidy. Would stay again great location to walk around Prague and buses near by.",
            "time": 1730912066,
            "translated": false
        },
        {
            "author_name": "Amira Dhifallah",
            "author_url": "https://www.google.com/maps/contrib/115276743784175492712/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUcwT5-3yINfO3Y9CfRUirebaKQ79RHm6QwjHcwyoZUUcnMce8a=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "We stayed at Majestic Plaza for 5 days, and it was one of the best hotel experiences we had in Europe. The hotel itself has a great location (15 minutes by foot from the main train station, also 15 minutes from almost all great attractions- old town). The staff are very kind and dynamic, everything was always clean and well taken care of (from house cleaning to buffet, bar and reception staff). The breakfast buffet was varied and delicious (every day they had different selections of traditional sweets which was a plus). The only negative thing was that the rooms were not sound proof (we could listen to everything in the next door room, and unfortunately we had very loud neighbors), also it was weird that we didn’t have shampoo in the bathroom (and instead of shower gel we had hand liquid soap?). Other than these two details, everything was great! We really recommend this hotel to anyone visiting Prague :)",
            "time": 1724323540,
            "translated": false
        },
        {
            "author_name": "Celal Öztürk",
            "author_url": "https://www.google.com/maps/contrib/102537565109372394578/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXjswNrVBeYqlWlhvKdstvuDAs6GcOM-qVthk45HfmXZ-LQDp8=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "3 weeks ago",
            "text": "Hotel was very comfortable and nice. But our room was on the back and was not able to see the sun and sky. That made us unhappy. Walls are thin so you can soke making love sounds. Reception officers were a bit cold. Location is good. Price was affordable.",
            "time": 1731501849,
            "translated": false
        },
        {
            "author_name": "Rachel Bleasel",
            "author_url": "https://www.google.com/maps/contrib/104593433027592650326/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIUcieUv90JTV8EdnjKaTEvBwUDgfzuzKM1qsl2TU3ighNBkQ=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "Spent 5 nights here and had a great stay. The rooms had everything we needed, cleaning staff were efficient and the air conditioning was a blessing in the heatwave we had. Happy hour at the bar was great and the staff were great at helping us exchange cash, and even had a lovely bottle of wine and swans made out of towels to greet us on our anniversary. Breakfast was a good inclusion. In a great area with lots of nice food options around. Would stay here again.",
            "time": 1724081546,
            "translated": false
        }
    ]
}