{
    "name": "Sarajeva",
    "rating": 4.7,
    "reviews": [
        {
            "author_name": "Ben L",
            "author_url": "https://www.google.com/maps/contrib/102599477297490696573/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVt1ae-dkWucBnvZNt7FP5n66HseBgCsm-ZU0qR9-G8PmOHD1XA=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "8 months ago",
            "text": "Having dined at the town’s oldest grill house, I can confidently attest to its status as a culinary gem steeped in history and flavor. Nestled in the heart of town, this establishment boasts a legacy of culinary mastery that spans generations, evident in every succulent bite of its renowned grill meats.\n\nThe allure of the grill house lies not only in its age-old recipes but also in its commitment to maintaining the authenticity and quality that have made it a beloved institution. From the moment you step through the door, the air is infused with the tantalizing aroma of sizzling meats, drawing you deeper into its timeless embrace.\n\nWhat sets this grill house apart is not just its exceptional cuisine, but also its impeccable cleanliness and inviting atmosphere. The pristine surroundings and warm ambiance create the perfect backdrop for indulging in the flavors of yesteryear, transporting diners to a simpler time where good food and good company reigned supreme.\n\nAs a connoisseur of grill cuisine, I found myself thoroughly impressed by the expertly grilled meats, each bite bursting with robust flavor and tender juiciness. The traditional techniques employed here are a testament to the enduring appeal of classic recipes, standing in stark contrast to modern trends yet surpassing them in taste and authenticity.\n\nFor anyone seeking to experience the pinnacle of grill excellence in our town, I wholeheartedly recommend a visit to this venerable establishment. Prepare to be transported on a culinary journey through time, where the old ways of grilling reign supreme and every bite is a testament to tradition and flavor.\nNestled within the historic confines of the old city, away from the glitz and glamour of modernity, lies a hidden culinary gem that embodies the essence of tradition and taste. This revered grill house, tucked away in an old neighborhood steeped in history, stands as a testament to the enduring legacy of timeless recipes and unwavering quality.\n\nWhile the exterior may not boast the flashy allure of trendy districts, the real magic unfolds within its humble walls. Here, amidst the cobblestone streets and weathered facades, diners are treated to a culinary experience unlike any other, where the flavors of generations past come to life in every savory morsel.\n\nDespite its unassuming location, this grill house holds the distinction of serving the cleanest and most authentic grill cuisine in town. The dedication to cleanliness and hygiene is evident in every corner, ensuring that diners can feast with confidence, knowing that their culinary journey is as safe as it is delicious.\n\nBut it’s not just the cleanliness that sets this establishment apart; it’s the unparalleled dedication to preserving the oldest and most cherished grill recipes in the region. Each dish is a lovingly crafted homage to tradition, prepared with time-honored techniques that have been passed down through the ages.\n\nFor those seeking a true taste of history amidst the charm of an old neighborhood, I wholeheartedly recommend a visit to this venerable grill house. Prepare to be transported back in time as you savor the flavors of yesteryear, surrounded by the timeless beauty of the old city and the warm embrace of culinary tradition.",
            "time": 1712678466,
            "translated": false
        },
        {
            "author_name": "Edmond Siqani",
            "author_url": "https://www.google.com/maps/contrib/111719655484281603770/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJdsZ9ZjlsxN4NxTnohTnblMUBq-JKiSO0fPHypPsUvBqiBhQ=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "5 years ago",
            "text": "Oldest and best kebap house in Prishtin\nDon't leave Prishtina without visiting Sarajeva",
            "time": 1552150245,
            "translated": false
        },
        {
            "author_name": "Gëzim Preniqi",
            "author_url": "https://www.google.com/maps/contrib/106984465634436484613/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUu8OPfpSLUs7ZbfHmUYGVTMDvDZVkHqMLq4z3yisAFEG4IFwvJzQ=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "7 years ago",
            "text": "nice place to visted for eat food",
            "time": 1488798118,
            "translated": false
        },
        {
            "author_name": "Rei Matsushima",
            "author_url": "https://www.google.com/maps/contrib/106003806743004534849/reviews",
            "language": "en-US",
            "original_language": "ja",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVVIR3dvCx_Oi2AQJzquBBZ7qN27IO6A07G1jKbRp3xTstBBUz0=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "2 years ago",
            "text": "Although the signboard is quite faded, it is still open for business. It seems like a popular shop. The staff was nice and the food was delicious. It would be nice if they were open until late at night. Open until 5pm and closed on Sundays. Was it just across the street a few years ago?",
            "time": 1665222170,
            "translated": true
        },
        {
            "author_name": "Faik Sefketi",
            "author_url": "https://www.google.com/maps/contrib/117552183307211054150/reviews",
            "language": "en-US",
            "original_language": "sv",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVHJ45F6BI0mLAAEhXXHT7MCEbkXTT0Mu-WyBlUcuAC1RwGpL_6=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 5,
            "relative_time_description": "6 years ago",
            "text": "Extra bar!",
            "time": 1535021758,
            "translated": true
        }
    ]
}