{
    "name": "Hotel Borg by Keahotels",
    "rating": 4.5,
    "reviews": [
        {
            "author_name": "michael ireland",
            "author_url": "https://www.google.com/maps/contrib/116241205295741416089/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJLvb-DDjQt-kBTWxc6es2tKVbZVj-2to8o6ysmz5HYRtIbtw=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a week ago",
            "text": "Loved the hotel!!! Nice welcome on arrival. Only slight grumble a guy on reception wasn't the most helpful on day 2 and was more interested in counting his key cards while I was stood there for 2 mins but this is been picky as overall it was a top stay and hotel. The wine for my birthday was a lovely gesture.",
            "time": 1732695881,
            "translated": false
        },
        {
            "author_name": "Billie Schwetz",
            "author_url": "https://www.google.com/maps/contrib/111394425708761110088/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWNR3FPZIaCSlQtB7nPYv4sQx8j1iguFujBY9ktokrWzY5nskiWaA=s128-c0x00000000-cc-rp-mo",
            "rating": 1,
            "relative_time_description": "a month ago",
            "text": "There are much nicer places to stay downtown than this. It was not old world charm, it was a 2 star hotel charging 4 star prices.\n\n1. There is no parking nearby and to stay overnight you need to park in the garage. For almost 2 days it was $148.\n2. Breakfast is basic with banquet style tables and they charge for anything more than drip coffee.  The eggs were powered and not a lot of variety.  We stayed at 7 other hotels while in Iceland and they all had a better breakfast than this one which was supposed to be one of the nicest given it's self rated 4 stars.\n3. Rooms all had damage to the walls and bed covers were old and pilling.  Both rooms we stayed in had cleanliness issues as well with unchanged sheets and a bathroom sink that was never wiped down.\n4. There are so many other options in downtown, choose anything but this one!",
            "time": 1729444197,
            "translated": false
        },
        {
            "author_name": "Lilianna Husseini",
            "author_url": "https://www.google.com/maps/contrib/110047807065040540866/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWbDCOnfKD-VUcOGdMmC-dWkA7YyhnGspvWj5VSd4-dFlrSDHiF=s128-c0x00000000-cc-rp-mo",
            "rating": 3,
            "relative_time_description": "2 months ago",
            "text": "I stayed here twice in one week. Disappointing. Rooms could use an upgrade. Lots of chipped paint, cracks and dated beds. Room service menu only has three items and kitchen closes at 21h. No mention of this anywhere. No restaurant or bar available on-site but thankfully there are others around. Speaking of which, the hotel is located in a very fun part of town but you will hear music and people from the clubs while sleeping. As part of check-in process, you request for the room to be cleaned during your stay. Despite choosing the cleaning, I still had to chase down housekeeping each time. Staff was standoffish...only exception to the whole stay was the wonderful woman in the spa.",
            "time": 1728201308,
            "translated": false
        },
        {
            "author_name": "Avril Twomey",
            "author_url": "https://www.google.com/maps/contrib/112572815833927565485/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVaGYSZMkQIVqJ2hc8fDUD3Iy8ebBIdK6Oe5tRLAYeS3NBxGyvQBQ=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 4,
            "relative_time_description": "2 months ago",
            "text": "Beautiful Art Deco hotel in a fabulous location in Reykjavik.\nReception staff were friendly and helpful.\nWe booked a superior room, which was spacious and comfortable. Nice comfortable bed with separate duvets (which seems to be a thing in Nordic countries)\nThe main issue with the room was that the hot water took a good 5 minutes to reach the taps, so you'd have to turn the tap or shower on and go about your business while you waited for it to warm up, which felt at odds with the sign in the bathroom about reusing towels to save water.\nBreakfast was nice, if a small bit limited, but the restaurant is a lovely space, and it was never crowded.\nNo parking, but that's standard for a city centre hotel in most countries, and the nearest car park is less than 5 minutes away on foot.",
            "time": 1726012422,
            "translated": false
        },
        {
            "author_name": "Dori Knight",
            "author_url": "https://www.google.com/maps/contrib/115161038389152010385/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUZpiqz3Hn-L3QjVEzcwN3ZMpGdY8e2T68B_aEHtJUK63hTurHlOg=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "I've made several trips to Reykjavik over the years and have stayed in many different hotels, but Hotel Borg has been my favorite thus far.\nIt is centrally located to just about everything in the city, especially if walking, the rooms, restaurant, and amenities are of high quality, and the staff are incredibly kind and helpful.\nI'll definitely be back.",
            "time": 1724976498,
            "translated": false
        }
    ]
}