{
    "name": "Loft - HI Eco Hostel & Bar",
    "rating": 4.5,
    "reviews": [
        {
            "author_name": "Paolo Gorgoni",
            "author_url": "https://www.google.com/maps/contrib/105484517689997319743/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUPalfHUCNbu4GaGKFjL0mo9uZCAjMVjmsBgLYTYy0ZiqRNFz_y=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a week ago",
            "text": "Loft is perfectly located, has a very cozy and stylish bar at the top floor, an equipped guest kitchen and dorms with their own bathroom. It’s clean and functional, informal but curated and it made me feel home. 5 stars for the staff: I was helped through my stay with kindness and empathy and this made everything easier. Thank you!",
            "time": 1732523518,
            "translated": false
        },
        {
            "author_name": "Sumayah M",
            "author_url": "https://www.google.com/maps/contrib/102063303914802034301/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUwTndxUJE1iz5j8iIAWsk6cSO749bVzOj-cMwbmseJFGz30Z-ixw=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 4,
            "relative_time_description": "a week ago",
            "text": "I had a good time at the Loft Hi Eco Hostel and would recommend it. I stayed for 4 nights in a female only dorm. I felt super safe, and secure! In a post travel  state of confusion, I accidentally tried to enter the wrong room with my code so can confirm all rooms have different codes.\n\nI wish this hostel had a common space/area. I think this might've been closed during my visit and there most of the time.\n\nThe location is perfect and super central. Close to bus stop 3 as well as the famous rainbow street and cathedral!",
            "time": 1732548272,
            "translated": false
        },
        {
            "author_name": "Mohammad Aktaruzzaman",
            "author_url": "https://www.google.com/maps/contrib/116759423896514709960/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJDepVHTr_lvSYhCfpxC8ekEpxay5NIZob4BaFTub38RtLGFg=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "I’ve never stayed in a hostel before, so this was my first experience. I spent two nights at “Loft – Hi Hostel” in Reykjavik, and it felt like a 7-star stay. The hostel is centrally located, making it a great choice in Reykjavik’s pricey hotel market. With restaurants, bars, and shopping nearby, and the bus station not too far away, getting around was a breeze.\n\nThe interior of the hostel was immaculate, and the kitchen was impressive, especially the “Free” basket where guests could leave items they didn’t need for others. The hostel also had a small library and an in-house bar. I stayed in a six-person room with an attached bathroom, and my roommates were friendly, respectful, and cool. One of them, a frequent guest, told me it was the best hostel in Reykjavik, and I couldn’t agree more.\n\nMy experience was incredibly fulfilling, and I returned to Canada with warm memories of both the hostel and Iceland.",
            "time": 1727275681,
            "translated": false
        },
        {
            "author_name": "zaineb chiha",
            "author_url": "https://www.google.com/maps/contrib/112895758462019850440/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK0Tgt1MwAbwleUAu2y3rDRs0Jlg33N2N0mYOLngSQ69Aza1qc=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "It is truly the best hostel I have ever stayed in. They pay attention to all the details in the female dorms and the kitchen to ensure you enjoy your stay.\n\nUnfortunately, I wasn't lucky enough to have a quiet room, as there were girls in my dorm who snored while sleeping, which made it difficult for me to rest. However, this is not the hostel's fault. I highly recommend it, and I hope you have better luck with your sleeping arrangements!",
            "time": 1727086819,
            "translated": false
        },
        {
            "author_name": "Erica Brown",
            "author_url": "https://www.google.com/maps/contrib/111978083462280525174/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKbtkLNQ_Qq6fMw-Uv1Eyn7hWgLRNhomJSICHiWg4ktO4ocgg=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 4,
            "relative_time_description": "2 months ago",
            "text": "Good hostel in a great location with a nice bar area, reasonable kitchen and helpful staff. Not much of an atmosphere to meet people. There were a few things that bugged me about the hostel though: No privacy in the rooms, lockers were not very secure (and would my take all types of padlock), nowhere to store large bags, bed sheets were flat sheets, not with elasticated corners to aid fitting (this was a nightmare when on a top bunk), the protection from falling out of the top bunk was a single rail which means anything you put on the bed can fall on the floor which is annoying.\nNot reasons to avoid staying, I stayed twice in my trip and it was good value. But those things were annoying and could be easily resolved by the company.",
            "time": 1727338669,
            "translated": false
        }
    ]
}