{
    "name": "Kex Hostel Reykjavik",
    "rating": 4.3,
    "reviews": [
        {
            "author_name": "Charlotte Hyland",
            "author_url": "https://www.google.com/maps/contrib/111938098488033106021/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWvb2SkrchrSL2YFNCOp9wpNXs66zYm7vflEaMU4MPwD6Y7RytVOA=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "Excellent customer service! I left my glasses in my room the day I left and with a payment for shipping, the staff sent my glasses back to me. I was so grateful. The rooms are clean and the hostel is run like a tight ship. I enjoyed my stay and would definitely go back. Construction hinders the outdoor entrance but did not make a difference in my overall experience.",
            "time": 1729604443,
            "translated": false
        },
        {
            "author_name": "Pablo E",
            "author_url": "https://www.google.com/maps/contrib/114978742528502345569/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVP5PFr02uY2CSzHHKGUJ2pmnewNpgrGhwfc4UXbyLrqsNs-2JM3g=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "There's big construction at the moment but nonetheless the location is pretty awesome...right at the water.\nthe receptionist Thomas is the absolute best..super friendly and helpful. Can definitely recommend this place. Also the prices are fair for Iceland.\nthanks again to Thomas for helping me with locking my bicycle so spontaneously :)",
            "time": 1729282002,
            "translated": false
        },
        {
            "author_name": "Kelsey Cuthbertson",
            "author_url": "https://www.google.com/maps/contrib/101804213930355126715/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ8etd-6knWqt_f8zgw7ok3Hcbx2SfqPzcS4AsNOnidHO28hA=s128-c0x00000000-cc-rp-mo",
            "rating": 4,
            "relative_time_description": "a month ago",
            "text": "Generally enjoyed my stay. Staff super helpful. Cleaners on point in bathrooms. Unfortunately we didn't get much warning at all about some works on the lower floors until a few days before our stay and our room was right by the works. Luckily the noise didn't really disturb us too early. Downside was this meant the restaurant was completely out of action and was one of the main reasons we pickled this hostel. Live and learn I guess and just some bad luck.\nThe kitchen was also fairly small and often did not seem appropriately stocked for the amount of large groups that were staying. I would say that's my main criticism. Overall enjoyed my stay and would be intrigued to see once the works are all finished.",
            "time": 1730144083,
            "translated": false
        },
        {
            "author_name": "Balazs Kiss",
            "author_url": "https://www.google.com/maps/contrib/107772361093017699180/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWAixBmZvdcyqV-xHlNkPBKUwjxDaZYlP4cyQ0-aKF_iZbhw7rf=s128-c0x00000000-cc-rp-mo-ba6",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "The 42-bed room was much better than it sounds. It is divided into sections by walls, so it doesn't feel cramped at all. Located in downtown, easy to walk everywhere, the staff is very friendly and helpful. Day tour companies pick you up with a bus directly in front of the hostel. Breakfast is top quality, rich selection of sweet and savory options. The kitchen is open later, too, you can eat lunch and dinner in the hostel. Super fast Wifi, you can work from there. View to the sea.",
            "time": 1728853977,
            "translated": false
        },
        {
            "author_name": "M Reiten",
            "author_url": "https://www.google.com/maps/contrib/103904400395752953882/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVbhG2p03ipz_Dp3xYW_Ckq6-gJwwzR_wRoJW9j0N1fGM6XOA=s128-c0x00000000-cc-rp-mo",
            "rating": 4,
            "relative_time_description": "2 months ago",
            "text": "Fun atmosphere! Definitely a hostel so everything is shared. They were under construction when I visited. 4/5 stars because it is a bit musty and wet feeling like other reviews have said. However, I believe their construction is working to address that.\n\nStaff were very friendly and helpful. Held my bags in a locked room while I explored the city after checking out. Recommend staying there!",
            "time": 1726565591,
            "translated": false
        }
    ]
}