{
    "name": "Alda Hotel",
    "rating": 4.6,
    "reviews": [
        {
            "author_name": "Ian McCutcheon",
            "author_url": "https://www.google.com/maps/contrib/104931077981613301528/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXmF8BMql7YvIzG10eRdcwJoBbok6nnQh0J14hKYsShUH-iINQ=s128-c0x00000000-cc-rp-mo-ba6",
            "rating": 5,
            "relative_time_description": "2 weeks ago",
            "text": "Perfect location for exploring the centre and close to all the major bus pick ups. The hotel is perfect walk into the centre. Rooms are spacious and very comfy beds. Shower is hot and powerful with all the essentials you need. Breakfast had a great variety with both hot and cold selections. Highly recommended would book again.",
            "time": 1731856089,
            "translated": false
        },
        {
            "author_name": "A P",
            "author_url": "https://www.google.com/maps/contrib/103586202428060907279/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLSN4WdJkD8qcQsKzLMupNUFuLH7zXG-J8KV68OBYIl6pAk0A=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "This is a very well kept hotel with great access to downtown and easy walking to a tour pick up spot. We had an amazing view from our room and the environment was quiet.\n\nI thought the price was very expensive, but they mostly made up for it with service, which was on point and they helped to accommodate all of my needs.\n\nThe restaurant also makes good, healthy breakfasts.",
            "time": 1728998180,
            "translated": false
        },
        {
            "author_name": "Amy Kugali McWilliams",
            "author_url": "https://www.google.com/maps/contrib/107460194240712537058/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXI3PyK77FC2xOY_VfqrBcjNGUKN4B2LYTpha8GTwku-PmoksGx4Q=s128-c0x00000000-cc-rp-mo-ba6",
            "rating": 5,
            "relative_time_description": "a week ago",
            "text": "We adored this hotel and it is in the perfect location, walkable to so many wonderful things in Reykjavik! The rooms are a good size and the service was wonderful. The overall hotel is so cozy and chic and we loved that they had a sauna. Would absolutely stay here again.",
            "time": 1732659625,
            "translated": false
        },
        {
            "author_name": "G&K",
            "author_url": "https://www.google.com/maps/contrib/112318683114616699385/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX6rERMeR_xbAkELuX0c6m2DD0WTIjh5jzA8ckOPqNF6W7equI2=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 4,
            "relative_time_description": "5 months ago",
            "text": "We stayed in late May; 1st stop on 18 day trip. The room was simple, clean and comfortable. The breakfast was absolutely delightful, something for everyone. Also a nice little water bottle station.  Our disappointment was the check in person was rigid about being early. We are seniors and like many guests traveled on an overnight flight. We arrived between 11-12 and were told firmly check in was at 3. We understand and were just hoping someone could let us know when the room was available - ‘we don’t have that functionality’. We later met and learned another couple paid an additional charge for early check in which we would have happily done had it been offered. We will definitely ask any hotel we are going to stay in about this when we travel overnight in the future. The rest of the front desk staff was friendly and helpful. The location was great but was a short to medium distance walk to most meeting places for the bus tours.",
            "time": 1720438795,
            "translated": false
        },
        {
            "author_name": "Alfredo",
            "author_url": "https://www.google.com/maps/contrib/106777724802140345786/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUnCxz9P7kh2J9h450WHkudKwYZxwDeLZNX9PEiRIE9SukN4kl3=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 4,
            "relative_time_description": "3 months ago",
            "text": "Hotel in the center and within walking distance of the city's main attractions. Modernly furnished, well soundproofed, with a gym and sauna. Excellent and varied breakfast buffet. The negative aspect is the quality/price ratio. The room does not have a wardrobe or shelves to store clothing. It is inconvenient to leave everything in the suitcases when you are staying for five nights. We had to ask for the room to be cleaned at the end of a day because it had not been done. At our request, a girl at the reception was not happy to help. They only changed the towels, but did not remake the beds or add the amenities that had already been worn out. Very worn towels and common areas in need of repair. There is room for improvement in a hotel with four-star hotel costs.",
            "time": 1724658922,
            "translated": false
        }
    ]
}