{
    "name": "Reykjavík Natura - Berjaya Iceland Hotels",
    "rating": 4.1,
    "reviews": [
        {
            "author_name": "Atis Basak",
            "author_url": "https://www.google.com/maps/contrib/102901904911371497838/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWUVukj2eFbjwNhi8UbM2F2BIyVt7vn_t3-d4yzgi7zGsYLtvexdQ=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "Great place for spending nights, extremely comfortable rooms, the dining is superb as you would expect from the outlook of the hotel. This gets a thumbs up from us! The aesthetics of the interior is extremely pleasing!",
            "time": 1728925853,
            "translated": false
        },
        {
            "author_name": "VJ S",
            "author_url": "https://www.google.com/maps/contrib/106238998315892372917/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKu4F3Mo4txBijzGFq_f9BIL3OuIAJqG0OgOjO4kM6ew3Lp0Q=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "4 months ago",
            "text": "We came here with a kosher tour and this hotel was very accommodating to our special needs. The service is attentive and friendly and the property is located on a regional Airport. The offices of Iceland air are here as well. It is very centrally located and we enjoyed our stay very much. The Natura Spa was also of special note for its white noise room, hot tub, and lap pool. The water here is pristine. We really enjoyed it here.",
            "time": 1721641905,
            "translated": false
        },
        {
            "author_name": "marian bojinca",
            "author_url": "https://www.google.com/maps/contrib/108196133126031850383/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ4irvYT5G3w8ed4YsKnx5oF-yg09pVW3ivSpRord5JP-Snww=s128-c0x00000000-cc-rp-mo",
            "rating": 1,
            "relative_time_description": "a week ago",
            "text": "The room I stayed in was uncomfortably cold because the heating wasn’t working, which made my stay unpleasant. To make matters worse, some of the staff were rude and unhelpful when I brought up the issue, leaving me feeling ignored and frustrated. For a place that markets itself as a comfortable retreat, it failed to meet even basic expectations. I would not recommend staying here.",
            "time": 1732451664,
            "translated": false
        },
        {
            "author_name": "Gigi T",
            "author_url": "https://www.google.com/maps/contrib/105892641089696901107/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKwVB42SXD3xFVSLwZELM2cJCX5gR0zN5c3-a20z0uy_RBJfzyA=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 3,
            "relative_time_description": "a month ago",
            "text": "Cleanliness: 4/5 – The room was clean, but not flawless.\n\nComfort: 3/5 – The bed and pillows were adequate, though not particularly comfortable.\n\nSpace: The room was spacious, with a resting area and an armchair.\n\nAmenities: Convenient bedside ledge for storing items. Robes were provided, but the full-height mirror was hidden behind the wardrobe door, making it difficult to find. The room was well-stocked with coffee pods, tea, and a coffee machine.\n\nBathroom: Spacious and clean, with L'Occitane toiletries, which was a nice touch. However, there was an occasional unpleasant odour, and the fabric shower screen, which was hard to dry, may contribute to the smell.\n\nView: My room overlooked the airport, but the location is excellent for catching the northern lights and sunsets.\n\nLocation: Only 10 minutes drive to the city with plenty of parking spots. 5 minutes drive to Perlan for northern light viewing at night.\n\nQuietness: The environment was peaceful and quiet, ensuring good privacy.\n\nLighting & Temperature Control: The room was well-lit. The air conditioning and heating worked efficiently.\n\nStorage: Very limited closet space with a loose luggage rack, though the extra hooks for jackets were helpful.\nService: The reception staff were friendly and thorough in addressing any queries.",
            "time": 1728906158,
            "translated": false
        },
        {
            "author_name": "Jason Roberts",
            "author_url": "https://www.google.com/maps/contrib/101900714072733055807/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKOPKyZyaWfOiMdfw_atvERp86L6HaxpQzBvlFszIWjN0C-gg=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "4 months ago",
            "text": "Lovely hotel. Very helpful and friendly staff. We stayed in a king deluxe room as a family of four. Very spacious. Our room gave us free access to their excellent spa facilities, which the family enjoyed (kids are restricted to 10+ and specific hours, accompanied). Breakfast was always excellent. We treated ourselves the dinner buffet one night, in their restaurant. Expensive but some of the best food we've tasted - and we expected expensive anyway due to it being Iceland. Hotel is close to the Perlan but about 20 minutes walk from.the city centre - not a problem for us but might be for other visitors. Although, there is a bus stop nearby and buses passed regularly (although we didn't use them). If we return to Reykjavik then we'll probably return to this hotel.\n\nIt is next to the domestic airport but it is a quiet airport and didn't impact negatively on our experience - in fact, our children enjoyed seeing the planes landing and taking off from our room.",
            "time": 1722849034,
            "translated": false
        }
    ]
}