{
    "name": "Dome Hotel",
    "rating": 4.8,
    "reviews": [
        {
            "author_name": "Mary Lazitskaya",
            "author_url": "https://www.google.com/maps/contrib/105714989416104932042/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVv4m_SKZrvxdj3Oh2ANYI7V7unKDBWKk25tURUYNTL50DdMvA=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "Beautiful hotel, perfect for a special occasion or a short visit to Riga!\nThe location is perfect for a first-time visitors, but also for those who are in love of Riga’s Old Town.\n\nThe room is spacious (I’ve got a Suite), has all the necessities including bathrobe, slippers, dental kit etc.\n\nThe staff is extremely friendly and knowledgeable!\n\nThere are two saunas and both of them are private - definitely recommend to check the one on the 5th floor, it has a gorgeous view of Dome Cathedral\n\nThe breakfast buffet has a wide selection of local products and also some pastries and fruits. Coffee is great and also it’s possible to order straight from the kitchen (Cheese omelette and Eggs Benedict were excellent!)",
            "time": 1729277148,
            "translated": false
        },
        {
            "author_name": "Satu Koskimies",
            "author_url": "https://www.google.com/maps/contrib/113086527464483682562/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUL87JwLRMXz8CvaxZuwI-XoC__I72zvwHE7R65puh_iwvCXCo=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 4,
            "relative_time_description": "7 months ago",
            "text": "Highly recommended! Kind personnel, room was tidy and well kept, everything was perfekt. Only thing that caused a bit confusion, was the breakfast. Buffet was not very versatile an warm dishes were     quite lame. I guess that there is some challenge in the premises that causes the not-so-super breakfast. But, the dinner we had (as part of the restaurant week in Riga) was good. The chefs had used their imagination, which was refreshing. Chosen wines suited well with the courses.",
            "time": 1713538682,
            "translated": false
        },
        {
            "author_name": "Vicki Rowlands",
            "author_url": "https://www.google.com/maps/contrib/102075478450486595202/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUCKeQCzNr98ugbpkWZNjy3H8N0mR5KHzxXMqSleqOSXG22STBk=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "6 months ago",
            "text": "Lovely hotel right in the centre of Riga Old Town. Nice rooms, good breakfast and service. Has its own steam room downstairs, and a lovely rooftop terrace for a cocktail looking out over the roofs.",
            "time": 1716329994,
            "translated": false
        },
        {
            "author_name": "Tom Steggall",
            "author_url": "https://www.google.com/maps/contrib/114882303809071520376/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocICdtE4G0zuu3Wz-I1rlaPnzRXE9yI9GiCZ2UKg2zdT9Ey5Vg=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "9 months ago",
            "text": "Beautiful building located in the heart of the Old Town. The rooms were decorated tastefully with great facilities and very comfortable beds.\n\nThe Dome also offers one of the best hotel breakfasts that we have ever had. The pastries are divine and the eggs benedict is unbeatable.\n\nThe staff are very friendly and attentive. Daniel on the front desk was particularly helpful and gave us lots of information about Roga and the surrounding area.\n\nWe will definitely be back if we are visiting Riga again.",
            "time": 1707636131,
            "translated": false
        },
        {
            "author_name": "Andrew Hancock",
            "author_url": "https://www.google.com/maps/contrib/104669839456582011698/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWgU8tuHeVJo_tHDrfGIIWLIQA3eB8jOhD5FRlBz3mB2GUmSCiyRw=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a year ago",
            "text": "Where do I start? We had a wonderful stay at the Dome Hotel. When we arrived, we were warmly welcomed by the reception staff. The room was bright and spacious, being tastefully decorated with a large bathroom. When we went down for breakfast the staff were great. Good coffee, selection of pastries and deli. There's a breakfast menu where we tried as many different choices as we could, on the three mornings we were staying. Every menu choice was excellent. Overall, the hotel was clean and had loads of character. Would highly recommend.",
            "time": 1689356174,
            "translated": false
        }
    ]
}