{
    "name": "Hotel Radi Un Draugi",
    "rating": 4.5,
    "reviews": [
        {
            "author_name": "Gośka Tur",
            "author_url": "https://www.google.com/maps/contrib/112199223894175487385/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU00H04ONdhkHbVsmyMZqDFa_5MnPXsiM8P4Dt7uWklkflOnT7E=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "The hotel itself is amazing - very clean, renovated, with a lovely vibe and super friendly and helpful receptionists. We stayed here for almost a week with a group of 30 people and everything was excellent. The hotel restaurant offers extraordinary buffet for breakfast and their lunches and dinners are outstanding. I liked the fact that each room has a spacious desk to work at, and there is a variety of lamps to choose from. The A/C works well.\nThe only disadvantage is the location of the hotel - just above the Rock Cafe, open daily till 6 or 7 a.m. It means that you can't really keep the windows open because the yelling and singing of the drunken guests is immense. But once you close double windows, you hear nothing. So if you are ok with living with A/C in the room instead of the opened window, do choose this hotel for your next stay in Riga!",
            "time": 1725365541,
            "translated": false
        },
        {
            "author_name": "Sarish Mohar",
            "author_url": "https://www.google.com/maps/contrib/109782354854400825855/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVmJCDovwSlWtbqAr_WiphnF2oLompFV2pFAcsWjFedznyVgEwH=s128-c0x00000000-cc-rp-mo-ba6",
            "rating": 3,
            "relative_time_description": "4 months ago",
            "text": "Overall the rooms were very good and I appreciated having a bath in the room. The hotel itself was also pretty comfortable and the breakfast was excellent for its selection and taste. However, the price point at about €100/night seemed a bit much for what's on offer in Riga.\n\nFinally, some staff members seemed really unfriendly and are quite unhelpful with suggestions and recommendations. They were often moody and looked like they were forced to work there. Doesn't really make for a very comfortable experience overall.\n\nBut if you want to be close to the old town in Riga , this is a fairly good choice to make\n\nReply to the owner: you're taking the piss with this response , your customer service skills are as bad as your staff - now I see where they got it from",
            "time": 1721652335,
            "translated": false
        },
        {
            "author_name": "Georgy Mnatsakanov",
            "author_url": "https://www.google.com/maps/contrib/110511462210323927950/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXmGkc2cHTdR1K8yMVVRLegI3Q2OnGm_EtYkxoGNuKz4DZy9wMS=s128-c0x00000000-cc-rp-mo",
            "rating": 2,
            "relative_time_description": "2 months ago",
            "text": "Of course, this is not a 4-star hotel, but 3 at best. There wasn't even any water in my room. The furniture is old. The breakfast is mediocre and also not 4 stars. The most important thing is that it is impossible to sleep there because of the noise outside the window. Very loud noises near the hotel. I don't recommend it.",
            "time": 1726852354,
            "translated": false
        },
        {
            "author_name": "Kai Avalos",
            "author_url": "https://www.google.com/maps/contrib/106564778373811608796/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXslzRSF7e2fYcWl-IyTLdt4fJzdC54SxlMemzHhUykqTdNXCgf=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "Friendly staff, room was a little cramped. Breakfast had a good range of options but a little bland. Ran out of pastries and fruit quite quickly and took a while to get refilled. Well located to museums and bars.",
            "time": 1724056713,
            "translated": false
        },
        {
            "author_name": "Viktor Lakatos",
            "author_url": "https://www.google.com/maps/contrib/108578285452539040419/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXUHvHlhHzZXMawp68EipYWNS7kHgdJZLmAKEVw6QpQ2SUtDl5hMg=s128-c0x00000000-cc-rp-mo-ba6",
            "rating": 4,
            "relative_time_description": "a year ago",
            "text": "Perfectly located hotel only a few steps away from the old town. It is in nice condition, service is kind and attentive. We had a superior room on the 1st floor facing the side street. It was spacious and super clean. Breakfast was included which they served in a restaurant they have direct connection with. Selection is alright you can definitely find yourself something you like. Qualitywise it is fine as well.\nWe were able to store our bags in the luggage room after checkout, which was a big help.\nThe only drawback I need to mention, is that there is a bar close to the hotel which is open until 6 AM and plays music very loudly. In our it took only 30 minutes between 0:30-1:00 AM, but still it might disturb other guests. They have provided earplugs but not everyone can sleep in those so it is not the perfect solution.\nBut overall it is a good hotel, I would recommend it if you are a good sleeper:)",
            "time": 1698877315,
            "translated": false
        }
    ]
}