{
    "name": "Balzambārs",
    "rating": 4.6,
    "reviews": [
        {
            "author_name": "Arailym Soltanbekova",
            "author_url": "https://www.google.com/maps/contrib/111494196001265246884/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL0rRpbAz5Rt2SCnBnpSvQEY4PrHCcVFFzGlC0RREvXWf7i1w=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "4 years ago",
            "text": "Excellent service and welcoming staff. They treated us with the compliment from the chef as a starter. A share plate with local cheese, prosciutto, salami, cheese balls and some pickles was good for snacks, but a bit expensive. All the cocktails we ordered were breathtakingly astonishing. I enjoyed passion fruit gin cocktail. Special thanks for the meat in the burger as it was flawless. Also, we loved pasta with shrimps and salmon. It was perfect al dente, right \"to the tooth\". Be ready to spend 20-25 euro per person in average. And it is worth noting that they presented us a bottle of champagne as a birthday present with the  Happy birthday music on the background. A memorable place with good music and atmosphere. Surely a must visit place for families and friends.",
            "time": 1579376035,
            "translated": false
        },
        {
            "author_name": "Annie Kardas",
            "author_url": "https://www.google.com/maps/contrib/111373609979766248935/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUQE6Dzj4ctT7mWxe-yCd47-9_V_RUd8Qbc4_f6kA7x9d0aNw=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 5,
            "relative_time_description": "2 years ago",
            "text": "We were a large group of friends visiting Riga from around the world, and we had our first meal here. IT WAS AMAZING!! The customer service was superb and personable, the food was delicious, the atmosphere was perfect, the prices were reasonable, and the manager even gave us a round of the traditional Riga Black Balsam on the house! It was the best start to an unforgettable time together in Riga. Cannot recommend this restaurant more highly!",
            "time": 1659157489,
            "translated": false
        },
        {
            "author_name": "Anne Todd",
            "author_url": "https://www.google.com/maps/contrib/100120540094632113966/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ7XRjGmwuJUlIbuaHeqjDQM4nQHN3WGvqSx04HMqHgFRGPZQ=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 4,
            "relative_time_description": "4 years ago",
            "text": "A bar with food. I drank a couple of nice mojitas, so probably any food would have tasted good afterwards! We shared a potato/smoked trout starter — very nice (and easily big enough to share unless you’re very hungry). I had chicken salad, also nice.\n\nWe were given bread and butter.\n\nService was okay. Seats were comfy. Decor was cosy.",
            "time": 1582213136,
            "translated": false
        },
        {
            "author_name": "Bruno VAN DEN BOSSCHE",
            "author_url": "https://www.google.com/maps/contrib/114142689808332482419/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVASf589GcIe3gIwz1cMIO_kAxPN8vydQ8DCz7dm1BINyBHKVRH=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "2 years ago",
            "text": "This restaurant doesn't look like much and even the menu looks a bit plain as in basic ... but don't go by appearance!!!\nThe food is simple but great!!! Tasty and very nice. Their wine list excellent also offering a wide variety of wines by the glass.\nIf you are after a very good meal, unsophisticated menu but excellent delivery ... I recommend it without hesitation.",
            "time": 1645477495,
            "translated": false
        },
        {
            "author_name": "Helmi traveler",
            "author_url": "https://www.google.com/maps/contrib/103429877088991709845/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUL3uzldYTveN2G4cSSumesvWhj8FiXarvfYHrQfK-1zVDDE-5-=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "5 years ago",
            "text": "A stylish restaurant in the #oldtown  Because it is near the #swedishgate , there is not much traffic and it is a place where you can enjoy a relaxing meal in the oldest city.  Here you can order #latvian specialties #zuppa and potatoes, #honeycake , Latvian original liqueur #balzam original and lemon cocktails.  zuppa had a strong taste because the fish was soaked in vinegar!  Fish are also thick!  Perfect for cream!  The honey cake was rich and luxurious with cheese cake, plenty of honey, passion and orange sauce!  And big!  This is recommended for cocktails.  The fruity refreshing taste of lemon and the savory taste of liqueur are wonderful. *  The performance is often performed in front of the Swedish gate, so it is highly recommended that you can eat rice while listening to music.  There is also a bar in the store so you can use it at night.  I will write another article about the bar.\n\nSatisfied after dinner, ordering another #balzam drink at the bar in the shop in the basement, thinking it was very good and only one cup.  After ordering a sweet #cocktail, the bartender made an ice cream cocktail using balzsm's normal taste!  I often meet the fruity taste of balsam and the rich taste of ice cream! *\nWhen I was very pleased, the bartender allowed me to sample all kinds of balsam #liqueurs and #gin .  Liqueurs are available in normal, expresso, cherry, currant and cream.  I like sweets and love cream and currant.  The cherry blossom has a slightly artificial taste, so the bartender did not recommend it too much.  Jin taught me that it is recommended to drink a kind of berry called Juniver with lemon and gin.  This is a berry but tastes bitter.  When I tell my first visit to Latvia, I often introduce many places.  The bartender is very friendly.  They often greet and shake hands when regular customers come.  It was a friendly and very cozy bar.  I promise to go play next summer.  The bartender gave me a strong handshake on my way home.  I am looking forward to seeing you again.\n\ninstagram: aed_traveler\nofften write travel info in the world",
            "time": 1567669267,
            "translated": false
        }
    ]
}