{
    "name": "The Spring House Hotel, Tapestry Collection by Hilton",
    "rating": 4.4,
    "reviews": [
        {
            "author_name": "Cristina Alejandro",
            "author_url": "https://www.google.com/maps/contrib/112175997096789910208/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocISypO3DbR4a5jgKb-qD2yH7JtC0eGQt_b85NzFpKAbLRBt3g=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "This hotel is amazing. Close to the Vatican City and Museum, and good restaurants. The staff are great, very hospitable too. We needed to keep our luggage with them as we travelled to Tuscany before our check in they happily accommodated our request.\n\nThe rooms are super clean, the sheets are pressed and do smell good, as well as the pillows are also clean. The passage ways smell good all the time.\n\nTheir staff are dedicated to providing the best possible stay for their guests.\n\nThank you Best Western Plus Spring House Rome! We had a relaxing and an awesome stay with you the whole time.\n\nI hope it continues when you change over to Hilton Hotel in December 2024.\n\nAll the best of luck.",
            "time": 1728385313,
            "translated": false
        },
        {
            "author_name": "Dale Squeo",
            "author_url": "https://www.google.com/maps/contrib/113505558027082894669/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJGvyY_mgLBAO2btsXkybXOflJusDl1_O8EHmCeaaOifhEieA=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "From the moment we stepped into the hotel we felt very welcomed.\nThe staff is amazing here.\nOur first time to Rome.\nAt check in, the clerk gave us a map of Rome and with a highlighter, marked all the main attractions to see. This made our adventure very easy and this was very helpful.\nThe “spa/hot tub” was just what our bodies needed after we walked miles around the city.\nIt was the perfect Place to relax on a very hot day.\nThe water is the best temperature for a hot muggy day.\nThe location is right beside the Vatican and with the Metro (transportation system) close by, it made it very easy to get around.\nWe were going to do a hop on hop off bus tour, but with the stories of busses being full and the stops really lined up… which they are.\nWe decided to do our own adventure with a day transportation pass.\nIt was much cheaper and better than relying on a bus that you may or may not get on.\nWe preferred this route in the end.\nThere is most likely a lot more walking but so worth it.\nNothing held us up doing what we wanted.\nThe breakfast at this hotel is top notch!\nEvery morning we had a great breakfast to start the day.\nThe presentation of the food was almost feeling like a fine dining restaurant.\nPerfect way to start the day.\nI have been to many best westerns and this is by far the number one on my list.\nOnce again, the STAFF is amazing and very friendly.\nI highly recommend this hotel.",
            "time": 1725484468,
            "translated": false
        },
        {
            "author_name": "Susan Bell",
            "author_url": "https://www.google.com/maps/contrib/107123770223793792778/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI9DE9ZmOnDqlI71EYx0cJHLtxZs5xvzFlU2vAz58uDKih_bw=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "From the moment my parents and I arrived at the hotel we were made to feel so welcome. This hotel is beautiful. It has a fantastic location of a 20 min walk to the Vatican City. Rooms, staff and food (breakfast buffet and dinner,) all delicious. Thank you Spring House (Chiara, David, Sara, Stella, Ricardo and all staff) for making our trip to Rome so special. From the Bell Family..",
            "time": 1727529797,
            "translated": false
        },
        {
            "author_name": "raymond gunn",
            "author_url": "https://www.google.com/maps/contrib/101763352873573092366/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVhP15tTL38yYVCdna7RnaiGcvRxeSvq4HrZUYPlWbuw1696zpYaA=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 4,
            "relative_time_description": "2 months ago",
            "text": "The location and the front desk staff was superb.\n\nMinutes away from St Peters Basilica, the Square, Vatican and Sistine Chapel is what defines this hotel.\n\nGreat walkability, good restaurants near and easy to get to the Coliseum, Spanish Steps, Trevi Fountain, the Castle, St Maria Maggione, the river, and other noteworthy places.\n\nWe walked 12+ miles each day from the hotel and were able to get to and from easily.\n\nI would not recommend eating at the hotel as the food was not acceptable given the surrounding excellent choices. The rooms and bathrooms were acceptable but not very comfortable.\n\nFor these reasons I give the hotel an overall 3 star rating.",
            "time": 1727428001,
            "translated": false
        },
        {
            "author_name": "Michael Allen",
            "author_url": "https://www.google.com/maps/contrib/102815515474761330609/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJh42p_VXa6M8VkeQhSB7QM96S-oQb435HIRj73mSev6JCP=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "4 months ago",
            "text": "Great hotel. In a sea of poor Italian customer service, this was an oasis of relief. The front desk staff was very kind and engaging. They also allowed us to check in early which was a huge relief to escape the 100deg heat. If I'm ever forced to go to Rome again, then I will be sure to stay here.",
            "time": 1722772868,
            "translated": false
        }
    ]
}