{
    "name": "Park Hotel dei Massimi",
    "rating": 3.9,
    "reviews": [
        {
            "author_name": "iliya pezeshki",
            "author_url": "https://www.google.com/maps/contrib/113048295833580612225/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV7wAIoOWPYmi9yQXPdNqXN-374BJrs7nXjPJRSPwNXXd_s48Lv=s128-c0x00000000-cc-rp-mo-ba6",
            "rating": 4,
            "relative_time_description": "7 years ago",
            "text": "As a matter fact, this hotel is a perfect place to spend your vacation in Rome. Just look at the prices and you’d get it!\n\nMy room was clean and the bathroom was fantastic, just a little bit got cold in the morning which you can avoid using the AC in the room. Also, for younger people, the plugs in my room weren’t close to my bed! So, in case you care!\n\nThe hotel has a vintage look, as in: they use keys for room, actual keys!\n\nI’m not talking about staff because having polite staff is literally the purpose of a 4+ star hotel! But, yeah, they are, indeed, polite and nice!\n\nThe break fast could be better; diversity-wise. They bad almost everything, though I had better experiences!\n\nThe hotel offers a free shuttle service for Vatican and nearest (Cipro) Metro station. 3 times a day! Which is fantastic! Although, it kinda limit you to the shuttle hours. (The last return is 8pm, which could have been 10)\n\nAlso, note that by my experience so far, Italian hotels don’t offer toothpaste and toothbrush for some reasons, don’t forget to bring some!\n\nAll in all, I’m definitely recommending this hotel to you, you will have a nice vacation here!",
            "time": 1509701042,
            "translated": false
        },
        {
            "author_name": "Peter Williams",
            "author_url": "https://www.google.com/maps/contrib/101017123582193265239/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWrLOe_XEIAsmMAgr46cMNIh75QTcue0do_yKu4yIVaWpqv-rOspQ=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 4,
            "relative_time_description": "5 years ago",
            "text": "It is a 4 star hotel. A little far out from the centre of Rome but comfortable and reasonably priced. Air conditioning. Set food for a group adequate and very good cooked and continental breakfast. Relaxing and warm atmosphere from the friendly staff. In an urban setting.",
            "time": 1571140672,
            "translated": false
        },
        {
            "author_name": "Barry Hennegan",
            "author_url": "https://www.google.com/maps/contrib/116238022319158728336/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjURKzyE7hZJi3iaMusZSNrv-aWGAAdXA27gbA5bAEje0-2xjqbrBw=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 4,
            "relative_time_description": "11 years ago",
            "text": "We stayed in this hotel on 2 occasions for a total of 8 nights in August 2012, We loved it for the friendly staff and the Breakfast room service was the best we have experienced in all our travels. We found it well placed to access Rome city by car or when using the hotel bus. Local shops made buying Groceries easy .. short walk down the hill. Space to park our little rental car was an option that we were drawn to originally.\nWe will only stay here when we visit Rome in the future .. love the views from the rooms on level 4 and 5 ...",
            "time": 1369381843,
            "translated": false
        },
        {
            "author_name": "BoB Parnell",
            "author_url": "https://www.google.com/maps/contrib/105341092166018747280/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVRZXVJKfGf2wYy5hBiP6UU7r-fq4h-JPudXY1gSemKfYXB-i1f=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "7 years ago",
            "text": "Front Desk Clerks are freaking awesome! There are small locally owned family stores nearby within walking distance. Neighborhood (partially residential) seems cool. **Ask for Room 511 if you stay there... It has a GREAT view especially at night and has a balcony!",
            "time": 1505767886,
            "translated": false
        },
        {
            "author_name": "Philip Marcial",
            "author_url": "https://www.google.com/maps/contrib/108244592470155962404/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKupoP7Jb-XsY05xIYAax4md8bRc-ysyIiSZM-U2dV0O5G7j-A=s128-c0x00000000-cc-rp-mo",
            "rating": 1,
            "relative_time_description": "8 years ago",
            "text": "Female restaurant staff is very rude; guests are dictated upon where to sit to take their meals. When she sees you taking time eating your food, she'll approach you to ask\" why are you still here?\" You are not allowed to spoil their linens. There's a big bowl in every table where guests are expected to put their butter and jam wraps, etc. When you put your coffee cup in your table as there are no available saucers on hand, they will get one for you immediately and she will call your attention \"use this as you are spoiling our linens\". We have never seen such rude, disrespectful, uneducated hotel staff like her. Rooms are dingy, small and smells-awful is an understatement to describe this hotel",
            "time": 1476562085,
            "translated": false
        }
    ]
}