{
    "name": "Bettoja Hotel Massimo d'Azeglio",
    "rating": 4.1,
    "reviews": [
        {
            "author_name": "Tere GB",
            "author_url": "https://www.google.com/maps/contrib/101245121314601826700/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI72qQIiVE9bUDqFVy2kGi5XuIBKjLO7pmvX9FmRfp-LFkU2g=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "I had a great stay at this hotel. From the moment when I checked in to the moment I checked out, the staff was kind and helpful. I highly recommend this hotel for its service, location and price. I stayed during the peak of summer (last week of August) I was lucky to have booked a place close to Roma Termini. Restaurants, bars and the main points of interest are all nearby. I wish all of my stays was like the hospitality I had here. The hotel is also beautiful. The staff were kind enough to gel retrieve my phone when I left it in a cab. I can’t thank the staff enough for a great stay. Will stay here again next time in Rome. Thank you for making my first time in Rome memorable.",
            "time": 1729687878,
            "translated": false
        },
        {
            "author_name": "Franciation Photography",
            "author_url": "https://www.google.com/maps/contrib/106121205704694814313/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXMNz4N8RiH9tymgrEox84CAVfWj9byJX0p8PKXYOXIqPnZJ40=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 4,
            "relative_time_description": "4 weeks ago",
            "text": "Exiting Rome’s Termini station, we were delighted to find our hotel just a convenient five-minute walk away. The staff couldn’t have been more friendly and accommodating, assisting us with everything from arranging taxis to providing wake-up calls. Listening to them speak in such a beautiful language felt like watching a scene from a television show, adding a touch of enchantment to their everyday routines behind the counter.\n\nThe hotel itself was clean, spacious, and exuded an unmistakable Italian charm through its decor and thoughtful layout. Having been to Rome before, we knew exactly which sites we wanted to revisit, although we hadn’t personally chosen this location—and hadn’t realized just how far it was from the city’s main attractions.",
            "time": 1730928903,
            "translated": false
        },
        {
            "author_name": "shane van de Vorstenbosch",
            "author_url": "https://www.google.com/maps/contrib/105971520470313188380/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWdSsIx-wP0QhI-7ClEYW0BLd9rAB2Z0eRs5_EIXRc1AMcqrHy-=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 2,
            "relative_time_description": "a week ago",
            "text": "Great location and fancy foyer. After that it is all downhill.\n\nRooms are a sauna with no individual room temperature control. We had to open the window to cool the room down at night which then meant the street noise kept waking us.\n\nThe key system is hopeless and over 3 days we had 6 trips back to reception to \"fix\" the issue.\n\nThe rooms are very small given the price.",
            "time": 1732271272,
            "translated": false
        },
        {
            "author_name": "al b",
            "author_url": "https://www.google.com/maps/contrib/109453782659183315046/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX_QdlIn4VXcEAvpQ2VVJDBnQA4XVpsAyMgj6_f4ScjyYVcydimBw=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 3,
            "relative_time_description": "a month ago",
            "text": "Hotel is close to a number of attractions and close means 30 to 60 minute walk.  Close to train station is convenient.  The front desk staff are rude, would not provide a second key to room, the rooms are ok but dated, AC would not get real cool so it’s warm to sleep, overall not impressed. They have no umbrellas for gusts to use either.  For an upscale hotel it did f seem like it",
            "time": 1729313829,
            "translated": false
        },
        {
            "author_name": "Seawind12",
            "author_url": "https://www.google.com/maps/contrib/110046207805249481619/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVYll1XOPkXy14VkZA7YL0FZ4O45qQlV2Wenixdci5qEIfKTZKI=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "Excellent hotel close to the Termini.  Staff was wonderful, we were able to get a nice room and an early check-in after a long sleepless flight.\nThe food at the restaurant and cocktails from the bar were good.  Our room was clean and beautiful.  We will come back when we visit Rome again.",
            "time": 1727705527,
            "translated": false
        }
    ]
}