{
    "name": "UNAHOTELS Decò Roma",
    "rating": 4.4,
    "reviews": [
        {
            "author_name": "Henry Rundell",
            "author_url": "https://www.google.com/maps/contrib/113081519425812618484/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKsb__LGKTteogvzBVFNU6WNpVmRtSoeNJ0jzNwQB2tRWNfuw=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "Staff are welcoming and definitely accommodating as we arrived 4 hours early. Ensured our room was priority to be ready. Room was simple and clean with decent AC as we arrived with temps of 37-39 degrees for 5 days. Location was great and near the main train station along with being central to all the touristy location such as Trevi fountain. We also included buffet breakfast daily during our stay which makes it easy for you with lots of food and variety to choose from.\n\nHighly recommended hotel to stay.",
            "time": 1724705266,
            "translated": false
        },
        {
            "author_name": "Andrew Thompson",
            "author_url": "https://www.google.com/maps/contrib/105426026834124763175/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJorGd8WoYFv3xfFY6XDQ93KODVbf8f7mQOfbctULsLnqIF=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "I have read another review on here to say the area in which the Hotel is located is unsafe, which I do not doubt they felt justified in doing so. However our experience was nothing but gloriously satisfied with all..the standard of the hotel/staff/room/location included. Just off the beaten track & accessible to all the city  & sites either by walking or connections. Would highly recommend.",
            "time": 1728923085,
            "translated": false
        },
        {
            "author_name": "David Atkins",
            "author_url": "https://www.google.com/maps/contrib/103516762462070203518/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUHAHsq1NY2tL9wUC4RR3YUgcuzeMD1Mdo2Ca5stOe6FxIh4bm_=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "Fantastic hotel,  staying in a  family suite. 2 separate rooms created by easily opened dividing doors. Air con is great and much needed at this time of year. Immaculately clean.In room dining was excellent. Hotel is pristine. Highly recommend and would definitely stay again.",
            "time": 1724268229,
            "translated": false
        },
        {
            "author_name": "The Evolution of Now",
            "author_url": "https://www.google.com/maps/contrib/116840400011351683463/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXlA6igQzhlJPoAVKUeFyYeDKZhtZveQLuUSCoDRJgtzbMxwCg=s128-c0x00000000-cc-rp-mo",
            "rating": 4,
            "relative_time_description": "3 months ago",
            "text": "This hotel had a lot of great things going for it. However, there were some clear issues with the rooms. The first room they had given me, one of the electrical outlets was damaged, and could not be used. The window's lock was broken and it would not fully lock ever. The bedside lights need to be physically unplugged from the wall to turn them off, in order to get to sleep. And the bathroom was a nightmare. The toilet was made for a giant, and just sat way too high off the ground. I was on my tippy toes while sitting! The shower also leaked all over the rest of the bathroom, when you showered. Finally, the sink faucet had the longest handle that I have ever seen on a bathroom sink in my life. It was more likely meant to be a kitchen sink faucet or something. I loved the location, the staff were good, and the restaurant was great. The room just was an entire debacle. One thing I can say positively about the rooms was they were quiet at night. That was good.",
            "time": 1724859385,
            "translated": false
        },
        {
            "author_name": "Lucas O'Neill",
            "author_url": "https://www.google.com/maps/contrib/100684836448720205326/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL2-vYrOn-f3mE5SINZsQ99WO1F6IsU4LF_PwDN8eiyLfwqzg=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "4 months ago",
            "text": "This is a very nice hotel. It was quiet and the staff were very friendly. The rooms have minibars that you can use as a fridge. The hotel was quiet. It is located in a great location with easy access to the train station and within walking distance of the Colosseum and other major sites. Rome can be sketchy and the area around hotel is no different. However, we always felt safe walking around.",
            "time": 1720902929,
            "translated": false
        }
    ]
}