{
    "name": "Baglioni Hotel Regina - Rome",
    "rating": 4.5,
    "reviews": [
        {
            "author_name": "Lara Dunlap",
            "author_url": "https://www.google.com/maps/contrib/116993006327405796297/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocItDTiZ994IZWidXqGQXGWzNsjFhDZAbOGb5DYkc6jQ4Dc-iw=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "Hotel delivered a first class stay with all the amenities one expects at a hotel of this caliber. Moreover the staff were all lovely, attentive and had great attention to detail.   Breakfast was excellent!\nI really enjoyed my stay at this hotel and for me the location is perfect, close to everything but slightly north of the chaos !",
            "time": 1728763706,
            "translated": false
        },
        {
            "author_name": "Anthony DiCenzo",
            "author_url": "https://www.google.com/maps/contrib/105656563828077353613/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUXbutY-FsXD7-PYY-H8wxl_FYsWGlR8SzUjpAhTCnM8zIncxmu=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 3,
            "relative_time_description": "2 months ago",
            "text": "So here’s the thing.  If this was a 3 star hotel it would have gotten a 5 star review from me.  But as a hotel promoting itself as a 5 star hotel it got my 3 star rating.  Here’s why.  We rented the highest category suite in the hotel.  It was lovely.  Definitely “5 star”, and impressed us when we first walked in.  Everything then went downhill.  The toilet that didn’t work for 2 days.  The failure to address the toilet in a prompt and apologetic manner.  The lack of toiletries provided.  Limiting us to 2 large bath towels despite repeated requests for more given our roman bath and shower in the room. The AWFUL food from room service (we ordered once and never again).  The tired carpet in the hallways.  A terrace with seating for 12 people that didn’t have even a table for 2 to enjoy a meal on.  A single concierge who only started at 10 am for a hotel that size (despite how good he was at what he did).  This will be my last stay with them.",
            "time": 1726484158,
            "translated": false
        },
        {
            "author_name": "nick knight",
            "author_url": "https://www.google.com/maps/contrib/104503466743918036651/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIcAB7iU_OLerZ9LJbQXqqmDCU3KvDKJLOu0tuiaCHkQnXm_A=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 3,
            "relative_time_description": "a week ago",
            "text": "The room we stayed in was great, but the service left much to be desired. The staff at the front desk and concierge were unclear in answering our questions. We booked an activity through the concierge and were up-charged. Additionally, the concierge only accepts cash, and we weren’t given a clear explanation for this policy. The $100 AMEX credit was converted to 85 euros, and we were also charged for charity donations and city taxes, which was a surprise—especially since I’ve never had to pay separate taxes in Europe before for food or anything. On the day of check-out, they didn’t provide any water or the usual amenities. We had requested a late check-out until 4 PM, but when we returned to our room around 2:30 PM, we noticed the water bottles were not replenished.",
            "time": 1732482002,
            "translated": false
        },
        {
            "author_name": "김희숙",
            "author_url": "https://www.google.com/maps/contrib/112652453711757150243/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLZ1MF-4V1oym6uyf9gXa4YGU-GxX0_mHPO5SUUrS6vFgH2=s128-c0x00000000-cc-rp-mo",
            "rating": 1,
            "relative_time_description": "in the last week",
            "text": "I was very disappointed with the service during my  stay, I experienced several issues that were quite disappointing. I requested a luggage stand four times but was only told the next morning that it was not available. My requests for an extra blanket and heating were also not addressed until the following day. When I mentioned this to the staff, I was curtly told that heating starts on the 15th, which was not communicated in advance. Overall, I was very dissatisfied with the service.\"",
            "time": 1732847359,
            "translated": false
        },
        {
            "author_name": "Kathy Miller",
            "author_url": "https://www.google.com/maps/contrib/116979145482989416235/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK5qJxiVkw7Gr4zYTCMEbThfbpYgYVpgGitHQAOYQyyGoIIFA=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "It was our first time in Rome and this hotel was perfect.  It was located on the ideal street.  The staff was so helpful as we navigated our way around Rome.  The rooms were comfortable and the food at the restaurant was great.  I wish we had time for the spa treatments because they looked amazing!  We highly recommended.",
            "time": 1727209941,
            "translated": false
        }
    ]
}