{
    "name": "Hotel d'Inghilterra Roma - Starhotels Collezione",
    "rating": 4.3,
    "reviews": [
        {
            "author_name": "Christina Wehbe",
            "author_url": "https://www.google.com/maps/contrib/106772340409201534518/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXzqadch4ZmnekFU5ZbuM-UQcLUl5qP3aRkyYj2mtuEPYZLwhfO=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 5,
            "relative_time_description": "2 weeks ago",
            "text": "Since the remodeling, staying here has been an absolute joy—but seriously, where’s the gym? The vibes are unmatched, especially if you’re an old soul with a young heart. The food is exquisite, the rooms feel like you’re stepping into a beautifully curated museum, and the location couldn’t be more convenient. Above all, the staff truly makes the experience unforgettable. Thank you for an amazing stay! ❤️",
            "time": 1731780407,
            "translated": false
        },
        {
            "author_name": "Marcus Toffolo",
            "author_url": "https://www.google.com/maps/contrib/116449935729502384903/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJNm4SNtVe5oM-8a9qXcPHmbA7wH8dgiRXD4-XYc9NINB4LYA=s128-c0x00000000-cc-rp-mo",
            "rating": 4,
            "relative_time_description": "a month ago",
            "text": "Beautiful renovations. We visited a week after they reopened and there were a few teething problems, without which it would have been 5 stars.\nThe cocktail bar serves excellent cocktails and is very snug. The breakfast was also excellent.\nRooms are “preserved” in an antique style but are all new and clean",
            "time": 1729264426,
            "translated": false
        },
        {
            "author_name": "R K",
            "author_url": "https://www.google.com/maps/contrib/108317487546435442310/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV0_0znLTKuwokoCbU2tPCqC9nc9MvLj_sVKWNv-TVDveY1QUlm7g=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "My apologies for the 2 star review.  I did not submit that on purpose, I may have accidentally hit a button on an open screen.  I had a 5 star stay.  Staff was amazing, room was great, location was great.  I did have an issue with the A/C but it was handled immediately with a room exchange and everyone was very accommodating.  Would definitely stay again if I return to Rome.",
            "time": 1729946929,
            "translated": false
        },
        {
            "author_name": "Dennis Peytchev",
            "author_url": "https://www.google.com/maps/contrib/106946092885146407184/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXoI3ZBaSC8s_SM5q0-yPP_Pho9DZrjL6-GBdZs0J9-5n8rFw7u=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 2,
            "relative_time_description": "a month ago",
            "text": "Shame about this hotel because it has a huge potential. Was woken up at 3am twice because of an alarm. The entire hotel was awaken. No apology or anything from staff. I was not asked how my stay was from anyone otherwise I would have mentioned that. Literally ruined my entire night and could not sleep anymore. I later was told that it was an employee that lit up a cigarette. Unacceptable!!!\n\nOn my second day of the breakfast they served me very watered down juices(they claim is cold pressed) and hot chocolate made with water. I asked for a particular dish from the menu and I was told that they won't have it for me because the kitchen was very busy when the restaurant was at most 30 percent full. I would stay again here however management clearly is failing. Until then I would recommend if you have 1100 euro to spend for a single night to book elsewhere. Other better choices where you will not see those service failures.",
            "time": 1728922075,
            "translated": false
        },
        {
            "author_name": "Alexandra Thiltgès",
            "author_url": "https://www.google.com/maps/contrib/105501896545150127716/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVURPaJra4ktFsoJ8IGxIMhsXvdUOTpK_yStDJKX4NFmV99JmMKxg=s128-c0x00000000-cc-rp-mo",
            "rating": 1,
            "relative_time_description": "a week ago",
            "text": "Dear Sir/Madam,\n\nI am writing to report an incident of unacceptable severity that occurred during my stay at the Inghilterra Hotel, an establishment that is part of the Small Luxury Hotels of the World, affiliated with Starhotels Collezione.\n\nOn November 9, 2024, two valuable rings – including my engagement ring and a ring that belonged to my late mother – were stolen from my hotel room. This theft occurred between 3:45 PM and 1:45 AM, a time during which I was attending the wedding of a hotel guest. During this period, the housekeeping service entered the room to prepare it for the night. Upon my return, these items were missing.\n\nThis theft represents not only a significant material loss but also profound psychological trauma.\n\nI would also like to point out that this incident is not an isolated case in terms of security. During my stay, I personally witnessed a serious breach of security protocols: a guest was handed keys that did not match their room, and only the guest’s honesty prevented a further incident. In general, no identity verification is carried out when handing over room keys. These glaring security failures are unworthy of an establishment of your standing, which claims to be a luxury hotel.\n\nDespite my immediate complaint to the police authorities and my various follow-ups with the hotel and the police, I have only received the response: “It’s being handled, the insurance will contact you.”\n\nI am deeply shocked by this situation. The stolen items had priceless sentimental value, and their disappearance from my private room, which was supposed to be a secure space, is a direct affront to the trust I had placed in this establishment.\n\nDue to the lack of action from the hotel, its management team, and the insurance company, I am forced to share this message on the platform to prompt a response from them.",
            "time": 1732566183,
            "translated": false
        }
    ]
}