{
    "name": "Hotel Oxford",
    "rating": 3.9,
    "reviews": [
        {
            "author_name": "Julie Spillman",
            "author_url": "https://www.google.com/maps/contrib/105712994096092034267/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIkPIxleLqRpGoM_Y0eG4C3JeaRexb_KdlqiJ_N-QRQoqbVwg=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 3,
            "relative_time_description": "3 weeks ago",
            "text": "Room allocated was large, simply furnished and clean. Had a large adapted bathroom which was very spacious.\nThe breakfast room layout was poorly designed, no plates, bowls or  glasses where you'd expect them. Staff were slow replenishing items,  had to ask every morning for one thing or another. Also slow clearing plates away.  Also there seemed to be alot of fruit flies around which was very off putting.\nLittle touches such as a free bottle of water in the room would have been lovely, also a bin in the actual bedroom would have been useful.\nReception staff weren't particularly helpful when we discovered a train strike on our last day. Acknowledged their hotel taxi was more expensive than the city taxis but wasn't keen to call one for us. In the end we opted for their service as worried about getting to airport on time.\nOverall,  the hotel was clean, rooms comfortable, location just about nearby to sites but customer service a bit lacking. A shame really as otherwise with a few tweaks our stay would have been perfect.",
            "time": 1731170853,
            "translated": false
        },
        {
            "author_name": "Stephany Filardi",
            "author_url": "https://www.google.com/maps/contrib/111231086446686857024/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX8WxC4_we9tCNn2OsoeIsT1E2AvVUFeNBsjFCuOmKlv92Q1ZfY=s128-c0x00000000-cc-rp-mo",
            "rating": 1,
            "relative_time_description": "a month ago",
            "text": "My experience at this hotel was the worst possible. Starting with the part where it claims to be a 4-star hotel, but I wouldn't even give it 2.\nWhen we arrived at the hotel, we realized that the air conditioning wasn't working. We went to the reception and they said that the technician had visited but couldn't fix it, and that the entire hotel had no air conditioning and that he would return the next day, which didn't happen. Leading us to believe that they give this excuse to all guests who arrive.\nThe quality of the accommodation was terrible, the bed had a deplorable mattress. If you want to take a shower, forget it, they don't have a shower, just a tap inside the shower, which you can barely wash yourself with because you have to hold the shower. The bed linens were stained and smelly. The hairdryer worked for the first 2 minutes, after that it stopped and wouldn't turn on anymore. I chose to use my own hairdryer and was surprised by the power loss, even though the hairdryer was 220v. When we went to eat, there weren't enough tables or chairs. We couldn't stay more than one night, so the next day we went to the reception to check out and go to another hotel. When we mentioned all the problems we had and told the receptionist that the hotel was nowhere near a 4-star category, the response was that it was a VINTAGE hotel. Vintage is different from old. Be careful when booking this accommodation, because the advertising is MISLEADING. We lost 1000 euros and were not reimbursed. I am writing this review so that more people like me do not fall into the trap of dealing with this discomfort.",
            "time": 1729683328,
            "translated": false
        },
        {
            "author_name": "Akhil Penumudi",
            "author_url": "https://www.google.com/maps/contrib/113512592998175122044/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVqW_yJWjMMKsA3F41-DFHFyBjTx7rgYBCqvAekbBwZ7VGHSaXq=s128-c0x00000000-cc-rp-mo",
            "rating": 1,
            "relative_time_description": "3 months ago",
            "text": "DO NOT COME TO THIS HOTEL!!! This hotel is a complete scam and total waste of money. The website paints this hotel to be a 4 star hotel when in reality it is a dump. None of the photos of the rooms match the actual rooms they provide. The elevator was incredibly unsafe (like being in a death cage) and able to fit only one person at a time. The stairs leading up were even more unsafe with a railing that was set to break off at any given time. The room and bathroom itself was incredibly filthy as if it had not even been cleaned once and the beds felt like sleeping on concrete. My friend and I made other hotel plans immediately once we spent 5 seconds in the room. Initially, my friend and I thought the front desk manager was kind but we ended up getting charged the full price of the stay (a week after we left Rome) after being reassured that we would not be charged. AVOID THIS PLACE AT ALL COSTS, you won’t regret it.",
            "time": 1724816536,
            "translated": false
        },
        {
            "author_name": "Bhav Kotecha",
            "author_url": "https://www.google.com/maps/contrib/104766642283290072124/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU8QYeUJQPZDyNG1ZWGJayBVfRU1i9ukDzkuHJb_7wgGF2Kkb6G=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 1,
            "relative_time_description": "a month ago",
            "text": "Booked for 3 nights through British Airways Holidays expecting a 4* property as advertised. Was advised to not stay near Termini station by a friend from Rome so chose this one about 15 mins walk away. Staff are helpful and location is not bad. Not amazing either. However, be warned. At best this is a 1 star hotel. The photos of the room we were given had no resemblance to those on their website. This is deceit in any language including Italian (inganno). Attached are the real photos of the room we were given with 3 steps up to a bathroom, and when queried were told hotel was full (sounds like a regular excuse they use looking at other reviews) and to ask for a move the next night. We did not bother to move as the hassle was not worth it. If you are looking for a 1* hotel in Rome which is poor value and not in a particularly amazing location, nowhere near public transport and want to pay over the odds - Hotel Oxford in Rome is the place for you.",
            "time": 1728244391,
            "translated": false
        },
        {
            "author_name": "Dale U.",
            "author_url": "https://www.google.com/maps/contrib/109139934115170590267/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLfh6Jq9MRkXRto2ItRYG-Wv73D_VRF5_t4c-qOVFxX70Ke-w=s128-c0x00000000-cc-rp-mo",
            "rating": 1,
            "relative_time_description": "2 weeks ago",
            "text": "Date of stay was 10/30/24\nWe had this hotel as part of a British Airways holiday, and were booked to stay for 4 nights, based on BA recommendations we felt ok about the hotel, that is until we checked in. This is no way close to a 4 star hotel. The room was extremely dirty, the bathroom had what looked like mold on the walls. The bed was like laying on a board. Hard as a rock. The sheet , yes 1 sheet and 2 flat as a pancake pillows was what was in the room. If I could give this hotel a half star I would.\nWe had asked to be moved to another room and was told no. After explaining our concerns the front desk staff reply was , so what the room is paid for and we need to accept the room they gave us . We checked out the next morning and booked our own hotel for the remainder of our time in Rome . We went to the Best Western Plus hotel for the rest of our time in Rome. Which was an actual 4 star hotel . Unlike this hoyel.\nDo yourself a favor, DO NOT STAY AT HOTEL OXFORD. Rome.  If you do. It’s waisted money.",
            "time": 1731903168,
            "translated": false
        }
    ]
}