{
    "name": "Bettoja Hotel Mediterraneo",
    "rating": 4.2,
    "reviews": [
        {
            "author_name": "C Howard",
            "author_url": "https://www.google.com/maps/contrib/100813536666453339436/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUiv-cLp9XkbZ3InocCUkL1D2yKza42B6snXXO1o_eOR7CWm0Da=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "We have stayed here for 3 nights and enjoyed it all. Very close to the transport hub, although we enjoyed our walk to the historic sites each day.  The room was spotless, the staff are great. The breakfast was enjoyable and easily kept us going until lunch time.\nOn our last day we were able to use the facilities until our train at 10pm. So we checked out, stored our luggage and set off for another day exploring Rome. Excellent service and highly recommended",
            "time": 1726251188,
            "translated": false
        },
        {
            "author_name": "Geri Haydon",
            "author_url": "https://www.google.com/maps/contrib/100893637441424519843/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK7ffhI-CBQzeqQLlOAM6idv9oKIsq1m3a-uYUvB-_4AOgreg=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "4 months ago",
            "text": "Perfect location 5 minutes walk from the train station.  Large fluffy towels in the bathroom. Polite, helpful, professional staff on the reception desk and in the breakfast room.  I was lucky to be upgraded from a standard single room to a beautiful double room. I loved the style of the bedroom furniture and the colour is my favourite and helped me to decide to stay at this hotel. The room was comfortable and quiet and I was able to adjust the air conditioning in the room myself which was great. The large lounge area near the bar and restaurant is wonderful for sitting and relaxing. I found the choice of foods available on the breakfast buffet to be good - it is European style which is what I expect from a hotel in Roma. I loved my stay here and will stay again the next time I’m in Roma.",
            "time": 1722774865,
            "translated": false
        },
        {
            "author_name": "Jhingles",
            "author_url": "https://www.google.com/maps/contrib/114102549427049510246/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLT_NmTYyP0Dp9IWJ_B5s5oDRfTAkvLx8EB9oFyXA5WN1pB1w=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "Beautiful lobby, great breakfast, central location. Right by museums and the train station if you don't want to walk too much, but also centrally located next to many things to do. Rooms were clean and very comfortable. Has a good restaurant and rooftop bar with excellent views at night.",
            "time": 1727295233,
            "translated": false
        },
        {
            "author_name": "Elena Barrick",
            "author_url": "https://www.google.com/maps/contrib/109443119818157906345/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVJsGN9dkZtAe9brbcCj5hqILlRhe8mFRIiOYt5bNhnH-eygbNp=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "Great location so close to the Termini train station, lots of delicious restaurants nearby. The rooms are more modern than most I was seeing in the area. Beautiful color palette in the room, and the bathrooms were luxurious for sure. Service is great, rooftop lounge is charming, breakfast spread satisfies.\n\nPlenty of sights in walkable distance as well, even walked all the way to the colosseum and back in a day. Tho I am from NYC so maybe that's not as \"walkable\" to most people. ;)",
            "time": 1728797748,
            "translated": false
        },
        {
            "author_name": "Kornel Rozsavolgyi",
            "author_url": "https://www.google.com/maps/contrib/110600113129207655189/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVC8GayraB3754b0fZTDxn7hrPlanQTQXxs3FNo81KL57qqLejE=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "The hotel is very nice inside, spacious,  the service in the lobby, restaurant, cleaning etc is very good and friendly. They helped with any questions immediately. It does worth getting breakfast here added to the room, the selection is big and everything tastes good. Everything is fresh. The location is excellent,  very close to the train station ( 5 min walk ), airport is 40 min, downtown is 10 min with taxi. The restaurants nearby are good too.  I would come back!",
            "time": 1725036837,
            "translated": false
        }
    ]
}