{
    "name": "La Terrazza",
    "rating": 4.5,
    "reviews": [
        {
            "author_name": "Sven F",
            "author_url": "https://www.google.com/maps/contrib/116468221094020063921/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLr993joN0WDrQ_-NA6FJrPZxpeDPORiovZAWNogg94fffAWg=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "Best place in San Marino. The view is fantastic, the food excellent and the waiters are hilarious. Prices are more than reasonable. Went there for two nights. Loved it.",
            "time": 1726122562,
            "translated": false
        },
        {
            "author_name": "Rob Hale",
            "author_url": "https://www.google.com/maps/contrib/107652715060528582279/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX3Y7h1G3nRWHKCfVpgsxHvU7Vj6EWqbfTK9_Gr3IxlXRe1-9bWdg=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "8 months ago",
            "text": "A nice experience which offered great food in a nice environment. The restaurant is connected to the hotel so can be accessed off the street or through the hotel. A service team of three served us. Two spoke no English. The third did have good English skills so between my poor Italian and this person's English we got by. There seemed to be one chef so the food delivery time was  a bit too relaxed for my liking. But I wasn't in a rush so did not downgrade on this. Oddly two men (one in a suit) came in to another table and their food was served immediately with great priority. I'm thinking they were either local politicians (the restaurant sits right next to the Government building) or hotel management. The night we were there in San Marino was VERY windy. This led the windows to really rattle leading to some concerned looks on other faces. This distraction also led to a slight lack of the upscale atmosphere the restaurant seems to create. Nothing that the establishment can be faulted for. More of a general observation. Overall a good meal.",
            "time": 1711774921,
            "translated": false
        },
        {
            "author_name": "Emine Atayurt",
            "author_url": "https://www.google.com/maps/contrib/113431828779561797907/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL7SCiNFtgdJ5nxH8piTUv_PAAqGwxIACv103EFe8j_M-_KDw=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 3,
            "relative_time_description": "a year ago",
            "text": "Okay at best. We did two tasting menus. Would not go back nor recommend.\n\nLow light: food is bland. Most is not very tasty.\nService was disappointing. Right hand doesn’t know what the left hand is doing. We had a reservation and were first in line for 7 pm dinner. We’d expect more organized service. We never got a spoon for the stew. We didn’t get one of the desserts and when asked, they charged extra for what was included in the tasting menu… not a refined experience.\n\nHighlight: the view is nice but then you can see the same view from the public area.\nThe steak was good and the starter of the special tasting menu was good.",
            "time": 1690532562,
            "translated": false
        },
        {
            "author_name": "R.A",
            "author_url": "https://www.google.com/maps/contrib/116529871860888194165/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWBgCACMS8RShb45jH7vdkc3o9wBi85QtjDDIxDJZCtKaikktgh=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 3,
            "relative_time_description": "a year ago",
            "text": "Nice view restaurant definitely nicer than the food. It had high rating but not that good food honestly. The appetizer of potato was so good but the pasta was so disappointing. It could do so much better. We ordered this truffle pasta but nothing was close to the truffles. We couldn’t taste the truffles, nor the parmesan and didn’t deserve the costly dish. The appetizer price was a s costly as the main dish, it should be cheaper although it's good.\nRestaurant overall nice for its view but not the pasta dish.\nWouldn't go again or recommend the place.",
            "time": 1691586988,
            "translated": false
        },
        {
            "author_name": "Egle Jankauskiene",
            "author_url": "https://www.google.com/maps/contrib/115045292988804869506/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL_ITOdBseQB13FWo_regMbt2EbJSgCCiiPrIOjyHsbOyFpdGXD=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "4 months ago",
            "text": "Friendly and quick service. The panoramic view was great too. Spritz was 7 eur per glass and very delicious too!",
            "time": 1722858606,
            "translated": false
        }
    ]
}