{
    "name": "La Fratta",
    "rating": 4.2,
    "reviews": [
        {
            "author_name": "Bogdan Panici",
            "author_url": "https://www.google.com/maps/contrib/114181593341811403656/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV02zOaSPv8eBJUKmqt_gHuMUUlRM_uvy-op_x-sE65xp619jII=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "4 months ago",
            "text": "I had a very nice experience here, is the perfect place to have a brake after hiking to the towers of San Marino Castel !\nI had the tailgata Florentina and I wasn’t disappointed!\nThe only thing I would add, it will be a little more salt immediately after grilling or before, because the mea loose it’s temperature until it comes to the table!\nThe local beer is strong and tasty, service is on high level and the place looks very nice!",
            "time": 1722714281,
            "translated": false
        },
        {
            "author_name": "Jeroen de Graaf",
            "author_url": "https://www.google.com/maps/contrib/111151330204763649131/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXIZO9nqi3X222Hwqkum28_aL9rQWIfOTvTkbVT6yNF6GVJdXlX=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "4 months ago",
            "text": "Grande grande, what an amazing service and the location, next to the gate is amazing. We love San Marino and even better to visit this restaurant with an amazing menu and even better wines :)\nAsk for the specialities and make a reservation. You can have a dinner down stairs or at the Terras. Tablers take a note of the details on-site the restaurant. The owner is a Tabler and knows how to challenge you.",
            "time": 1722774966,
            "translated": false
        },
        {
            "author_name": "是无名",
            "author_url": "https://www.google.com/maps/contrib/105456352515293598037/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUyfMpEpSPvhf3dwnFhdLjwH_kWHkSqsZCbsQmj8WJtYT3PWJbz=s128-c0x00000000-cc-rp-mo-ba6",
            "rating": 5,
            "relative_time_description": "7 months ago",
            "text": "The food is good and delicious.  We had a very late lunch so didn't order much for dinner.  We did ask if we could share one of the main and we were given the ok and they even distributed for us into 2 plates portion. Very considerate.  Nice restaurant.  We were just too full to order more but it looks yummy for the rest of food.  Might find it a little expensive but still OK though.",
            "time": 1714164055,
            "translated": false
        },
        {
            "author_name": "Bianca Mendoza",
            "author_url": "https://www.google.com/maps/contrib/115298948694454712976/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUw9atq12ULfE-QiYI-25pVNlBzWs9gxzntFaNgKwLfzXou1c5O=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "4 months ago",
            "text": "Came here around 9 pm after a long travel day! They close at 10 so I felt bad coming so late, but we were starving and it was right across our hotel!! The workers were so welcoming even though we came so late! Our waitress was attentive and great! We got the truffle pasta — it was the best thing I’ve ever ingested in my life. We got it to share AND THEY SPLIT IT INTO TWO PLATES! Like omg I’m in love with this place. Thank you!",
            "time": 1720467805,
            "translated": false
        },
        {
            "author_name": "Steve Bintley",
            "author_url": "https://www.google.com/maps/contrib/108010780340305730878/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUz91tVXj2WT6I7ulfH4Gp5APOIk3cPC3KNiD2RZ0AT-lIBXQFCDg=s128-c0x00000000-cc-rp-mo-ba7",
            "rating": 3,
            "relative_time_description": "2 years ago",
            "text": "I was a little disappointed when I first arrived here, since as a single diner I didn’t get the most welcoming experience and felt like I was causing them more trouble than I was worth. Despite being empty it wasn’t possible to get a table on the balcony so instead I was shown to a large table in the centre of the restaurant. The decor was great and it was really cosy throughout. The menu was very large for both food and drinks and the prices superb, for what ended up being good portion sizes.\n\nThe waiting staff were very friendly, perhaps a little too keen at times though to get orders taken which could be mistaken as a desire to turn my meal round as quickly as possible, but were professional at least. Actual service of each of the dishes was incredibly fast and unfortunately made the whole experience feel a little rushed. However everything was redeemed by the quality of the food.\n\nPrior to the starter being served a basket of bread was brought, which was nice enough but unfortunately no butter to accompany. I opted for the “tasting of local cheeses” to start which was really enjoyable - a large amount of cheese with compote, although no crackers so the bread came in handy! Presentation was great on the slate plate however. The main dish of lamb cutlets was superb, served with potatoes which were so delicious, and the side of roasted vegetables I added was a welcome additional, although they were a little oily.\n\nThere’s a good range of drinks on the menu too, and it was a delight to see the house wine served as a carafe, which was provided in a chilled bag. There was no topping up from the waiting staff but that helped to make it a more relaxing affair, and even the house wine was very enjoyable.\n\nI perhaps would have selected a desert to round off the meal, but getting the attention of any of the staff to order it was near impossible, so eventually I gave up. Payment was requested from the reception desk rather than at the table and although the quality of food was nice enough I felt the whole experience was both too rushed and more concentrated on the groups than those they deemed less valuable.",
            "time": 1660464766,
            "translated": false
        }
    ]
}