{
    "name": "Kibe Mahala",
    "rating": 4.5,
    "reviews": [
        {
            "author_name": "Kenan Fisekovic",
            "author_url": "https://www.google.com/maps/contrib/109824897958059648716/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUIJZjH5Yf8Of-9dYq48VeE7VlaHb7f6pDZZrAoNrvxz7DnX7jF=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "I had the beefsteak at Kibe Mahala, and it was absolutely amazing! Cooked to perfection, tender, and full of flavor – one of the best I’ve had. The atmosphere is warm and authentic, with a beautiful view of Sarajevo that adds to the experience. The staff were friendly and attentive, making sure everything was just right. It’s a bit pricier, but the quality of the food and the whole dining experience make it worth it. Highly recommend for anyone visiting Sarajevo!",
            "time": 1729430629,
            "translated": false
        },
        {
            "author_name": "Ethan Harman",
            "author_url": "https://www.google.com/maps/contrib/100201009832468820086/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX70T9qQb7JizLFQ9XjSUcRpyM-U5MXHUIpA11dvCCDA5LjxF4=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 5,
            "relative_time_description": "3 weeks ago",
            "text": "My Partner booked this restaurant for my birthday and I was incredibly impressed with each the service, food, atmosphere, drinks and view of the city. The food was some of the best I have had across more than 25 cities of travel and the service was impeccable, the wine selection and variety of spirits on offer was also a bonus. The staff were very accommodating of us despite our not being overly familiar with the food on offer and suggested that we try half portions of each dish to try a bit of everything, we loved everything we tried. Highly recommended for a special occasion with a special someone, the view and atmosphere are unmatched and they also have live music and a great selection of after dinner drinks and desserts. 10/10.",
            "time": 1731229255,
            "translated": false
        },
        {
            "author_name": "Ирина Заболотная",
            "author_url": "https://www.google.com/maps/contrib/110988603861305570209/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVps4hapdXiBRWBFxdw__WPxzeaGa05y3z9uvdplZAqd1d_Jyw=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "Everything was very good. We didn’t book in advance but they found a spot for us. Of course better to book due the place is very popular and always packed. Food was very delicious. Our waiter was nice and friendly. The view is amazing! Interior is great. Thank you for hospitality. Will recommend this to all my friends😊",
            "time": 1727202023,
            "translated": false
        },
        {
            "author_name": "Shane Hamilton",
            "author_url": "https://www.google.com/maps/contrib/118427389162940370756/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUYXcuxAx2QdhBj4PtewHkRmDgKdB_AZ2NA2fS28jUD-SzPcEM=s128-c0x00000000-cc-rp-mo-ba6",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "We booked in advance and had a great meal here, obviously you have to pay for the quality and service,  We'd spent 2 weeks in Bosnia and were getting sick of the bland tourist trap style restaurants so opted to go a little upscale.  We weren't disappointed.\n\nIf you get a window seat you get a great view out over Sarajevo.\n\nGet a taxi to and from here, it's quite a steep hill to climb up if not",
            "time": 1728979543,
            "translated": false
        },
        {
            "author_name": "Nadeem Al Katheeri",
            "author_url": "https://www.google.com/maps/contrib/111967226865595119900/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWcp4tw080uTsnS43TvPCTDh1KXcUkmvXX2bCxcR83dHnEqWVh5=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "We had an amazing experience at this restaurant! The view over the city is absolutely stunning, and the food was delicious. Our waiter, Janan, was incredibly hospitable and made us feel very welcome. Even though we didn't have a reservation, they kindly accommodated us. Just a heads-up—it's a popular spot, so it's best to reserve in advance. Highly recommend!",
            "time": 1726855105,
            "translated": false
        }
    ]
}