{
    "name": "Montana",
    "rating": 3.2,
    "reviews": [
        {
            "author_name": "Hamza",
            "author_url": "https://www.google.com/maps/contrib/112062980187725608138/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXERuqu9TSP2RGOHs-Tm72icD-13Nbv2OvPHI6Cbp1r9a6EFXNz=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 1,
            "relative_time_description": "4 months ago",
            "text": "I would never recommend this place!\n\nThe service is incredibly slow, we wasted our time here waiting for our orders, and they made mistakes. Our order was wrong, and they didn't even apologize! They just said, \"Just take it, please.\" Like, what??\n\nThey also don't accept card payments. The food is very bland and tasteless. Don't bother yourself to come here.",
            "time": 1721072099,
            "translated": false
        },
        {
            "author_name": "Mo Dernawi",
            "author_url": "https://www.google.com/maps/contrib/102389946575774866734/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXiNvbU1KkK_UjAYcGh7V7ibE6D3hZsD3f66g57P2GVjAYo4jw=s128-c0x00000000-cc-rp-mo",
            "rating": 1,
            "relative_time_description": "a week ago",
            "text": "I came to Montana scc, where they make sandwiches, I asked for sandwich without white cheese like I do every time , the lady at the counter said ok. When I got the sandwich it had cheese in it, I asked nicely please I ordered without cheese, the guy works in the kitchen came out and told me we can’t change or give you money back go give it to someone else. Very rode. The guy was bold, with beard and tattoos in the arm. Very unprofessional\nAfter spending my credit on calling to get some help, finally after all they made me the sandwich , however the guy working in the kitchen is very unfair and rude, I will never go back again.",
            "time": 1732632366,
            "translated": false
        },
        {
            "author_name": "Léo Yigit Ekiz",
            "author_url": "https://www.google.com/maps/contrib/100840810740382327393/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXdsW0ozjCP0cA2FVIgGsF26KDeWbzTEw4TRFK9YMzazHJihbt8=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 1,
            "relative_time_description": "a year ago",
            "text": "Waited 30 min for a ranch chicken (which I tried before) the portion is now like this 😅\nThey claim that this chicken piece is 120 gr\nI think they just make 2 portion from 1.\nDon’t think you will receive what you see In the advertising photos. (Scc chicken risotto soup Montana)\n\nTaste is acceptable but it’s very funny to sell something like this.\nThey should change the name of the plate not chicken but smashed potatoes. So you got some side dishes like chicken pcs.",
            "time": 1690567688,
            "translated": false
        },
        {
            "author_name": "Anđelka Jovanović",
            "author_url": "https://www.google.com/maps/contrib/112284237792910181252/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXrHcYQu3noHVPAbNjKll9A6vN-gos64DptFFefVygm62pmaVp9cw=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "The best pizza in town, all recommendations for service and quality!",
            "time": 1725011187,
            "translated": false
        },
        {
            "author_name": "zonemyparkour",
            "author_url": "https://www.google.com/maps/contrib/112223437046859293298/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLjDv0srYyzdZoWre9jycjDtXzaH6zCCmpwXOUe3rgfMBAd5w=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 3,
            "relative_time_description": "2 years ago",
            "text": "Foremost I want to say that this place has a great tasty food for reasonable prices, and it's worth eating here whenever you can.\n\nSecond, I want to address some common one star ratings left here:\n\nI do agree that wait times are sometimes long, but whenever I asked staff how long will I wait for pizza for example, I would usually get pretty accurate time frame.\nSo if waiting 40 mins is long for you, go eat somewhere less crowded, there are literally 20 other food places around.\n\nAlso, girls work with full steam, so it is no surprise that they cannot smile to everyone at all times. Water is being paid everywhere in Europe, and I don't see big deal to pay 0.25 euro cents for half a liter bottle. Some people that are complaining here are insane  to say the least.\n\nManager or owner is uncultured swine and I whole heatedly agree that shouting at his workers is beyond words. He also tried to evade taxes even tho he had one of the biggest profits in year.",
            "time": 1644746043,
            "translated": false
        }
    ]
}