{
    "name": "Hospes Las Casas Del Rey De Baeza",
    "rating": 4.6,
    "reviews": [
        {
            "author_name": "Ryan B",
            "author_url": "https://www.google.com/maps/contrib/100243330660912200376/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWUD2Q6SLXNpPRtaquW6nsv5GodR6S0EKKZhpXHk4xHWagTIlI=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "3 weeks ago",
            "text": "Hospes is a very interesting hotel. It's not what you might expect, especially if you're American. We have stayed here twice, once in 2021 and now in 2024. I would call this a boutique hotel, with a great location (when on foot) in the old city with tiny streets etc. the rooms have been redone since COVID but are still unique and relatively small. We were lucky that they had one of the bigger rooms available for our family and they made accomodations for us. The staff are extremely friendly and long term to the hotel. The fact they're part of the Marriott system is a huge bonus for us, but this is no typical Marriott experience. It is a several hundred year old building nestled between old churches etc. you can park a car here in their subterranean garage for a small fee but you will not need or want the car much. They have a restaurant and beautiful courtyards and little sitting areas to enjoy. I say this to my fellow travelling Americans: please check out the photos etc to make sure this is what you want before booking. If you do like this sort of experience, it's top notch. I feel like we have a home in Sevilla for when we inevitably return. Thank you Hospes for taking care of my family in Seville!",
            "time": 1731590832,
            "translated": false
        },
        {
            "author_name": "Dirk R.",
            "author_url": "https://www.google.com/maps/contrib/105953583359760563209/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXukz0ng2yQ6qKoP5yDncUExR-iufMvIrfl2yFAFTX19tAStEx1=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 4,
            "relative_time_description": "a month ago",
            "text": "Beautiful boutique hotel. It's a small Spanish chain, but it's actually really nice. Note that with the less expensive room options, you'll get a room that's located along the walking routes of everybody else, and you will be a little distributed by the noises of guests passing by, dragging their luggage.\n\nThe bed was comfortable (and large!), the shower was modern (and large!).\n\nIf you have a car, you can use their valet service to get your car parked in their garage (26 Euros per night).",
            "time": 1730823679,
            "translated": false
        },
        {
            "author_name": "Lisa Nathan",
            "author_url": "https://www.google.com/maps/contrib/108784177781694870803/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXNblxsy8TY3R1FgiqBbF5QOHD887kOhXAI1FoGNMDAqHxxDOkr=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 4,
            "relative_time_description": "a month ago",
            "text": "I had a pleasant stay at this charming hotel in Sevilla. The rooftop pool with city views was a highlight, and the location was perfect—close to cafes, restaurants, and attractions. The room was comfortable, and the staff were friendly, but for what we paid, I’d expect a bit more. Overall, a good experience but with some room for improvement.",
            "time": 1729713558,
            "translated": false
        },
        {
            "author_name": "Devon Haley",
            "author_url": "https://www.google.com/maps/contrib/109219551302289709645/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVJ37n8eFnXAhlAXpX_LIuudxqqClKFUmeP2_KnnMrFWsChzBajRA=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "5 months ago",
            "text": "My husband and I stayed here while visiting multiple cities in Spain. The hotel was one of the most comfortable we stayed in and was also luxurious. I really loved the rustic aesthetic of the hotel and the lovely sitting areas in the courtyard and salon. The roof deck was also a nice place to lounge for the day although with Sevilla’s heat it would have been nice to have more shade on the deck.\nWe also enjoyed some of the food at the hotel’s restaurant and loved the variety & care that went into each meal.\nRoberto recommended a wonderful Italian restaurant nearby and was incredibly helpful during our stay.\nPerfect location and stay for our trip to Seville!",
            "time": 1720263799,
            "translated": false
        },
        {
            "author_name": "ryan sheppard",
            "author_url": "https://www.google.com/maps/contrib/105895227068983771773/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLg17nKHgKpcT1yH4nLfKH21SorsGVJS_zwpvM1ONsmhS6uPg=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "5 months ago",
            "text": "We had a fantastic 3 night stay for my wife’s 40th birthday.  This hotel is fantastic.  We stayed in Junior Suite and were delighted with the size, decor and style of the room.\nThe hotel grounds are all lovely.\nBreakfast is fantastic.\nThe rooftop pool is a lovely space and very clean.  Drinks are brought to your beds throughout the day.\nAnd its location is perfect.  You can walk to any of the major attractions in 20 minutes and is only 5 minutes from the Old Town (Alfalfa) which is great for food and drink.  Lots of great tapas bars in this region.\nHighly recommend.",
            "time": 1719671185,
            "translated": false
        }
    ]
}