{
    "name": "Restaurante Ispal | Grupo La Raza",
    "rating": 4.3,
    "reviews": [
        {
            "author_name": "Rosalyn Lee",
            "author_url": "https://www.google.com/maps/contrib/109744072855386117357/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUzkudfPToHEq-impQ2Zq22oU94MedjiVsltMlsMe0ObQsg5RXN=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 2,
            "relative_time_description": "2 months ago",
            "text": "this meal was underpar and i gave my opinion to the lovely wait staff who asked for it. yet i still feel compelled to leave a review because it was my first meal on my first ever day in Sevilla and it does not and should not represent this city.\n\nfood is complicated, subjective and we all have our biases/preferences - i did not enjoy the food at Ispal but the american couple at the table next to mine seemed to love it. so ill try to be objective.\n\nfirst, the good stuff: the two servers working the dinner shift on 11 sept 2024 were AMAZING. super attentive, warm, and served my dishes quickly and efficiently as per my request. i think in terms of michelin-level service standard, both servers hit the mark.\n\nsecond, the music playlist. it was loud and giving cheap karaoke pop song covers. after an hour in, the cover of Natalie Imbruglia’s Torn played for the second time. its fun for a cheap and cheery diner, very jarring for a white tableclothed restaurant. but the food was so underpar i found myself lipsynching to Coldplay’s Fix You about 45mins in. also the trolley which was used to serve wine. its NOT a wine cart. its just a regular trolley, used in place of a serving tray, to serve a glass or two of wine. it was so loud id jump a lil cuz it sounded like a train was approaching from behind me.\n\nfinally. the food:\n\n1. PLATING - its giving early 2000’s michelin. dry ice, sauce smears and spatters, gold dust… except for one duck dish which came adorned in pink feathers which my friend accurately said was “giving 1999 from the reduced section in a cheap teenage clothing store”. too many biscuit tuilles.. the dessert one didnt break so the mousse under it pushed thru like pus. plating is the first sign (to me) of whether a restaurant’s got originality or if its trying too hard. often times when the plating’s off, the food usually follows suit.\n\n2. TASTE - simple dishes that any good tapas bar can churn out much better versions of. most disappointing was the 36hr slowcooked pig… tough for something thats slowcooked. but the worst was the trout roulade - dry trout with dry rubbery tasteless bits of lobster innit, served with vanilla sauce… i sent back 95% of that dish. overall: flavours were largely unbalanced and chef was heavy-handed on salt and acid.\n\nfinally, and this is my bias: im a discerning singaporean diner who just got off a long flight and wanted to treat herself to a nice degustation meal. i dont trust Michelin Guide so i turned to the Eater guide which pointed me to Ispal - the guide’s usually on point but in this one instance it failed me. i shouldve read the google reviews - esp the one from Euna Cho.\n\ni hope the rest of my week in Sevilla would yield better meals but my hardcore foodie friends said Sevilla aint San Sebastien. ah well.",
            "time": 1726119720,
            "translated": false
        },
        {
            "author_name": "Debbie G",
            "author_url": "https://www.google.com/maps/contrib/109441840590240704853/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVdNmtCd8C3zUJEPwdJLtWGF0dw0rpSry0Tfos4SHw8aMnxkZ0b=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "4 months ago",
            "text": "Wow. Chef Andreas Onofri is a talented genius! This place exceeded every expectation.\nOpted for the smaller (13course) menu with the wine pairing\nServers Jose & Serena are on hand to explain & answer every question you may think of!\nAmuse bouche: orange blossom bubble made by spherification & orange mousee.\n1.Blue crab, pork rind & tomato confit.\n2.White shrimp garlic emulsion - not too overpowering\n3.Mussels from the River in a smoke gaspacho soup with jellified mussel juice to intensfy flavor.\n4&5Dual course:\nMeat of ropa vieja as a stew with spinach gave it an indian style flavour profile... the same :chorizo, morcilla, pork cheek + different spice profile served in a lettuce cup\n6.Sweetcorn \"gazpacho\" - rockfish, apple + oil & basil spherification\n7.Sea bass & roteña sauce + celery root\n8.Rainbow trout with red crab centre both from the river\n9.Suckling pig slow cooked for 36hr at 72C plus:\nIberian ham mousse\n10.Mallard from Seville with traditional stew\n11.Strawberry marmelade, rose mousse, red fruit cookie.\n12.Torrija -french toast caramalized with sherry & vanilla ice cream\n13. Petit fois:black chocolate truffle.\npio-nono biscuit,red berry bonbon in white chocolate,orange jelly & cold tea green/black/red infused.\nWine pairing was as follows :\nSherry: Manzanilla 3 yrs barrel - dry\nWhite: Buleria 2022 cadiz sav blanc - fruity\nRose : Alanis Seville = ganache, tempranillo & macebo 13% - tart\nRed : Higueron 14% from Cadiz  aged in Frech oak = syrah & cab sav - light aromatic.\nDessert wine : orange wine huelva 8yrs in barrel macerated with orange skin 15%.\n\nEverything about this place is exceptional!",
            "time": 1720761662,
            "translated": false
        },
        {
            "author_name": "David Goldsmith",
            "author_url": "https://www.google.com/maps/contrib/110816020461858818983/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVHYnthcD6SyjprDqpocom0SKy5uzJqdOhzBnmNQss24tpS51MUKA=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "9 months ago",
            "text": "A lovely 12 course tasting menu. We did not opt for the wine pairings but good wines available by the glass. Attentive friendly service, well thought through and executed Adalucian menu, delicious dishes. Only 200E . Close to main station and trams. Thoroughly recommended.",
            "time": 1709714775,
            "translated": false
        },
        {
            "author_name": "Abby Schottenfels",
            "author_url": "https://www.google.com/maps/contrib/109064545740686678030/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVJuB3vmvSz4MhtGnUSLpTsa9zrYEQmVbmQEK72kCQynVf0sxTN=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "9 months ago",
            "text": "This was a highlight of our trip to Seville. The food had so many layers of flavor and texture. So much variety. Service and ambiance was great, secret trick - go at dinner when there is no rush.",
            "time": 1708254430,
            "translated": false
        },
        {
            "author_name": "Elizabeth McIntire",
            "author_url": "https://www.google.com/maps/contrib/117238733654222433148/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJfYnN92XN23VcLP2zZ-n59vtortsezZOonir1yA2arX0wX4g=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "Cute restaurant. The food was great, and a great value for how many courses you get. When I walked in my dress broke and they happened to have safety pins in the bathroom so that was very convenient. The service was great, I loved that we got a little service from all 3 front of house staff. Food was rich and tasty.",
            "time": 1727030090,
            "translated": false
        }
    ]
}