{
    "name": "Hotel Colón Gran Meliá",
    "rating": 4.6,
    "reviews": [
        {
            "author_name": "Pravina",
            "author_url": "https://www.google.com/maps/contrib/101284025859794634241/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXdwefyvj78eCI6qrDfRcM48PlqmpvNbyzH7c752PLtl7jfclapNg=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "in the last week",
            "text": "First time visiting Sevilla, so we weren't sure what to expect. Hotel Colón Gran Melia made us feel safe and welcomed. It is an exceptional hotel located in the heart of the shopping area. Staff can't do enough for you whilst respecting your privacy.  It is immaculate with an inviting atmosphere.  There was a choice of hot breakfast from a menu and made to order as well as a buffet.  There were traditional flamenco evenings and a pianist playing one evening and on Sunday morning through breakfast. The rooms are spotless and cleaned (i mean properly cleaned) every morning and turned down in the evenings.  The bar and restaurant caters to everyone with a choice of traditional tapas dishes or Spanish inspired fare. If you book early, you can pick up a very reasonable deal.  We will definitely rebook and recommend to friends and family.",
            "time": 1732957415,
            "translated": false
        },
        {
            "author_name": "Alfa Victor",
            "author_url": "https://www.google.com/maps/contrib/115147297618490271725/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUOeNsrTB3sc9TWK0V-P73JjxkAfZ3WjmSxV59JYsnV6pIpcKk=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "in the last week",
            "text": "Excellent hotel right in the heart of old town Sevilla. Plenty to do and shop. Most with walking distance or cab ride. Everything was amazing. The food, the coffee, the rooms, the service and hospitality of the staff. It was like being at relatives home. We recommend Hotel Colón Gran Meliá to anyone traveling to Sevilla.\nDefinitely planning on returning. Must experience.\nP.S. My wife and I were hooked on the coffee, but we forgot to ask for the brand used. Both in room and at the breakfast lounge. If you could kindly share would be great.",
            "time": 1732821225,
            "translated": false
        },
        {
            "author_name": "Bryan R",
            "author_url": "https://www.google.com/maps/contrib/110192588534832795137/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW5I1ITBgXyKRxk8tAzciFklsOug54Uq_1lyNt-UYJmpUbz_fzI=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "First of all, the location is unbeatable—just a 10-minute walk from everything you’d want to see.\n\nWe recently spent a week in the presidential suite, and it was extraordinary. The room was impeccable, with every design detail thoughtfully considered. The terrace was a real show stopper, offering breathtaking 180-degree views that made every moment out there special. The bedding was of the highest quality, which, for me, is always a must.\n\nThe service was exceptional throughout our stay. We felt completely looked after, and Sofyan, one of the managers, deserves special mention. He went above and beyond to ensure everything was perfect, and his attentiveness left a lasting impression.\n\nFrom the accommodations to the great service, our stay was memorable in every way.",
            "time": 1729661525,
            "translated": false
        },
        {
            "author_name": "Sally Hall",
            "author_url": "https://www.google.com/maps/contrib/110821060726253659793/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUlqYr2vcWDt4eqibNrOHr4RIna1hLpmrV9g5Ks-3rEA_xd6xX4=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a week ago",
            "text": "Wonderful Hotel, staff professional and friendly. Breakfast delicious.  We had a great evening in the bar with live Flamenco. The pool outside was heated.,Sauna was a welcome treat after a day sightseeing.",
            "time": 1732623883,
            "translated": false
        },
        {
            "author_name": "Paulo Roberto Mascara",
            "author_url": "https://www.google.com/maps/contrib/105422812548412097619/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVsTu6xd0R_kwcavB23YYu2qSaDRCIJxFN4s04wlxBC-1CDoOC0=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "The Hotel Colón Gran Meliá is simply fantastic. Located just a 10-minute walk from the main attractions in the heart of Seville, its location is perfect for those who want to explore the city with ease.\n\nThe service is absolutely impeccable, from the moment you arrive until the end of your stay. The rooms are spacious, comfortable, and offer a luxurious atmosphere that guarantees an unforgettable experience. Moreover, the staff is incredibly helpful and always ready to assist with any needs or requests, making you feel truly welcome.\n\nIf you're visiting Seville, you must stay at the Hotel Colón Gran Meliá!",
            "time": 1725716878,
            "translated": false
        }
    ]
}