{
    "name": "Hotel Mercer Sevilla",
    "rating": 4.5,
    "reviews": [
        {
            "author_name": "Lacey Perkins-Kelly",
            "author_url": "https://www.google.com/maps/contrib/103017074186349603979/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLnpIIYhTiglMcGdDuTxCagPU38Q0G2D1S2wms1dpjQTU9Cu9hb=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "6 months ago",
            "text": "Just returned from a stay at the Mercer Hotel and can't wait to return!  The hotel itself is beautiful and really unique.  It is also ideally located - it is central to everything in Sevilla, but  also on a quiet street.  The service at this hotel is exceptional. Pablo and the rest of the Mercer staff were so welcoming and helpful. They arranged dinner reservations, horse carriage rides, and even car service to Marbella - which made everything easier for us.  We were traveling with our two year old and the Mercer team had a crib waiting, along with a child-size bathroom, kids' toiletries, crayons, and a small stuffed animal that my son was so excited about.  Everyone at the hotel was so nice to my son, too! We've stayed at a lot of other high-end hotels and the Mercer is truly the best - highly recommend it!",
            "time": 1716638880,
            "translated": false
        },
        {
            "author_name": "Monica Bhagwandin",
            "author_url": "https://www.google.com/maps/contrib/108030988467972476784/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL9KZydW1_8IHx2grptLVh9zelVgESBbuZ7bl_6VQEPtg1apQ=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "9 months ago",
            "text": "ONE STEP CLOSER TO PARADISE…\n\nHi! What can we say about this hotel, where to start. Have travelled all around the world, and often, there is something that was a bit disappointing, but hotel Mercer, is absolutely intoxicating! The hotel design, the staff (the best!) the rooms, the cleanness, the quietness, the central location, the food, the bar, just everything was impeccable! ! The choice to stay here was simply the right one. We felt as if being home, moreover since its a boutique hotel. A true hidden gem in the middle of everything. My husband and I can’t wait to go back and stay in the same hotel again. Value for money in all ways…… thanks for making our trip so special🙏🏼",
            "time": 1709372936,
            "translated": false
        },
        {
            "author_name": "Shane Austin",
            "author_url": "https://www.google.com/maps/contrib/117650332620910399378/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIn4wtEeo_UQTvAnGrMTETuBeX8jKg-IUgm8GtpmqBCFE905w=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "Amazing service and attention to details. Can’t recommend this place enough. Everyone that works here is absolutely amazing and made our trip to Seville perfect.",
            "time": 1729931911,
            "translated": false
        },
        {
            "author_name": "Ophelia Bellio",
            "author_url": "https://www.google.com/maps/contrib/117104400033308724206/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXMY-RSduR2uXjsv7vvGiyt87HhgNRs3afbelIM3f-wnjkex4T4=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 1,
            "relative_time_description": "3 months ago",
            "text": "I popped in for drinks and was served G&T with no Gin.  When I raised concerns that paying 34 euros for drinks with no gin I was told the price was for the excellent service.  What this one.  A little disappointing for a nice venue.",
            "time": 1724668137,
            "translated": false
        },
        {
            "author_name": "Veronica Li",
            "author_url": "https://www.google.com/maps/contrib/106287635720111839779/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUiQJhVvjC-ei6Pw6m4tA6Xeyf5oHHXV8gzapAVe2YEyW7ybgE=s128-c0x00000000-cc-rp-mo",
            "rating": 2,
            "relative_time_description": "9 months ago",
            "text": "Overall I’d expect better as a 5-star hotel. The location is good and the staff is very friendly and welcoming. Nice decor that gives you a modern boutique vibe.\n\nMy biggest problem is with the room.\n1. The AC never worked. We tried heat, cool and vent mode, none of them worked. There is no air coming out…It gets hot at night. We had to leave the window open to go to sleep.\n2. The room comes with a few charging cords (which is convenient). However, all of them are broken. The USB port is also broken. We had to share one adapter to charge all our devices.\n3. There is window in the room but is facing another room so you basically get no natural light. The room is small with a cabinet in the middle for TV and fridge.\n4. The room is a bit worn out with peeled paint and chipped frames.\n\nWe did not try the restaurant or the swimming pool. The rooftop is ordinary with some lounge chairs. There is no Spa in the hotel.",
            "time": 1709921236,
            "translated": false
        }
    ]
}