{
    "name": "Abades Triana Restaurante",
    "rating": 4.3,
    "reviews": [
        {
            "author_name": "yiju chen",
            "author_url": "https://www.google.com/maps/contrib/110122111753379241872/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV80DlqSjou0mW0nSQRij2ZC5AN3_AO02y3VFXpCKyBLjBiTGM=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 3,
            "relative_time_description": "a month ago",
            "text": "The location is great, food is alright, the price is not too bad for total. However, I ordered the wine paring and which is not providing by the order as the menu; also didn’t adjust it based on the testing menu I ordered.\n\nThe sea bass I had is okay, bit dry but the source is delicious; but there is bone and scales. Should not happened in a fine dining restaurant.\n\nService is good, view is great. Can try, but don’t expect high",
            "time": 1730040458,
            "translated": false
        },
        {
            "author_name": "YL",
            "author_url": "https://www.google.com/maps/contrib/106108786279684420848/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUGuB9QD3xxE0AKlhK85p6zTXH3d0pCXllpPX9tuviwcMumz4FORA=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "4 months ago",
            "text": "We opted for the premium service(€15 per person) which includes drinks before and after the meal, the right to sit right in front of the river and tiny dessert after all the food.\n\nThe whole experience was amazing and the waiters are really really professional.\nI don’t come to this kind of places often but when you do spend this level of money, this restaurant actually don’t disappoint.\n\nWe had two starters, two main courses plus the premium for two, at the end it cost us €150. With the view and the good quality food(the chef cooks amazing) I think it’s worthy to try if you come to Sevilla!",
            "time": 1721127766,
            "translated": false
        },
        {
            "author_name": "Benedita",
            "author_url": "https://www.google.com/maps/contrib/112240705421876932423/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWRlWItsEAbXl_V6qOB7ni9T3Ir9g-hWSLtOXarBtmEOTolAfRRUQ=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "Ivan, Fernando, and Javier were incredibly skilled and attentive, providing one of the most exceptional lunch experiences.\n\nThe food was delectable, even though I typically avoid ham, I couldn't resist trying it and found it to be absolutely delicious.\n\nI highly recommend this restaurant to anyone who appreciates excellent service and stunning panoramic views.",
            "time": 1724434433,
            "translated": false
        },
        {
            "author_name": "Joel Reyes",
            "author_url": "https://www.google.com/maps/contrib/116988979584540323250/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVeAy9I2ZfZQZFBwvdGVCbrxu-x8VllbMdTSwWVjVY14WQMmu8hIQ=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "Located across the bridge on the Guadalquivir in the Triana neighborhood it has one of the best views in the city (Torro de Oro), especially at night. The food is original and beautifully presented, with just the right portion size. Waiters very attentive and friendly.",
            "time": 1724402514,
            "translated": false
        },
        {
            "author_name": "Marc Ll.",
            "author_url": "https://www.google.com/maps/contrib/117925496819936188715/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUgL3Llea0bQDMtA7YFQI6wr3J4gjwiDejhZAACNVb9QdHseCftZQ=s128-c0x00000000-cc-rp-mo-ba6",
            "rating": 5,
            "relative_time_description": "4 months ago",
            "text": "One of the top experiences in Sevilla. Yes, it is far more expensive than the average, yet you new to take it as another view about Sevilla..the stylish one.\n\nWe actually paid more (15€/person) to make a reservation for a private room in front of the window overlooking the river and Torre del Oro. It is a must. The 15€ pays off as you  ensure magnificent views but it also includes a welcome cocktail (it is worth 12€ already), coffees and small sweets at the end.\n\nAll staff is extremely attentive and knowledgeable. Perhaps younger ones are struggling (probably starting in this business) yet already playing it very well and they are anyway closely monitored by the more experienced ones.\n\nMenu is diverse, yet everything is gorgeous, high quality and excellently presented.\n\nThey have tasting menus starting at 60€/person up to 250€/person, yet we stuck to the menu sharing some entrees (awesome Iberico 100% bellota) and very well cooked fish of the day as main.\n\nWines are not too expensive, actually quite close to the market price.\n\nThe ambience is high end, very stylish, so it is highly recommended to dress up according (smart).\n\nVery recommended.\n\nIllustration: 100gr Iberico ham for 33€\n\nLabels: 2Eat, $$$$, #mediterranean, #terrace, #views, #fashion, #romantic, #mustGo",
            "time": 1720765224,
            "translated": false
        }
    ]
}