{
    "name": "Park Hotel \"MOSKVA\"",
    "rating": 4,
    "reviews": [
        {
            "author_name": "Marianna Figueroa",
            "author_url": "https://www.google.com/maps/contrib/108139559186740579470/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIMdJoZV-bigUpPwpQO9Fc0m9N4o52Vw2jvLyhrpXjdNpn5JWg=s128-c0x00000000-cc-rp-mo",
            "rating": 1,
            "relative_time_description": "3 weeks ago",
            "text": "No one speaks English, which is surprising if they have tourists, so it was almost impossible to communicate. Breakfast buffet with few varieties, dirty eating areas, everything cold. Average room. Really unpleasant staff. I had booked for 5 days, but I left on the second day, since staying in that place is really impossible. Not recommended at all.",
            "time": 1731270722,
            "translated": false
        },
        {
            "author_name": "Emir Ergenekon",
            "author_url": "https://www.google.com/maps/contrib/102918359343821262653/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLCPoPQhRxt7wFoXONqMlAfPu8K3od4UdEQhBwFHSh3DPqOzn4=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 1,
            "relative_time_description": "2 weeks ago",
            "text": "I recently visited this hotel without a reservation, hoping to find a room. After being informed by the receptionist that they were fully booked, I returned to my car, only to find I’d been charged a 3 leva parking fee for just a few minutes. When I went back to the reception for clarification, I encountered some of the most unprofessional and dismissive behavior I’ve ever experienced.\n\nThe receptionist insisted on payment in leva, despite my explaining that I had just arrived and hadn’t had a chance to exchange currency yet. When I asked if there was an alternative option, she responded with rude comments like, “What are you doing here if you don’t have leva?” and even, “Are you from the moon?” Eventually, she offered to accept euros—but only at an absurdly high exchange rate, which made it clear she had no intention of being helpful. Frustrated, I decided to walk away, feeling that this was a type of trouble I didn’t need.\n\nOnly after this difficult interaction did a helpful parking attendant inform me that there was an ATM across the lobby—information the receptionist had conveniently neglected to mention.\n\nHonestly, I couldn’t help but laugh at the absurdity of the situation. It didn’t affect my day, but I could see how this kind of treatment could ruin the experience for other guests who simply want a smooth, welcoming check-in. I hope hotel management takes note and retrains their front desk staff to handle guest interactions more professionally. I ended up booking at another hotel in Sofia, where I received far better service. Until this hotel addresses its reception staff’s behavior, I’d recommend future guests consider other options.",
            "time": 1731794575,
            "translated": false
        },
        {
            "author_name": "Alexandru Mihai Budes",
            "author_url": "https://www.google.com/maps/contrib/116441447916891346173/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUk3sluKDgPMFOF75T7y3Z89xO_7sMFo0PlWhUpPZNknespixqU=s128-c0x00000000-cc-rp-mo",
            "rating": 1,
            "relative_time_description": "5 months ago",
            "text": "My girlfriend and me wanted to reach the Panorama Restaurant and asked at the reception desk.\n\nBlack haired woman denied of having a restaurant or bar in the hotel, telling us extremely rudely to go outside to find one. The lobby bar was 5 meters away from us, with people enjoying some drinks. Ridiculous and obvious lie.\n\nWe are happy we did not book a room here.",
            "time": 1718998877,
            "translated": false
        },
        {
            "author_name": "James Hollen",
            "author_url": "https://www.google.com/maps/contrib/116507620767721120639/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIfV5syYWUFPDQSCUYX7O9NnO9wfBToQAbE5kSrn6dCDxR-FA=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 4,
            "relative_time_description": "a month ago",
            "text": "Nice hotel in the Russian Embassy neighborhood.  It is clean, attentive staff in a safe area. It is a short walk to the subway/metro. Only 200 meters.",
            "time": 1730246935,
            "translated": false
        },
        {
            "author_name": "Rob “Bob-Popular” Reynolds",
            "author_url": "https://www.google.com/maps/contrib/101290773302970159914/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXlcbiDsCkmiHeycmsSrrpHPvTbNcO5RdBpk5h1we2fTRVed516=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 4,
            "relative_time_description": "7 months ago",
            "text": "The Staff are the stars of this Hotel, very helpful and friendly.\nMy room was perfectly clean and comfortable.\nRestaurant on the 19 floor was excellent value and I enjoyed the meals with amazing views.....\nBreakfast was OK, not the best , however, was OK, no real complaints. People complain about the Hotel being a little dated...yes, however its just the decor from that era, still perfectly clean 👌 and the staff are still professional and friendly.",
            "time": 1714139177,
            "translated": false
        }
    ]
}