{
    "name": "J.J. Murphy's",
    "rating": 4.1,
    "reviews": [
        {
            "author_name": "Janko Falli",
            "author_url": "https://www.google.com/maps/contrib/118176374744689101269/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUUgSz7LCXWYM6RvKsxZTBoLtBXOm8dU6mS5VpRwu92gV8B1ipN=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 2,
            "relative_time_description": "3 months ago",
            "text": "I recently visited J.J. Murphy's, and unfortunately, the experience was disappointing. The most notable issue was the incredibly slow service. Despite the restaurant not being overly crowded, it took far too long for our orders to be taken, and even longer for the food to arrive. We had to repeatedly ask the staff for updates, but each time we were met with vague responses and further delays.\n\nWhen the food finally arrived, it was undercooked. The main dish, which was supposed to be the highlight of the meal, was barely warm and lacked the proper texture and flavor. It was clear that it hadn’t been prepared properly, and it left us questioning the quality and care put into the cooking. Unfortunately, this wasn’t an isolated incident, as other diners around us seemed to be having similar issues.\n\nThe overall atmosphere, which could have been pleasant, was overshadowed by the frustration of waiting and the disappointment of receiving poorly cooked food. J.J. Murphy's might have potential, but the slow service and lack of attention to food preparation make it difficult to recommend. I hope they can address these issues, but as it stands, I wouldn’t be in a hurry to return.",
            "time": 1724522616,
            "translated": false
        },
        {
            "author_name": "A350 Airline Pilot",
            "author_url": "https://www.google.com/maps/contrib/101433699355957317907/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjURssm56j-lw1nNAJchgXEKHVEpi3OuujmJlOoqEAXQT88kmb-I=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "Definitely the best place I know in Sofia, to have a quality beer (no fake beer there), especially the Stella Artois is just perfect (served super cold), for less than 10 LEV. The Atmosphere is always amazing with super friendly waitresses. Every time I am in Sofia, it's a must to have some beers there!",
            "time": 1725917752,
            "translated": false
        },
        {
            "author_name": "Michael C",
            "author_url": "https://www.google.com/maps/contrib/112455639197690842104/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVEg_SGYNruIYIBVdybjn9F0w9gZrHdJ6m9956Y_0d6M-g4002kiw=s128-c0x00000000-cc-rp-mo-ba6",
            "rating": 5,
            "relative_time_description": "7 months ago",
            "text": "Popped in for a quick drink. Very nice relaxed atmosphere, definitely a place to go to see sports on the screens. Great selection of drinks at reasonable prices. Service was very good. Well worth a visit.",
            "time": 1713455297,
            "translated": false
        },
        {
            "author_name": "Rory Mc",
            "author_url": "https://www.google.com/maps/contrib/100410645873046969595/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJU2nR9sBvnRbIUNQ6qvR3038xZE1dbCmh6FjUpeDkDqzspDw=s128-c0x00000000-cc-rp-mo",
            "rating": 1,
            "relative_time_description": "6 months ago",
            "text": "Hands down worst Irish bar I’ve ever been to. Over 40 mins to wait for the first round to arrive. Bar only takes cash but can pay card table service? Terribly run establishment with staff who act like you’re an inconvenience. Not a single apology and the “it’s your problem” thrown at us by the staff was very evident, as we certainly had a problem.\nGuinness is terrible too.",
            "time": 1717313249,
            "translated": false
        },
        {
            "author_name": "Victoria L",
            "author_url": "https://www.google.com/maps/contrib/113957408453351649752/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXh4lqZDSL5hb-k48w8N1glcqu7taBn9pitUdsQJha6hT-sUc4=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 4,
            "relative_time_description": "2 weeks ago",
            "text": "After I lived in Ireland for 3 years, this is the place I love to go when I miss the Irish atmosphere. Everything, from the smell, the food and the river of beers remind me of my green island. Mainly populated by foreigners, also prices are pretty high compared to the normal Bulgarian standard.\n\nUpdate: even better in 2024 for brunch",
            "time": 1731936623,
            "translated": false
        }
    ]
}