{
    "name": "Arena di Serdica Boutique Hotel",
    "rating": 4.5,
    "reviews": [
        {
            "author_name": "Arkadi Panitch",
            "author_url": "https://www.google.com/maps/contrib/111133259368636316631/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWwknW5hIRztaI3AURecjk8ZM2TuwXeo9DdOt18VeGURBqVNUAH=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 1,
            "relative_time_description": "5 years ago",
            "text": "Awful experience. Bed is terrible hard. Air conditioning did not work, so it was hot to sleep, and you can not open window because there is a lot of noise. It was dirty: someone cut nails before me, and it was on the floor near bed. The blanket was very hot. The shower was overflowing, and temperature not stable. My requests to provide a mattress topper and a summer blanket were denied.\n\nHotel location is not very convenient. It's not bad, but there are hotels located much better as for instance Intercontinental or Grande.\n\nOverall a hotel that is rather 3* minus level.",
            "time": 1558334870,
            "translated": false
        },
        {
            "author_name": "Muhammad Yaser",
            "author_url": "https://www.google.com/maps/contrib/104542640372090846039/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW79Cv7XCdpnB96Qbl0v_XWyNIeekPOmEKuPUbsnBFm6CT7-3s=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "3 years ago",
            "text": "Nicely furnished rooms - no matter where you went you saw so much amazing art. Staff was friendly and took good care. Good service and friendly staff. Nice and spacious room. An error with my reservation had me waiting in the lobby while the staff sorted out the issue. There was also an issue with my bathroom floor left riddled with black shoe marks and a dirty floor cloth after cleaning servic",
            "time": 1631860186,
            "translated": false
        },
        {
            "author_name": "Colm Downey",
            "author_url": "https://www.google.com/maps/contrib/108417852471363785848/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLBTTg7bumT4OTMzemByW3W9BLnrkXIIqTxP460iRANat3Wfw=s128-c0x00000000-cc-rp-mo",
            "rating": 4,
            "relative_time_description": "6 years ago",
            "text": "I stayed in this hotel for 3 nights, March 2018, and found it to be clean, comfortable and warm. The staff were extremely helpful, pleasant and courteous. Breakfasts were very satisfactory. And the fitness centre was better than most hotels, in that it has an extensive range of weights as well as the 3 cardio machines. I could not fault this hotel, and would be surprised if anyone else could either. Well done Arena di Serdica, and thank you for making my visit to Bulgaria enjoyable",
            "time": 1521820962,
            "translated": false
        },
        {
            "author_name": "Renārs Lūsis",
            "author_url": "https://www.google.com/maps/contrib/101923093342723986410/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocISROWXQVIopP3XgtiSyIuh0goA3MV3HI0Ek5nrHr7zgDYe-A=s128-c0x00000000-cc-rp-mo",
            "rating": 4,
            "relative_time_description": "5 years ago",
            "text": "Nice 5* hotel right in the heart of the city. Close to all main historical city sites, kind service, tasty meals, wide selection of buffet breakfast options, fresh croissants. Spacy rooms. Unfortunately didn't had a chance to use SPA facilities which I trust could have raised my rating. One star that stayed in my pocket this time was for a bit inexperienced and slow service at the counter desk and if you look at the ceilings and shower equipment you expect perfection in cleanliness from 5* hotel, which was not there, maybe a bit firmer pillow would also helped my . But this was very close to max 5* rating and overall I enjoyed my stay here.",
            "time": 1568272924,
            "translated": false
        },
        {
            "author_name": "Mohammad Qasem",
            "author_url": "https://www.google.com/maps/contrib/100590593580450312777/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVdNX37iPomMN37epPwzSFDlOkkHpCqwIljuIXHOgecKDDPfgKx=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 4,
            "relative_time_description": "6 years ago",
            "text": "A long review, but TL;DR: Great hotel, but make sure your stay is in a good time!\n\nWe were on a long trip that ended up in Sofia, and we were looking forward for a relaxing stay for 2 days! Unfortunately, it was not what we hoped for.\n\nThe Hotel:\nThe hotel location is great! Close to many museums and attractions, as well as many nice bars and restaurants. You are a walking distance away from all your needs. The rooms are clean, comfortable, and spacious. The staff (besides the reception) was all friendly and helpful.\n\nThe Restaurants:\nThe restaurant on the ground floor is lovely, the staff is super friendly and the food is awesome. Definitely worth a visit if you are there! The breakfast which also takes place there, was also great and has many local options which we found nice. The terrace restaurant was closed and only opens for occasions.\n\nThe SPA:\nThe SPA was also excellent, not many facilities though (A sauna, a steam bath, and change rooms). No couple massage room which we also found on the down sides, just two separate massage rooms. We had two separate SPA treatments and we were satisfied with both.\n\nWhat could be better:\nMainly the reception. We had mixed feelings and it depended on the person working there, some where friendly and helpful, and some, not much.\n\nThe first issue was with the transfer to the airport. Our reservation included a transfer to the airport, and I asked about it at the check in, the reception informed me that we will deal with it later. The second day at night, I ask again. The reception tells me that I have none. However, they informed me that they will make sure anyway and let me know later. That got me worried. I asked again the third day, the reception informed right away that yea, we do have a transfer. The second issue is in the details below.\n\nWhat was bad:\nAs I mentioned, our stay was about relaxing for 2 days before we head back home. Unfortunately, that was not the case the first day. We arrived early April and the temperature was higher than usual (~22 degrees IIRC).  Our room was on the second floor, it was a suite of two rooms and both had a long window spanning the wall facing the street where the sun is most of the afternoon.\n\nWe go into our room around 13:30, we shower and decide to take a nap. The windows and the AC were off. 1 hour later we wake up full of sweat in a really warm room.  The curtains were closed and no sun was in (except for a small part on the edges which you can't cover with the curtains, which was the case in both rooms). That caused the room to heat well! I tried to turn on the AC but that was not working in one room, and in the other, was working in fan only mode. It helped a bit but not enough. I looked at the thermometer and it was 31 degrees inside the room.\n\nI tried to open the windows (you can only open one third of the windows and partially anyway) and turn on the fan only in one room, that got it down to almost 28 but no further. Plus, it was a bit noisy to keep the window open on the street side. I call the reception, they inform me that the AC season did not start yet, and advised me to turn on the fan only mode in the AC. I told them that I did and it did not help, but I felt they had the attitude of \"live with it\". It went back and forth, saying that one room the fan does not work at all,... etc.\n\nI was so frustrated and about to snap, I had the though of just sleeping in the hall way since it was much cooler. Eventually, the receptionist tells me \"I could upgrade you to another room\", frankly I didn't care about an upgrade or a downgrade, as long as it was a room with smaller windows (less sun) and away from the street. Fortunately that was the case.\n\nAt night the temperature dropped and we managed to cool the room down with the windows open. However, we had an issue with mosquitoes! Wasn't a good night at all. The second night was much better.\n\nI feel it is not fair to give the hotel a very bad review based on that experience. But it sure definitely was not a good experience for me. Still I really enjoyed the restaurant and the SPA.",
            "time": 1524577559,
            "translated": false
        }
    ]
}