{
    "name": "Hotel Rival",
    "rating": 4.4,
    "reviews": [
        {
            "author_name": "Riane F",
            "author_url": "https://www.google.com/maps/contrib/117941237404215953249/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLHMdgoyiaeDw7w18mN3Ho6HvYCIqRl1fIK_ADTA1MhxF8DbA=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "We LOVED this hotel and were so glad we stayed here rather than the north part of Stockholm, which we were considering. Location was amazing--a quiet and authentic part of Stockholm but a very close walk to metro stations and other areas of interest. Beds were so comfortable and shower pressure was amazing. The made-to-order items at breakfast were so good we had breakfast there every day (which we ordinarily wouldn't do), and staff were so courteous & welcoming. It's just a gorgeous, historic hotel. Would stay here again for sure!",
            "time": 1725109834,
            "translated": false
        },
        {
            "author_name": "Geoff R",
            "author_url": "https://www.google.com/maps/contrib/109161342539444957438/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVEF8370jrER_oKNJ1EHrOcmZp7Mad8TyBvPKGso6EfENlq23o=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "3 weeks ago",
            "text": "We stayed at the Hotel Rival over the summer in early August and really enjoyed it. The location is very nice, right next to a pretty park heavy on trees, statues and a central fountain. If you have kids, there is a wonderful, unique, immersive fountain park where they can play in the water just outside of a neighboring church (there’s also a small beer hall there for adults). The neighborhood is very walkable and hip with lots of nice restaurants (food from all over the world) and cafes. The staff at the hotel were very accommodating, especially of our 1 year old. The rooms were clean and well decorated with a nice view and balcony over the park (careful if you have young ones though). I loved the shower as well, very high water pressure and sleek design. The hotel is also “cool” and attracts a night life to the art deco bar (we enjoyed having a drink there while our young one played), but overall it’s a quiet stay and almost residential feel. Occasionally there are loud car noises outside the window at night. Overall highly recommend, it’s also a short walk uphill 5 minutes to a beautiful look-out over the old town Stockholm.",
            "time": 1731101282,
            "translated": false
        },
        {
            "author_name": "Larry Marshall",
            "author_url": "https://www.google.com/maps/contrib/103937018659365376370/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKoKRZEADtFexN5yc8JsDAHa2D55FevLO1mmIWRHyy-TBhneA=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "We recently spent 2 nights at the Hotel Rival in Stockholm. This is a hotel you do not want to miss. From arrival to checking out we had nothing but praise for the staff and the hotel Front desk staff were warm and welcoming and always asking if they could be of assistance. The room was very modern, clean and spacious. They offer a wonderful breakfast with a large selection of buffet items and the ability to order from the menu. The location is perfect. You are in the middle of Stockholm neighbourhood with easy access to parks and places to dine. You can easily walk to Old Town or take the metro. The metro station is a 5 min walk away. We will stay here again when we return to Stockholm.",
            "time": 1727181840,
            "translated": false
        },
        {
            "author_name": "Adam Berger",
            "author_url": "https://www.google.com/maps/contrib/103999784119808162302/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ0R6epMFq0UDm5q69SWCrpk5IB1cCh3fkveacdSUSFNWxgWg=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "Everything was wonderful.  Front desk staff Michelle, Joel, Mailin, and others, made us feel welcome and appreciated.  They provided restaurant recommendations and reservations we really appreciate.   The room, and the bed were very comfortable.\n\nThe included breakfast is the best hotel breakfast we have ever had, and staff there were great too.  Such wonderfully curated and excellently prepared choices.\n\nAny future visits to Stockholm will include a stay at Hotel Rival.",
            "time": 1726566214,
            "translated": false
        },
        {
            "author_name": "Rachael Ward",
            "author_url": "https://www.google.com/maps/contrib/118051516585693691447/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIlLwarHtMuUpQXuN37-fECd2775woy7IdlraL8QO_E948oNA=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "We had wonderful friendly reception on checking in, we couldn’t have been made more welcome. The room was beautiful, comfortable, clean and spacious. Room service prompt and delicious. The Reception Manager was incredibly helpful and helped us make the most of our stay in Stockholm.",
            "time": 1724168528,
            "translated": false
        }
    ]
}