{
    "name": "Scandic Klara",
    "rating": 4,
    "reviews": [
        {
            "author_name": "Anders Løkke",
            "author_url": "https://www.google.com/maps/contrib/117132721788376678285/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWeVTKukvsUGyCBLR7NGJw0XnJzoUHMs8ZS5G7bL2xazG6kAAvB=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 4,
            "relative_time_description": "a month ago",
            "text": "Centrally located and easily accessed from station or via car. Clean rooms, mine was a single and very small, but very quiet and nice. Breakfast buffet was a little untidy, and staff should have kept more tables clean - this happened all of the three mornings I stayed there, making it harder than expected to find a nice spot to sit. Otherwise would recommend.",
            "time": 1728799450,
            "translated": false
        },
        {
            "author_name": "Yahya Akyel",
            "author_url": "https://www.google.com/maps/contrib/108220872131162964867/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL07TFNmstgpAmA5jpq7paZY_uEIARK5bm27I3o71SzhE1KQg=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 4,
            "relative_time_description": "4 months ago",
            "text": "The hotel's location was fantastic, right in the heart of Stockholm with easy access to restaurants, shopping, public transportation and cultural sites.  The room was clean but small.  It is even difficult to find places for your luggage and clothing.\n\nThe highlight of the hotel was its breakfast.  The breakfast is served at the atrium.  The area was bright and airy with plenty of seating options.  Self-serve buffet style breakfast has many different food stations.  From classic continental options like pastries, fruit, and yogurt to a full-fledged hot breakfast with eggs, bacon, sausage, and pancakes, there's something for everyone. They also have a dedicated section for those with dietary restrictions, offering gluten-free bread, dairy-free milk, and vegan options. It is a delicious and satisfying start to the day.  If you decide to stay in Scandic Klara don't miss their breakfast.  I highly recommend.",
            "time": 1722341551,
            "translated": false
        },
        {
            "author_name": "Andy Andersen",
            "author_url": "https://www.google.com/maps/contrib/100255764131072056943/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUbeG5VW9EY0iUwDh_pvXnjfsUZxUhTnBvO_hvQhoaakPLjDOcq=s128-c0x00000000-cc-rp-mo-ba8",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "Overall this is a really nice hotel. It is centrally located and walkable. About 10-15 minutes to old town.\n\nRooms were incredibly spacious, immaculately clean. (Added a video)\n\nThe breakfast was really nice, diverse and hearty.\n\nThe gym and sauna were a big plus for me. I could a morning workout/sauna.\n\nWould definitely recommend.",
            "time": 1724582858,
            "translated": false
        },
        {
            "author_name": "Timothy Berger",
            "author_url": "https://www.google.com/maps/contrib/116919567976649693220/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWVReKnHvx0NYII6N9XKcngHmn-xk8iy4p3AVYSvYIRslG0xpDl4Q=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "4 months ago",
            "text": "This hotel was an ideal base for exploring central Stockholm. The room was comfortable and clean and the staff were all friendly and courteous. The hotel is set on a side street, eliminating any street noise. We heard nothing from any of the rooms; based on the heavy, solid doors, I suspect everything is pretty soundproof. The luggage storage was secure, convenient and no extra charge. On arrival, we dropped our bags in storage after landing at Arlanda at 9:30 am, then taking the Arlanda Express into the city. (Check in was not until 3). The day we left, we checked out and again put our bags in storage until 9 pm, when we retrieved them prior to catching an overnight train.",
            "time": 1722174715,
            "translated": false
        },
        {
            "author_name": "Ryan A",
            "author_url": "https://www.google.com/maps/contrib/112037624371259227320/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLRmYuBeiockxY9osaTIf457LUB7rAwOtq00QNWwCPowHpl=s128-c0x00000000-cc-rp-mo",
            "rating": 1,
            "relative_time_description": "5 months ago",
            "text": "I spent 1 night in Scandic Klara hotel. I enjoyed the facility but woke up with bed bug bites all over my body.\nI quietly brought it to the front desks attention, not to disturb or concern others that were checking in.\nStaff came to inspected my room and determined that there were bed bugs that had been there for some time.\nI have now spent 8 days in severe discomfort from this incident and they would not offer me a refund.\nBed bugs can come from anywhere, but the fact they knew the bed bugs were there prior to my stay and would not offer a refund was very disappointing.\nI would paid 2x the price of that room to avoid the discomfort and pain that I continue to experience.\nI am not one to leave negative reviews, but felt I need to share this experience.",
            "time": 1720030955,
            "translated": false
        }
    ]
}