{
    "name": "Clarion Hotel Sign",
    "rating": 4.2,
    "reviews": [
        {
            "author_name": "PL Lau",
            "author_url": "https://www.google.com/maps/contrib/108671385992214123453/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX_kjCx3N7Oe5EIg03qgHTSqYbHJ9Dr8h6_hZbfJqZYWeYejkv9=s128-c0x00000000-cc-rp-mo-ba6",
            "rating": 2,
            "relative_time_description": "in the last week",
            "text": "Clarion Hotel Sign: A Modern Stay with a Few Quirks\n\nClarion Hotel Sign in Stockholm offers a prime location right next to the station and in the heart of the city center. The spacious rooms, with their contemporary design and ample workspace, are perfect for both business and leisure travelers. The hotel's quiet ambiance creates a serene atmosphere, ideal for getting some work done or simply unwinding after a long day.\n\nThe breakfast spread is impressive, offering a wide variety of options to cater to different tastes. The friendly staff in the restaurant and reception add to the overall positive experience.\n\nHowever, a few minor issues marred our stay. The bathtub drain proved to be problematic, with water overflowing onto the floor when the plug was removed. While the staff was accommodating in offering a room change, the inconvenience of having to move rooms for two days was certainly frustrating.\n\nOverall, Clarion Hotel Sign is a decent choice for a stay in Stockholm, but it's essential to be aware of potential maintenance issues that could impact your experience.",
            "time": 1732924545,
            "translated": false
        },
        {
            "author_name": "Doi Recamara",
            "author_url": "https://www.google.com/maps/contrib/104464225840335312844/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKHGZj6LE1yNOGlGipMwdqiZGv93689FXmyjrLClZwX19V7Jg=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "★★★★★\n\nI've had the pleasure of exploring Sweden for the past four years, and I couldn't be happier with my experience. From the moment I moved in, the front office manager named Nita and staff have always been nothing short of amazing. They are always friendly, helpful, and quick to address any concerns I may have.\n\nOne of the standout features of this property is the maintenance team. They are incredibly skilled and always respond promptly to any maintenance requests I submit. Whether it's a leaky faucet or a malfunctioning appliance, they are on top of it, ensuring that everything is fixed efficiently and to the highest standard.\n\nAdditionally, the grounds here are beautifully maintained. We partied at the bar. They have such delicious meals (not just delicious) but they have more options.\n\nOverall, I highly recommend this property to anyone looking for a place to call home. Great maintenance, awesome front office staff, and beautiful grounds make it a five-star living experience!",
            "time": 1725632489,
            "translated": false
        },
        {
            "author_name": "piyush aggarwal",
            "author_url": "https://www.google.com/maps/contrib/115057038236798756909/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKOTeofSf5MDxJGfNwTaTuPJ1RRkkLvSSgCbHVkpy1ekKPp4Q=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "The property location is very close to the central station and bus station. The family room was very spacious and beautifully designed. The reception staff is very polite, friendly and helpful. The breakfast buffet was extravagant with multiple options and a great variety. Excellent stay and excellent service",
            "time": 1730274719,
            "translated": false
        },
        {
            "author_name": "Sundaram Mallik",
            "author_url": "https://www.google.com/maps/contrib/109004541950228352701/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJKQtIiVmJd_GefuOv6bKKQiRYSxy89nsh8NVyi2lpv8jld7w=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 4,
            "relative_time_description": "2 months ago",
            "text": "Love this hotel, one of my favorite in Stockholm. The view of the park, the large window, the lobby cafe, everything about this hotel is yummy. The gym is limited. But the location is great, walking distance from the central station.",
            "time": 1727878300,
            "translated": false
        },
        {
            "author_name": "KG FL",
            "author_url": "https://www.google.com/maps/contrib/107930023878743794976/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUYO8Lu0dheTBe2HjWrHdnfTyn1j-TqSg91hYZE6iWUhypf3oNC=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "4 months ago",
            "text": "Spacious rooms, perfect for working, very silent area, friendly staff in the restaurant and reception, breakfast is great with super friendly staff. My only critique is that they should serve draft beer in the roof top bar. Going back again next week..",
            "time": 1722076107,
            "translated": false
        }
    ]
}