{
    "name": "Mornington Hotel Stockholm City",
    "rating": 4.2,
    "reviews": [
        {
            "author_name": "D1030",
            "author_url": "https://www.google.com/maps/contrib/106928722812737125766/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIpaAqefMMFiaQC3vLV4fR9AIGs2pPf4KVRTsGNgViTV-T1dg=s128-c0x00000000-cc-rp-mo",
            "rating": 4,
            "relative_time_description": "3 months ago",
            "text": "Great location. Train/Metro Station about 2 blocks away if you don't feel like walking.  Market not far.  Hotel is very nice and our room did have character. Unfortunately, our room was street-side and I'm a light sleeper.  There was some late night noise.  Every morning we were there, before 8:00AM, there was a recycling truck. You may get woken up by the tumbling of glass bottles. I did ask the front desk where I could purchase a fan to help with white noise & they provided one for the room immediately. Lifesaver! Room didn't have AC, so it was a little stuffy (mid-August). Refreshing to see a lot of socializing in the lobby throughout the day, more so after dinner. Breakfast is busy, but we could always find a seat.",
            "time": 1725584866,
            "translated": false
        },
        {
            "author_name": "Victoria 88",
            "author_url": "https://www.google.com/maps/contrib/100012386329862713147/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJiQH-VdbfELLPN8EWVeE-oeGdnh1huLOY8a5RLvTMiAKN0nktB=s128-c0x00000000-cc-rp-mo",
            "rating": 2,
            "relative_time_description": "3 weeks ago",
            "text": "Basing my review on this being a 4* hotel: You need earplugs. Single glazed windows. The bin lorry noises people share are real. The hairdryer is terrible (I find the quality of hairdryer says a lot about a hotel). Every morning I had to use the Health Gyms shower (room shower not 4*) and hairdryer as I had business meetings and needed to look professional. Bathroom is a wet room. No one cleans your room (I stayed three nights), kettle in room so old that I didn’t use it and I’m British! Breakfast was so mediocre to be honest, basic options (fruit, toast, cereal, cheese/ham), again I’m basing this on previous 4* hotels I’ve stayed in and you’d at least expect someone ask if you want a cappuccino vs having to use a flask to get a black coffee. I feel very bad leaving this review but I really, really was so underwhelmed by this place. Thank goodness it was a work trip otherwise I’d have asked for a refund. What did I like? The lobby looks great and I was safe in my room at night as a solo traveller.",
            "time": 1731225270,
            "translated": false
        },
        {
            "author_name": "Maiia Chernova",
            "author_url": "https://www.google.com/maps/contrib/103582513583103090777/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI8lAFZ8NvY0wcn3O24E32YKTFfwlZXISOYeQf61oT0o1E7=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "4 months ago",
            "text": "The hotel is located 10 minutes walk from the city centre on a pleasant, pedestrian street. The hotel has its own individual, unique style.  The staff is quite friendly. The managers are pleasant to talk to and very professional in their work. I especially liked communicating with manager Natalie. Service from Natalie is at the highest level!\nThe breakfasts are also worth mentioning. A lot of varied, fresh and quality food.  In summer it is a pleasure to have breakfast in the quiet courtyard. Also, several times we ordered dinner in the hotel restaurant and drinks in the bar. Everything was delicious!\nI am sure we will stay there again on our next trips ))) I recommend it!",
            "time": 1722205673,
            "translated": false
        },
        {
            "author_name": "Karin Lane",
            "author_url": "https://www.google.com/maps/contrib/109060881570808754078/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI4bVDChJK6diG0EUrwN4Ac6S6Uzzi_L9f6fa24-7mNz8pDrQ=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "An excellent stay.  The bed was very comfortable and it was so pleasant to have a hotel room that was not too hot, so we could actually sleep!  The service was helpful and polite and the breakfasts good.  It may be hepful to have some sort of sign over the cold meats, saying that the hot food is next door for us who aren't quite there in the morning,  but that is a mere quibble, especially as most people don't read signs.",
            "time": 1729968012,
            "translated": false
        },
        {
            "author_name": "dbajune",
            "author_url": "https://www.google.com/maps/contrib/105911417031034246907/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJOE9D9yZ3DGTkZJcmKI90R-wyk1f8ljxFRw2mMisQ_o5C24g=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "Excellent location next to all the trendy bars but somehow still quiet at night. Rooms are nicely decorated and clean. Good selection of breakfast though it's always crowded so hard to find a seat. We stayed for two nights but no one cleaned our room.",
            "time": 1729246103,
            "translated": false
        }
    ]
}