{
    "name": "Clarion Hotel Amaranten",
    "rating": 4.1,
    "reviews": [
        {
            "author_name": "Simon Adelman",
            "author_url": "https://www.google.com/maps/contrib/114704613660822481700/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUvGMOGc-7PQL_ge7oTZ6MmH3kKANalFqVLFzoRkp6X7iCIuKhZSQ=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 4,
            "relative_time_description": "2 weeks ago",
            "text": "It's a nice hotel in the centre of Stockholm, very convenient for the central station and subway. The bar and restaurant is modern and a nice place to eat and drink. Sadly the rooms really let it down. The rooms are small, they feel basic, and the beds are poor. It's a shame, because otherwise it's a great hotel.",
            "time": 1732178515,
            "translated": false
        },
        {
            "author_name": "Ley Csro",
            "author_url": "https://www.google.com/maps/contrib/110866654034677508228/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJwoD-6gtkrEBh269qGkXKosdLpuXmcSvRT7Wwu5VCoZu8JqQ=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a week ago",
            "text": "The location of the hotel is next to the subway station and a 1-2 minute walk to Coop grocery store! The interior of the room is nice and cozy! Love the breakfast buffet and the dinner menu at the hotel restaurant.\n\nElevators get busy at around 10AM (during our stay) so you might need to wait a few more minutes to get down to the lobby or up to your rooms.",
            "time": 1732710463,
            "translated": false
        },
        {
            "author_name": "E R",
            "author_url": "https://www.google.com/maps/contrib/115444237760451565995/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKH__yZiKCe9sVUQpdDi5r1BqB3AbQ_eY8Jv_XOgwwWnLRlZQ=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 4,
            "relative_time_description": "a month ago",
            "text": "Excellent breakfast and very friendly and welcoming staff. The location is good, as everything is within a 25 minute walk or you can take the metro, as there is one right next to the hotel, which can get you to the central station in 1 stop. However the rooms need to be cleaned better as there were visible stains on the walls and the beds, and uncleaned dirt and dust on the floor.",
            "time": 1730506414,
            "translated": false
        },
        {
            "author_name": "Juan G",
            "author_url": "https://www.google.com/maps/contrib/112110833158244229381/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI2iEOFhjoGhOBlbJ6_BrdYtda7qONTWdwVpVtdXYYES2Dc_w=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 4,
            "relative_time_description": "2 months ago",
            "text": "The overall experience was good in this hotel. The location is quite convenient if you want to be close to the blue line of the metro. The breakfast was very good, in line to what you would expect in a 4 star hotel. One thing to note from the room is that it didn’t have a safe.",
            "time": 1727706560,
            "translated": false
        },
        {
            "author_name": "Briony B",
            "author_url": "https://www.google.com/maps/contrib/107018067521070114999/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIHymgOOWXF1T6IuxdbPcgmooWh3QrpXttucy1k-zB4xn0pJw=s128-c0x00000000-cc-rp-mo",
            "rating": 4,
            "relative_time_description": "5 months ago",
            "text": "Overall great hotel. Location is great, right next to a tube station but it only has steps and an escalator so if you have a wheelchair or a pram it’s no good (we tried another exit too which took us to the top of the hill with more stairs).\n\nWe booked a superior double as supposedly this was the only room that took a cot. The borrowed cot was charged for, and wasn’t in good condition (had holes in the sides). It wasn’t set up when we arrived so we had an overtired baby and nowhere to put her :(. The staff also had no idea how to set it up so we had to figure it out ourselves. The room itself is very small for a ‘superior’ and I can’t see any difference between the normal double, so don’t waste your money upgrading! There is no kettle in the room so we had to request one, and the first one was broken (it was night at that point so we couldn’t get it replaced till the morning), so be aware if you are counting on this to make up baby formula.\nI believe that we also had an older room as it had carpets (instead of the pictured parquet flooring). The carpet was pretty grim and needed a wash. The beds were comfy (but again expected a double instead of two singles pushed together for a superior!) and the bathroom was nice despite our shower leaked.\n\nThere was also issues with the lifts. There are only 3 for the entire building, one is too small for one pram on its own, and one was out of order (it trapped us in the lift when the door didn’t open)…the lifts were always busy! Breakfast time is horrendous, easily the airing 10-15 minutes for a lift with a pram.\n\nAll in all, they are pretty small faults although I have no idea what was meant to be good about that room type, not convinced it was a superior. Location great, staff are lovely and speak English.",
            "time": 1720283600,
            "translated": false
        }
    ]
}