{
    "name": "Schlössle Hotel",
    "rating": 4.7,
    "reviews": [
        {
            "author_name": "Garry S",
            "author_url": "https://www.google.com/maps/contrib/105315446006075927746/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLaE9cexk2iesXVVNi5OMXYI795N4gVOsgJkxJEbskNSbyiAg=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "3 weeks ago",
            "text": "Originally had a standard room with a small double bed. The room was nice but a little small. We paid for a room upgrade which came with a larger bed. It was cracking and well worth a little more money. The staff were brilliant, the hotel was spotlessly clean. The hotel was full of personality and the breakfast was amazing. It the middle of old town with restaurants nearby. We absolutely loved the place. Hope to return next year for Christmas.",
            "time": 1731100874,
            "translated": false
        },
        {
            "author_name": "Luke Proctor",
            "author_url": "https://www.google.com/maps/contrib/103892910624505172523/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKqeUDC_GvEv6yUFl5X9tb379ywsr5hiXHsGmouqZpSD5ZHUw=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "Magnificent charming hotel in the heart of Tallinn!\n\nI was given the free upgrade to the Presidential Suite, which I really appreciated - not least because it happened to be my birthday at the same time. Also appreciated the sweet treats and sparkling wine in the room. Really made the day that much better.\n\nStaff throughout our stay were really nice, particularly Vadym, who is more than a consummate professional.\n\nIn all, I thought this was a very impressive hotel and I would certainly like to come back in the future!",
            "time": 1728293205,
            "translated": false
        },
        {
            "author_name": "Edric van Vredenburgh",
            "author_url": "https://www.google.com/maps/contrib/100525763919057677017/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLO-AeM4UMwsyDJkM9CeGTkOgamdkZ1RqTeMbViNXpHEJvHUw=s128-c0x00000000-cc-rp-mo",
            "rating": 1,
            "relative_time_description": "2 weeks ago",
            "text": "The attitude of this hotel was a Disgrace, one fully understands if you cancel less than 48 hours before arrival one is charged but if you only booked 4 hours before arriving and they expect you to cancel 48 before is asking for a miracle. The reason we cancelled was the said they had secure parking we then had a message to say they did not but there was public parking near by when we called they more or less said TO BAD YOU CANCELLED LESS THAN 48 HOURS BEFORE ARRIVAL. As we had stayed at about 7 hotels using Booking.com we were charged through them using my credit card . WHAT A DISGRACE BY BOTH THE HOTEL AND BOOKING.Com",
            "time": 1732100153,
            "translated": false
        },
        {
            "author_name": "Kari Nixon",
            "author_url": "https://www.google.com/maps/contrib/117865968762327599541/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ28PBOhvsNkp5Mtw5rxUwDRzhtQHktNanWVs8Y5MmsHuew5Q=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "When I say the Hotel Schlössle felt like home away from home, I mean it. And when you can have that “home away from home” feeling in a 5-star hotel—where luxury just feels like a cozy fireplace and a wonderful meal, instead of fussy refinery inaccessible to us regular folks? I think you’ll understand why it was my favourite hotel stay of my entire life, no exaggeration whatsoever.\n\nI think there is something to the fact that the staff has the creative freedom to make special touches for guests that cycles back to employee happiness in their job (they aren’t just expected to check boxes and act as automatons) that makes you really feel like the enjoy being there for you! They truly don’t seem to mind the acts of service that make up the 5-star hotel experience. From the pillow menu (yes, a PILLOW MENU), to the arctic hot tub experience, where you can order drinks at the spa, to the teddy bear turn-down service they offer to children…I got the distinct impression that their freedom to make the experience customized for each guest allowed them to lean into the parts of their job that made it enjoyable and fun, which put me so at ease as a guest!\n\nThe rooms were impeccably maintained and the warm, cozy fireplaces I all the main areas, combined with candlelight made the 13th century bones of this building (yes, you read that right!) feel warm and inviting, like a place that had never lost its hospitality for a moment, even after 800 years. All of this, right in the heart of Old town Tallinn, with impeccably clean rooms and by far my favorite hotel breakfast—ever, hands down—and you will want to RUN and book this affordably priced hotel as fast as you can.",
            "time": 1727866178,
            "translated": false
        },
        {
            "author_name": "Sabau Daniel",
            "author_url": "https://www.google.com/maps/contrib/112932794662653197709/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLAsaLtqozew5JC_-OkTo07dtdCXho8R1vCcgNFJ72b3ImQ8w=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 1,
            "relative_time_description": "2 months ago",
            "text": "I have stayed for 2 nights în this well situated 3 star hotel. Without elevator în a 3 floor building, I am amazed they got 5 start. I was în the biggest room, presidential suite, the room was smelling upon arrival very bad, at 1 o clock the receptionists kept us 30 minutes to check the IDs that were already sent by the agency! I recomand it if you are looking for a central 3 star hotel, with quality shower gel and shampoo!\n\nLater edit: As I cannot reply to your comment, I will write here for the ones who read, at a distance of 50 meters, there is an old building, the post building, that has a newly built-in elevator inside. So, your excuse is not quite good. And about the lists for the group, for the checkin, I inform you that the people who arrived at 1 am, were not running away and the details could be filled în next morning. But as I have told you, your team is not very polite and guest oriented. About smoking, I still do not know any proofs, and room 21 the people who were sleeping there are not smokers. So, be careful also with yhe fines as you can fine all your guests upon your imagination! Very nice approach!",
            "time": 1727864190,
            "translated": false
        }
    ]
}