{
    "name": "Restoran Olde Hansa",
    "rating": 4.5,
    "reviews": [
        {
            "author_name": "Stephen Ragell",
            "author_url": "https://www.google.com/maps/contrib/108429653866905803381/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjURMAKl24xTV7lXUm3OddWTZJ2t7RZmi5FGzWS8aj3cnknWhJUs=s128-c0x00000000-cc-rp-mo-ba6",
            "rating": 5,
            "relative_time_description": "in the last week",
            "text": "Olde Hansa certainly has to be one of the more unique restaurants I've visited and as a result it's a great experience for tourists visiting Tallinn!\n\nWe booked in advance and went with the Grand Chef's Feast, which is served to the table but unlimited and you can get refills of whatever you want. In practice however it was a lot of food in the initial round anyway so we didn't end up ordering any refills.\n\nThe food was good and true to their mission of only serving foods available prior to the 15th century. No tomatoes, potatoes or any other new world foods to be seen here! We also tried two of their beers, a cinnamon beer and a honey beer. I really liked the cinnamon beer, it was only a subtle flavour and quite nice.\n\nService from the staff was friendly and started really well however got a bit slower as the restaurant filled up with the lunch crowd.\n\nBe sure to visit the bathroom, it's part of the medieval experience as well. Pro tip, the soap is in the little bowl next to the taps.\n\nAt almost €70 each including drinks it is an expensive meal but it is an interesting one and so filling that we didn't need dinner after. If you are short on time or don't want a big meal I would suggest sticking with the a la carte menu instead of the feast.",
            "time": 1733137596,
            "translated": false
        },
        {
            "author_name": "Silvia",
            "author_url": "https://www.google.com/maps/contrib/100603315673403918823/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXi9eIyUKIaxxZw3tfcgONdDb4SF4ZVltc26Y8IfrjH_ohavBKf=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a week ago",
            "text": "I had an amazing experience at Olde Hansa, a restaurant with a medieval theme that is exceptionally well-crafted. The ambiance transports you back in time, with detailed decorations and a warm, candle-lit atmosphere.\n\nThe food was absolutely delicious. I tried a vegetarian dish with turnips, and it completely exceeded my expectations. The flavors were rich, unique, and memorable.\n\nThe staff were fantastic—they fully embraced the medieval theme, not just with their costumes but also with their friendly and immersive attitude.\n\nHighly recommended for anyone looking for a unique dining experience paired with great food and an unforgettable atmosphere.",
            "time": 1732487329,
            "translated": false
        },
        {
            "author_name": "Julius Bubnys",
            "author_url": "https://www.google.com/maps/contrib/115469319567014036144/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXxASUaz3wA7-05NAkV9pShaS5haTn2xkJQu3HAz1aD9E6ACpDNBA=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 4,
            "relative_time_description": "in the last week",
            "text": "Cool experience. Nice ambiance. Felt like we were in the medieval times. Servers were great and in character and we loved the food. However I was extremely disappointed that we couldn't get a take away box for the Christmas feast leftovers. We ate all we could until we were sick but we couldn't finish all the food. Apparently it's not allowed to have a leftover box from the feast, but you can have a left over box from the ala carte menu. Which doesn't make sense because we spent 75 euro a person, and the chef set the servings. I'd understand this rule if it was a buffet, but it wasn't a buffet. The servings were too big and it was a waste of food because we couldn't pack away the leftovers. A shame. We also ordered 5 drinks each, we spent a lot of money. The least they could do is allow leftover food to be taken home. Nonetheless I would still recommend. The venison was tender, the spiced wine very nice. We enjoyed.",
            "time": 1732892561,
            "translated": false
        },
        {
            "author_name": "Dobrawa Róg",
            "author_url": "https://www.google.com/maps/contrib/112042516032698373819/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWtsrTGoHLSANrvo2HfNdd_qkfuhH9HVsg_7GAih2_dRKGQ2Ybw=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "Highly recommended! Located in the old town, is styled to transport you to the Middle Ages. From the moment you enter, the medieval interior, candle-lit tables, and dim atmosphere make you feel like you've stepped back in time. The staff, dressed in authentic medieval clothing, add to the immersive experience. Even the restroom is designed to match the theme, which was a delightful surprise! Plus, it's pet-friendly, making it a perfect spot for all. The unique ambiance, excellent food, and helpful staff ensure a memorable visit. I’ll definitely be returning!",
            "time": 1725796253,
            "translated": false
        },
        {
            "author_name": "Gaston D'Apice",
            "author_url": "https://www.google.com/maps/contrib/114085726315966526561/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV5H-oyc24iJnCWy2nE6y9l0PhY_3nYZmjBwz-QOiRvK2D2Q6Ae=s128-c0x00000000-cc-rp-mo-ba6",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "Step Back in Time at Olde Hansa – An Authentic Medieval Dining Experience!\n\nOlde Hansa in the heart of the old town is a truly unique and highly recommended experience. From the moment you walk in, you are transported to the Middle Ages. The medieval-style decor, dim lighting from real candles, and candle-lit tables create an atmosphere like no other. The staff, dressed in authentic medieval attire, further enhance the immersive experience, and even the restrooms match the theme – a delightful and unexpected touch!\n\nThe restaurant is also pet-friendly, making it a perfect choice for all visitors. The food was simply amazing, with traditional dishes that reflect the historical setting. We had the bear dish and the flavors were remarkable, paired with their medieval beverages.\n\nAlthough the prices are on the higher side, the experience is well worth it. Between the exceptional food, attentive service, and one-of-a-kind atmosphere, it’s an experience you won’t forget.\n\nI’ll definitely be returning to relive the magic of this place. If you’re looking for an unforgettable dining experience that takes you back in time, Olde Hansa is the place to be!",
            "time": 1726631528,
            "translated": false
        }
    ]
}