{
    "name": "MammaMia Clazz Restaurant",
    "rating": 3.4,
    "reviews": [
        {
            "author_name": "Ani S.",
            "author_url": "https://www.google.com/maps/contrib/104010573008852148516/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXqtQnJ7jQ2yIp3ATqGjYgoecoHLJEPWPcfte1kavwcwlJWbNrl=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "4 months ago",
            "text": "We were a bit late and a lot of other places were already closed. I had also very specific ideas in regards to food and just wanted to have a cheese plate with some wine and enjoy our last evening in Tallinn. So we ended up here as they had a cheese platter on offer, had cider and were still open (we arrived at 9:40 pm).\nIt was a real treat: the staff was very friendly and helpful. And when they didn't have something they recommended something similar. The other people seemed to enjoy their pizza. We had in the end a bit more than planned, but that was ok. I recommend the cheese - it was good.",
            "time": 1720902969,
            "translated": false
        },
        {
            "author_name": "Ali CHABANI",
            "author_url": "https://www.google.com/maps/contrib/111414740413452817012/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV8TNKYTNiJ3Ml68fwfF00rE73l9k42rCltCHRnRzzNr_f5Fif7=s128-c0x00000000-cc-rp-mo",
            "rating": 1,
            "relative_time_description": "3 months ago",
            "text": "I’m shocked by this experience at a restaurant that should be avoided at all costs. I walked in without checking the overall Google rating because I was hungry and craving Italian food. I ordered a salmon pizza, but what I received was nothing close to a salmon pizza. For an Italian restaurant, that’s really strange! I spoke with the waitress and shared my disappointment, though she didn’t seem too pleased. But seriously, avoid this place at all costs! My pizza had just a few tiny pieces of salmon, and there was no sign of crème fraîche or mozzarella! Where are we living? I ended up paying €21.50 because I also ordered an apple juice. These are Parisian prices, but at least there, you get quality! Avoid this place! For a country like Estonia, these prices should be more affordable. It’s really excessive.",
            "time": 1724348716,
            "translated": false
        },
        {
            "author_name": "Big Fish Dive Club",
            "author_url": "https://www.google.com/maps/contrib/106843142746248472991/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUK-1slAsBK0wrY3vtI32_Mc85DmISyetkM3I0QQQU-8SlBoohf=s128-c0x00000000-cc-rp-mo-ba6",
            "rating": 3,
            "relative_time_description": "6 months ago",
            "text": "The pizza was just okay, not that good and yet not all that bad. The risotto was the same, just okay. The service was okay as we had a larger group with the first young lady that looked way over worked, but later a second young lady came over to help and she was much more amiable. The bathroom was clean but you have to walk down a narrow stairs to use it. It’s okay for a quick rest before finishing our day tour of Tallinn.",
            "time": 1717160637,
            "translated": false
        },
        {
            "author_name": "Melek Özel Akyüz",
            "author_url": "https://www.google.com/maps/contrib/110527604232918653214/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUXNNDIhb8L9jHD63G71Q9yL8SduWBoMw3imNR1Hys1D7vaBjmhTg=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 3,
            "relative_time_description": "4 months ago",
            "text": "Maybe it got its name from Italy, but the products were definitely not Italian, an uncooked pasta arrived cold. The staff doesnt seem happy at all, I dont recommend it. It is a bad Italian restaurant. Italians would cry if they ate here!",
            "time": 1723030991,
            "translated": false
        },
        {
            "author_name": "Jii Aalto",
            "author_url": "https://www.google.com/maps/contrib/108147818483937241180/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXS6fPzNiG_sKM-wfrCRtEDEcxWmQbVu5opO9dqAVgSWThBtAn04g=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 2,
            "relative_time_description": "a year ago",
            "text": "Our group eat lasagne and pasta carbonara, both not so good. Vine moderate, As well as the charcuterie/cheese plate taken as appetizers. We now know why there were no bookings :(",
            "time": 1683402799,
            "translated": false
        }
    ]
}