{
    "name": "Hestia Hotel Europa",
    "rating": 4.4,
    "reviews": [
        {
            "author_name": "Natalia Li",
            "author_url": "https://www.google.com/maps/contrib/106472961985482786459/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVKZzIohIqGIOK31-t8onbg2C_2lWLQPbbpszxbkI_ITBiq_t_n_g=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "We stopped in Tallinn for 1 night before going to Helsinki by ferry, hotel location for this was excellent: just 5-7 min walk from the terminal. There is also a shopping center right across so that is also great. Walk to old city center is about 15-20 min but it's ok & manageable.\nStaff was exceptional, very polite & helpful. We also got a free room upgrade (I guess they were overbooked on our room type) which was also a great way to handle overbooking & we're grateful for this.\nBreakfast was fantastic with a lot of cold cuts, vegetables, fruit, ice cream(!), herring, salmon, meat, porridge, pastries & desserts, few kinds of juices, an espresso machine, teas, etc. Very good breakfast for the foodies.\nStorage room is very secure & staff locks it - thank you!\nView over a harbor & boats was a very nice touch & was relaxing.\n\nI wish we stayed longer, it was truly a great hotel experience - thank you so much!",
            "time": 1725272005,
            "translated": false
        },
        {
            "author_name": "Joan Savage",
            "author_url": "https://www.google.com/maps/contrib/103351072832289418834/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXdNQHN_Lb9mkElYPctPu-bGxXZ3hG1FOpXwORfk-lr0RSYWr95yw=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "This hotel is in a perfect location. Great view of the city and the port from our balcony. Having a balcony was great and we could have coffee and drinks there too.\n5 mins walk from the port terminals and 10 mins from the city. Modern hotel with comfortable beds and clean bathrooms. Breakfast was very good. Only thing missing was poached  or fried eggs! Do take a day trip to Helsinki - the ships are like cruise ships! The hotel gave me a complimentary fruit platter and bottle of rhubarb fizz for my birthday- thank you!\nI highly recommend this hotel. 😀😀",
            "time": 1723623905,
            "translated": false
        },
        {
            "author_name": "Rafal KOTUL",
            "author_url": "https://www.google.com/maps/contrib/103059125341627752614/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVgcQcxPbttAHsPVoDQzMKqn3oo487gy6XGJXZak2tfOqTHR3RJ=s128-c0x00000000-cc-rp-mo-ba6",
            "rating": 4,
            "relative_time_description": "2 months ago",
            "text": "This was my first stay in a hotel of the \"Hestia Hotel\" group and I must admit that I am very pleased. The hotel met all my expectations, everything was as in the offer, and even better. Check-in (and check-out) very efficient, fast and hassle-free. Service at the reception very nice, smiling and helpful. Clean room, equipped with everything a tourist like me needs (TV, Wi-Fi, safe and fridge), with a large comfortable bed, large windows and a view of the marina. Clean bathroom, with a bathtub and shower, with a sufficient supply of towels... everything you need:)\nI must say that the breakfast buffet here is really varied and sufficient for anyone who needs to eat a good and filling breakfast. Big appreciation for local fish dishes for breakfast!\nThe advantage of the hotel is the location close to the ferry terminals and really not far from the Old Town!\nGenerally, everything in this hotel worked as it should and my stay was successful thanks to it, so I will gladly recommend this hotel to others.",
            "time": 1726679257,
            "translated": false
        },
        {
            "author_name": "Dim076",
            "author_url": "https://www.google.com/maps/contrib/115093561873497858582/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVtR5-EpXj2AbfjjiNwIS8A6sTBlq6dQxeuYmS-EKoN2ntkHQ=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 4,
            "relative_time_description": "a month ago",
            "text": "Nice hotel.\nIts located near the tallinn port where ships for helsinki depart.\nIts almost 10.minute walk from tram stop.\nThere is a shopping mall almost two steps.\nStuff was nice ans helpful\nRoom was big enough(always travel.alone).\nClean.comfy and with all amemeties.\nThere is also a small friedge in the room\nMy room.had view on the harbour!!\nBreakfast good enough.\n\nOverall a very good choice",
            "time": 1729180027,
            "translated": false
        },
        {
            "author_name": "Ariel M",
            "author_url": "https://www.google.com/maps/contrib/108676571253530746168/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWbTCx_MWERosOwh3onEYWItdRY3A5ngTNqaAocI8Odc45Zyx0=s128-c0x00000000-cc-rp-mo",
            "rating": 1,
            "relative_time_description": "2 months ago",
            "text": "Beware! Reception people were ones of the most unpleasant and disrespectful people I got to meet in any hotel. There's not one single room in this hotel that has air-conditioning and they lied about it to us, it was stifling hot. There is no bin in the room. There are no water bottles given in the room, or anything in the mini bar. The shower water current resembles a leak rather than a current. There was not enough soap and shampoo. The beds and pillows are rather hard and not comfy, but I personally slept fine. These claims about the hotel conditions were echoed across our organized travel group of 35 people. As a 30-year-old who travels a lot and doesn't really care too much about hotel conditions and could sleep it off - this hotel is BAD. It's maybe the first negative review about a hotel I've ever written, but this one's worth it. I implore you to stay away.",
            "time": 1726814541,
            "translated": false
        }
    ]
}