{
    "name": "Kalev Hotel",
    "rating": 4.2,
    "reviews": [
        {
            "author_name": "David Valen Aadland",
            "author_url": "https://www.google.com/maps/contrib/113341340162396661441/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUj8Y02tyqYEFwgf5Y1GiMKByOhodcdq_WfWIljmNbtcyhLY7Quqw=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 4,
            "relative_time_description": "in the last week",
            "text": "We really enjoyed our stay here.\nThe hotel is located on the outskirts of old town in a fairly quiet area.\nThe breakfast buffet was good,\nThe pool area was nice,\nOur kid (1yo) loved the toys room.\n\nWe got no WiFi in our room, but “when in Rome”.",
            "time": 1733075962,
            "translated": false
        },
        {
            "author_name": "jonna",
            "author_url": "https://www.google.com/maps/contrib/109301761747619722010/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ5KaY4cLX7Wxt_g5s3eLXpCFLgnKLluNPPS1g7AneNwwspYA=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 3,
            "relative_time_description": "a month ago",
            "text": "This was OK and nice Spa hotel. The waterpark side is essentially nice with families with kids. The sauna Oasis side is nice for adults without kids, but the sauna Oasis side is little bit small especially the pools were small. The staff was very nice, kind and helpful. The hotel room in the 1st floor was little bit noisy in the night with the car traffic outside. The location is perfect. The car parking was quite bad so recommended not to come with your own car. The hotel room had little bit stains in the shower and some black hairs in the bathroom sink. The hotel felt like nice 3 star hotel rather than luxury 4 star hotel. Everything was working and was as agreed. Next time I will choose the same price ratio hotel Metropol spa hotel.",
            "time": 1730734202,
            "translated": false
        },
        {
            "author_name": "Anya M.",
            "author_url": "https://www.google.com/maps/contrib/105159918094368973829/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXLU-cnUbNZv76TK9onp8vRxYfuH_y5XLX4DbYr-aEsFfRsRxmB=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 3,
            "relative_time_description": "4 months ago",
            "text": "Great location of the hotel, spa is mediocre. Super warm inside, feels like no air circulation. Two dangerous water slides, everyone from our group got injured riding them. Small kids enjoyed little pool with little slides.\nGym is good, even though some of the machines didn’t work.\nPictures look much better with better rooms, but none of us got “these” type of rooms. ))\nThey provide you with one towel per person for spa and then they expect you to use it in your room, a bit strange but ok.\nMake sure you bring your shampoo conditioner and lotion, because nothing is provided except for two boxes of hand soap, one in a shower and second one next to the sink.\nHeard a lot of good reviews about breakfast, but nobody was a fan of it, it was okay, had some stomach ache after consuming their hot chocolate.\nNo fish no seafood, nothing like that was at the breakfast\nSome eggs, scrambled eggs, sausages/ bacon and porridge, Some dry pastries and that’s it pretty much. Location is definitely good, 5-10 minutes walk to everything around the hotel, old town, nice restaurants and a mall.\n\nOverall okay experience but nothing wow",
            "time": 1721038514,
            "translated": false
        },
        {
            "author_name": "Krišjānis Rērihs",
            "author_url": "https://www.google.com/maps/contrib/103036074904363584975/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKCaXsr4UbxQWZ5PJOXGeyq0-Eo1OQPVW30PC-gJVcr47YdOLLv=s128-c0x00000000-cc-rp-mo",
            "rating": 3,
            "relative_time_description": "in the last week",
            "text": "It's not a 4-star experience.\nThe hotel and its rooms are outdated. Staff was not very welcoming.\n\nBreakfast - ok, yet a bit crowded around 9 am.\nRoom - ok, yet wc was outdated, standard room was quite small.\nWater park - some of the jetstreams did not work, and on the last day, steem sauna was out of order.\nWelness  - no slippers provided, not very welcoming feeling. The massage table was loud, and the massage experience was not very relaxing.",
            "time": 1733068578,
            "translated": false
        },
        {
            "author_name": "Juli A K",
            "author_url": "https://www.google.com/maps/contrib/117506589680036773539/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUrqkAocdP-b7xsLJV8HKxyHgiz7Ln7MgllVauQ8Wc_y-3qSi-3TA=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 4,
            "relative_time_description": "2 months ago",
            "text": "The hotel is great and really pays attention once you made them aware. The initial check in process was not ideal but eventually the reception manager paid a lot of attention and made it all up to us.\n\nWe're having a great time, we love the food and the beach and it's the holiday we hoped for.",
            "time": 1727550783,
            "translated": false
        }
    ]
}