{
    "name": "Stephen Center Restaurant and Coffee Shop",
    "rating": 4.4,
    "reviews": [
        {
            "author_name": "Lisa Appadurai",
            "author_url": "https://www.google.com/maps/contrib/108420370370646521194/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLjDTDYb6A4V7-3ifbCGwgD0VTF5yE95wb9PzuMd07IJM0-Cw=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "What an absolute gem of a place this is! Manager Katie was so helpful to me prior to my arrival, answering my queries and arranging airport transfers and a day trip driver for me.\n\nThe welcome was warm, rooms are basic but spotlessly clean and comfy and the communal lounge had everything I could wish for in order to fully enjoy my stay.\n\nThe breakfast was served in the adjoining restaurant and was very tasty.\n\nLocation-wise, perfect for getting around the city centre sights on foot so easily!\n\nI would definitely recommend Stephen Center.",
            "time": 1727378517,
            "translated": false
        },
        {
            "author_name": "Mišel Kašel",
            "author_url": "https://www.google.com/maps/contrib/104675774994997965075/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU5rzJjoiPI_lovMMmXIrja0XeEhaB88NUgEXxzYuNtOzrg6z3w=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "I have fantastic experience with this restaurant. The waiter was nice, he spoke good English and he was quick in everything. We were here around lunch time, the restaurant wasn’t full, two tables outside and inside like 7 tables tops. I ordered club sandwich with fries on the side and salad. The salad came first and I was surprised by the portion. I expected a lot smaller amount. For me this portion was absolutely full filling (sandwich, fries and salad) and it was very tasteful. We tried also quesadillas and some meat with potatoes. Also perfect. The portions were big and the prices are way good for these portions. So I recommend this place and this restaurant is also in a very good location!",
            "time": 1725358871,
            "translated": false
        },
        {
            "author_name": "Esi Mirçe",
            "author_url": "https://www.google.com/maps/contrib/104285998734410422011/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJIZt2bpP8uRKD4zqRMMPcyqxtHzmNAIx2rGQr7Bb6GIf3c=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "I had a fantastic breakfast here today.\nThe food was absolutely delicious, easily the best I’ve had in a long time. The service was warm and welcoming, making the experience even better. I was excited to leave a review about how much I enjoyed it, but when I checked the existing reviews, I was surprised by the negativity from some people. I’ll never understand how certain individuals feel entitled to damage a business’s reputation so easily.\n\nIf you have a concern, speak to management, ask for a refund, or request that your meal be replaced. If, after all that, you still feel unsatisfied, then sure, share your experience to help others. But this approach of jumping straight to a negative review feels unfair and impulsive. Businesses work hard, and sometimes mistakes happen. I believe giving them a chance to make it right is the more reasonable thing to do.",
            "time": 1724529645,
            "translated": false
        },
        {
            "author_name": "Diana Aguilar",
            "author_url": "https://www.google.com/maps/contrib/111744838084096988003/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWxAD3rYujroU2dGyT--OKnT86_6NVD0WxBLEYNij3p0A8__l6Z=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 4,
            "relative_time_description": "a month ago",
            "text": "Found this place on a quest for a good breakfast in Tirana. Nice atmosphere, distinctly empty by 11am in comparison with nearby businesses. The prices are standard, has WiFi. Had a cheese and mushroom omelette and a small water. The water was more expensive than normal (100LËK) but the food pricing was ok.",
            "time": 1730197360,
            "translated": false
        },
        {
            "author_name": "Armejsa Kullolli",
            "author_url": "https://www.google.com/maps/contrib/106997882544400431959/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXNKpO1R1ufUDCrIDFvQFoYT9w7sgKr-4Au0XX3sPm_p2BDtPDQ=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 3,
            "relative_time_description": "3 months ago",
            "text": "Stephen Center is one of our most frequented places in Tirana. We do have some specific dishes we order and enjoy them as they are always delicious, but there is this problem we will never understand even after two years of dining here. The food is late almost every time. No matter if the restaurant is full or just 3 sitting tables. I don't remember having our salad in less than 20 minutes, ever. There have been times we have waited longer than 45 mins. Not once or twice, many similar situations. I have given myself the chance to wait for this review as I would love to be as positive as possible, but it is unacceptable that the service is missing a lot. Hopefully things get fixed!",
            "time": 1725107561,
            "translated": false
        }
    ]
}