{
    "name": "Hotel Broadway",
    "rating": 2.4,
    "reviews": [
        {
            "author_name": "Duckarmy Atack",
            "author_url": "https://www.google.com/maps/contrib/104376194356773478503/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW0SZcKYDggK54eVY4koCU1rKo8ichJcBZYPu-7kLzY5vNCabc=s128-c0x00000000-cc-rp-mo",
            "rating": 1,
            "relative_time_description": "4 weeks ago",
            "text": "Terrible hotel. First scammed us online with the platform saying it was €20 then asked us for €35 more to get the room. Toilet was broken, no blanket and the one they brought us was dirty and unwashed. Furthermore at midnight they came to the room and asked for an additional €20 because there was another person inside. At all other hotels you pay for the room not the number of people. Plus additional €10 for breakfast.\n\nHowever the staff were friendly and understood that what they were asking from us was silly. They were polite and kind. They only doing their job.\n\nI’d suggest just get an AirBnB or go to another hotel.",
            "time": 1730983395,
            "translated": false
        },
        {
            "author_name": "Rasmus Askloef",
            "author_url": "https://www.google.com/maps/contrib/114877093934771747213/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLwdwcSnD3XIYM8N6SJnPiHZXy2B0YaU4ENcCUDCuqNCkuijBo=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 1,
            "relative_time_description": "a month ago",
            "text": "VH Hotel Broadway unfortunately receives only 1 out of 5 stars. Our stay was filled with several disappointments, particularly regarding hygiene. The towels and bed linens were in unacceptable condition—they were stained and did not feel fresh, giving the impression of poor cleaning standards. There were no shower curtain nor a bath mat. Some of the lamps could not be turned on, and the curtain to the bedroom was also broken and could not be closed properly, so people could look into our room. Additionally, the rooms were dilapidated and in need of serious maintenance. They do not not like the pictures online at all\n( I have add'ed pictures of this)\n\nWe did not eat the breakfast, but heard from several other guests at the hotel, who were extremely disappointed.\n\nTo make matters worse, the hotel charges a significantly higher tourist tax compared to other hotels in the city, which feels unjustified given the overall poor quality of the facilities. I cannot recommend this hotel and would advise others to seek better alternatives in the area.",
            "time": 1729968590,
            "translated": false
        },
        {
            "author_name": "Enio Gjerga",
            "author_url": "https://www.google.com/maps/contrib/107907256655315285793/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUKBc3obUljSyCfWgWr0goG73W7iWGeox-UYcPvmQh3QyLc28zc=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "I am not sure why this place gets many bad reviews. The communication during the checkin and checkout was always nice, rooms were clean, the location is very central and rather quiet. I evaluated with 5 stars because it exceeded my expectations for the total amount of money paid.",
            "time": 1725078473,
            "translated": false
        },
        {
            "author_name": "Dennis KimYYZ",
            "author_url": "https://www.google.com/maps/contrib/117894615351580718333/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLPFb6uT7ZTgrEU4FrKrgzqWoDMWNdTWuIW59E_izAJk_Qm_g=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 1,
            "relative_time_description": "3 months ago",
            "text": "The photos are from when the hotel was brand new because it doesn't look anything like the photos.\n\nThere is no pool. The outdoor patio area is in shambles. No breakfast was included, which was the norm at the other two hotels I stayed\nin Tirana and Duress. This was probably a good thing because based on the rooms, I would have been afraid to eat there.\n\nThere are stains everywhere. On the chairs in the room, on the sides of the bed, and on the walls. There was a little toiletry caddie in the bathroom, where the metal hardware was all rusted. The only toiletry was one small shower gel and no soap. Their towels are air dried so they feel like sandpaper when drying yourself. There is no housekeeping for a  multiple day stay.\n\nThe only thing that was a positive was the price and it's proximity to the Bloc District, but I was contemplating using my Marriott Bonvoy points after the first night. I can't imagine how this property would be able to meet the standards of most women, unless they live in a pigsty themselves. I showered with my flip flops. Enough said!",
            "time": 1724531502,
            "translated": false
        },
        {
            "author_name": "Ignasi Casas",
            "author_url": "https://www.google.com/maps/contrib/103210161029806694687/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWb5Z3hiX9Q8oN_f7Na9YrrJp_uOSXag8z1Y6wRGn5ce_NH0faj1g=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 1,
            "relative_time_description": "2 months ago",
            "text": "We arrived in Tirana on September 3, after booking the trip through Logitravel last April, and we immediately obtained the confirmation.\n\nThe first stop was this hotel in the city's center, then continue to Berat, down to Sarande and the Albanian Riviera, up and overnight in Tirana the night of 7 to 8 September, and then go to Shköder.\n\nWhen we arrived at the reception of this hotel (21:00h) they told us that there had been a system error, that it was not working and that they would have to relocate us to another of their hotels (Hotel Broadway). At all this, the hotel was full and our reservation was for April 2024!\n\nThe poor receptionist was transferring us the messages that, from behind a divider, was given to her by the person in charge of the reception, who did not even deign to give us an explanation. This was an unfortunate experience, since the other hotel was 3km away and not exactly well located. They wanted to charge us 25 euros per person for the tourist tax per night. Come on, neither Venice nor New York charge these amounts per night.\nIn any case, at the Broadway Hotel we were asked 3 times if we had consumed anything from the mini bar. After saying no, they went up to look at it as if we were cheating them.\n\nAvoid at all costs if you can. In the end we had to return the night of 7-8 September and decided to stay in Vlöre and make our way to Shköder along the coast. I don't give it 0 stars because Google doesn't let me.",
            "time": 1726395105,
            "translated": false
        }
    ]
}