{
    "name": "Bujtina e Gjelit",
    "rating": 4.4,
    "reviews": [
        {
            "author_name": "Jan Piskacek",
            "author_url": "https://www.google.com/maps/contrib/113164612293506451285/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVv0x3BLmnR4PwYRbzBRIvopcGXs0yUI2m1qACzlEobSmAfx9257A=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "Well, sometimes five stars are not enough. This is the case. From super-friendly staff to clean and unusual hotel itself (in a good way) to amazing food on grill, turtles and pool it was overall fantastic experience. Thank you!",
            "time": 1723149099,
            "translated": false
        },
        {
            "author_name": "Geoff de Burca",
            "author_url": "https://www.google.com/maps/contrib/100953209269436585401/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVjtZhzDTFebBpa3wOWSfZ8O_pTyP2sIgri0qe2sbzqYV_3MWiX=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "One of the highlights of this hotel is the lovely courtyard with a pool, providing shade a spot to cool down on a hot day. The rooms are quiet and comfortable, and the breakfast buffet extensive.",
            "time": 1726046232,
            "translated": false
        },
        {
            "author_name": "Helder_visuals",
            "author_url": "https://www.google.com/maps/contrib/112348490935391230880/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWnSgPKz6p5zOabXIT9nkWnW6yV1poV4CdPC_VhUTUFBcehuolu6Q=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 2,
            "relative_time_description": "4 months ago",
            "text": "My girlfriend and I were excited to stay at Bujtina e Glejit, expecting it to be one of the highlights of our trip through Albania. The hotel appeared promising, especially with its advertised restaurant serving grilled meats and a nice swimming pool in the middle of the hotel—a perfect setup for our son, who was looking forward to a swim after a long day of travel in 40°C heat.\n\nWe arrived at the hotel around 4:30 PM and immediately asked about the pool hours, being told it closed at 8:00 PM. Feeling reassured, we headed to the restaurant for a meal, only to discover it has been closed  for the last two months due to a lack of customers. This was quite disappointing as the restaurant was one of the main reasons we chose this hotel.\n\nAfter finding somewhere else to eat, we returned to the hotel at 7:30 PM, expecting to enjoy a quick dip in the pool. However, we were informed that the pool was already closed. Despite our earlier confirmation that it would be open until 8:00 PM, the staff explained that if the pool is empty, they close it early, which was not mentioned before.\n\nMy girlfriend argued our case, explaining how much our son had been looking forward to swimming, especially after such a hot day. Unfortunately, the staff were not flexible and didn't allow us to use the pool, which was a major letdown.\n\nThe rooms were cozy, but the misleading information about the restaurant and the pool significantly marred our experience. Given this, I'm afraid we won't be returning to Bujtina e Glejit. I hope the management addresses these issues and updates their website to reflect the current situation accurately.",
            "time": 1721574394,
            "translated": false
        },
        {
            "author_name": "L S",
            "author_url": "https://www.google.com/maps/contrib/113839075595228289792/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKhgUiYOKV6VbYWAR2-Xcc1BZMuf5_Q2tIgvm5nmCeT1OgKOQ=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 3,
            "relative_time_description": "6 months ago",
            "text": "Young staff friendly, located in a nice neighbourhood with good restaurants- bedroom clean with good mattress, wifi poor in room though good by the pool but with only sun beds for comfortable seating! - there are dark dusty areas/ rooms on the second floor that you have to access to get downstairs which could be cleared out and brightened!! Breakfast was varied but foods I would like hot were served cold- like the pool but then again it’s the time of the year! Paid €200 for 3 nights which was sufficient 👍",
            "time": 1715402353,
            "translated": false
        },
        {
            "author_name": "artan ravmanoski",
            "author_url": "https://www.google.com/maps/contrib/106809835752356988693/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWcpiaALbzGJwmU4-kfg2jR-8IZP0yorLYMOfncnjYnNivHs8C-=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "9 months ago",
            "text": "I was referred by a family member. It was described  as rustic, warm and very welcoming. With traditional Albanian food and proper aged steak. Well I was not disappointed. The staff, and Aziz the manager were more than welcoming. The food was great and the aged steak was cooked over wood. A great experience and will definitely tell my friends about it.",
            "time": 1709323814,
            "translated": false
        }
    ]
}