{
    "name": "Tirana International Hotel & Conference Center",
    "rating": 4.2,
    "reviews": [
        {
            "author_name": "Ramo Mazreku",
            "author_url": "https://www.google.com/maps/contrib/106804174068513720569/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK6YfjUaP-kUbPw6FJvSv-mHhZi7a36tf7lQd2apnCUtFgZlQ=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 2,
            "relative_time_description": "3 weeks ago",
            "text": "Its passable for one night stay. The only positive thing this hotel has is the location and the view in front of Skenderbeu Square and near most Attractions. Despite asking for a newly renovated room, I got the old one. Hotel room and bathroom was quite old and worn and the soundproofing is not good. Outside noise and the noise from neighbours can be heard quite a lot.",
            "time": 1731258770,
            "translated": false
        },
        {
            "author_name": "Ana Golja",
            "author_url": "https://www.google.com/maps/contrib/107379728569283461953/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ-Fv1nB2ZWg-sqjl9cm7CFX1TYqlMUE_0XGIINOIGV_DkEnA=s128-c0x00000000-cc-rp-mo",
            "rating": 2,
            "relative_time_description": "4 months ago",
            "text": "I’m not one to write negative reviews but after my experience at this awful hotel, I had to do my part to warn future guests of what to expect. I’ve travelled the world and stayed in everything from hostels to super luxury 5 star hotels — the customer service at this hotel was THE worst experience I’ve ever had in my life.\n\nAside from a bad check in experience (waiting in line forever and lack of communication skills), the hotel itself is old, dirty and has a terrible odour. However, given the affordability and good location, I was willing to look past that.\n\nI extended my stay by one night due to a change in travel plans and was ensured by multiple staff members that all was fine. When I returned to my room on the evening of my second night, my room had been completely emptied. Without as much as a phone call or email to notify me.\n\nThe arrogant, rude, disrespectful night receptionist (older gentleman with glasses) spoke to me in a tone that was beyond awful. He claimed I had no reservation booked for a second night, even though I was assured by multiple staff members (day of check in AND following morning) that it was booked and paid for(hence why my key card still worked).\n\nNonetheless, I offered to pay for the room AGAIN (figured I could clear it up with management the next day) and he insisted the hotel was fully booked and that I remove my belongings right away.\n\nAfter I decided to leave and retrieve my things from their storage room(god forbid he helped me with that either) he said I could pay for another night, even though he had JUST claimed there were no rooms available.\n\nI travelled all of Albania and had only wonderful experiences for a whole month… to have my last night spoiled like this was beyond disappointing. This is NOT what Albanian customer service looks like.\n\nDo not stay at this hotel.",
            "time": 1721649637,
            "translated": false
        },
        {
            "author_name": "Ei Phyu Phyu Thant Zaw",
            "author_url": "https://www.google.com/maps/contrib/108705204455532985782/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWPHfBMFuOczPc-X0BNy6goyJPkaNXJgWT0xOtPIEiXmgh5xRUm=s128-c0x00000000-cc-rp-mo",
            "rating": 4,
            "relative_time_description": "2 months ago",
            "text": "Great location. Can go to many restaurants within a few meters. However Rooms are old and worn down. The bed is stiff and can feel sprains inside. The bedding and pillow sheets are worn down after many years of usage. This hotel needs to renovate most of its facilities.",
            "time": 1725989447,
            "translated": false
        },
        {
            "author_name": "Jay J",
            "author_url": "https://www.google.com/maps/contrib/105444997937719113726/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUGZXJ0sJyG0oN8lEdOfRAIDbzLzw1AtrUqusKR8lfVhYa4LEky=s128-c0x00000000-cc-rp-mo",
            "rating": 2,
            "relative_time_description": "2 months ago",
            "text": "Location is decent, views from up top are good, it's a decent hotel for the price. Rooms are a bit \"meh\", but all the par for this price range. Staff aren't great - a simple room change request was met with Olympic level unhelpfulness (well, more like a blatant lie which was only resolved after I challenged her comments). If you are a relatively chilled traveller this should work for a night or two. But due to the negative staff interaction I rate this as below average.",
            "time": 1725700289,
            "translated": false
        },
        {
            "author_name": "P O London",
            "author_url": "https://www.google.com/maps/contrib/102003948128816892803/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWU4nPxrCiJXng2UujEe3Soq0p4b7DG3wbT_Ydc51Ljc4YfptzEJg=s128-c0x00000000-cc-rp-mo-ba6",
            "rating": 4,
            "relative_time_description": "3 weeks ago",
            "text": "Conveniently located hotel on Skanderbeg Square and only minutes away from the major attractions including Bunkart 2, Opera and museums. A short walk from the airport bus and buses to the bus terminal for travelling around Albania.\n\nThe hotel is clean with a light lobby, restaurant and rooms for event. Located next to the casino.\n\nBeds are comfortable and rooms are well equipped with a minibar. Rooms are not the most modern in Tirana but they are a reasonable size, have excellent views over the square and a desk if on business or to work on a laptop.\n\nStaff do the job they need to do and are neither friendly or unfriendly with the exception of the cleaners who give a smile. Staff could be more knowledgeable about giving advice about the area and it would be good if you could book tours through the hotel.\n\nWiFi sometimes cut out but was very good when working.\n\nPrices are reasonable for a central location.",
            "time": 1731170116,
            "translated": false
        }
    ]
}