{
    "name": "Prince Hotel",
    "rating": 3.8,
    "reviews": [
        {
            "author_name": "Køśťą Ñťįńö",
            "author_url": "https://www.google.com/maps/contrib/111563302466979441168/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUgeQ9K3l2E7Gpj-Mq4ctlckG-EVywzYsjHgLmSXK0cjwiejlfjKw=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "I was very lucky some guys found me this hotel , I arrived at Tirana late night 23:00+ and I went to a different hotel but it was closed, by walking around I found a different hotel \"doanesia\" but they were full, and the guys in reception called this receptionist and asked him if he had any room available and I was lucky he said \"yes I do\" I walked 500meter down and found the hotel, I have to say the receptionist was very friendly and after I walked to my room few hour later I was hungry and I didn't knew what was open and what no, the receptionist even know a number from a place I could order a take away\nThank you very much for everything!",
            "time": 1728930975,
            "translated": false
        },
        {
            "author_name": "Marsilda Dakaj",
            "author_url": "https://www.google.com/maps/contrib/113321115832956790675/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ_9M3Tairf7zcBJmLri38iSu_1ZW8VIlCo4p2ZEb8bvCtOYw=s128-c0x00000000-cc-rp-mo",
            "rating": 1,
            "relative_time_description": "4 months ago",
            "text": "So the rooms are good But the service was terrible. It is family oriented and they did not have a good connection with each other. We had booked  2 room but our flight were delayed so we didn’t get to the hotel tell 3am. So I had asked the guy at the front if we can have a late check out like 1pm due to the fact that we have 4 little kids and we wanted them to sleep. And he said yes. But then in the morning the owners mom can at 11 and told me that I have to get out And was not saying it in a nice way. I told her the other guy told me I can stay tell 1pm. So there was no Communication between them too. Then I asked her if I can book 1 room for the day to leave my stuff because I am headed to a different city and just want to leave my stuff tell later in the day and she said yes and I paid for the for that day. But  throughout the day different family members asking are you stay are you staying as if the is the first time I have stayed in a hotel. And if you have kids stay away. They are very mean to kids to the point they told me I should spank my 2 year old for touching there flower and ripping some petals off. I was in shock. Tell me that that United States families raised the worst kids. Even Made my baby girl cry as she was saying sorry. You go to the lounge to get some drinks with the kids and they say why are you here instead of what would you like. Do not recommend them ever.",
            "time": 1721485034,
            "translated": false
        },
        {
            "author_name": "Hanna Dubrouskaya",
            "author_url": "https://www.google.com/maps/contrib/105404570587032871258/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVY4D-uefePw8iMw1pk0EEW8Q5oZLc4alfzL992Jvb30PSmag=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "6 months ago",
            "text": "The hotel is located very close to North and South bus station. My room was clean and comfortable, especially the bed. Nice and delicious breakfast. I want to thank the staff as they are very pleasant and helpful, patient and friendly. Overall my experience was great there.",
            "time": 1715761689,
            "translated": false
        },
        {
            "author_name": "Florian lala",
            "author_url": "https://www.google.com/maps/contrib/116575972698362893243/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIMxmVK65iUXAsbG087S_goKlbF17Rw5nLyN_nC3_rABHY2aRMe=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "4 weeks ago",
            "text": "It was a nice Hotel. I would recommended to all the visitors in Albania.",
            "time": 1730852037,
            "translated": false
        },
        {
            "author_name": "Faisal Arain",
            "author_url": "https://www.google.com/maps/contrib/117723499363376273398/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKCInH3FBm8j4RqWt-hY62fgXA4naUdockNx4clstg_P1uLAg=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 3,
            "relative_time_description": "3 years ago",
            "text": "The beds were very comfortable but I was getting strange vibes from the place. I am. Not exactly sure. There is a restaurant and Cafe inside the hotel as well that serves decent food. Owners were nice. They did not charge me for my last coffee",
            "time": 1635362644,
            "translated": false
        }
    ]
}