{
    "name": "Hotel Boutique Kotoni",
    "rating": 4.6,
    "reviews": [
        {
            "author_name": "Dertrez P",
            "author_url": "https://www.google.com/maps/contrib/102072892328097714708/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUkozlarzU_-SCPuqwDp11nYJI0gVB0DMrcsPR47pOhimgzPtX5=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "5 months ago",
            "text": "I Was in Tirana for a conference and the hotel some of my colleagues (from other parts of the US) stayed at was booked. That 1st hotel was able to assist me in booking a room here at the Boutique Kotoni and I'm very grateful they did.  I was the only only person from Vegas so in a manner I was traveling solo.\n\nThe hotel itself is on the smaller size so there are not an unreasonable amount of guess, which for me is prefect. It's located pretty much in the center of the city so it is surrounded by nearly every amenity you might ask for. It is within a 5 to 10 minute walk from parks, bars, lounges, restaurants, Ice cream shops, and the pyramid where the conference was being held.\n\nThe interior of the hotel was modern. Even my colleagues commented on how it looked much nicer than the hotel they stayed at lol. The hotel rooms were well set up, clean upon first entry, and overall felt peaceful. There is no bar or mini fridge but for me it was not needed. The service of the staff was 1st rate. In particular Ann, Orgta, and Era.  They were personable, kind, and never once had any attitude even though I asked a million questions and several request.  I needed my suits pressed for the conference and even though laundry service had past they were able to accommodate the same day. I extended my stay by 2 day before leaving.\n\nBreakfast was served each morning from 7 to 10 or 10:30 but it was much better than your standard centennial breakfast. There is a covered outdoor patio and a bar to order drinks from along with some lobby seats on the main floor and 2nd floor.\n\nI would definitely recommend this hotel, and if I end up in Tirana, Albina again, I will stay at this hotel.",
            "time": 1719438565,
            "translated": false
        },
        {
            "author_name": "Pauline Claes",
            "author_url": "https://www.google.com/maps/contrib/115359061699469566025/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKZ-gLT8eWbn5Y7XTfikfUcSwIfjNS054DHZlgFxfhDKNTGGAw=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "5 months ago",
            "text": "We had a wonderful experience! The location is excellent - close to almost everything you want and need. The staff was extraordinarily friendly and helpful at all times. Would 100% rebook and recommend.",
            "time": 1717910474,
            "translated": false
        },
        {
            "author_name": "AL-MUTHANA AL-HARBI",
            "author_url": "https://www.google.com/maps/contrib/110657826209036125396/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLrXlUDyXGHgGQhZVGS4vp794qO9FkeYtkQIMBMKaecQ0cCh1U=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "5 months ago",
            "text": "One of the best hotels , the rooms are clean and nice , the staff is very very friendly and welcoming, and the breakfast is good but not the best ; but in all I totally recommend staying the hotel",
            "time": 1718813357,
            "translated": false
        },
        {
            "author_name": "Ann Elliott",
            "author_url": "https://www.google.com/maps/contrib/109876504290572104509/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUDVe8vs3u_YUL9Y9xm0Ig4Vem9lpXY1XKa2ccSCYnwOdBokfs=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "2 years ago",
            "text": "Great location, updated lovely room, excellent king bed, super clean and great breakfast. What’s even better are the people who run the hotel. It definitely has a family boutique feel. Everyone is so willing to make your stay perfect! Ms Bardha was exceptionally nice and helpful. The evening desk host was also amazing. He gave us great recommendations and provided us with some historical facts of Tirana.",
            "time": 1656491826,
            "translated": false
        },
        {
            "author_name": "Lisian Kastrati",
            "author_url": "https://www.google.com/maps/contrib/110960030557406159782/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJanheaGZco6JCQCZEZ0RXYvc0AoAmmN8HB4xig3oTYS1Or0g=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 5,
            "relative_time_description": "2 years ago",
            "text": "The hotel is located in the center of Tirana's nightlife. The Skenderberg Statue (center of the city) is only 600m far away. To Tirana's hottest night life spots its only 300meters. The Hotel it self is very quite, while its located in a safe corner, in front of the one of Albanians Courts. So the area is more than safe for you.\n\nTho rooms are super clean and big. The bed  very nice and comfortable.\nThe bathroom is super clean, and also with a whirl pool.\n\nThe food is delicious. High Quality breakfast and lunch (dinner I did not try)\n\nThe Owners, Customer Service, Cleaning Ladies, Reception, were super careful and generous. Thank you very much for this amazing time!!!\n\nYou can also work there, since there is enough place. You can also connect the TV with your Laptop, to extend screens.\n\nThank you very much Kotoni Team!\n\nBest",
            "time": 1652124996,
            "translated": false
        }
    ]
}