{
    "name": "Tre Galline",
    "rating": 4.4,
    "reviews": [
        {
            "author_name": "Jeanne Neylon Decker (Traveltawk)",
            "author_url": "https://www.google.com/maps/contrib/104410127253254555217/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIDrZ27SX_tthnoTnscyDMHPFiT8rGlglAkA1QO8BBE8XCXtA=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "Tre Galline is classic Piemontese cuisine at its best. There's a reason this restaurant has been here forever!  The service, ambiance and food are all top notch. Everything on the menu sounded so good we had trouble choosing, but were delighted with all of our choices. The agnolotti was amazing-- perfect pasta with just the right amount of sauce. The beef was also incredible-- cooked to perfection. My husband had the rabbit and was very happy. We were too full for dessert but Marina  brought us a little sweet treat anyway. I will be back on my next visit to Torino for sure. Be sure to book a table --it's essential!\n\nYou need to ring the bell to enter. Leonardo will welcome you in.",
            "time": 1726093034,
            "translated": false
        },
        {
            "author_name": "Carlos Ferreira",
            "author_url": "https://www.google.com/maps/contrib/103842645127425381851/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJKpl6oVsdDj4hmjc5Y3oZ_m0iIuGVEJuNd0VTBROcODI1vwg=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "Excellent restaurant in old town Torino, near to  the central market. IF you happen to be in daytime near the place, you will never believe how nice and pleasure it becomes by night. I recommend the agnoloti and the panacota as desert",
            "time": 1723319150,
            "translated": false
        },
        {
            "author_name": "Mathilda Dembele",
            "author_url": "https://www.google.com/maps/contrib/101480603135531245387/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKmSkN9siO4tfT-IWhrUWUFjgRGk1LvC0qIP7bc8_B6mAfxCII=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "6 months ago",
            "text": "I recommend this restaurant for the food that was amazing and the atmosphere in a very animated street of the city centre.\nI tried the crema di piselli con verdure di stagione e formaggio di mandorle (green beans cream with mushrooms, asparagus, potatoes, almond cheese), a 10 out of 10, would go there only to try that dish again.\n\nThey also have a great and rich selection of wine and nice deserts !",
            "time": 1717359560,
            "translated": false
        },
        {
            "author_name": "Mohamed Badaoui Najjar",
            "author_url": "https://www.google.com/maps/contrib/116596453516421988270/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVAM6PjMnB2AtGNMjZCH6ybrptdl_nY3xNDlxL2lBMDSpC-qw6Adw=s128-c0x00000000-cc-rp-mo-ba6",
            "rating": 5,
            "relative_time_description": "5 years ago",
            "text": "Tasty foods meets solid customer service. The dogs is simply made yet tasty and our server was very courteous and had some great hospitality gestures. The risotto with goat cheese was tasty,  chocolate dessert was well made and the plate with liver had a great taste. Overall solid execution",
            "time": 1559018285,
            "translated": false
        },
        {
            "author_name": "Sankari Reddy",
            "author_url": "https://www.google.com/maps/contrib/104904977197050609340/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVXBzGyw3vsJSg-2vfg2bum90Mt9mFaVSUqXTa_TwpGyWQdTcfB=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "3 years ago",
            "text": "Unassuming restaurant but exceptional quality. The first truly wholesome meal I have had in Turin. Real pietmontese food.\n\nDiverse wine selection - from very expensive to more affordable. Wine recommendations are excellent. Many local selections to choose from.Staff are warm and friendly and speak English.\n\nManagement went out of their way - we received a complementary appetizer and zabaione - which were both excellent with complex flavours.\n\nWe ordered three main dishes, one dessert, one bottle of wine and one large sparkling water which totaled €110.\n\nThe veal and puréed potato with Nebbiolo red wine sauce was exquisite, the meat literally disintegrated in your mouth.\n\nThe veal sausage gnocchi was cooked to perfection and the flavours were complex and satisfying.\n\nThe boiled meat plate (typical pietmontese) was above expectations and I will order this next time I attend at this restaurant. It came with a selection of sauces (abundant servings) and candied fruit.\n\nFor a restaurant of this quality and reputation, we left very satisfied and not hungry as with other fine dining establishments.\n\nHighly recommend.",
            "time": 1620988040,
            "translated": false
        }
    ]
}