{
    "name": "L'Acino",
    "rating": 4.6,
    "reviews": [
        {
            "author_name": "Sam Chantaravisoot",
            "author_url": "https://www.google.com/maps/contrib/109597704290504381515/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXO37focBIG6gKmbz-lMfrAM0ojWxXAkMVf7BzFsdimr3gOZwbqnw=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "We LOVE this cute restaurant run by the family. We made a reservation 2 weeks ago just to make sure we could dine here during a brief visit in Turin. What a joy! Service is warm and impeccable. Food is amazing. We absolutely recommend anyone to come here when you are in town. The experience will blow you away.",
            "time": 1726973727,
            "translated": false
        },
        {
            "author_name": "Ling",
            "author_url": "https://www.google.com/maps/contrib/113489336694941550005/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVAxrkcd9pPlDSQL-iUKaUdSN4EVuQmKJho6QyTL-ig_uNrtDOZmg=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "What a wonderful time I had here with my new husband. The restaurant is family owned and serves Piedmontese cuisine. The menu is small but I like this because you know everything is done well. The lamb shank is so tender and you must eat it with a bit of potato altogether! The staff are very friendly and made us feel like family (when my husband poured water into his wine glass by mistake they were very kind about this). Probably my favourite meal in Turin.",
            "time": 1724437933,
            "translated": false
        },
        {
            "author_name": "Julius Radauskas",
            "author_url": "https://www.google.com/maps/contrib/107435365024306156591/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXh5qdSM0UnZR9uEFaD2dAaPrAGMTREoXKncvw0VYzKU__fuR0vgQ=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "7 months ago",
            "text": "Couldn't recommend it highly enough! We were lucky enough to get the last table without reservation and since the moment we were seated it was just an amazing evening with great food, great service and great atmosphere. The owner himself was serving us and he couldn't have been nicer. Not just paying attention to us to see if everything is ok but also explaining to us about the cheeses on the cheese plate and in which order to eat them to get the best experience. We had ravioli, pork shank, pork stew and plate of cheese for starters with some local wine and everything tasted amazing. It's not cheap, but the quality is worth it - I don't feel like we overpaid. We've visited several restaurants in Turin during our time there but L'Acino definitely is the best one that we dined in.",
            "time": 1714585451,
            "translated": false
        },
        {
            "author_name": "Wael Nakhleh",
            "author_url": "https://www.google.com/maps/contrib/103109140622443692609/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVvRBVoKBdXw4Eu0Qix8y0tayaGc0mJfW9QxJriKHRZ3yIWuMf0_w=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "5 months ago",
            "text": "So after living in torino for more that 2 years i finally cam decide that L'Acino is one of the top 3 restaurant in the city if not the best , the L'Acino team are sooo kind and the service was great plus you will eat the best dishes in the area .\nThe pasta was out of this world , not a dish that you could eat every day or in every city  and the starters were amazing + the wine menu is a win.\nI totally recommend and coming back asap",
            "time": 1719474541,
            "translated": false
        },
        {
            "author_name": "Trent Cantrell",
            "author_url": "https://www.google.com/maps/contrib/116357783016631048406/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKRjKq8e9FLFAqTOxHFKVko0uC5zB-tM6uencOzL6MNctO6hg=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "This was a top 10 meal of all time.  The food was impeccable.  We didn’t have a reservation and showed up when they opened.  They said if we were quick that we could take a small table.  The review by Michelin review got it wrong if they didn’t give it a star.  And they have been reviewed several times.  Get the stuffed onion and a cheese plate and anything else that sounds good.  Angelo and company were very accommodating.  This is a special place.",
            "time": 1729086730,
            "translated": false
        }
    ]
}