{
    "name": "Pizza Ad Hoc",
    "rating": 4.5,
    "reviews": [
        {
            "author_name": "Denis Treskanica",
            "author_url": "https://www.google.com/maps/contrib/113478081751881570067/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVozJdDctFAz4KxaEC97JozxY5e07CcPUIlTeXpWtdMM8WMtpOF=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "5 months ago",
            "text": "This is probably the best pizza I’ve tasted in the last 5 years. It’s hard to describe why, but the combination of simple yet high-quality ingredients created a fantastic balance on my palate. It’s not just my opinion, but also the opinion of the four of us who enjoyed the flavors.\n\nAd Hoc Pizzeria is located on a quiet street in the center of Turin. The interior is interesting, but we dined on the small terrace. The staff is hospitable, and the prices are reasonable. With more than 20 different pizzas, they also offer salads, burgers, as well as a variety of beers and wines.\n\nI recommend the La Bella Rossina pizza for 13 EUR, which is more than enough for one person. It features 00 flour dough, domestic tomato, local prosciutto, and creamy buffalo burrata cheese. The taste is fantastic! Highly recommended!",
            "time": 1719068703,
            "translated": false
        },
        {
            "author_name": "Andrea Merlo",
            "author_url": "https://www.google.com/maps/contrib/114857046731486898003/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVE9_fH6vvblU1tqi-tI8zv2nFppcnCOFeMlBi7w5U98H8CPn-N=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "Great service with friendly ns knowledgeable stuff. Good location just off Piazza Vittorio. The food was great and the Ad Hoc pizzas were very delicious. The farinata is a must try. They a great selection of digestives and Amaros for after dinner.",
            "time": 1729586529,
            "translated": false
        },
        {
            "author_name": "Katerina",
            "author_url": "https://www.google.com/maps/contrib/116491473983846724025/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJhFZAorQWYUNOvp1MtVm1dAI-5ZCSXdA7t1DNF-eIf63qzdg=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "4 months ago",
            "text": "I am giving 5 stars for the hospitality, friendly staff and quick polite service. We took two pizzas with 7 grains which ended up to be tasty but a little heavy to eat.\nIn general the experience was positive.",
            "time": 1721213661,
            "translated": false
        },
        {
            "author_name": "Fiona H",
            "author_url": "https://www.google.com/maps/contrib/117596345629589187774/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKYBhUKbD6NCz6OiVGvvbHs63zRziVmWnFoUyZPa6bhSWX7PRo=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "Such a hidden gem, I'm very glad we found this cool restaurant. It was well frequented by local Italian people, which usually means it serves authentic and good food. And it did! Everything was very tasty, high quality, good portions and very reasonable prices. The service was excellent and very attentive.",
            "time": 1724183587,
            "translated": false
        },
        {
            "author_name": "Araeik Panousian",
            "author_url": "https://www.google.com/maps/contrib/111024566303831826489/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWSb4VQM34vJGPyssiyNq9iXftLnw0kEp-m9qI-kN5fMHR5S_jE=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 4,
            "relative_time_description": "a year ago",
            "text": "The pizzas we ordered tasted very good, we ordered five different pizzas and each has a fantastic taste. The negative point was that since we were there on a Saturday night and all the tables were full, plus, the hall of restaurant was small, there was a lot of noise, but since it had delicious food, there is no complaint ✌️\nThe restaurant staff were very friendly and cool. The interior of the restaurant, however, needed more attention and revise, especially the second hall where we were, the first hall that is in front of you upon entering was ok.\n\nThis note is for owner and manager:\nTo be honest, we came to this restaurant by chance. The only problem, from my point of view, was that if I pass by the restaurant, nothing in particular catches my attention. It is much better for the restaurant manager or owner to think of a better sign for the restaurant in order to attract more customers, although the restaurant already has many customers...",
            "time": 1697610891,
            "translated": false
        }
    ]
}