{
    "name": "Novotel Torino Corso Giulio Cesare",
    "rating": 3.9,
    "reviews": [
        {
            "author_name": "The Entrepreneurial Adventurer Español",
            "author_url": "https://www.google.com/maps/contrib/108780332978761359189/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXRmGdtI53SD3uQNRxjrebcyUNCsYB181sTY6PLdsI9cgwlKJU=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "in the last week",
            "text": "Everything was fine. Nice and friendly staff. I want to mention Ariana from the FO she was very helpful with organizing my early breakfast for the Torino marathon. But in general all the staff was friendly, attentive and supportive. Nice experience. Location is not the best if you want to visit the centre but its easy accessible by tram with like 30 min drive depending on the traffic.\nWas very quiet although there was a school group.",
            "time": 1733065677,
            "translated": false
        },
        {
            "author_name": "Vignesh",
            "author_url": "https://www.google.com/maps/contrib/110138007533778476976/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXa2KwFDaxIlPDyeb7xGohf3gpV1QlhEroT7-owic-fBomftMQU=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 4,
            "relative_time_description": "a month ago",
            "text": "Location is not that great because it is in a very secluded area.\n\nThe staff were helpful and friendly.\nThe rooms were just fine.\n\nThe breakfast is mostly sweet based items and remains the same for everyday.",
            "time": 1728677213,
            "translated": false
        },
        {
            "author_name": "Louise Kelly",
            "author_url": "https://www.google.com/maps/contrib/116847293470185894559/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJactx82Q9rO5Co3nuc1_uwbUGs4Q98DbJjCzK1uGrt9biJsQ=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 3,
            "relative_time_description": "3 months ago",
            "text": "I will start with a couple of negatives, the settee in the room had 2 largish cigarette burns on one of the seats, when pouring, the water from the kettle would go over the surface. Finally, the windows when closed are not sound proofed at all, there was a group of guests sat down by the pool till very late, they was very loud and jumping in the pool. Called down to reception who went and spoke with them, stopped for a bit then started again.\nOn a positive note, the rooms are clean and spacious, hotel is in a good location\nWe walked to Turin centre as is just one road in a straight line, took about an hour.\nThe staff there are very helpful and friendly.\nWe ate there on the evening and had the buffet they was offering. Had plenty of choice and was very enjoyable.",
            "time": 1724838349,
            "translated": false
        },
        {
            "author_name": "Sam La Vida",
            "author_url": "https://www.google.com/maps/contrib/113165728896493101843/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWlYVoue9I7_f9iGfj13Ih3RsW_toI2YrbbxpdMHhKtRaiiWNE=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 3,
            "relative_time_description": "a week ago",
            "text": "I hated the room I paid almost 190 euros for one night! It smells the insects killing spray! The shower was broken! And I the bathroom waste can was not clean and had those ear cleaning thing inside",
            "time": 1732274133,
            "translated": false
        },
        {
            "author_name": "Francis Park",
            "author_url": "https://www.google.com/maps/contrib/112506217908619217664/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXaPfMKUcLyIX7Mm5J9dSqYIxId5quJloRYp3VuqVbxvg4i3p8=s128-c0x00000000-cc-rp-mo",
            "rating": 2,
            "relative_time_description": "a month ago",
            "text": "Aside from the advantage of being only a 5-minute walk from the train station, the hotel is quite far from downtown Turin, and the surrounding area is relatively rough. However, it is conveniently close to the airport. I booked as an Accor Platinum member, but aside from the welcome drink, I didn't receive any special hospitality. It was far below the level of courtesy I received last year as a Gold member at other Accor hotels in Italy, such as in Rome, Florence, and Bologna. There were no welcome amenities either. The hotel seemed to mainly cater to foreign group tourists. The room facilities were outdated, and the drainage in the bathroom was particularly poor. To make matters worse, there were bugs in the bathroom. I took photos of the hairdryer, which had something left on it from a previous guest, and the bug that came out of the bathroom. Overall, the staff themselves are generally friendly.",
            "time": 1728733503,
            "translated": false
        }
    ]
}