{
    "name": "Park Hotel Sonnenhof",
    "rating": 4.8,
    "reviews": [
        {
            "author_name": "Ali Paige",
            "author_url": "https://www.google.com/maps/contrib/104590558094721609655/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL2HWQvsTHEmCA0q6rql7UG-ihVhVHJo6jtJeoFz_U6UHJxVA=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "Loved my stay here - I'm planning to go back! The hotel staff were really helpful. The hotel itself is beautiful, with a great breakfast. It's a bit of a steep hill, but the walk from the center is not long at all. I took a train to Sargans and then a bus to Vaduz, and walked up to the hotel, and it was pretty seamless and only about a 10 minute walk from the bus stop.",
            "time": 1729185240,
            "translated": false
        },
        {
            "author_name": "Ira Nanda",
            "author_url": "https://www.google.com/maps/contrib/112274077005687286940/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVgM_ydDE4Ewxdrl1F9oE_OmKskrD5Xtm2BVw2HDALs_RibG4wShw=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "4 months ago",
            "text": "Two words to describe this hotel3 Elegant tranquilly. This was by far the best stay of our 2-week Europe trip, and we stayed in some very nice hotels. Room has the best sleeping arrangement for 2 adults and 2 kids, and the balcony was so wonderful to enjoy the greenery from. Easy walk to city center as well as to Vaduz Castle. The breakfast was incredible - fresh baked in house pastries, and the best croissants ever! The in-house restaurant is Michelin-starred and we had one of the most delicious and relaxing meals there. The staff was welcoming, helpful and friendly, and made us feel so welcome. Thank you so much for everything- we will definitely be back!",
            "time": 1722426694,
            "translated": false
        },
        {
            "author_name": "Meredith Shafer",
            "author_url": "https://www.google.com/maps/contrib/114763087457507269057/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVGh3ldPJzLETX6cTDlwHRoN-jdSeYM-DFDIntJupF6WuQGXLtc=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "4 months ago",
            "text": "We had such an amazing time at the Park Hotel Sonnenhof during our first visit to Liechtenstein.  We brought our dog and there were such great touches in the room so that she felt at home.  We ate dinner two nights at Marée and had AMAZING food!  Also, my husband has food allergies and the staff remembered the details of his allergies from one night to the next.  We loved everything about this property and the staff and would definitely recommend it to anyone!",
            "time": 1720536082,
            "translated": false
        },
        {
            "author_name": "Oleksandra Ochman",
            "author_url": "https://www.google.com/maps/contrib/101803404113036121954/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUqR-GIdVTsuC5xw4zt9JhEKsA1pEFBooeNQOMM0VuCIWzrSb0=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "It’s a great place to have a holiday! Very classy and cozy at the same time. Great service, great food, nice spa area. I totally recommend",
            "time": 1728332804,
            "translated": false
        },
        {
            "author_name": "Deanna K.",
            "author_url": "https://www.google.com/maps/contrib/112573900762140663938/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVZtzuQhb8eLfuAsJBbnE9zwXdMrdGP5Rr_BdfysYktZOW3ThWA=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "8 months ago",
            "text": "The staff of this hotel were particularly outstanding, very welcoming, kind, and hospitable, and I certainly enjoyed my stay. The property was well-maintained, inviting, cozy, and tastefully and elegantly and beautifully decorated. The views were splendid, and the room bed was very comfortable. Breakfast was fantastic, so fresh and delicious. When I arrived, I was pleasantly surprised to learn that my room had been upgraded, which was very generous of the hotel. What a treat! The only downside is that the walk to the hotel from the closest public transit stop is a bit harrowing, as the sidewalks are narrow, but at the same time, cars aren't generally going too fast, and it isn't far. I hope to stay here again someday!",
            "time": 1711595512,
            "translated": false
        }
    ]
}