{
    "name": "Hotel Hospes Palau de la Mar | Valencia",
    "rating": 4.5,
    "reviews": [
        {
            "author_name": "Gabriella Vascotto",
            "author_url": "https://www.google.com/maps/contrib/115598665482290483163/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ6fi3pAtL21ypx3qNjtPhg6YzdTRv_quX_GUBG4YbbRQYIYQ=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "Lovely, spacious room with very comfortable beds. Breakfast was delicious with a variety of hot and cold foods including options for gluten and lactose intolerance. Excellent location within walking distance of key attractions. All the staff were friendly and helpful at all times. Thanks for a memorable stay in Valencia.",
            "time": 1729972950,
            "translated": false
        },
        {
            "author_name": "Andy Wellington",
            "author_url": "https://www.google.com/maps/contrib/112286672049369094567/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIJf_8NzApCVgoz6_NTmDhcdMIPv2nwJTyebNAkJVIKDwEqGg=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "My wife and I stayed here for a few nights. The welcome on arrival was great, all of the staff were very friendly helpful and professional.  The room was clean, tidy and room serviced twice a day.  We both slept well as the hotel was very relaxing. The location of the hotel is brilliant for a visit to Valencia. Definitely stay here again when visiting Valencia",
            "time": 1726142119,
            "translated": false
        },
        {
            "author_name": "Karen Phillips",
            "author_url": "https://www.google.com/maps/contrib/113023387375158007109/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKr551rEBWHYKe3XmcymCKA6dx23ibQ3lRL7-HGBc3KUQufGg=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "I had a wonderful stay here.  The location is easily accessible and walking distance to many of the tourist attractions and shopping.  The hotel accommodations are well thought out.  The front staff are helpful and pleasant.  The beds are comfortable well maintained and the housekeeping staff are attentive.   The breakfast was plentiful, and tasty.  The pool area has jets, a waterfall and lounge chairs with plenty of towels along with a steam room.  I purchased a spa package which was relaxing one of the better massages I have experienced.  I would stay here again",
            "time": 1725004409,
            "translated": false
        },
        {
            "author_name": "E. S.",
            "author_url": "https://www.google.com/maps/contrib/100911960203832913856/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJjhr8jE9plhCGLnEOtlEMpBUbcGxZFQTpcBM4RYqHGB4ed5UA=s128-c0x00000000-cc-rp-mo",
            "rating": 3,
            "relative_time_description": "3 months ago",
            "text": "My husband and I stayed at this hotel for a week. While the overall experience was pleasant, I wouldn't classify it as a true 5 star establishment. The rooms were decent holiday inn kinda vibe, but lacked any special touches that would set them apart.\n\nBefore our arrival, I called to let the hotel know that we were celebrating our honeymoon. The staff surprised us with a bottle of cava, which was a very nice gesture that we truly appreciated. They also gifted us chocolates every day, another thoughtful touch that made us feel welcome.\n\nHowever, one of the most significant disappointments was the bathroom. We stayed in room 114, and every time we took a shower, the entire bathroom flooded with water. This is something I would never expect in a 5 star hotel, and frankly, it’s an issue we’ve never encountered even in hotels with fewer stars. The silicone seals around the shower were also in poor condition old and crusty, clearly overdue for replacement. These kinds of details really matter, since it was a sliding and trip risk too, especially in a high end hotel, and their neglect was surprising.\n\nOther aspects of the stay were also less than ideal. Breakfast was not included, and at €22 per person, it seemed overpriced so we didn’t have it. The pool required a reservation and could only be used for one or two hours at a time, which was inconvenient so we didn’t get a chance to use that too.\n\nOn a positive note, the staff was very nice, professional and welcoming, their efforts to make our honeymoon special did improve our stay. However, given the issues with the bathroom and the lack of attention to detail, I would hesitate to recommend this hotel as a true luxury experience.",
            "time": 1723406271,
            "translated": false
        },
        {
            "author_name": "Pilar Vidal",
            "author_url": "https://www.google.com/maps/contrib/113133452543215591275/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXqT2r8LjB-QCkB5VJBnXnIv91yfOpoZSygfchgLPlhGInzMA=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "5 months ago",
            "text": "Beautiful hotel jus outside the city center away from the crowds but walking distance to the main attractions.\nRooms are perfectly presented, cozy and spotless. Staff is very warm.\nBreakfast is delicious.\nThe bar is small, good for a business meeting.\nRestaurant has a few gluten free and vegan options. Room service has a few options  24 hours.\nOverall a wonderful experience.",
            "time": 1719906595,
            "translated": false
        }
    ]
}