{
    "name": "Senator Parque Central Hotel",
    "rating": 4.1,
    "reviews": [
        {
            "author_name": "Eleazar Reyes",
            "author_url": "https://www.google.com/maps/contrib/115698532460751986062/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVwJHPRGQWSu4kOOb-_XbyDPvUgthcBWpTXroLgUgBKmYR6b74L=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "This hotel has a good location. 3 minutes by taxi to the train station and accessible by bus to many points of interests. The room we booked has a king size bed. The breakfast was excellent for just a few Euros when we booked through Expedia.",
            "time": 1728976784,
            "translated": false
        },
        {
            "author_name": "Photo Lux",
            "author_url": "https://www.google.com/maps/contrib/116639163297389445639/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIjdXIsg-Z7mWdSbRnMDPgipTRojgXGP2qxhze3FSPe7rrKCw=s128-c0x00000000-cc-rp-mo",
            "rating": 1,
            "relative_time_description": "2 weeks ago",
            "text": "I booked a stay at this hotel to attend the Moto GP event, which was unfortunately canceled due to extreme flooding in the area. The circuit sustained extensive damage, and traveling to the region was both impractical and unsafe.\n\nWhen I contacted the hotel just after the weather events happened to explain the situation, they initially offered to allow me to rebook for a different date within six months which I have proof of. However, they later reneged on that offer without explanation and outright refused to accommodate my request for any changes. This flip-flopping added to the stress of an already difficult situation.\n\nI also contacted booking.com directly to see if they could help talk some sense into the customer service department to change the dates. Unfortunately they were unsuccessful and very surprise that the hotel would not help in any way.\n\nWhile I understand cancellation policies, these were extraordinary circumstances beyond anyone’s control. Instead of showing compassion or flexibility, the hotel chose to be rigid and unhelpful, leaving me stuck with an unusable booking.\n\nTheir lack of integrity and poor customer service were deeply disappointing especially as I was a returning customer. Due to this terrible experience I cannot recommend this hotel to anyone who values reliability or empathy.",
            "time": 1731770336,
            "translated": false
        },
        {
            "author_name": "Grigor Sanoyan",
            "author_url": "https://www.google.com/maps/contrib/111554061630473765466/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKwpSVdai8IJb46VMGleKNc7AO7keKDCLVZEO3B1DURNBmjLA=s128-c0x00000000-cc-rp-mo",
            "rating": 1,
            "relative_time_description": "2 months ago",
            "text": "The staff were very rude to us. We made a small mistake when doing a booking. The receptionist told us about that and we politely agreed to pay the fee that we didn’t pay as a result of our mistake. But afterwards one of the employees started to speak to us very disrespectfully claiming that we should respect her colleague, that we are being mean and she was basically screaming at us and not even letting us talk. She was acting like she’s our boss and we need to do everything she says (A quick reminder we were very polite and agreed to correct our mistake and she’s the one talking about respect). We were not going to tolerate such attitude and we said to cancel our reservation. We were going to pay in cash around 820-900 euros I don’t remember the exact amount. They gave the cash back but 2 days later they tried to take the whole amount out of our debit card the one we made the reservation with. Not only they were rude and disrespectful but they also tried to take the money out of our card without providing service. That’s the worst hotel experience I have ever had.",
            "time": 1727862692,
            "translated": false
        },
        {
            "author_name": "Eryn D",
            "author_url": "https://www.google.com/maps/contrib/112930303820691990289/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIbG3ZvNzh6YcZ1a0WPemsAMe8Aa3i3hNFItmJPNDM5P6VS6Q=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "We stayed only a single night in Valencia but this was a great hotel! The desk staff were friendly and the room was huge! The bed was comfortable and the bathroom had so much space! The location was walkable to so many places and there are lots of restaurants nearby.",
            "time": 1727187527,
            "translated": false
        },
        {
            "author_name": "Kevin Galtrey",
            "author_url": "https://www.google.com/maps/contrib/107438696939031212905/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWfuYdUfpMR9_oaTMjseb_mQXZZHsGfpbKFZziTkTJcm-ijzoot=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 4,
            "relative_time_description": "2 months ago",
            "text": "Good standard, if aged 4 star hotel, clean and well maintained, but not luxurious.\n\nNot a romantic settling, more travelling accountant.\n\nGood sized rooms, comfortable but basic.",
            "time": 1727793444,
            "translated": false
        }
    ]
}