{
    "name": "Restaurante La Cepa Vieja (Valencia)",
    "rating": 4.5,
    "reviews": [
        {
            "author_name": "Charles Calleros",
            "author_url": "https://www.google.com/maps/contrib/114443446188476227870/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWC5TTBY7PyNscN9WcKlM4Nh_tMs08Z6UI0Gg2ltj_Ms4ciVlI=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "5 months ago",
            "text": "How delightful that this charming prix fixe restaurant was close to our rented flat. It's a two-person operation featuring a very talented chef. The four course meal, plus dessert, began with a delicious tomato salad, but each succeeding course (eggplant and then fish in a layered dish) was more special the the previous, until we reached the main course of pork, which was perfectly cooked, just irresistible. We chose the chocolate cake for dessert. It was as delicious as the photo suggests.",
            "time": 1718764451,
            "translated": false
        },
        {
            "author_name": "Gillian Redmond",
            "author_url": "https://www.google.com/maps/contrib/114587745041212583642/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVfQ5ZTjBfa-5qCYdZQY5kvrZqS4SzpyI1hBJ_EHLTsEbS-PhAT=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a year ago",
            "text": "I had an EXCELLENT dinner here. I dined solo and got the 4 courses, for an amazing €25. Each dish was fresh, delicious, and innovative. You can really taste the passion and care from the chef.\nAmazing wine list to suit any taste.\n\nThe lady looking after me was attentive, kind, and friendly. She asked about dietary restrictions, and food preferences.\nThe restaurant is charming and intimate, I absolutely loved my meal there.\nThey change the menu weekly I believe, so I can’t wait to return to try something new and amazing.\n\nThe zingy lemon dessert recommended by the lady was incredible! Great end to the meal.\n\nAbsolutely brilliant, I can’t wait to return.",
            "time": 1697196170,
            "translated": false
        },
        {
            "author_name": "Jim Holt",
            "author_url": "https://www.google.com/maps/contrib/106765934090480983032/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWi8wP6xih3E8eoqV3TTNLfCpFzrAB6jDh0-lrzl6qi8hLEQB0=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "4 months ago",
            "text": "Had a lovely solo dining experience here.  Had a long day and was looking for a place with decent wine.  But surprised by the quality of food, too!  A set menu that is priced so well for what you receive.  Great flavors across the board, attentive service.  Really a hidden gem!",
            "time": 1721596094,
            "translated": false
        },
        {
            "author_name": "Sophie Regazzoni",
            "author_url": "https://www.google.com/maps/contrib/102720276675392523271/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLwjbdO-M--FDQnONGVIEbbvjKsSiLakDil2ZE0839Ix3XVjQ=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "3 years ago",
            "text": "I walked in front of this restaurant a few times without even noticing it. But I found it on google as I moved nearby. I went on a Saturday evening and it was very quiet.\nThey have a unique menu but can adapt on request. My friend is vegetarian and had a cheese platter to replace the meat.\nWe also had an impressively real fake steak.\nAll dishes were not also tasteful but also beautiful.\nA real little gem near the train station.",
            "time": 1634595146,
            "translated": false
        },
        {
            "author_name": "Thalia Davies",
            "author_url": "https://www.google.com/maps/contrib/107498208629073311457/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLEik43P5OfZu66ixVY_yiL7YJYaU1zq1CdPthEjGIgQtGKmi4=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "4 years ago",
            "text": "Although it doesn’t have stars we found this quaint wine bar via the Michelin guide. Away from the main touristic areas we found the restaurant a little quiet. There was no ”menu“ per se, they change what they serve weekly. We enjoyed all the courses especially the tomatos. The wine list is ultra extensive too. This was by far our favourite meal of our trip coupled with one of the best wines I’ve had the pleasure of trying. I can’t wait to visit again on my next trip to Valencia, Highly recommend.",
            "time": 1577678726,
            "translated": false
        }
    ]
}