{
    "name": "HOTEL TÚRIA VALENCIA",
    "rating": 3.9,
    "reviews": [
        {
            "author_name": "Eduard Ciama",
            "author_url": "https://www.google.com/maps/contrib/113609702147921172216/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX7Q0dJfDwjte-vxJuZtpsLEl8a77IDkk95cgtQGz5LKZvqBeYb=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "Very good location for this hotel. Tasty and big breakfast assured by the staff. Very kind and helpful staff starting from the reception, food area, room services. The room has AC or heat system depends on season. The room had balcony with city view. Very close to the Mall and Bus/Metro station (10 minutes)",
            "time": 1728649423,
            "translated": false
        },
        {
            "author_name": "Neil Beard",
            "author_url": "https://www.google.com/maps/contrib/114925237388175905337/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJejgH7w_NRWTX-hVhtv00w8gOO3FPraYYEne9nNw2YppZohg=s128-c0x00000000-cc-rp-mo-ba6",
            "rating": 4,
            "relative_time_description": "a month ago",
            "text": "I have been to Valencia previously and choose the Hotel Turia for its location on this occasion. The room & bathroom were fine and the bed was very comfortable. The bed was made up every day, and the rooms cleaned. The hotel was quite busy, and the breakfast room spilled over into an adjacent room sometimes, but that was not too big a deal. The breakfast selection was great and is well worth booking.\nThe hotel is close to the Turia metro station so access from the airport is simple.\nThe hotel bar was not expensive and there is a large outside seating area.\nA 15min walk takes you to the old town area. To walk to the beach is 90minutes.\nI did not use any public transport but walked between 4 and 14miles/day to see the sights.",
            "time": 1729149339,
            "translated": false
        },
        {
            "author_name": "דור הרצנשטיין",
            "author_url": "https://www.google.com/maps/contrib/109517314221926499298/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKlPX2OkszdNWyjNqb0K7AhGq50OqK63fo_icII9Txhnk4E6A=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 4,
            "relative_time_description": "2 months ago",
            "text": "Take care of the gang problem outside the hotel with the police! A huge advantage is that the hotel is located very close to the central bus station, just a minute's walk. The disadvantage is that in this area there are many homeless people and many Arab criminals, it felt very scary for me to walk around there in the dark. The hotel is a little outdated and you feel it mainly in the room, there is no refrigerator or mini bar and there is no particularly technological TV and it's a shame because the room is large and very comfortable with a good shower. Proximity to the station allows public transportation to be readily available all day. In addition, the staff is nice and helpful with an excellent dining room both in the morning and in the evening at a high and good level.",
            "time": 1727869371,
            "translated": false
        },
        {
            "author_name": "Pierina Amato",
            "author_url": "https://www.google.com/maps/contrib/110533194960367432221/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVmH4YcTguqWUMnMkYFPw5EEdYMlvuFiOpdvWawnsX4xX5R2w0R=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "Beautiful Hotel ..\nSpacious, huge rooms,\nVery, very clean ..\nHelpful, friendly, warm  staff ..\nSituated right next door to the central bus station, which was extremely convenient when making our way back to the  Barcelona Airport.\n\nAlso, situated next door, is a beautiful, huge shopping mall called Nuevo Centro; filled with endless beautiful boutiques, Restaurants, a huge grocery store, a pharmacy, a playground for children, etc. etc.\n\nThe Hop on, Hop off bus stop is situated right in front of the mall, which was  also great for us.\n\nValencia’s gorgeous city center is a 20 minute walk from the hotel; which was absolutely fabulous during our stay.\n\nThe only thing that I disliked, is the fact that they don't have a mini bar in the room.  We needed a refrigerator for my husbands medication, but undoubtedly, we were thankful that they took care of it.\nAlso, the safe in our room was outdated ...\nyou need to ask them for the key.\nAhhh! Well … I didn't quite understand that.\n\nBut all in all ...\nIt's a beautiful Hotel, super, super clean, well situated and to top it all off\nIt offers a super delicious breakfast buffet.\nEverything was extremely fresh; well prepared and presented with care.\n\nI would highly recommend this hotel to my family and friends.",
            "time": 1729014773,
            "translated": false
        },
        {
            "author_name": "Sarah Monty",
            "author_url": "https://www.google.com/maps/contrib/109536927069328368197/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWq_As9ryRSfHFb7WLjL-QrjsT42GH_f_R-NeQhsn3D80wBb4Zirg=s128-c0x00000000-cc-rp-mo",
            "rating": 4,
            "relative_time_description": "3 months ago",
            "text": "Friendly and helpful staff. Close to bus station, luggage storage and amazing breakfast. Rooms were a bit out of date but were clean and had all we needed. Gluten-free and lactose-free items at breakfast, lots of variety. We'd definitely stay again.",
            "time": 1723654662,
            "translated": false
        }
    ]
}