{
    "name": "Las Arenas Balneario Resort",
    "rating": 4.6,
    "reviews": [
        {
            "author_name": "Alexander Nixon",
            "author_url": "https://www.google.com/maps/contrib/115004483502931845875/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJCpXlxs_1OnRHF74awSkq3qLKzT3EJq_m89mO-OH9FAv3zRQ=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 4,
            "relative_time_description": "3 months ago",
            "text": "Overall a very good experience. The service was amazing. Nice facilities (pool,gym,spa). The restaurant was top notch. Easy access to the beach. Two minor points. The room was a little small. Wouldn't be an exaggeration to say that the bathroom was of equal size. And more importantly, I found it bizarre that a premium hotel like this would charge for parking even though there is ample free public parking just next to the hotel. And one extra point. Like so many hotels in premium destinations they still haven't managed to solve the problem with guests waking up early in the morning, leaving their towels at the chaises lounges at the pool only to disappear for hours and depriving honest guests of their time at the pool. This is so true of many establishments in this part of the world (Spain, France, Italy, Greece). People without decorum just claiming a spot for the whole day. That being said, the hotel should try to dissuade this behavior.",
            "time": 1725228292,
            "translated": false
        },
        {
            "author_name": "Andrew Y.",
            "author_url": "https://www.google.com/maps/contrib/106434758564288669860/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKYsRQSJbEtWiN8_KgWD7obbLZrqsjv5i_JxOfsefc-aeCXpw=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "This hotel was one of the main reasons we decided to make a trip from Madrid to Valencia, and we’re so glad we made the right decision. The resort-style accommodations were perfect for our family with three children, including an infant. Visiting from Boston, we felt incredibly welcome here.\n\nThe room was spacious, clean, and comfortable, and the pool area was beautiful. There’s also a fantastic kids’ center, which our children absolutely loved. The restaurant was excellent, especially the paella, which was delicious.\n\nWhat impressed us the most was the exceptional service we received, particularly at the restaurant. The manager, Andres, was not only attentive and caring toward our family but also extended the same warmth to other guests, making everyone feel welcome. The room service attendant, Elenia, was wonderful, ensuring that everything was perfect during our stay.\n\nThe location of the hotel is unbeatable—directly connected to the beach and within walking distance of many great restaurants. We also enjoyed being able to walk to a nearby venue to watch a fantastic flamingo dance performance, which was one of the highlights of our trip.\n\nWe were fortunate enough to meet the hotel manager Sergio, and I want to personally thank him for his leadership, kindness, and genuine hospitality. He truly cares about both his guests and his team, ensuring that everything is just right. Sergio is a true gentleman and a top-class hotelier.\n\nThank you, Sergio, and the entire team, for making our stay so memorable.",
            "time": 1725405143,
            "translated": false
        },
        {
            "author_name": "Sylvana Rochet",
            "author_url": "https://www.google.com/maps/contrib/110750200449264286467/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVDDcJO7ELlBlJ_0WwC8w00mtzg1NveEIKNMJ7PcixBNz-Kqd4G=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 5,
            "relative_time_description": "4 months ago",
            "text": "Beautiful location and hotel. The staff were attentive, warm and helpful. The afternoon spent by the kids' pool was a great time for the whole family.\nThe children loved going to the Kids Club, the young women running it were wonderful! And we got to have a couple of hours of child-free relaxation. (Why doesn't EVERY hotel offer a Kids Club????)\nThe breakfast buffet was excellent quality: there was something for everyone, including many healthy and protein options for those who don't want to start the day with sugar and gluten.\nThe rooms are beautiful and the whole place feels peaceful and luxurious.\nOne of our best hotel experiences, as a family, for sure. Again, the staff are what makes this experience so lovely. We will be back!",
            "time": 1721727396,
            "translated": false
        },
        {
            "author_name": "Eylan Ezekiel",
            "author_url": "https://www.google.com/maps/contrib/116336880078082511851/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWAiJRgDL18nBL6oQxvyT96zAquA-pCeAcgD4VlQGouuqxqD094lg=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "4 months ago",
            "text": "We treated ourselves to a fancy hotel while visiting our daughter who is studying in Valencia and we're very happy with our choice.\n\nObviously, rooms are great and well appointed. Bed and pillows were very comfortable. Air con and soundproofing were ace\n\nView of the beach was great but beachside club went on till very late so sound proof was essential!\n\nThe pool is fantastic and huge and deep and clean and..   well... Just great.\n\nBreakfast was good,... And lots of choice, even for me as a veggie , but I think vegans would struggle a bit!\n\nBest thing is that I made a stupid mistake with booking and they could have made me pay for another night but (thanks to one of the reception team whose name I've forgotten!!! Sorry 😔) we got it sorted and they were very reasonable.\n\nSo...it IS expensive and it was a treat for us but it felt very comfortable and friendly.",
            "time": 1720731063,
            "translated": false
        },
        {
            "author_name": "Nick Leone",
            "author_url": "https://www.google.com/maps/contrib/109468732851134190193/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIJaHXDKxN0qgRUr0X0kYia_eErgtW1u1jX96d0UYyUYKTD6A=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "Luxury hotel situated right on Valencia’s beach, adjacent to dozens of restaurants along the promenade that leads up to La Malvarosa beach and beyond. The hotel lacks for nothing in facilities with pools, a gym and day spa as well as a restaurant and bars. Breakfast was a feast with a wide variety of food options available. All staff were very friendly, helpful and attentive to your needs. Every day in the late afternoon housekeeping would come to ask whether you needed any extra room amenities. Our room was a triple room in a corner of the hotels that had views of the beach and the pool deck below. The room was spacious, comfortable, and with first class amenities. It was a wonderful place to stay for the 4 days we were in Valencia.",
            "time": 1727464105,
            "translated": false
        }
    ]
}