{
    "name": "Hotel ILUNION Valencia 4",
    "rating": 4.1,
    "reviews": [
        {
            "author_name": "Caitlin Lucy",
            "author_url": "https://www.google.com/maps/contrib/117640568530147107640/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWJTLP_tM_6O7jjJppeTd8eBrm1-_gz9B3Alk1B4H8iBkWpt9A=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "Stayed for a 6 night trip. Lovely hotel with great services. Perfect location. Easy to cycle to the beach within 12 minutes. Comfortable beds and room. Friendly staff. I would not hesitate to stay here again if we have another trip to Valencia. Highly recommend!",
            "time": 1727023575,
            "translated": false
        },
        {
            "author_name": "Randeep",
            "author_url": "https://www.google.com/maps/contrib/106720631051708027355/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWHM7dGT3eZ9o1w8ueLeApaGSoOTJv6g-t1GCfQ1rUWm6m2t6Anhw=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 4,
            "relative_time_description": "3 months ago",
            "text": "Our stay at Hotel ILUNION Valencia 4 was a pleasant experience, marked by a warm welcome and exceptional staff. From check-in to check-out, the service was top-notch, with the staff going out of their way to ensure we had everything we needed. Our room was clean and well-maintained, and we appreciated the attention to detail in the housekeeping. The hotel’s gym was practical, offering basic facilities that were sufficient for a quick workout, although nothing too fancy.\n\nI mentioned that it was my wife's 50th Birthday when I booked months ago as I wanted to pay for flowers to be waiting for her. They didn't provide this service, which was fair enough, but they did surprise us with a complimentary selection of deserts and hot drinks which they brought to our room. Excellent service and thoughfullness from the hotel.\n\nThe pool area was nice and clean, but there were not enough sunbeds, which made it a bit challenging to find a spot to relax. Additionally, the pool closed a bit too early for our liking. However, the restaurant staff were very accommodating, making dining a breeze with their friendly service. The hotel’s location was another highlight, being close to two tube stations and a main bus route, making it incredibly easy to reach central Valencia. Overall, it’s a great choice for a comfortable stay with excellent service in a convenient location.",
            "time": 1723459704,
            "translated": false
        },
        {
            "author_name": "Bijal Patel",
            "author_url": "https://www.google.com/maps/contrib/105293139684210283211/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIlvgSLGbUvRmq8593febPmTXTo6W_9KRbW2f1Dvbnl6MGNRg=s128-c0x00000000-cc-rp-mo",
            "rating": 3,
            "relative_time_description": "a month ago",
            "text": "Great location. Good breakfast. Lobby looks great but rooms need modernising especially the hallways which you use to get to your room. Service needs to improve as had to ask a few times for towels and hand soap. I eventually went downstairs to get the soap and was handed a handful by the receptionist BUT no apology. Spoke to Roly several times about towels, soap, local services like cinema BUT he seemed very unhappy to oblige. I was made to feel like I was asking too much. Each time he would take a BIG sigh and make me feel horrible for asking the question in the first place. Staff definitely need training on being kind and saying sorry and thank you. I wont be staying here again unless customer service improves.",
            "time": 1730316890,
            "translated": false
        },
        {
            "author_name": "Karol",
            "author_url": "https://www.google.com/maps/contrib/111564246906672949440/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKSwyrQCNot1736MxIxwHyYbnEkpzbxiRHKp-xlDxdZJBL_1w=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 4,
            "relative_time_description": "2 months ago",
            "text": "The service at the front desk was wonderful - Royla (?) (Cuban) and his colleague that trained in Canada were really lovely. Best service that I had in Spain.\nIn the breakfast area, the lady needs to improve her approach to clients.\n\nThe rooms were dated. It is actually quite strange as the lobby is quite nice but rooms feel tired. Water was provided during the stay which was wonderful. The kleenex provided was dad also, no conditioner.\n\nThe air conditioning in the room was working perfectly. Sheets and all are clean. No coffee maker.\n\nBreakfast was great. A good variety of options.\n\nTravel to the core was easy as there is a metro steps away. However, the area is a bit questionable and run down.\n\nPool access is not great. Open from 11am to 7pm. ... which is very odd since those are key hours that guests would be out in the city.",
            "time": 1725913851,
            "translated": false
        },
        {
            "author_name": "Harry K",
            "author_url": "https://www.google.com/maps/contrib/103355607536769732010/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIzYhMrk-rqUnm76-GGXblY-CqAcwrPHQFMQ-G67baLa895lw=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 4,
            "relative_time_description": "2 months ago",
            "text": "The staff was very helpful. The food was so so. They really need to supply salt and pepper at the table. Having to chase down salt and pepper is frustrating. The pool area was way too small, and no service can't get a drink.",
            "time": 1727433404,
            "translated": false
        }
    ]
}