{
    "name": "Okurama Japanese Cuisine",
    "rating": 4.2,
    "reviews": [
        {
            "author_name": "Will",
            "author_url": "https://www.google.com/maps/contrib/114201459799676619508/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJXMIVWJgO8vubUUZ-8l4xoKR8Gnf3apXERaux02C58iVuzmA=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 1,
            "relative_time_description": "a month ago",
            "text": "I strongly recommend to AVOID THIS RESTAURANT.\n\nThe worst meal we have had in a long, long time.\n\n1. We were both ill after eating the food. Bad stomach. Potential food poisoning. The quality of the rice and fish was extremely poor. Way below standards. For the price, it is quite simply horrendous. You can get way better sushi for cheaper prices.\n\nFrom a quality perspective, it makes no sense to eat here. It is a tourist trap. No local people were in this restaurant…this says a lot.\n\n2. We were scammed.\n\nWe asked for the all you can eat menu. The server said yes and we proceeded to order off the menu given to us (not knowing that there was another menu).\n\nAt the end the bill came to €40 higher than what we expected. We questioned it.\n\nIt turns out that there is a separate all you can eat menu…which the server did not give us!\n\nSummary:\n\nSo all in all, an absolutely horrendous experience here. You can see from previous reviews that I do not leave many bad reviews…but this place was horrendous. The staff at the end did not want to help or refund us in any way either. All in all, terrible experience all round.",
            "time": 1730498977,
            "translated": false
        },
        {
            "author_name": "Gabriel Pincetta",
            "author_url": "https://www.google.com/maps/contrib/105015465697081623251/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU9VFsqbcBcJAMU1Fi0shPLtMMjrZ3Zlyr0teRVHovu-F2FnIoX4w=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "4 months ago",
            "text": "Amazing Experience at Okurama\n\nI recently visited Okurama, and it was an amazing experience. The all-you-can-eat sushi is the best in Malta—if you love sushi, this is a must-visit.\n\nEverything was fresh and delicious. The place is cozy, and the service is excellent.\n\nGood price that includes  dessert, it's a fantastic deal. I highly recommend Okurama. You won't regret it!",
            "time": 1722941899,
            "translated": false
        },
        {
            "author_name": "Valentina Movember",
            "author_url": "https://www.google.com/maps/contrib/114772277732622414520/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXiElpppLMf-EwBjpsXNv1csf07_jWaBCVOi_Ip8-IfKxMroi8AVw=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 3,
            "relative_time_description": "2 months ago",
            "text": "The sushi was okay. But we didn't like the waiters, they were sly and pushy. I noticed one woman who was nice and kind, but the rest of the waiters were bad. At one point, when my boyfriend and I were sitting and eating sushi, the waiter rushed to clear the plates. Our table was empty, but the waiters kept wiping it with rags, as if they were hurrying us to leave. We think the waiters wanted us to clear the table faster. That's why we didn't like the service..",
            "time": 1726998807,
            "translated": false
        },
        {
            "author_name": "Sam 07",
            "author_url": "https://www.google.com/maps/contrib/117713131610233415069/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXKN2zq8AzqRhMA9uScTHrNNZ7utBqseJnOIIwaYpOkfiu16Yyi=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "ICREDIBLE !\nThe quality is phenomenal, I did so many buffet/all you can eat, but this one is by far the number 1.\nIt was 32€50 per person. But the prixe is very low compared to the quality.",
            "time": 1728476786,
            "translated": false
        },
        {
            "author_name": "Sinon S",
            "author_url": "https://www.google.com/maps/contrib/110066954359524845881/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUaqsFCwxmdQe8yC0unLGzQsSa4WbNHmkW5T3p6s7rT4XGxIW7t=s128-c0x00000000-cc-rp-mo",
            "rating": 2,
            "relative_time_description": "a month ago",
            "text": "I recently visited this restaurant, and while the food was excellent, the service from one of the staff members was disappointing.\n\nAs a 19-year-old on a language stay, I was eating alone, which made me a bit anxious already. I greeted her politely, but she didn’t smile or seem welcoming. Later, I noticed she was much friendlier with other customers, smiling and giving them more attention.\n\nMy food arrived, but my drinks, as well as those of other customers who ordered at the same time, were left on the counter for about five minutes. I don’t want to assume anything, but she seemed to spend a lot of time going in and out of a room while the food and drinks remained on the counter, even after the chef rang the bell.\n\nWhen I asked for the bill, I had to wait about 10 minutes, even though other tables who requested it after me were served first. I tried signaling that I was ready to pay, and although we locked eyes, she ignored me and continued serving others. After another 10 minutes, I went to the counter to pay, even though others were able to pay at their table when she brought them the card scanner. Thankfully, another staff member noticed and apologized.\n\nThe difference in service made me feel uncomfortable, especially since I was polite and respectful throughout my visit. I hope this feedback helps improve the service, as the food was fantastic, and I believe all customers should be treated with the same level of care.",
            "time": 1728670313,
            "translated": false
        }
    ]
}