{
    "name": "Grand Hotel Excelsior Malta",
    "rating": 4.4,
    "reviews": [
        {
            "author_name": "Geoff Ellam",
            "author_url": "https://www.google.com/maps/contrib/114352012393394574504/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVhm7dL11rWvtfiQaZL4BLFGNtCZSXqNR6xuEqw7HR64IMT4-A5nA=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 4,
            "relative_time_description": "in the last week",
            "text": "Very nice hotel with a couple of minor drawbacks.\nThe first room we were offered smelled stale and damp so we were located to a better room which was much better.\nRoom cleaning could have been better and I did find a couple of old fingernails on the carpet.\nGenerally the staff were polite and helpful.\nThe food buffet was excellent and reasonable value.\nWould I go there again?Yes for sure.",
            "time": 1732886115,
            "translated": false
        },
        {
            "author_name": "Ralph Berry",
            "author_url": "https://www.google.com/maps/contrib/117450384167674338808/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXyl54nu3mDiXN75Vorem3bxoNnVC33fE-ejBy000a8LrKMFLU=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 4,
            "relative_time_description": "2 months ago",
            "text": "This hotel is in a tremendous location for visiting Valletta. Hotel itself is good, with comfortable rooms and beds. The pool area is excellent, with a large pool and also access to swim in the sea. Plenty of shaded areas and an attentive bar staff. The indoor bar areas and public areas are perfect for meeting or to grab a small meal and a drink.  I wish the hotel had a good restaurant, but there are just basic small places to eat, not a formal restaurant. But that was okay as we walked into town where there are many good restaurants. So all in all, I can’t rave about the hotel, but also no real issues at all. If I was returning to Valletta, this is where I would stay.",
            "time": 1727384429,
            "translated": false
        },
        {
            "author_name": "Ellie Heale",
            "author_url": "https://www.google.com/maps/contrib/106864601221011463239/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI_SCtzlXFsmqXRhUH9GpLpuchkt3XVi9b8Rg1dCpLvE_TYIQ=s128-c0x00000000-cc-rp-mo",
            "rating": 4,
            "relative_time_description": "3 months ago",
            "text": "After booking to come, I saw numerous negative reviews of this hotel which made me quite skeptical. However, our stay on the whole was pleasant. The hotel is in a great location; it’s a 10 minute walk into Valletta (although there are a lot of steps) and we enjoyed numerous trips and dinners there throughout our holiday. Both the indoor and outdoor pools are lovely and there are always beds available to use. Rooms are air conned well and were cleaned to a high standard daily and staff were always pleasant and polite.\n\nHowever, there are certainly a few things which could be improved. Starting with the service - on the whole, the service was poor. Staff are very busy which makes me wonder if the hotel is understaffed; we had to ask numerous times for the same thing on several occasions, at breakfast no staff member approached to ask if we wanted tea or coffee - we had to go and ask them ourselves each day and one lunchtime, we waited around 20 minutes at the pool bar before our order was taken. One afternoon, my partner’s shorts also fell off our balcony onto the roof below; they were easy enough to collect via using another room’s balcony but we had to speak to reception four times before this was done. Another issue was around half of the umbrellas by the outdoor pool were broken meaning shade was limited, even though it was 30+ degree weather, plus the steps into the sea were extremely slippery; we witnessed two people fall on the same day and said to the staff they should put a sign up. Finally, the prices of drinks were ridiculous - €5 for one glass of Diet Coke, which was flat and tepid. The fizzy drinks from the pool bar are poured from large 2L bottles meaning they’ve gone flat and they aren’t kept in the fridge.\n\nOn the whole I would stay here again, but for a 5* hotel there are definite improvements to be made.",
            "time": 1724853651,
            "translated": false
        },
        {
            "author_name": "Stuart C",
            "author_url": "https://www.google.com/maps/contrib/106983034757455714115/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIxmPDAq-5ngMgoW5Gpx_GiSCtTuYUayXQZN4Nz395SwckbIA=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "Excellent hotel and superb location for visiting Valletta (10 minutes walk to the City Gate and the bus station). We booked for 5 nights and at check-in were given a complementary upgrade to a sea view room. What a room! I was hoping for a high floor. Reception was level 6 and we were given a bedroom on level 2. The porter asked which room we were in and when told said it was a very nice room. It was. The balcony was directly facing the small harbour where coincidentally some yachts were preparing for the Rolex Middle Sea race (please see photos). Many of the crews were also, not surprisingly, staying at the hotel.\nThe room was very spacious, clean and comfortable. The en-suite had a combined bath and shower and quality toiletries.\nThe room was very quiet.\nBreakfast was very good with a wide hot and cold choice.\nThe staff were all very friendly and helpful. There is also a complimentary shuttle to the City Gate / bus station area every 20 minutes if needed. Would we stay here again? Definitely.",
            "time": 1729980496,
            "translated": false
        },
        {
            "author_name": "Paul Darby",
            "author_url": "https://www.google.com/maps/contrib/109410935876443456013/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKxofTtpsH7JApJYGvFDCWA1bMoc_fdt1IvAhTdeCcsMcDVdA=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "3 weeks ago",
            "text": "Really enjoyed our time here last week.  Nothing not to like.  The staff were all very welcoming and helpful.  Room service was brilliant.  The breakfast had a great choice and was very good.  It was just a few minutes walk to the bus station and Valletta.  All brilliant.",
            "time": 1731567423,
            "translated": false
        }
    ]
}