{
    "name": "U Bistrot",
    "rating": 4.5,
    "reviews": [
        {
            "author_name": "The D",
            "author_url": "https://www.google.com/maps/contrib/115726753982986945435/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLJkXJcMeec7vMcv2fMY6MnLL7Q_OW_mZLZzXszu7i2sHbX0oJ2=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 1,
            "relative_time_description": "2 months ago",
            "text": "Incredible customer service… incredibly bad.\nWe were refused entrance out of fear of not spending enough.\n\nThe first time I went there it was for a late lunch (~15:00) and everything was fine. I had the carbonara which tasted very good although I’m not sure that was real guanciale. What I can say for sure is that it definitely wasn’t crunchy (I assume it was left in the sauce). Also, to my disappointment it was made with fettuccine not rigatoni(this stated in the menu so it wasn’t a surprise). But it tasted good and that’s all that matters. I ate it all and I would recommend it.\n\nBut the thing that really impressed me over there was their kiwi cocktail. Absolutely delicious. I don’t remember ever tasting something more delicious. The perfect balance of alcohol and fruit, not too sweet .. simply perfect.\nMy heart really stayed with that amazing kiwi cocktail all I could think of the following day was going there again.\n\nSo i do that in the evening (~7pm) but the waiter simply refused to accept us in. The reason being that we only wanted a drink and it was dinner time. Mind you: the terrace was more than half empty and there were no “reserved” signs on the free tables.\n\nHow many people even have dinner at 7pm in the south of Europe???\n(We for sure, were planning to have it later, and this was an option we were considering but we were just not hungry at that specific time.)\n\nI don’t know how much time he thought we would have spent there sipping 2 cocktails that we specifically came to taste again. But I can tell you for sure we were not there to stay. It was an in and out situation. And ultimately, I would have even stood up in a corner just to be able to serve that deliciousness again. But there was no room for negotiation.\n\nToo bad.\nFood was good, drinks absolutely amazing, but the attitude of the waiter ruined the experience and the will to return.\n\nI would definitely not recommend this place to a friend.",
            "time": 1727877761,
            "translated": false
        },
        {
            "author_name": "Joshua Preiswerk",
            "author_url": "https://www.google.com/maps/contrib/102819303298663173685/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVI6_D8hPk2vmplJwQoE1yoU74bVDrqoKfRSol0pHKAFd6FsZB8=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "I was starving, so I had two main courses: penne with local sausage+chicken+ sauce, and the half lobster. They were both excellent meals, generous portions, great service… Truly a really good & nice dinner experience in Malta ! Go for it, they know what they're cooking there 😎",
            "time": 1729103095,
            "translated": false
        },
        {
            "author_name": "R J",
            "author_url": "https://www.google.com/maps/contrib/109633714776334354258/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVuxQwcj7WDSjg7HrJRVdmhgx-_dsIjgbZxJSlADvBVgxe8ToBS=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 4,
            "relative_time_description": "a week ago",
            "text": "A page of vegan menu.\nThe beetroot and chickpea ravioli was just amazing. There was a good selection other than the usual salad or risotto.\nThe waiters were all very attentive and it was clear the chef loved cooking. Every dish was prepared with detailed perfection.\n\nDisappointing part was the waitress initially checked if there was a free table for 5 mins. There were 6 tables free with no reserved signs. We were sat by the draughty door. It was 7.00 pm and no other clients arrived until 8.15. I guess she felt we would not be spending much.\nTip....... outdoor seating is a sandwich position on the pavement with cars on one side and public walkway on the other. OK for quick drinks but not a full on meal.",
            "time": 1732442461,
            "translated": false
        },
        {
            "author_name": "E H",
            "author_url": "https://www.google.com/maps/contrib/104897857421432809454/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLhVFKUl4RLphVvxnOvOTmBw12oGmsIJ_ilRFVnhJlxH2RB8Vxx=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "4 weeks ago",
            "text": "Beautiful little bistro, food was great, you can see and hear the kitchen preparing the dishes (like peeling and chopping). The fondant was perfectly cooked, still running inside for my French husband.",
            "time": 1730826980,
            "translated": false
        },
        {
            "author_name": "Xatia Gabadze",
            "author_url": "https://www.google.com/maps/contrib/110254747372431122822/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWXObdYHB6i3cKiRrDCRQ-HSRrKChXhQZXVwlFaqBnyHh3OYgU=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "This place is amazing with amazing staff and amazing food💯\nI found a place in Malta that I really enjoy going to. The food is very tasty and very beautiful. The staff is very friendly, positive and pleasant. I am glad that I found this place. Also the place is very tastefully done. Inside is elegant and sophisticated.  I recommend that you definitely visit this place.",
            "time": 1725267050,
            "translated": false
        }
    ]
}