{
    "name": "Hotel Kennedy Nova",
    "rating": 2.9,
    "reviews": [
        {
            "author_name": "Rye Serneo (Rye)",
            "author_url": "https://www.google.com/maps/contrib/117761698360491809551/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVh0v5Ad_FpVMxstaDXHVmPXbslnNdnJvldYSPgVkUYiu5PEgaqyA=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "I want to share my positive experience at this hotel with you. Some previous guests have left negative reviews, but I found it to be a gem.\n\nThe room was decent and the service from the staff, especially Khalid at the reception and Juan in the restaurant was amazing.\n\nThe breakfast at the restaurant is excellent. The portion size is generous, and the quality of the food is top notch.\n\nThe price was reasonable and the location was very convenient with easy access to transportation and various attractions.\n\nI definitely plan to stay at this hotel again in the future.",
            "time": 1724323345,
            "translated": false
        },
        {
            "author_name": "Jill Sullivan",
            "author_url": "https://www.google.com/maps/contrib/105901353832307858977/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJNcuDtv3hDhNtLbMsJArchx4mZMtAJAnFvgaOVjmJ6j5vjEw=s128-c0x00000000-cc-rp-mo",
            "rating": 2,
            "relative_time_description": "2 months ago",
            "text": "Although the room had a great view across the harbour,  the hotel itself was very tired and needs updating. The air conditioning was faulty and the fridge was barely working.\nThe breakfast was awful with powdered scrambled eggs and hardly any choice. There were still perspex screens up left over from covid 4 years ago so you had to ask for what you wanted. Also when we were there loads of school kids were there on a school trip so at breakfast it felt like a school canteen. This wasn't mentioned when we booked.\nThe pool was supposed to open at 10, which I  thought was a bit late anyway but sometimes it didn't open until at least. 10.30 and one day they were not going to open because there was a bit of a wind. The staff though were great but there weren't enough of them so they were run off their feet.\nThe location of the hotel was good and there were plenty of good restaurants and bars nearby.  Generally I would not recommend this hotel.",
            "time": 1726393651,
            "translated": false
        },
        {
            "author_name": "Milena Lamar",
            "author_url": "https://www.google.com/maps/contrib/115197622882754240316/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXlDzko11ShqTZU2DrEuBfYj4Gti1p-2GIu4P7oyYLBHp-Q3GDhMA=s128-c0x00000000-cc-rp-mo",
            "rating": 3,
            "relative_time_description": "2 months ago",
            "text": "Excellent employees! Except for one I found on the last day, it seemed to be replacing the attendant.\n\nThe place is great. But I was unlucky enough to find a cockroach in my room.\n\nBreakfast is very basic.\n\nThe location is worth it.\n\nBut, they owe me back the 5 euros they charged me when I arrived. They charge this fee to make sure we're going to return the key, I think that's terrible! And on the day I checked out, who answered me was an unprepared person and didn't give me my money back. I've already sent an email about it and I'm waiting for answers.",
            "time": 1727867052,
            "translated": false
        },
        {
            "author_name": "tzenaras __",
            "author_url": "https://www.google.com/maps/contrib/108176713553169234177/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUn-25CudFV4IdvyK4Zd8V62rRiCuU6GIhB_gGMcqBShq5KtOPP=s128-c0x00000000-cc-rp-mo",
            "rating": 1,
            "relative_time_description": "4 months ago",
            "text": "The hotel has nothing to do with the pictures on the internet.\nIt's not neat at all.\nIt has been maintained for years.\nBreakfast very poor and every day the same things.\nThe bartender is rude.\nWe paid €120 a night and it wasn't worth more than €70\nI wonder who reviewed it and gave it 4 stars...\nSad...",
            "time": 1721901076,
            "translated": false
        },
        {
            "author_name": "Lorenzo De Iudicibus",
            "author_url": "https://www.google.com/maps/contrib/117108473221912317055/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKhdBmvXKE5cw_m8phQ3RTXyELoYcjc9c4O3YoNA9t1pilviA=s128-c0x00000000-cc-rp-mo",
            "rating": 4,
            "relative_time_description": "a month ago",
            "text": "I stayed in this hotel last week with my school from Rome for a language trip and I must say that I had a lot of fun given the experiences I had that I will never forget.\nToday I returned to class and the routine has started again, but I will always cherish this week spent having fun with my classmates and teachers.",
            "time": 1729544918,
            "translated": false
        }
    ]
}