{
    "name": "Luciano",
    "rating": 3.9,
    "reviews": [
        {
            "author_name": "Tom Shaddock",
            "author_url": "https://www.google.com/maps/contrib/114221851650752419448/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKGtb4Uuha-Do6E9IQ_7dUE-f7uDglBfW35nqaJEeSsvQrYfw=s128-c0x00000000-cc-rp-mo",
            "rating": 2,
            "relative_time_description": "2 weeks ago",
            "text": "Honestly this place has really gone down hill in terms of food quality (while the price just keeps going up). Been coming here for years and has always been a mandatory lunch stop in Valetta but now the recent drop in food quality has just made it not worth coming. I think the chefs have been outsourced to the lowest possible labour cost and the ingredients quality also now very poor. The rest of the service is good though, as is the internal decor. Will be giving this place a miss in future",
            "time": 1732164080,
            "translated": false
        },
        {
            "author_name": "Saki",
            "author_url": "https://www.google.com/maps/contrib/101027201338962179715/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXUcVV7dVQrLmpaagE6LkutEmHG887PhpYvPKxkmgvdReselW0=s128-c0x00000000-cc-rp-mo",
            "rating": 1,
            "relative_time_description": "2 months ago",
            "text": "We had spaghetti with seafood which was “acceptable”, or edible if you’re hungry or not picky, most of the clams were mostly close. But what it was a truly disappointing experience was the pasta salmon, I could not figure it out why the taste was odd, I could not tell at the beginning if it was salmon, just smashed grey parts. Price was too much for the food quality.",
            "time": 1727469035,
            "translated": false
        },
        {
            "author_name": "Sara Szuwarska",
            "author_url": "https://www.google.com/maps/contrib/102429412930799533668/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWURWy80jFUWgvfuOLPZ2LFZ_5SsfQy_ISpyrRV2qGT-UbuXHzW=s128-c0x00000000-cc-rp-mo",
            "rating": 3,
            "relative_time_description": "3 weeks ago",
            "text": "The restaurant is quite mediocre. We had pizza, but it was hardly better than standard fast-food chains. The table wasn’t very clean, and the service could have been more professional. If you’re really hungry, it’ll do, but I’d recommend finding anything else if you can.",
            "time": 1731096853,
            "translated": false
        },
        {
            "author_name": "ililyopuppy",
            "author_url": "https://www.google.com/maps/contrib/102812126901024178737/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVLthigvhsUUCuqDiRR7jcAOAJo0NKHKNOh8R8MQanaM_cVc80=s128-c0x00000000-cc-rp-mo",
            "rating": 2,
            "relative_time_description": "5 months ago",
            "text": "We ordered pizza, ribs, steak, burger, octopus. Out of all of these, the pizza and ribs were very questionable. First of all, the pizza was literally drowned in olives. I love olives but I could sense the aura of all the olives on the pizza before we even entered the restaurant. It was like they just drowned and flavored the pizza with pure olive juice. There was so many olives I started eating them off the pizza and I dropped one in my water (which was my fault) but I could smell the STENCH of the olive from the bottom of my water, so there was no need to add that many. Secondly, who BOILS ribs? The only good thing about it was the sauce. The ribs itself were unseasoned and they were definitely not slow cooked, they shouldn’t even be considered ribs. They’re a fraud. The ribs were still soggy from the boil. The steak was good but there was a lot of fat. The service was good. This restaurant lost about 900 aura from this experience.",
            "time": 1720270963,
            "translated": false
        },
        {
            "author_name": "Kyle Boqli",
            "author_url": "https://www.google.com/maps/contrib/110007709586192863240/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIX2PwrOvF6sG0yXBoWynFmbPYfNXmSW_bf40ySAwIuyYLbbQ=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "Amazing food and great staff service! The pizza and pasta looked too good to photograph before being devoured sadly. Both cooked to perfection.",
            "time": 1728142628,
            "translated": false
        }
    ]
}