{
    "name": "AX The Victoria Hotel",
    "rating": 4.5,
    "reviews": [
        {
            "author_name": "Daniel Blight",
            "author_url": "https://www.google.com/maps/contrib/107589606408731651446/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ7b1HsGt5V1LBYjzB1hO9JvrY1onQ4OHqvr-PRwYh1xWNKWQ=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a week ago",
            "text": "Fantastic hotel, stayed at the Victoria in July this year for a short summer break away from the UK.\n\nThe rooms were lovely with massive beds and gorgeous bathrooms, balconies were a great addition. the rooms were cleaned and tidied daily by the lovely housekeeping staff.\n\nReception and bar staff were all great with reception staff being very helpful sorting taxis out and helping book activities to do around Malta!\n\nThe sauna, indoor pool and gym were a great addition. But the highlight was the roof top pools and bar with stunning views of the Mediterranean and Valletta!\n\nwould highly recommend and will definately be staying again on my return to Malta!",
            "time": 1732565949,
            "translated": false
        },
        {
            "author_name": "Arjun Greig",
            "author_url": "https://www.google.com/maps/contrib/100898700846135914202/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLXjcQ-yP4XJaZLNTt7It-nBNybatixHDggQ0wTz42WNLLl9Q=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "Me and my family stayed here in August 2023, and it was a fantastic stay!\nThe breakfast buffet provided plenty of options and I was always satisfied when using it. Reception were always helpful whenever we needed something. The swimming pools at the top are very good and the views are spectacular.\nBeing able to drink at the Palace's (neighboring hotel) bar and restaurant was also very convenient. The options of restaurants and bars at the rooftop too were also very satisfying to have.\nThe rooms are at a high standard along with having balconies with more tremendous views.\nHighly recommended if you're looking for somewhere to stay in the metropolitan side of Malta.",
            "time": 1725987132,
            "translated": false
        },
        {
            "author_name": "Johannes Elze",
            "author_url": "https://www.google.com/maps/contrib/112282202623196187079/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWMmeDh8ER4Acl7jgWZHTMbFSv2jGX4eXVPdNv5T87FqBRJygw6=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "Overall it was a very pleasant stay. We got a complimentary update to a wonderful and spacious room. The view from the balcony was superb as the beds were comfortable. The rooftop pool and sundeck were brilliant too. The huge breakfast buffet was excellent and all of the staff members were extremely helpful. No matter what, I felt treated like a very well appreciated guest. It's a very professional run hotel which also cares about the small things in the guests everyday life.",
            "time": 1724746773,
            "translated": false
        },
        {
            "author_name": "DD Banks",
            "author_url": "https://www.google.com/maps/contrib/115560753362316037505/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ3ES79yY4cWCv8vKx1YoxssKh11bygtx7OMYdNVpzvBAFj6w=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 4,
            "relative_time_description": "a month ago",
            "text": "Good hotel, located a few mins walk from the beach. Rooms were spacious and well decorated. Staff were all friendly and very helpful. Really well equipped gym, indoor pool and sauna. Steam room functioning but there’s an damp/mouldy smell in there. Rooftop pool area also lovely with a nice sea view. Wasn’t a big fan of the breakfast though so docked a point. Fruit juices were from concentrate, coffee machine makes some very bad coffee and the food in general wasn’t up to scratch for me. Hotel also caters to families/older demographic from my experience which for me is fine but may not be suited for a group of lads for example. Total cost for 4 night was £500 including breakfast. Probably fair considering the facilities.",
            "time": 1729881697,
            "translated": false
        },
        {
            "author_name": "Alison Rutland",
            "author_url": "https://www.google.com/maps/contrib/114428203449966261484/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJfrJY-JgAJe5Cdr2k68vszBt5voIFKgMorA-3-tNWwMc-f8Q=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "Lovely hotel in Sliema. My husband was in the hospital next door and the location was ideal.\nI found the most wonderful and concerned members of staff on the front desk, Charles' welcome each morning at breakfast.\nMarvellous Penny Black bar for an evening snack.\nThr room was very comfortable, and the cleaning staff efficient always helpful.\nThank for making my stay during a worrying time so wonderful.",
            "time": 1729868546,
            "translated": false
        }
    ]
}