{
    "name": "Spinola Hotel",
    "rating": 3.7,
    "reviews": [
        {
            "author_name": "Toska_fit",
            "author_url": "https://www.google.com/maps/contrib/107479337346248938411/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWfEob2Ve0lXx_E75ORSPCAJDGNLkiJfugLMh3Z6PEYcTnDrWI=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "a year ago",
            "text": "Very good attention! Stuff in the reception - was very helpful and nice. The room - the first impression wasn't the best, but the room had everything you need - kettle, tea, coffee, cup for coffee, glasses, fridge, AC, soap, gel and hairdryer. Towels changed daily. Room cleaned daily. Very good prices. Very good location. Just one thing - this area is a little bit noisy - because of the clubs around, but maybe you can get a room with windows on other side so that will be great. In general - I am very happy about this stay.",
            "time": 1681755917,
            "translated": false
        },
        {
            "author_name": "Oona Ottelin",
            "author_url": "https://www.google.com/maps/contrib/116999920642912633827/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVp35zLcnkf0u2drQFeZGgs4l31GzLIxB4zAW60SDCrcI2J2DcPCw=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 4,
            "relative_time_description": "a year ago",
            "text": "Overall, it was a very basic hotel. We paid about 100€ a night in June and thought it was a bit expensive for what it offers\n\nSleeping: The mattress was not very comfortable. The duvet was nice, quiet, black out curtains, and we slept well\n\nBathroom: towels are thin and small, but they give you clean ones daily, hot water, and good water pressure, water runs yellowish when you first turn it on, shower hose holder is loose, black spots in silicon lining (maybe mold), we had a bathtub which was nice for my toddler\n\nCleanliness: it was OK but could have been better (there were some hairs in the shower and the carpeting felt dirty). bedding and towels were clean\n\nWi/fi: worked well in the room (I work online and watch movies, and I had no issues at all doing this)\n\nService: 24/7 Front Desk, everyone was nice and helpful\n\nBreakfast: cost extra, I didn't try it\n\nRoom: we had a room with a balcony (city view), spacious enough for me and my toddler, desk, closet, a/c, fridge, kettle\n\nLocation: Great if you need to be in St. julian. It's walking distance to all the main spots and bus stops, food, beach, shopping etc.\n\nOther: I had issues opening the room door, but they gave me another key that worked better. The lights in the hallway are quick to turn off, which was a bit annoying. Last day they forgot to give us towels (they removed the old ones but didn't leave new ones)",
            "time": 1687275456,
            "translated": false
        },
        {
            "author_name": "Livio Cortese",
            "author_url": "https://www.google.com/maps/contrib/115568158863349057223/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW_XJbMhILOIeCffuuO9V4NGnraGvO0buVOj9NuNecJpv4qFRSu=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "2 years ago",
            "text": "A very clean place, in a central position: 50 m to the bus stop (to go everywhere in Malta) and very close to the seafront.\nClean room and nice staff, they've always been very helpful and polite with me and my girlfriend. Thanks a lot, this hotel will be surely a landmark for our next trips in Malta, and I'll suggest surely to our friends.",
            "time": 1668495471,
            "translated": false
        },
        {
            "author_name": "Helen Lambrou",
            "author_url": "https://www.google.com/maps/contrib/102499023140845070686/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV3wdlK-ZGblGuOXroDwK7rmu-5M3YlQON1R9AFp_wcvlI_8oo=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "2 years ago",
            "text": "The hotel is located mere minutes from restaurants, supermarkets, and the seafront. The staff is amazing - a big shout out to Valerie and John who were simply wonderful! Thank you for making my stay so memorable. Valerie and John, you are first class!",
            "time": 1669044182,
            "translated": false
        },
        {
            "author_name": "PartyTimeBH B",
            "author_url": "https://www.google.com/maps/contrib/105546096159587156988/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWeEjD4b_yW86Zg4UHOCF-r6yhszCUjEFhm9NOOtRnJutS-0MfQ=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 3,
            "relative_time_description": "6 years ago",
            "text": "My first impression was that it's nice, the reception staff sweet and helpful (let me leave my luggage with them before 2PM, which helped me a lot not having to lag it around) The room is much smaller then in the pictures. There is rust on the tap and shower. The toilet seat is broken. The cleaning staff was very loud outside rooms and while cleaning room next door. Also the hotel is right next to a very busy and loud street. But it is right next to a small store that is open till very late and next to a lot of restaurants. Plus the bus station is not even 100 meters from the hotel to the airport. The aircon was keeping the room at a good temp. There was very loud  construction work going on right outside my window, they started early and kept the noise up all day long. If you're planning on sleeping and resting this is not the right place, but for the convenience of exploring and sightseeing is really good!",
            "time": 1521711511,
            "translated": false
        }
    ]
}