{
    "name": "Radisson Blu",
    "rating": 4.6,
    "reviews": [
        {
            "author_name": "Franco Cravero",
            "author_url": "https://www.google.com/maps/contrib/112874955461442561935/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV33qAvIlzRF6Y4xPSaDwlftnyO5busU9i1MjbjPgrvcHUdM_TW=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 5,
            "relative_time_description": "in the last week",
            "text": "I recently had the pleasure of enjoying breakfast at the Radisson Blu, and it was an exceptional experience from start to finish.\n\nMarisa, the hostess, was absolutely wonderful. She was incredibly lovely and welcoming, making me feel right at home. Since it was my first time at the breakfast venue, Marisa went above and beyond by taking the time to walk me through the various meal choices and special offers available. Her attentiveness and friendly demeanor set the tone for a fantastic morning.\n\nThe breakfast area itself boasts a stunning view of the sea, which adds a serene and picturesque ambiance to the dining experience. The entire staff was warm, friendly, and genuinely caring, ensuring that every guest felt well taken care of.\n\nOverall, my breakfast at Radisson Blu was nothing short of delightful. The combination of excellent service, a beautiful setting, and delicious meal options makes it a must-visit. I’m already looking forward to returning!",
            "time": 1733042092,
            "translated": false
        },
        {
            "author_name": "Lubomír Laski",
            "author_url": "https://www.google.com/maps/contrib/100132483196270375249/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXGbdOW8QKbrbG_b1knyZNvaNUIGFFmO-YenWtVcaoO4F-5Pt6u5g=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "3 weeks ago",
            "text": "We had an absolutely wonderful stay at the Radisson Blu Resort in Malta at the break of October and November. I visited with my wife and our two young kids, and the entire experience was perfect.\n\nThe hotel and rooms are beautiful, spacious, and very well-maintained, offering everything we needed for a relaxing family vacation. What truly made our stay exceptional, however, was the incredible staff. Every member of the team was incredibly kind, attentive, and genuinely made us feel welcome and cared for throughout our stay.\n\nWe want to give a special thanks to Matthew, Margaret, and Marisa for going above and beyond to make our time at the hotel even more enjoyable. Their warmth and dedication truly made a difference, and we are very grateful for their hospitality.\n\nOverall, the location, service, and facilities were outstanding. We couldn’t have asked for a better place to spend our family vacation, and we would highly recommend the Radisson Blu to anyone looking for a memorable stay in Malta.",
            "time": 1731323174,
            "translated": false
        },
        {
            "author_name": "Lala Ismayilova",
            "author_url": "https://www.google.com/maps/contrib/110475687751174093426/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWotZYnUTuIKKPp1Fh6Tn1_GEsX3yPFhvuDhuuacs4kV0HeEHQ=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "2 weeks ago",
            "text": "Enjoyed the stay , the outdoor pool usually does not get sunny but the indoor pool and sauna was nice.\nTried massage at spa, and want to highlight Virginia as she was very professional and nice however my husband also tried massage with the other therapist and did not enjoy it as much.\nThe location is a bit far from the central streets but has a good view.",
            "time": 1732204347,
            "translated": false
        },
        {
            "author_name": "Pauline",
            "author_url": "https://www.google.com/maps/contrib/108297760074977552619/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLUTORS86eKuEf-BLiNGzHtEY_wE5OKdTx-AFpvF8U6l_1D9Q=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "3 weeks ago",
            "text": "The hotel was lovely, very clean with good facilities.\nWe stayed at the hotel on a b& b basis. The restaurant was well laid out and the selection of food on offer was good. The staff immaculately turned out and hardworking.\nThe reception staff were excellent, especially Melody who was a delightful charming and helpful young lady. She helped us with getting medical assistance for my husband and arranging transport to the medical centre. It was a real comfort for the genuine care and concern she showed us at a difficult time. She even arranged a follow up call to see that we were alright. She came across as someone who is professional, dedicated and with an eye to detail. An asset to any front of house team.\nAlso a shout out to Wilfried, with his lovely smile, who helped us sort out the room safe.\nThe hotel room was spacious, with lovely white fluffy towels  and dressing gowns to use when using the pools and treatment rooms.",
            "time": 1731508996,
            "translated": false
        },
        {
            "author_name": "Wayne Grech",
            "author_url": "https://www.google.com/maps/contrib/117508799100382500172/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWOuqxj4Rg4wDo70d1O2uHARcy3nm5TkOL-QsOwaACw0LjIhUqt=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a week ago",
            "text": "We had a fantastic Sunday lunch with exceptional service to match. The food was delicious, and the warm, welcoming atmosphere made the experience even better. A special shoutout to Marisa and Mathew for their outstanding hospitality—they truly went above and beyond to ensure everything was perfect. We’ll definitely be returning soon!",
            "time": 1732455647,
            "translated": false
        }
    ]
}