{
    "name": "Schick Hotel Erzherzog Rainer",
    "rating": 4.6,
    "reviews": [
        {
            "author_name": "Leonardo Rangel Augusto",
            "author_url": "https://www.google.com/maps/contrib/102695997847084436450/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVRsaxpY4iaW0dHHfulLJWaKaVnGbyN_813xTf_KEP6WdWBB9NWQQ=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "The room was spacious, renovated, and clean. It's equipped with a fully loaded mini-fridge and snacks. We had great sleep, thanks to the temperature control, excellent window blind, great bed, and quiet neighborhood. The breakfast is outstanding, with a combination of typical viennese baked goods, charcuterie,  cereals, beverages and much more. Its extended hours (6:30-10:30) were very convenient as well. Service was fantastic, with the staff kindly reaching out and leaving some welcoming handwritten notes and sweets. The location is great: just a minute away from the metro, with grocery stores, markets, and restaurants nearby, many of them not on Google Maps and open until late -- go out and explore. I certainly hope to come back.",
            "time": 1727097346,
            "translated": false
        },
        {
            "author_name": "Natalia Kryvokobylska",
            "author_url": "https://www.google.com/maps/contrib/101121278187831511471/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIW0gYb_FIc-raUW76Hp5gPuqTiJV8x-urvcG0-aKyHd0H7fn4=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "4 months ago",
            "text": "Very nice old but good maintenanced Vienna spirit hotel. İt is very close to the metro station and not far from old city. The hotel is located on one of the central streets but at the same time it is very quiet. Good spacious room,  clean with everything necessary in it. Nice breakfast.",
            "time": 1722589153,
            "translated": false
        },
        {
            "author_name": "Helen Cobler",
            "author_url": "https://www.google.com/maps/contrib/103306515449493263583/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV2u8CBxr4V95BsR01bBQzTCg1XWaHgQQxt5YZghapt3pLUk0oB=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "5 months ago",
            "text": "Very clean, comfortable rooms.  Great breakfast included.  Staff is very gracious and helpful.  Location is good.  I was glad I had friends with me who were savvy with train travel and getting around.",
            "time": 1719746956,
            "translated": false
        },
        {
            "author_name": "Siobhan Corcoran",
            "author_url": "https://www.google.com/maps/contrib/108779789826795304305/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVZ3dAtt4fkrHAmhiat0umazJ8bA-mmgEkqVtlqSErPOPthT2U=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "5 months ago",
            "text": "This is a lovely hotel with lots of character in a perfect location, just a couple of minutes stroll to the underground station and a short walk to the Nacht Market and museum district. The area itself has lots of lovely indeed shops, bars and restaurants and a cool brewery within a short walk. The room was fantastic,  spotlessly clean and comfortable and all the staff we met were really friendly and helpful. Breakfast is served in a lovely room and is very tasty. Highly recommend 👌",
            "time": 1718204448,
            "translated": false
        },
        {
            "author_name": "Elena Petersone",
            "author_url": "https://www.google.com/maps/contrib/117516451592660224591/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUUVNTwndJJMT1PwXS9RVZ4XSCNAmAeBx1mlh6kUKWQQChP9D8L=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "5 months ago",
            "text": "I had a nine-night stay in Schick Hotel Erzherzog Rainer this June and it was absolutely wonderful in every aspect. The locations is great: metro line U1 just a short walk from the hotel (very easy to get from and to central railway station); a quiet pleasant street with the lovely Mozart fountain-monument, lots of places to eat, shops, pharmacies etc. All staff was very nice, professional, helpful, always smiling; the room was impeccably clean, the breakfast rich, tasty and varied (including many options for people with allergies); the interiors are beautiful with a charming touch of history. Staying here definitely added to my experience of Vienna as a capital of elegance, dignified friendliness and - yes, schick! I hope to return one day and I would readily recommend this hotel to anyone who wishes to have a calm, comfortable, delicious stay in this gorgeous city. Thank you!",
            "time": 1718356263,
            "translated": false
        }
    ]
}