{
    "name": "Austria Trend Hotel Europa Wien",
    "rating": 4.4,
    "reviews": [
        {
            "author_name": "Jaap Boom",
            "author_url": "https://www.google.com/maps/contrib/100257866030502369349/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXZe4E09_KDMZCz9H6hPuH_9RJ37gMONv6kYQaCiychhvVIbOJH=s128-c0x00000000-cc-rp-mo",
            "rating": 3,
            "relative_time_description": "a month ago",
            "text": "Stayed here a few times; never wrote a review; unfortunately this time I did and was needed. Bed and room fine. Kitchen brigade (more than excellent omlette) at breakfast all praise and friendliness. Service in the bar leaves much to be desired; the colleagues are busy with each other. After waiting 20 minutes no service and then left. Check-in fine and greeted friendly; however upon departure disinterested lady. In the settlement she starts interfering with the colleague instead of further processing my check-out. The bill was paid but not received. To my horror discovered that I forgot to report the consumption of the peanuts in the room. Thank you for your stay apparently does not exist. Back again, also because of my regular stay in Vienna? I have my doubts.",
            "time": 1728896964,
            "translated": false
        },
        {
            "author_name": "V Dro",
            "author_url": "https://www.google.com/maps/contrib/107151042453231591844/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJoT3yXcuT2OheRwxiItgBlsAyaDtpppMF25zszAdAOvuPHug=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "The hotel is located right in the center of Vienna. All the shops, sights and restaurants can be reached swiftly by foot. Public transportation is also nearby. The rooms had a decent size and were nice. One thing to criticize is that it could have been cleaner, it wasn’t dirty or anything, but still, some furniture didn’t look very nice (e.g. glass door to the bathroom). Also, a bit expensive for what is offered. However, staff was very nice and it was possible to store the luggage before check in/ after check out. All in all, a good hotel with a great location.",
            "time": 1723666211,
            "translated": false
        },
        {
            "author_name": "Elaf Abdulaziz",
            "author_url": "https://www.google.com/maps/contrib/103606729670024386056/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXkm9wNR8qHkpA2QcBZpAFl1LPao555pDEYRxB8ftn-IZ_JUMmu=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 4,
            "relative_time_description": "a month ago",
            "text": "The only thing good about the hotel is the exceptional location as for the rooms they are less than average and pricy for its furniture and bathroom quality. Also the lighting is a bit dim especially in the bathroom i had to do my make up near the window light so I can see better. Maybe if they lower their price I might stay at it in my next visit",
            "time": 1729021124,
            "translated": false
        },
        {
            "author_name": "Ellie",
            "author_url": "https://www.google.com/maps/contrib/109656041052402047747/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIuBKWQ8S3PQGi8MU8Z3MTpS3x9DK4kzg4WodYxBU387rHTRA=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 5,
            "relative_time_description": "5 months ago",
            "text": "Absolutely brilliant for the price, could definitely charge more and I would still pay it. The location is literally in central Vienna and you can walk to all the main attractions. The room was clean and bright and more spacious than we expected too.\n\nWe were so pleasantly surprised with this hotel after seeing a few bad reviews. But our experience was amazing and we would 100% go back if we were to visit Vienna again - and to top it off, the view from our room was unbelievable!\n\nDefinitely recommend staying at this hotel!",
            "time": 1720301543,
            "translated": false
        },
        {
            "author_name": "Bret Sinclair",
            "author_url": "https://www.google.com/maps/contrib/105590936015422886050/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUnJd3gH_vp36q0s52cThxUe6TELF6n8MYWRySwplyKTKEMzBXL=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "4 months ago",
            "text": "This hotel is excellently located in the centre of Vienna with everything only a walking distance away. It is conveniently located to all the major attractions. The room was spacious and had a nice view of the square and the fountain!\nThe staff were amazing and very accommodating. On our arrival they upgraded us to a better room for free and on my fiancés birthday they even surprised us with a cake and a note which was a lovely surprise!\n\nThe room was always cleaned and spotless. The reception staff were also helping in any directions we needed to get to the places we needed.\n\nHighly recommend this hotel and we will miss Vienna very much.",
            "time": 1720770448,
            "translated": false
        }
    ]
}