{
    "name": "BoutiqueHOTEL Donauwalzer",
    "rating": 4.5,
    "reviews": [
        {
            "author_name": "Rychard Stanton",
            "author_url": "https://www.google.com/maps/contrib/111933220272632981307/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUVi849lp31nhRsbgr8osgEbkggdoL1v7IPio19I_yPGuYRHYMnbg=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "a week ago",
            "text": "We were very well looked after and enjoyed our stay. The breakfast has a wide selection of meat, vegetarian, vegan and gluten free foods. The rooms are unique and very well laid out. Transport links are ideal with tram and train lines on your doorstep. Highly recommend",
            "time": 1732438761,
            "translated": false
        },
        {
            "author_name": "Carrie Bird",
            "author_url": "https://www.google.com/maps/contrib/102272670747894475278/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJm9-ddLssj71AmJlSwGO94YP8KFmiTHQU8j6SRLcpCoNjB2g=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "We loved our horse room 502 in the eves of the hotel Very clean everywhere\nFriendly helpful staff that spoke English ( always helpful)\nBreakfast was overwhelming with so much choice even frizzante! Never had cake for breakfast before !\nCould do with a hand wash basin in the toilet as you have to touch door handles then go to the bathroom area to wash your hands 🫣\nRoom needs a sofa or comfy chairs to make it perfect!\nLocation was fine if you are savvy to use the trams etc but a bit far to walk if you are less able bodied\nCharging for water in your room seems a little off when they serve SO much for\nbreakfast 🤷",
            "time": 1730196230,
            "translated": false
        },
        {
            "author_name": "Abhinav Mishra",
            "author_url": "https://www.google.com/maps/contrib/114599774370540249626/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ4MJ2fahBeTUbkpeZv6A03syUiqPQEfOvPICLY2TigLb1YNQ=s128-c0x00000000-cc-rp-mo",
            "rating": 1,
            "relative_time_description": "a week ago",
            "text": "\"Beware of Deceptive Practices at This Hotel: My Disappointing Experience\"\n\nI almost got scammed by the hotel staff—here’s what happened:\n\nI booked a **Classic Double Room** for two nights. Upon check-in, they assigned me a room on the first floor. To my surprise, the room was nothing like what I had booked. It was infested with flies, resembled a low category room, and had a shower area with no door—just a wooden divider. The amenities were extremely basic and looked like they hadn’t been updated in ages.\n\nShocked, I went to the reception to verify if they had assigned me the correct room category. Instead of addressing my concern, the staff acted as if I was mistaken, claiming that room designs vary and suggesting I check the images. It was obvious they were trying to convince me that the substandard room I received was normal.\n\nWhen I asked to change rooms, they claimed no other rooms in the same category were available. Frustrated, I informed them that I would have to move to another hotel. Only then did they suddenly “find” another room for me. This new room matched the pictures of the one I originally booked—proving they had deliberately tried to give me a lower-category room while making me think I was wrong.\n\nThis deceptive behavior completely ruined my experience. I strongly advise against staying at this hotel.\n\nCheck the images.",
            "time": 1732260402,
            "translated": false
        },
        {
            "author_name": "Ron Šmeral",
            "author_url": "https://www.google.com/maps/contrib/100845255292691453225/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUzziGXe-MSUPzb7CqAokTJWz4rD_Le6-vrezS3hdoCz2MXFaAc=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "Beautiful, quiet room for a great price. Even though the room didn't have a kettle which we hoped for, we were pleasantly surprised by one thing I've never seen in any other hotel room – a yoga mat!\nUpon our (last minute) reservation, there was some miscommunication, and the room was not properly cleaned when we first entered it, but the staff promptly resolved the situation by giving us another (better) room. Staff was very professional and helpful.\nBreakfast was great!",
            "time": 1726514638,
            "translated": false
        },
        {
            "author_name": "Amy Krasnyanskaya",
            "author_url": "https://www.google.com/maps/contrib/107874943113274922233/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWOyJsykulvxpEC0hsPhz9IN6tiFeux4jYDVfWOZmbTG7KJmQKY=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "If you're going to Vienna, stay at this hotel! Unless you have enough money to stay in the -- very busy -- city center, I recommend you stay here -- an easy and interesting 20 min walk/subway ride to the city center. The service, from the servers at the lush and varied breakfast buffet, to the owner of this family business, is fantastic. I truly felt like I was coming home after the first day. In particular, I will shout out Raffaela and Carina for their easy and cheerful helpfulness. One of the things we most appreciated was that the Boutique acted as a concierge for us, calling taxis and making reservations when we could not figure out how to communicate in German. The rooms are moderately-sized, with very comfortable, firm-ish beds. The rooms are well designed to make good use of the space. This is one of the great European cities, and the prices at this hotel are quite good, so I'd not worry about the room size -- hopefully you'll just be using it to sleep :)  I know I sound like a marketer, but the Donauwalzer is such a lovely place, filled with the absolutely best staff you'll ever encounter. I wish you all the best, my friends!  Amy K",
            "time": 1729209314,
            "translated": false
        }
    ]
}