{
    "name": "Hotel Daniel Vienna",
    "rating": 4.2,
    "reviews": [
        {
            "author_name": "Anna L.",
            "author_url": "https://www.google.com/maps/contrib/101027549349852481173/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIkjeFN2cr0lT8fqLRJldu7H-Fkbugb1yjrqtl_b6bGLzyr2g=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 3,
            "relative_time_description": "3 months ago",
            "text": "Booked this hotel because we heard how amazing the breakfast was supposed to be. The room was small but cozy, our window was out towards the main road and it was very noisy. The blinds didn't do a good job at blocking out the lights. Someone made the beds daily but they didn't vacuum the floors, which got weirdly dusty very quickly. The staff were friendly enough but always seemed a little annoyed when you approached them. The breakfast wasn't labelled with allergens and there were no gluten free bread options. I asked for decaf coffee which they said was out. I think 25 euro for a buffet style breakfast with automated machine coffee is a bit much. They had a waffle maker but waffles only seemed to come out one at a time every 15 minutes so it was hard to get a piece. Orange juice came out of the box, sadly not freshly squeezed.\nThe best part about this hotel was that you could rent bikes, they were in good condition and we had a lovely day exploring the city! The location was amazing.",
            "time": 1724463007,
            "translated": false
        },
        {
            "author_name": "Libor Trško",
            "author_url": "https://www.google.com/maps/contrib/110559846981308879110/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXgIr4KD2vkRTQIHrIj-5BlNZC_r3drX8TC_FqsKfQmk2I0Zitl=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 4,
            "relative_time_description": "in the last week",
            "text": "A very nice hotel near the main train station in Wien and also close to majority of the city center sightseeing locations. Breakfast was delicious with a wide range of food types. One strange thing that surpriesed me was shower in the middle of the room with see through glass. This is nice for a couple but sharing a room with just a friend would be ackward.",
            "time": 1732817683,
            "translated": false
        },
        {
            "author_name": "Joe",
            "author_url": "https://www.google.com/maps/contrib/109755406115164755947/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVi-lcL-E1ZlRf5OKinA-JoYVv0TlE7XE642FBUZS55u_5Q754j_A=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 4,
            "relative_time_description": "3 months ago",
            "text": "Very quirky hotel, good location (near to a tram stop and next to a park), friendly staff. Bed was one of the most comfortable I've used in a long time. The blinds aren't very good at keeping out light in the morning, or for privacy, which was a bit annoying considering the shower is in the main bedroom, right by the window and facing a main road... Some normal curtains or electronic blinds would really make a difference.",
            "time": 1725629955,
            "translated": false
        },
        {
            "author_name": "Barry Smart",
            "author_url": "https://www.google.com/maps/contrib/116132984501448053412/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUM3VtnI7sSjf-hiHX2mNMecAdT3bhInIDSA_oT1I-olgAShLI=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "Great hotel, staff so friendly and helpful with help finding anything you need, from places to go how to get there and most economical way to get around. Yes it’s different from the normal hotels in its decor, but for us we liked it and would happily stay again. The hotel is very conveniently located to all attractions and for all modes of transport from buses , trams and a short walk to the main railway for metro and main line destinations. Recommend getting a pass at the local station for what ever period you want as this will get you on all Vienna city transport and however many times you need, nothing is too far away. Yes it’s in a main road and can be a little noisy, but get out and explore, you will be so tired you will sleep like a log and won’t hear anything anyway especially in the really comfortable beds .\n\nI cannot recommend this hotel highly enough.\n\nJust brilliant",
            "time": 1727622924,
            "translated": false
        },
        {
            "author_name": "James Cameron",
            "author_url": "https://www.google.com/maps/contrib/101397128948874653916/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX5VlIgVDa8NUcLB5VhVyCc2slB6Phpp_lv26mpJC_aNVAfw1qD=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 3,
            "relative_time_description": "4 months ago",
            "text": "Lovely rooms and great location. The breakfast is absolutely amazing although it is pricey. There are no facilities for making hot drinks in your room and no room service (which we only discovered after ordering some drinks and waiting 45 minutes for them  not to arrive).\n\nAfter we had booked our rooms, we found an offer online giving a 30% discount for multiple rooms which was not there when we booked. We decided to see if they would still honour the offer when we arrived and the receptionist was very kind and said they would. When it was time to check out however it was a different receptionist and there were no notes on the system, end result no discount. Obviously if they’d refused in the first place that would have been entirely reasonable, but the fact they said they would honour it then didn’t meant we left on a low note. Overall it seems communication between staff is the underlying issue.\n\nDespite this I slept amazingly there, the beds were fantastic and it was a lovely holiday in a beautiful city.",
            "time": 1722254681,
            "translated": false
        }
    ]
}