{
    "name": "Hotel Astoria Wien",
    "rating": 4.3,
    "reviews": [
        {
            "author_name": "Sandy H",
            "author_url": "https://www.google.com/maps/contrib/105482149870623745457/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIQ8l13YcVnET68D5kbfJk_k1qj5zPbWnbarzo8SKCDNs7MSg=s128-c0x00000000-cc-rp-mo",
            "rating": 4,
            "relative_time_description": "a month ago",
            "text": "The location was good. The staff, especially the man that helped with our luggage, were all polite and helpful. The room was nice. The hotel was clean. The style and decor were very elegant. The bathroom was clean, spacious, and had a nice shower.\n\nWe had a room with a queen size bed, but it had two separate twin size comforters on it, which I would have preferred one queen size comforter, and in the defense of the hotel, I didn't request one either.  There weren't any luggage racks in the room. Instead of key card, it was a key with a weight on it that had to be given to the front desk anytime you leave and then picked back up when you come back. This is not the first time we have had it do this at a hotel, but in a newly renovated hotel I would have expected the convenience of a key card. It is quite annoying to have to pick up a key anytime you want to run out for a few minutes or a few hours.  But none of these were major issues.\n\nWe would recommend this hotel to others coming to Vienna.",
            "time": 1730740135,
            "translated": false
        },
        {
            "author_name": "Shara Terjung",
            "author_url": "https://www.google.com/maps/contrib/110790925307911223538/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLK7s4kzpyPoQKfZMlNzPfbzLB2giTeQBei_vu79p4Aq5eZ4g=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "Absolutely gorgeous hotel with the best service I have experienced in Europe. Staff were warm and welcoming and happy to help with any matter (even when we came in sweaty and bedraggled from the heat!). The hotel is beautifully and lovingly restored -- really feels like you are going back in time! The location is marvelous if you want to be right in the heart of things. Even being in such a busy a street, the lobby is immediately calm and relaxing -- truly an oasis.\n\nThe rooms have excellent soundproofing, and we heard no street noise at all. Blackout curtains are in place, but there is still a fair amount of ambient light from all the shops. Not enough to bother me, but good to know.\n\nThe air-conditioning was excellent -- very much up to American standards. We had a junior suite, and the fresh fruit was an excellent touch -- we really appreciated it!\n\nPerfect hotel for a special occasion or romantic getaway.",
            "time": 1724769121,
            "translated": false
        },
        {
            "author_name": "Deena Alshwairikh",
            "author_url": "https://www.google.com/maps/contrib/110954599738234625842/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV4zN3u1YxanzyWZgwP0J4p4xJAw-kTsfduwHMgy7nn1cyqEmg=s128-c0x00000000-cc-rp-mo-ba6",
            "rating": 4,
            "relative_time_description": "a month ago",
            "text": "Great location close to many attractions but it gets noisy at night. Room is old fashioned and little bit old but clean and somewhat big. The breakfast was good and full of different options and staff were friendly and helpful. They have physical keys only and it’s recommended to drop it at the front desk since the key chain is big and heavy.",
            "time": 1728813614,
            "translated": false
        },
        {
            "author_name": "Meredith O'Neal",
            "author_url": "https://www.google.com/maps/contrib/100291275707433473088/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWJApFFOnStqTYpPonUuAH0REWoFAixQdPN2vJZEzBL4YmgiQ5H=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "5 months ago",
            "text": "5 stars!! The hotel has an old-charm feel but modern at the same time- our stay was great.\nService: I last minute requested an early check-in that was declined, but reception was able to find a room that was ready right when we got there at 12:00pm (bless!!!). They were very easy to work with at check-in and very kind. We ordered breakfast room service one morning and it was great.\nRooms: I was unaware there was even a renovation until I read the reviews, and it absolutely paid off! The rooms were extremely nice. I had a superior room and the size was perfect. The AC was almost too cold at times (a good thing for me!). The toilet is separate from the shower room which is also a nice touch.\nLocation: 10/10. In the middle of everything, but off to the side so it's not loud. Could walk to all the shops we wanted to go to!",
            "time": 1718829933,
            "translated": false
        },
        {
            "author_name": "Monika Miljus",
            "author_url": "https://www.google.com/maps/contrib/101889891779084263278/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVkdHwo5joWfIFHpS0hLoMhw0kxizGyZPyb1CziaLSAqIOBQ_Ey=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "3 weeks ago",
            "text": "The hotel is located in the center of Vienna. If you are interested in coming to Vienna to see the museums, I would definitely recommend it as it’s close by the museums and the Opera. Hotel was recently renovated. The staff made sure we felt like we were at home. A big Thank you to all staff, especially Dejana and the rest of the staff working at the reception. We were also served by a Serbian waiter in the lobby bar who was very knowledgeable about the selection offered and polite. Overall, a very pleasant experience and we can’t wait to come back!",
            "time": 1731414557,
            "translated": false
        }
    ]
}