{
    "name": "Austria Trend Hotel Savoyen Vienna",
    "rating": 4.5,
    "reviews": [
        {
            "author_name": "stacy pak",
            "author_url": "https://www.google.com/maps/contrib/113463428162880705522/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLh8GfjsG8xlwJSwjXHPRG0Wwe7TO9l48B_7LjcKhDcIWkE0g=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "The room was very comfortable and the beddings were perfectly great.  It was very warm and clean.  Very nicely prepared for us.  Really enjoyed the breakfast and the pleasant staffs made the stay at this hotel very nice.  The warm water at the shower and bath tub were very stable with the set temp.  If I come back to Vienna again, I will definitely come back to stay here again.",
            "time": 1729186853,
            "translated": false
        },
        {
            "author_name": "Oliver Warne",
            "author_url": "https://www.google.com/maps/contrib/103919146865020326362/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVXi3YVXxoOQvHG0xyj9Ext1L0efCF9Di9kBEhDriNw9rMVc8lh=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 3,
            "relative_time_description": "2 months ago",
            "text": "First and foremost, I feel the staff have a difficulty being honest and clear with communication. 2 examples:\n\nWhen we checked in, we had more guests present than we initially had planned.  The staff at front desk implied that we were not allowed to have more than two people per room. When I asked them if that was a rule, they replied that it wasn't physically possible to squeeze our air mattresses into the room to accommodate our extra guests.  We paid to upgrade one room to a suite, only to discover that it was completely feasible to squeeze the extra guests into the original room.\nIn the bar they have a restaurant. The restaurant has a separate menu for food items available after 10pm, But both times I tried to order off this menu, I was met with resistance and excuses.\n\nIf you have a policy that only two people can share a regular room, then please just state that instead of lying. If you have a problem serving food after 10 pm, then please just say that instead of deflecting.\n\nThe suite we upgraded into was beautiful,  the breakfast was excellent, and the location was great for sightseeing.   But I got the impression that this hotel is operated with dishonesty.",
            "time": 1727539296,
            "translated": false
        },
        {
            "author_name": "Gary C",
            "author_url": "https://www.google.com/maps/contrib/107078272975691155264/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKO6Fet7GpuivgORrb8mWTRPVeIF9D7a_zjNxh3ecgzke2h0sw=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 3,
            "relative_time_description": "a month ago",
            "text": "Clean and comfortable hotel with nice staff. No ironing board in the room, or even on the floor, meaning you have to go queue to use two communal ironing boards. The hotel gym is very small with exceptionally limited equipment.",
            "time": 1729776860,
            "translated": false
        },
        {
            "author_name": "Bjørn",
            "author_url": "https://www.google.com/maps/contrib/101612741423845604079/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUEQ7xxVYZu98lcM6sTvREPJzkh0kbs0R-3nihn-guS4JPTp_TZ=s128-c0x00000000-cc-rp-mo-ba6",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "I was here for a conference, so my review would only be for event facilities. They were however really good and the food and beverages throughout the day was excellent! Good audio in the big rooms and comfortable chairs even for a long day.",
            "time": 1730743071,
            "translated": false
        },
        {
            "author_name": "Remco _",
            "author_url": "https://www.google.com/maps/contrib/103645694657594502555/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJNFhjWYbXT04KHhjjNg92_l0YTOKaGJSLzqd32aGrNEmA3hw=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "Good hotel. Stayed there for the weekend. Rooms are spacious, good bed, clean. Good bar with surprising good food.\n\nBut breakfast  was subpar. Stale bread, low quality all round. There is an excellent bakery just down the street so get a better and cheaper breakfast there.",
            "time": 1730060495,
            "translated": false
        }
    ]
}