{
    "name": "Do&Co Hotel Vienna",
    "rating": 4.3,
    "reviews": [
        {
            "author_name": "Steve Urpani",
            "author_url": "https://www.google.com/maps/contrib/105840917864878661591/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXO5VOZsloHG1w2DiLCxvHL77dr2S8ww63yn9dlQcOvHn9i-XR-=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 4,
            "relative_time_description": "2 months ago",
            "text": "Went for dinner at the top floor restaurant. Amazing views ! Food was very good, service very efficient and atmosphere enjoyable. It was a Saturday evening so they were super busy but coped nicely. Starters were very tasty and mains were good portions and beautifully presented. Prices were very reasonable considering the position of the restaurant.",
            "time": 1727178388,
            "translated": false
        },
        {
            "author_name": "oana marica",
            "author_url": "https://www.google.com/maps/contrib/107536422204327811438/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIZ0IPzqPXM9bOhVISJwDWpUj_O3xyXmddEzfuMVglM4ZTmFg=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "a good hotel, totally central, facing the cathedral, a beautiful view, very good restaurant on the top floor, very spacious rooms. The entrance is from the center, next to the cathedral, in the middle of the center. Beautiful as well as the location, but the restaurant on the first floor is very well rated, very famous there, the food is very good, with a full view to the Cathedral. The staff is very welcoming, all the conditions of a good hotel. if you like to stay centrally, this is the right location.",
            "time": 1728219431,
            "translated": false
        },
        {
            "author_name": "Alexander R Baasner",
            "author_url": "https://www.google.com/maps/contrib/110591704907869213198/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW48axRs6ZXe-fyTx5t0LXQRfrnW-m12_6rEgJn5GniTsXASDk=s128-c0x00000000-cc-rp-mo",
            "rating": 4,
            "relative_time_description": "4 months ago",
            "text": "Amazing food and view! We were dining at the restaurant with a small group. After we were taken extremely good care of in the beginning, the staff sort of disappeared from our table and we were waiting quite long to order additional drinks and desserts. Besides, it was a great experience and their food and wine offering is truly delicious! 👌",
            "time": 1720853556,
            "translated": false
        },
        {
            "author_name": "Dilara Şimşek",
            "author_url": "https://www.google.com/maps/contrib/103205711472319439904/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUIYNIkEcL1-3QCqGzg7_o1d8vqu86nE-BGGCiRAimoUqI9W_Yj=s128-c0x00000000-cc-rp-mo",
            "rating": 1,
            "relative_time_description": "a month ago",
            "text": "I stayed between the date of 04.10.24/06.2024. The only good thing about the hotel was the location. The room was cold and the air conditioner wasn’t working properly. While the air conditioner working there was a voice coming from the ceiling. Housekeeping didn’t clean the room well even the eaten apple was still in the room after they “cleaned” the room. The receptionist was very rude, whose name is Katerina. If i go to Vienna again I definitely won’t choose this hotel.",
            "time": 1728549501,
            "translated": false
        },
        {
            "author_name": "Leonardo Kaltenhauser",
            "author_url": "https://www.google.com/maps/contrib/100419219357847328431/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLf52D4LzQPXf4N2JFGbPLHl77NTwsViF6jQMXUYK6T8PYoYw=s128-c0x00000000-cc-rp-mo",
            "rating": 3,
            "relative_time_description": "a month ago",
            "text": "Park & baggage service and breakfast service was fantastic.  Friendly and motivated.\nService staff at the reception was de-motivated and not interested. View from our room was directly to Stephans-Dome which was breathtaking! Unfortunately the windows were not cleaned outside since at least 6 months, light spot at toilet was defect, dimmer was defect and the ventilation at toilet/bathroom didn’t work. When I reported these little defects during the checkout to the reception lady, she was seriously asking me if we put our room card into the slot. So she thought we are complete dumb. After I ensured to her that we are not, she didn’t apologize for those defects… when you pay 600.- Euro for the night, I think you can expect high quality and people who are at least pretending to be interested in your feedback. When I read the other reviews, most people complaining about the reception staff - I now understand why!! Next time we will stay again at the Sacher Hotel which is the non plus ultra in Vienna in my eyes",
            "time": 1729430919,
            "translated": false
        }
    ]
}