{
    "name": "Austria Trend Hotel Anatol",
    "rating": 4.4,
    "reviews": [
        {
            "author_name": "Mayla",
            "author_url": "https://www.google.com/maps/contrib/107265446144517149309/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVV8pVQT0jhrdwTndX5xaoaUIcGxCAYSpJmtAggikrdcdD_EWmR=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "The hotel made an excellent impression on us—not only because of its high standards of cleanliness and comfort but also due to its great location. Situated in a peaceful area, it offered quiet and relaxation, perfect for unwinding after a day of sightseeing. The rooms were spacious, impeccably clean, and well-equipped to meet all guest needs.\n\nWe were also charmed by the lovely lady at reception—a warm person with short hair who always greeted us with a big smile. Thanks to her kindness, we felt truly at home. This is a perfect place for anyone who values comfort, cleanliness, and tranquility in a charming location.",
            "time": 1730809166,
            "translated": false
        },
        {
            "author_name": "Aram Farzana",
            "author_url": "https://www.google.com/maps/contrib/115374214541821824385/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLK0GYkLlHndHdUvbLYB4fBmdThQlwuBiT4liu6WqAHMiqtkA=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "5 months ago",
            "text": "4.5/5\n\nFirst of all, the hotel had a very competitive pricing on their own site. The lady at the check in was so friendly and bubbly and we instantly felt so welcomed to the hotel. The room had aged a bit but everything was very clean! Also the furniture had been renewed and the bathroom was very nice. The breakfast was quite compact but very nice. There was a bit of everything and we could eat a very balanced meal there. The tables were set already and the staff were again very friendly and welcoming.\n\nThe hotel takes pride in usage of local products and it was visible in bathroom products but also at the breakfast. It's always nice when businesses support and promote local products, especially to tourists from abroad. We appreciated the eco-friendliness of the hotel as well.",
            "time": 1719943995,
            "translated": false
        },
        {
            "author_name": "Lucia Ogoryalkova",
            "author_url": "https://www.google.com/maps/contrib/101528164851217693468/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUqLyjXPhr5nmjvf-P_xuGkpTIG5NwJ7x_WeUavvOdEnszpzT1H=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "4 months ago",
            "text": "The hotel is very nice! Great location, very clean, staff is very friendly as we asked them to book us taxi to the airport 2 separate times and everything went great. The rooms are quite small but very organized and clean. The pricing is great. Really enjoyed our stay at Hotel Anatol! Thank you!",
            "time": 1721937528,
            "translated": false
        },
        {
            "author_name": "Ishita Shah",
            "author_url": "https://www.google.com/maps/contrib/116033986752314873093/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXm7FfjyjVOdac5F6YzSYOcX7ctNk7vb4Y7rKxoYzJor-hjXAY=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "It was a good hotel and stay…comfortable, clean, delicious breakfast…did the job for us but the best part of our stay was the service we received from Nadia who works as a receptionist. She was so thorough, helpful and friendly. She went above and beyond to assist us with our needs such as ordering dinner because of the language barrier. Thank you Nadia for your outstanding service and for making us feel like family.",
            "time": 1723741991,
            "translated": false
        },
        {
            "author_name": "eran liss",
            "author_url": "https://www.google.com/maps/contrib/106708378901005167060/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJP0UpHGGFWN66lhAgB7YdFQxMpxSUaIeFHHJPTxtLfDbzijA=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "Wonderful hotel. Close to subway which takes you quickly to the old town. Large air conditioned rooms, nice staff, clean, great breakfast. And on top of all-greatest value for money you can find in Vienna. Highly recommended",
            "time": 1724484090,
            "translated": false
        }
    ]
}