{
    "name": "Boutiquehotel Stadthalle",
    "rating": 4.8,
    "reviews": [
        {
            "author_name": "Konstantinos Fioravantis",
            "author_url": "https://www.google.com/maps/contrib/113960879924479947288/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVoURyWc8IEQzrPcPc2CrTDBkh4Eaxdx4pGJ8FNQr9-1K_8S3M=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "a week ago",
            "text": "This hotel was a nice surprise! Our room was amazing. Receptionists are very friendly, helpful and polite, answered our many questions and helped us familiarise ourselves with the neighbourhood. Super breakfast and a very cosy lobby, that makes one feel home. The night shift receptionist is also the bartender. The selection of drinks are also very special wines and whiskey like everything in this beautiful hotel. A tram stop is 150 meters away. If I am ever back in Vienna, I will stay there again!",
            "time": 1732560644,
            "translated": false
        },
        {
            "author_name": "Sam Boyarsky",
            "author_url": "https://www.google.com/maps/contrib/114741509823019920943/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLLcT9EEniEb-V_gFCi8gAKIkdJvkkCrsip7fFlvjCTQU3mEg=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "Had a lovely stay here, and would definitely come again!  There is secure bicycle parking, a lovely courtyard/garden, and free apples daily!\nBreakfast is an extensive spread, mostly bio/organic and delicious.\n\nParticular shout out to Kathi and Naomi at the front desk for being super friendly, helpful, and making great recommendations!\n\nAs there is no AC, I had the window open and fan blowing the entire time I was in the room (added bonus, the vines on the outside are slightly aromatic and quite pleasant)",
            "time": 1725434824,
            "translated": false
        },
        {
            "author_name": "Garnett Lee",
            "author_url": "https://www.google.com/maps/contrib/103153499873703329897/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUFzE1zywlQbXb40i5jS-Fu3B_sVUDFJshE9m6GMpVAsSxf9hMS=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "5 months ago",
            "text": "Enjoyed a lovely stay here. The staff are fantastic. They are friendly, helpful, and create a cozy, welcoming atmosphere that can be felt stepping through the door. The courtyard garden makes for a relaxing place to take a coffee or drink. Breakfast is all eco, and on offer without rush. Though it may appear a little ways out, nearby Westbahnhof station and close tram lines make for easy transit access.\n\nWill definitely stay there in future trips and recommend.",
            "time": 1718392620,
            "translated": false
        },
        {
            "author_name": "Martin Wulf",
            "author_url": "https://www.google.com/maps/contrib/103094226715502222388/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUvN05qupI4Y9mOGu2aLgJYfTPXnqNOTZgdOFxoJBlRPOWC-tE=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "4 months ago",
            "text": "I had chosen this hotel while unexpected stopovers at Vienna airport. I didn't know what's to expect, I was just looking for a cosy hotel. I was not into a big hotel chain, so I selected this hotel and became surprised by it's charming and authenticity. I am happy to be served as guest and as human and not just handled as a running number. I felt to be at a place to slow down from all the trouble and somehow back to basic to focus on the real essentials.\nI was happy to meet the front desk stuff which was really polite, guiding and helping at any time. I had to leave very early in the morning and the hotel did also offer a food package, frankly spoken, I had no expectations due to other experiences but this package was a quite nice experience and handmade. I was very satisfied with my stay and that's also the reason that I had chosen this hotel again while my 2nd unexpected stopover this weekend.\nIf I would visit Vienna one a day privately I would chose this hotel and can recommend it's charming authentic kind.\nThanks to the team and this great hotel concept.",
            "time": 1720898259,
            "translated": false
        },
        {
            "author_name": "Johanna Leinmueller",
            "author_url": "https://www.google.com/maps/contrib/109184537066706997847/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLgR2vlThNa3oPGDh8-FWQxCabB_ZI3JZcr6fbY6M57ED8GVQ=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 4,
            "relative_time_description": "4 months ago",
            "text": "Great green energy concept. Really good breakfast. Clean. Only downside was that there was no separate bathroom in the room, but a built in \"wet complex\" that had a shower and toilet.",
            "time": 1722567980,
            "translated": false
        }
    ]
}