{
    "name": "Ambassador Wien",
    "rating": 4.1,
    "reviews": [
        {
            "author_name": "fatimah ramadan",
            "author_url": "https://www.google.com/maps/contrib/115601361725702145738/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXm7a8y_s7Ao4t8tv8m0IjfI0nDlgcflp7TohX1izRQcvj1FL2s=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 3,
            "relative_time_description": "a week ago",
            "text": "Although this hotel is 5 stars, it does not suggest that, as the soap in the bathroom does not change for days, and there is no coffee corner in the rooms, and there is no kettle, and there is no iron in the rooms, I did not ask for it, as I have my own iron and the kettle, they said that I should ask for it from the reception, there was a defect in the window, as the cold air enters from below, but they fixed it when we asked them to, and there is no toothbrush, and even when you ask for it, it is not provided to you, and you are not provided with water, the water is not free, you have to pay for water. The only nice thing about the room is the view, as it overlooks the main square, and the proximity of the hotel to everything in Vienna. Thank you very much baker for the kind treatment",
            "time": 1732382088,
            "translated": false
        },
        {
            "author_name": "Dionysis Xygkakis",
            "author_url": "https://www.google.com/maps/contrib/101894622232564969133/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXZHlYP4ZnY2MjyPPtqNqQTQWVJ5t8ZZgVREyGqvn4FkHeSYaRe=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 4,
            "relative_time_description": "3 months ago",
            "text": "The hotel’s location is excellent, right in the heart of Vienna. The rooms are generously sized, but they are rather outdated. While the room was comfortable, I do think it’s in need of a refurbishment. Cleanliness was generally acceptable, although there was an odd incident on the second day when housekeeping removed the main duvet and didn’t replace it, which I found quite strange. However, housekeeping did attend to the room daily.\n\nAs for the staff, they didn’t leave much of an impression. They didn’t assist us with our luggage, seemed rushed when explaining things like breakfast and check-out times, and generally appeared a bit disinterested. They were polite, but the service didn’t quite match the standards one would expect from a five-star hotel. That said, they were kind enough to store our luggage until we were ready to leave for the airport.\n\nWhat bothered me most was their laundry service. I needed a T-shirt washed, but because it was a Saturday, I had to pay both an express fee and a surcharge, totalling 21€ to get it back the following afternoon. I understand it was the weekend, but I would expect a five-star hotel to offer such amenities on demand throughout the week without such steep charges.\n\nDespite these issues, I would consider staying here again, mainly due to the spacious rooms and the hotel’s unbeatable location.",
            "time": 1723418966,
            "translated": false
        },
        {
            "author_name": "mbs 001",
            "author_url": "https://www.google.com/maps/contrib/117285787143677955279/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKKVoUzqtQ25oHxxbdmdQikeSVGUM6IcXVX9pSTu1gbJv7asA=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "2 weeks ago",
            "text": "Fabulous hotel in a great location.\nAll staff were friendly and very helpful.\nThe room was awesome and the breakfast was tasty.\nThis hotel experience made our visit to Vienna a very enjoyable experience!\nThank you.",
            "time": 1731950051,
            "translated": false
        },
        {
            "author_name": "Helen Sweet",
            "author_url": "https://www.google.com/maps/contrib/110133146300376176832/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW5VSLe13cqmvKJlU2IxVXobZNYgGI820hR4uL2GiPL6mKY6JZD=s128-c0x00000000-cc-rp-mo",
            "rating": 2,
            "relative_time_description": "a month ago",
            "text": "The hotel urgently needs new management .\nLevel of room-service is very low.\nIn 9 days the room was cleaned only once, on the last day! In the bathroom they only change towels and nothing else.\nI’m disappointed.\nJust two good things:\nGood breakfast and place is very nice.",
            "time": 1728935417,
            "translated": false
        },
        {
            "author_name": "Huthaifa A.Ghaffar",
            "author_url": "https://www.google.com/maps/contrib/103155774288707162030/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJj0BS6msyNA52INgsSiVl03ftFS8Ih1bUXixpKABa2Ap3eig=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "The location of your establishment is superb, conveniently situated near the center. Your staff exemplify professionalism and friendliness, particularly Mr. M. Bacchher, whose assistance was invaluable. The spacious room with a stunning view added to the exceptional quality of my stay.",
            "time": 1730550550,
            "translated": false
        }
    ]
}