{
    "name": "BASSENA Wien Messe Prater",
    "rating": 4.5,
    "reviews": [
        {
            "author_name": "Bimal Gaire",
            "author_url": "https://www.google.com/maps/contrib/108265185790565340231/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL1Q3RzpVDg7s5cNXoSFPr_alPNsJj_bt05IIP9vO72fEehcA=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 4,
            "relative_time_description": "2 months ago",
            "text": "Great value and comfort. Nice room with lots of amenities including a mini fridge and towel dryer in the bathroom. Super quiet and centrally located. You can walk to the subway station in less than 5 minutes and can reach major spots easily. The staff was friendly.  Overall, I had a really good experience here.",
            "time": 1725806675,
            "translated": false
        },
        {
            "author_name": "Slobodan Acketa",
            "author_url": "https://www.google.com/maps/contrib/116834072626584188742/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWDqKRPjfyjsDvpPylxnz4d0ITfwR-rwAeyQDIc6ploQOWsLWEc=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "+++ Modern, clean, bright place. Card operated floor and room access, in house garage and a gym. Buffet breakfast is the same every day but there are enough different choices. The neighborhood is very quiet and green and public transport runs in the 5 min walking distance.",
            "time": 1730327772,
            "translated": false
        },
        {
            "author_name": "Dean Edney",
            "author_url": "https://www.google.com/maps/contrib/113412844686083392453/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUdng-iG8-aWf_Wg76PNB34lu2_h-qz4sHXEjdSOyB8OIv2k6sFYg=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "A wonderful stay! We stayed at the Bassena in July 2024 and loved every second of it. The rooms were comfortable, clean and welcoming. Very quiet with zero sound from both outside and adjoining rooms. Up to date television with the option to add your personal device and stream- would welcome a few more English speaking channels on the TV, but that's a personal preference!\n\nWe did encounter an issue with our first room, where the air conditioner wasn't working at full power (needed as it was low 30°Cs every day!). However the staff were brilliant and gave us a room on the same floor, so we could just swap over. Brilliant service!\n\nThe location was perfect for us (young couple). We wanted somewhere outside of the main historic city, but still close to transport and the Patter! Direct train to the airport as well, we couldn't have chosen a better location!\n\nWould stay here again in a heartbeat and would recommend this to anyone willing to visit Vienna!",
            "time": 1723930850,
            "translated": false
        },
        {
            "author_name": "Maria Berger",
            "author_url": "https://www.google.com/maps/contrib/110863190463425320159/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXhpgQ-BD7XvntmQaCVYhjjWYuY9xKDt66UpjtjiildZuN6xbu7=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "Thanks for amazing stay in Vienna! The hotel is new, supports sustainable initiatives\n(no plastic, a water pump room in the lobby, natural cosmetics, etc.). The room is very clean and well equipped. Good beds, blackout and soundproofing, a coffee machine, a refrigerator and a kettle in the room. We arrived an hour early, the room was ready and we were checked in early without additional charges. At the reception when checking in, they saw that it was my birthday and gave me 2 drinks. Special thanks for the help to the receptionist Margo. High recommend!)",
            "time": 1725538792,
            "translated": false
        },
        {
            "author_name": "Jeremy Springman",
            "author_url": "https://www.google.com/maps/contrib/113343708689860602227/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVFsKkM9XF0lxeh98XnAh-VC73z6We57H0TjL1NR361uBvVHmrU=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "The rooms, restaurant, and common spaces were all beautiful. We had a beautiful view of WU from our Juliette balcony. Prater park is a few steps away and there's easy train access to downtown. I really enjoyed my stay.",
            "time": 1726312527,
            "translated": false
        }
    ]
}