{
    "name": "Downtown Forest Hostel & Camping",
    "rating": 4.5,
    "reviews": [
        {
            "author_name": "Tessie",
            "author_url": "https://www.google.com/maps/contrib/117336858392741247094/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUF1CTRdvnt9jVHwDkOj1YuSQNznl77lcnh_x5i7aH-SPz36iY=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "Beautiful place to stay at. It has a nice terrace with a bar and grilling spots. You can just chill there and enjoy your time either alone or with someone. The receptionist is really nice and friendly.\n\nThe rooms are smaller but clean. It smells nice and it's not too hot inside. Some rooms have their own bathroom and toilet. If they don't, then the toilet and bathroom are in the hallway.\n\nIt's near different shops so that's nice and even some church and parks. So if you want to spend your leisure time in a park, this is a place for you.\n\nI really loved it there and when I'm visiting Lithuania again, I'll probably stay here.",
            "time": 1726144046,
            "translated": false
        },
        {
            "author_name": "nini",
            "author_url": "https://www.google.com/maps/contrib/112529093988750580078/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXg1A3jkEV2Xy5hZ4Ruy3Y_nVdBXBqsF6oqBwH5Ggdo8Gredvqz=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 4,
            "relative_time_description": "a month ago",
            "text": "Lovely earthy hostel/hotel in a beautiful old house. The area is very nice and the vibe in this hostel is very welcoming. Feels like a school trip or a house where you live with other people. Very communal but the people respect your own space in here too which is nice. Lot of people of all ages and backgrounds. Has a bar and a big common area. Room was really cute and clean. Area is close to old town and you can walk there easily from the hostel. 🌻🧡",
            "time": 1730585079,
            "translated": false
        },
        {
            "author_name": "Christian Sømme",
            "author_url": "https://www.google.com/maps/contrib/118159592587612140642/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVAIVORDLREuDiDIDdSqJ1pf4EpGeNwgf-StDBqQ434WkgdGwie=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "Truly a great and big hostel in a very cool neighborhood. An excellent starting point for city walks. Wish they did not have (noisy) metal locker in the room and would have loved curtains around the bed for more privacy. The place has a really cool garden where also locals come to grill. They will prepare a grill for you for a reasonable cost. Friendly staff with a bar. Free coffee in the morning and you can buy some sweet pastry (would prefer a healthier choice too). Big kitchen. Lots of showers and toilets.",
            "time": 1725805889,
            "translated": false
        },
        {
            "author_name": "Sexy Dudeuk",
            "author_url": "https://www.google.com/maps/contrib/117208340882631767366/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLnzUIduUSqjLUimY3DUam75w3MkfFk_14rDQwtskr6gOiUow=s128-c0x00000000-cc-rp-mo",
            "rating": 2,
            "relative_time_description": "a month ago",
            "text": "Place is close enough walking distance to city center and has a park outside to see some nature as well as shops to which were convenient.\n\nHowever I was on the bottom floor right near reception. Walls are paper thin and could hear people talking in the lobby till the early hours which got annoying. Even with ear plugs on I could still hear them.\n\nRooms were not cleaned and entertainment facilities were lacking",
            "time": 1729680909,
            "translated": false
        },
        {
            "author_name": "Aavgeen Singh",
            "author_url": "https://www.google.com/maps/contrib/116007719183786423423/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX7W7jiDDIxbnRp5fWGtNxj91MrFKW2AaReKwX2ePCBV7uE323gBQ=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "They have great options to enjoy barbecue in the common space. They have good parking facilities and place for camping vans too.\n\nGreat for backpackers who need common place to chill and also don’t mind the external private events also happening on that place.\n\nThis place is great if you don’t mind 20-25 min walking distance from the city center.",
            "time": 1725825859,
            "translated": false
        }
    ]
}