{
    "name": "BISTRO 18",
    "rating": 4.5,
    "reviews": [
        {
            "author_name": "Nousheh Saidi",
            "author_url": "https://www.google.com/maps/contrib/102790218155874393526/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK55anx274z6N3CFyqK8tph47-P6BCAh282NM4O1ADvE-IFBg=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "**Bistro 18 - Vilnius: A French Delight in the Heart of the City**\n\nBistro 18 in Vilnius offers an exceptional dining experience that effortlessly transports you to the French countryside. This charming, family-owned restaurant is run by a dedicated husband-and-wife team, whose passion for hospitality and great food shines through in every detail.\n\nThe atmosphere is warm and inviting, with delightful French provincial decor that sets the perfect mood for a cozy meal. The food is simply delicious, showcasing fantastic flavors and beautiful presentation. Every dish feels thoughtfully prepared, with a wonderful balance of taste and aesthetics, making each bite a memorable experience.\n\nService at Bistro 18 is outstanding, reflecting the personal touch of a family-run establishment. The staff is friendly, attentive, and eager to ensure you have a great time, with the owners often on hand to greet guests and add to the welcoming vibe.\n\nConsidering the quality of the food, the value at Bistro 18 is impressive. You get a fine dining experience without the hefty price tag, making it a must-visit spot for anyone looking to enjoy great food, service, and atmosphere in Vilnius. Highly recommended!",
            "time": 1726769374,
            "translated": false
        },
        {
            "author_name": "Irma Janus",
            "author_url": "https://www.google.com/maps/contrib/100208670047285362085/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLvFvQ4cumey185RUH0x78l4JqD2fJCyTro8QlPVUSQyS8XHg=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "5 months ago",
            "text": "On July 1st, after a break, Bistro restaurant resumed its activities. Today, I celebrated my birthday here and experienced the chefs' work from the European and Mediterranean menu, as well as the service! 💜🫶 Everything was incredibly delicious and wonderful! The cozy atmosphere, specially prepared purple napkins and candles for me, and the small details that pleasantly delighted me 💜🩷💚. The staff was friendly, and the service was warm and professional! Thank you to the chefs for the surprise greetings and divine food, we will definitely come back! 🫶",
            "time": 1720384209,
            "translated": false
        },
        {
            "author_name": "Alessandro Barbaccia",
            "author_url": "https://www.google.com/maps/contrib/100647722269444631169/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVE5HyqZcM7hFW6e9nPOTNbaLZusRCajbbsijkMhdrue6gJ-tw=s128-c0x00000000-cc-rp-mo-ba6",
            "rating": 3,
            "relative_time_description": "3 months ago",
            "text": "Nice restaurant but totally disorganized, every plate was not correctly made (cold or not cooked enough, etc.), probably not enough people working in the kitchen or an unprepared chef. Service extremely slow but nice. They probably tried to do their best that night but they didn't succeed with any table. It's a pity!",
            "time": 1723559287,
            "translated": false
        },
        {
            "author_name": "Juho Kopra",
            "author_url": "https://www.google.com/maps/contrib/105663206375690349568/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLSDUQC19IXCyOF2SRSas_s0kKw6HZEpSUB0IBTkivJFCUfDA=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 5,
            "relative_time_description": "4 months ago",
            "text": "Truly one of the best restaurants where I have eaten so far. Food was beyond our expectations, truly fine dining level. Unexpectedly the restaurant was quiet at Thursday 6PM but we still had to wait for quite long. Great taste was more than worth of waiting. Perhaps they need one more chef?",
            "time": 1721326749,
            "translated": false
        },
        {
            "author_name": "Nikolajus Aleksejevas",
            "author_url": "https://www.google.com/maps/contrib/100505393016128657125/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLChYQsdtqb-VrO0oMUp-SxL-QW16hhC-LB2X9PVic6FnG7UA=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "It was the best pork tenderloin I ever eated!  It was tender, juicy and beautifully presented. My wife enjoyed also seabass. Great dinner",
            "time": 1723923857,
            "translated": false
        }
    ]
}