{
    "name": "Etno Dvaras",
    "rating": 4.5,
    "reviews": [
        {
            "author_name": "Francesco Bianchi",
            "author_url": "https://www.google.com/maps/contrib/112760737136755702096/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW6N95fztcZaRHUq1GB1MdLG5BHYwvvRsKsRAep3iTrXEe_P2Ic3g=s128-c0x00000000-cc-rp-mo-ba6",
            "rating": 5,
            "relative_time_description": "a week ago",
            "text": "I had noticed this place quite a few times while walking along one of the main streets in the old part of Vilnius.\n\nI was torn about whether to enter because my instinct was saying yes but I am usually wary of places with a picture of someone dressed as a cook welcoming you at the entrance.\n\nOn my last day in the city a friend invited me there saying that he knew the place that helped break any last hesitation.\n\nThe moment you walk in one is immersed in a special atmosphere. The stone staircase that leads downstairs seems to bring you into a fairy world.\n\nThe atmosphere is incredibly cosy and the staff welcomes you with a very warm smile.\n\nThere's a lot of dark wood. I can only imagine how much even more magical the atmosphere may become during winter.\n\nI ordered the traditional cold beetroot soup and pork hock.\n\nI don't have a reference for the soup. The one they brought tasted quite nice.\n\nThe pork was delicious. Incredibly tender, it literally melted away from the bone when touched. Gorgeous preparation.",
            "time": 1732698657,
            "translated": false
        },
        {
            "author_name": "Jens Nilsson",
            "author_url": "https://www.google.com/maps/contrib/101696107786365397007/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJypyjGL9qRB2sh0DL0P6O7glus8xsP8rhNBAEWiggG4pCwYA=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "First time eating Lithuanian food and it did not disappoint. Big portions and the price was love. Nice waitress. Would recommend to go there.",
            "time": 1730403351,
            "translated": false
        },
        {
            "author_name": "Aleksandar Donev",
            "author_url": "https://www.google.com/maps/contrib/104316533339916103656/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWwABZTrD0rNWFXThO-Zo-L_7psbYVAe-GK36TwudBYaJaWqFMLHg=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "Good and friendly place to experience traditional Lithuanian food. The service was very good and the food was tasty. There were some vegetarian options but not as many. I suppose the traditional local food is very much meat and potatoes. The salad with the fried curd cheese was great. Cold beetroot soup is very different and tasty. The potato rosti/pancakes are very much in the same style as across Central and Eastern Europe. The beer was amazing.",
            "time": 1728033608,
            "translated": false
        },
        {
            "author_name": "Najeeb Ashraf",
            "author_url": "https://www.google.com/maps/contrib/100181283195933786359/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXYzIiOr7oSEOuc-uXQ-kY6dPMT1FSVxNiu5xjNP37Z1o_RhIgr=s128-c0x00000000-cc-rp-mo-ba6",
            "rating": 4,
            "relative_time_description": "5 months ago",
            "text": "Discovering this restaurant in the heart of Vilnius was a true delight! The food was exceptional, with the fish dishes standing out as a highlight. The fried Cod fish was crispy perfection, with a tender and flaky interior that simply melted in our mouths.\n\nBut what truly made our experience special was the ambiance. The atmosphere was sophisticated and elegant, with a warm and inviting decor that made us feel right at home. The service was attentive and knowledgeable, with a clear passion for the food they served.\n\nIf you're looking for an exceptional dining experience in Vilnius, look no further! This restaurant is a must-visit, with its incredible food, top-notch ambiance, and outstanding service.\n\nHighly recommend the fried Cod fish and any other seafood options - you won't be disappointed! A truly unforgettable culinary experience in the heart of Vilnius!",
            "time": 1720357333,
            "translated": false
        },
        {
            "author_name": "Mariia Linnik",
            "author_url": "https://www.google.com/maps/contrib/115481542997695372054/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXabA6fPpG-SnKSfYP_4NaXXPfEzSynhIH2wXej4LepdVPq-VGC2Q=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "3 weeks ago",
            "text": "Divine! The atmosphere, the staff, the food, the interior - everything makes you feel like you're in seventh heaven. We tried: khlodnik, mushroom soup, croutons with cheese sauce, scrambled eggs, beef stroganoff, sweet pancakes, linden tea and acorn coffee. It was all incredibly delicious, so much so that after eating I could barely think straight. Acorn coffee is something amazing, it smells like gingerbread, be sure to try it!",
            "time": 1731332651,
            "translated": false
        }
    ]
}