{
    "name": "Comfort Hotel LT - Rock 'n' Roll Vilnius",
    "rating": 4.6,
    "reviews": [
        {
            "author_name": "E Kara",
            "author_url": "https://www.google.com/maps/contrib/104723596501529580782/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVeVFqThOXpCTXWG9WNWc85w9PCtyWaHLG5p5PQOLu1fNYzu3my=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "I recently stayed at Comfort Hotel LT - Rock ‘n’ Roll Vilnius during a business trip, and it was a fantastic experience. The rooms were impeccably clean, and I was pleasantly surprised to find that the tap water was drinkable, which is always a plus. The breakfast spread was impressive, offering a variety of options to suit different tastes.\n\nThe hotel’s rock ‘n’ roll theme adds a unique charm, with music posters and artistic details adorning the corridors, creating a vibrant atmosphere. Additionally, the hotel’s location is convenient, being within walking distance of the Old Town, making it easy to explore the city’s historic sites.\n\nGiven this positive experience, I plan to stay here again on my next visit to Vilnius.",
            "time": 1730584994,
            "translated": false
        },
        {
            "author_name": "Razvan “Franco” Nitoi",
            "author_url": "https://www.google.com/maps/contrib/103955484057990228396/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUpJexJq9V3pFTZn39ZcYxbQiXFKpeOhuXaUgvb4-fHcCDtfYXx=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "Interesting interior design, with a lot of creative visual details. Good and comfortable rooms, modern and well maintained. Good location, not far from the city center, and very close to a supermarket open until 23:00.\nMinus: we were in a group with other friends whose room was on another floor and we were unable to visit each others, because the access via elevator or stairs is restricted to your own floor (room card scan).",
            "time": 1725348597,
            "translated": false
        },
        {
            "author_name": "Jani Kastinen",
            "author_url": "https://www.google.com/maps/contrib/110332240355613824557/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXKVbhVSYM8_abiVMRd0M3Q6NCHucN9a-f7jkqr238Cql9uGEc=s128-c0x00000000-cc-rp-mo",
            "rating": 3,
            "relative_time_description": "2 months ago",
            "text": "+ This hotel was very cool, it has pictures of rock and pop stars on each floors and dining room. Staff was friendly and helpful. Breakfast was diverse and quite good and location is good near the old town.\n- There were no mini bar/fridge in the room and pillows were little worn out and not so comfort.",
            "time": 1726056253,
            "translated": false
        },
        {
            "author_name": "Brenno Ferrari",
            "author_url": "https://www.google.com/maps/contrib/118358441959291685405/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWL32q_s9550_wWcsPJ6kSJp2B89rSXXoSrJla0BnjHPybmKHn5=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 3,
            "relative_time_description": "2 months ago",
            "text": "I’ve stayed at Comfort Hotel Vilnius several times for business trips and have always enjoyed my experience. The location is great, especially since it's very close to my office. The breakfast is excellent with a wide variety of options, and I really appreciate the flexible checkout window, which defaults to noon but can be extended if needed.\n\nHowever, during my most recent stay in the summer, I was disappointed with the air conditioning. The AC in my room wasn’t functioning properly, making the room uncomfortably hot. After complaining, it took an entire day for someone to come and fix it, only for the problem to return the next day. I had to personally request a room change, which should have been offered initially. The AC in the new room was also quite weak and took a long time to cool the space.\n\nI’ve spoken to some colleagues, and it seems this has been a recurring issue during warmer months. While I do enjoy staying at this hotel overall, I hope they improve the air conditioning and maintenance moving forward to ensure a more comfortable experience in the future.",
            "time": 1725864431,
            "translated": false
        },
        {
            "author_name": "Helena Krajinović",
            "author_url": "https://www.google.com/maps/contrib/111192638967421021320/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKg5UponH67lxgP7Ysk9Jp2lezznw4i0iY9oayI1euQr-K0DGQ=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "Had a really pleasant stay here. The location is great, close both to the city centre and the train and bus station. There is a big supermarket right opposite the hotel. The gym is clean and spacious and works 24/7. The staff was all great. We didn't get breakfast so can't rate it. The room was simple and clean. Really great price for what you get, would recommend.",
            "time": 1723920647,
            "translated": false
        }
    ]
}