{
    "name": "Podwale 25 Kompania Piwna",
    "rating": 4.5,
    "reviews": [
        {
            "author_name": "Paweł",
            "author_url": "https://www.google.com/maps/contrib/115230326848843178397/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWDo2eWaZbg0i6l9h86e2URwU0zoDCoBOYB6kE6jFdFsIb0JFSb4w=s128-c0x00000000-cc-rp-mo-ba8",
            "rating": 2,
            "relative_time_description": "a month ago",
            "text": "We have ordered drinks for 4 people. One of us got everything after 3 minutes. The rest after 40 minutes. Later service was better but first impression was negative. Food was average. Restaurant more oriented on tourists- I suppose.  Some decoration really nice.",
            "time": 1729202630,
            "translated": false
        },
        {
            "author_name": "哈哈哈嘿",
            "author_url": "https://www.google.com/maps/contrib/111556199692225998623/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLbw1Qp5ivnm01SS-m9zy0EcdYwwdwDaxb5VJ60dVUyVe4x9g=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a week ago",
            "text": "The service is really excellent, too good to be faulted. There was a misunderstanding and unpleasant episode due to language barriers. After reporting it to the supervisor, the supervisor took the initiative to apologize to me and gave me a very memorable gift. I felt a little guilty. I grew up in Northeast China. The Polish food in this restaurant is very similar to the food in my hometown. I found some home feeling because of the warm and considerate attitude. I wish all the employees of this restaurant good fortune. And the food is very good, very cost-effective, very delicious",
            "time": 1732260723,
            "translated": false
        },
        {
            "author_name": "Federica S",
            "author_url": "https://www.google.com/maps/contrib/117117519323021091149/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXf9-t-pig28v5JxmUQb5TjFR0N4hmVrrYw1FF4CAMxumc0WJx4=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "Even without a reservation we were able to have a table in this really nice and warm restaurant. We have been served by Maria, she was patient, kind and with really good skills about customer service. The service was smooth and the food delicious. During the dinner, the atmosphere was pleasant thanks to some traditional polish music. We recommend to eat here if you come to Varsavia.",
            "time": 1730500345,
            "translated": false
        },
        {
            "author_name": "Sagit Mis",
            "author_url": "https://www.google.com/maps/contrib/106257670140589563917/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWGnopqKSV7MdjgXm38_D22QnEHtwL23tSPMOw2HK-COyMWdkn0=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "This was the first restaurant we visited in Warsaw and it was a great start, a lovely area, and a good atmosphere.\nWe were greeted by a waiter named Camille who did a great job, the dishes were excellent and the stay was lovely.\nThe dishes were excellent and the stay was lovely so we went back again for the last evening, and it's a shame we didn't ask for Camille again, this time we sat in a different area which is also special, we had another waiter who had difficulty with the language and in general, he was nice but less so, but still the dishes were all excellent.\nEven the vegetarian among us and the girls had successful options.\nHighly recommend - hope to return in the future",
            "time": 1723795239,
            "translated": false
        },
        {
            "author_name": "Sheila Esteve",
            "author_url": "https://www.google.com/maps/contrib/115041192079736443525/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU33x6qtzEopcj8WvlPwpNEyaI4Vt627Xb87etIyx1_HeUfZpR12Q=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 4,
            "relative_time_description": "a month ago",
            "text": "Lovely traditional restaurant near Warsaw’s old town. We enjoyed the pierogies and the pork knuckle was really tender and crispy!\n\nLeave some space for the dessert as the apple pie is really tasty!\n\nYou will get to try all the traditional dishes at a high quality.\n\nThe restaurant is always really busy. So I recommend going there early if you don’t want to wait in the queue.\n\nThe interior is traditional. Although the place is really big, it feels really cosy and comfortable due to it being divided in small rooms.\n\nThey had musicians playing traditional music on the Saturday.",
            "time": 1728296453,
            "translated": false
        }
    ]
}