{
    "name": "Hit Hotel",
    "rating": 3.8,
    "reviews": [
        {
            "author_name": "Kestas",
            "author_url": "https://www.google.com/maps/contrib/110112433127566588153/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUlg9wUnKLux9czRUF3cC64DVEkriVBaY0nYF5nldhJk_JmvmY=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 3,
            "relative_time_description": "3 months ago",
            "text": "The hotel itself is not very bad. but it has some flaws.\nVery bad pillows, i did not understand whats inside, its outdated, needs to be changed.\nalso, thin walls, but we were lucky that neighbours were not so loud.\nJUST DO NOT TAKE BREAKFAST. Its very poor. I mean, there are plenty of food, but quality is very very bad. Just dont waste money, as you will not want to eat that.\n\nFrom good side: Nice location, affordable price. kettle with tea in the room",
            "time": 1724005686,
            "translated": false
        },
        {
            "author_name": "Ario Yuniawan Prariyadi",
            "author_url": "https://www.google.com/maps/contrib/111752493808993332604/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIGMbGPsgR1KNWDJhGgZqS3nsDH1dZfMchtz9ukHVJ-tYG5oqM=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 4,
            "relative_time_description": "4 months ago",
            "text": "We booked a room at this hotel for a one-night stay in Warsaw to attend a concert. Overall, we found that the price accurately reflects the quality of the accommodation. The hotel's location is a significant advantage, as it is conveniently situated near a tram station, Warsaw Stadion, and the East Train Station, making it easy to navigate the city and access various attractions.\n\nHowever, there are a few things to keep in mind. The rooms do not come with air conditioning, which can be uncomfortable during the summer months. We had to request a fan to make our stay more bearable. If you're planning to visit during warmer weather, be prepared for the heat.\n\nDespite this, the hotel offers good value for the price, and its excellent location makes it a great choice for short stays, especially if you're attending events in the area.",
            "time": 1722776082,
            "translated": false
        },
        {
            "author_name": "Alan Dempsey",
            "author_url": "https://www.google.com/maps/contrib/100960493859412985732/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUlKhNPlGjVyCjt119EYURoMA0uBlhW_CgEEHp7pLIpCg0Hk1XEXg=s128-c0x00000000-cc-rp-mo-ba6",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "It may not be 5 star rated but it was perfect for 3 of us. Good value and location. Very good food in restaurant and not expensive. Good central location.",
            "time": 1726418752,
            "translated": false
        },
        {
            "author_name": "Inese Biele",
            "author_url": "https://www.google.com/maps/contrib/117753254434038516305/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIId5KaPZ0kdmRz_Dk4OSHRihpMLYF4df9nMgyhi_y2j9ecp2o=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "7 months ago",
            "text": "We were a group of 16 car travelers from Latvia. We used accommodation and group catering services. We had excellent email communication with the hotel manager, Dorothy, even before our arrival.\n\nAll rooms (7 in total) were clean and comfortable, beds were comfortable. Everything was great.\n\nThe set lunch for our group was very tasty. Portions are big. The breakfast was also delicious, there were options for everyone's taste.\n\nThe location of the hotel is good. Both public transport and shops are nearby. There is also a restaurant in the hotel itself.\nIt is very convenient to get to the old town on foot, because at the very end of the street there is an open pedestrian bridge over the Vistula, which allows you to get to the old town in 30 minutes.\n\nSince we were in Warsaw during the May holidays, parking spaces throughout the city were free and we were able to find a parking lot next to the hotel. It may take longer to find a parking spot on a daily basis.\n\nThank you for the nice and warm welcome!",
            "time": 1715080417,
            "translated": false
        },
        {
            "author_name": "Sun Rise",
            "author_url": "https://www.google.com/maps/contrib/106343215979513847227/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJfQedFJSbchHh9jBtujukUybFBGEzpxwL1qNUUcwrF1pDGmg=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "5 months ago",
            "text": "A good place to relax, close to Warsaw s attractions, a good breakfast,too. I have been here with a group of students . We all liked IT! Marieta, Lidl, very close ! Very Nice!",
            "time": 1718394761,
            "translated": false
        }
    ]
}