{
    "name": "Dedek Park - historyczny dworek, w którym usypiasz z kumkaniem żab, a budzisz się ze śpiewem ptaków",
    "rating": 4,
    "reviews": [
        {
            "author_name": "AKBAR ALI ASIF",
            "author_url": "https://www.google.com/maps/contrib/103962287452587612923/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVgSYWrJQy6kirbjr6ef9Q_kvizn6EXfuuixx4oNJiphJ5wZ83Diw=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 4,
            "relative_time_description": "7 months ago",
            "text": "I stayed in Dedek park hotel for three nights. It is located in a big park that has beautiful lawns, small lakes, and some lovely old trees. Although it kept on raining during my stay, but I liked the hotel and the surroundings. It was quite peaceful and being a wildlife photographer, I loved the place. Rooms were nice, breakfast had a small menu but good, housekeeping was also managed effectively. It is a great place for those who want to get away from the busy city life and enjoy nature. Highly recommend!!",
            "time": 1714930877,
            "translated": false
        },
        {
            "author_name": "Vaggos Gan",
            "author_url": "https://www.google.com/maps/contrib/114488770577467215153/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXHOvBZzc2Y8QyTkC9H-eil26AYdESKRWF3E2_TdIK-BGjgNRG7=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 5,
            "relative_time_description": "4 months ago",
            "text": "The staff is amazing! That’s what I look to review when I go to a hotel, they help you in everything! It was so nice to stay there in that historical park! Until next time, thank u for everything!",
            "time": 1722932319,
            "translated": false
        },
        {
            "author_name": "Nolan Orvold",
            "author_url": "https://www.google.com/maps/contrib/118139440329023056758/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWH9TaaWnm6kWYk3AAslEtqaxy5BZYfy5KOnGS41CZwt64KXy4=s128-c0x00000000-cc-rp-mo",
            "rating": 4,
            "relative_time_description": "7 months ago",
            "text": "Room was clean in a beautiful location. Not far from the train station. My flight was delayed and I was helped to get into my booking after my check in. Quiet location perfect for getting a good sleep.",
            "time": 1714160245,
            "translated": false
        },
        {
            "author_name": "Frankie Huang",
            "author_url": "https://www.google.com/maps/contrib/112840304253282829456/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLnjLpfBVBiGzVIcTgcSrgfiJiKaniIJ8-oNSyjOFodfmDasA=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 1,
            "relative_time_description": "a year ago",
            "text": "⚠️☣️One of the dirtiest hotels ever. Many spiders, bed bugs, and critters. ( the spider were so big. When i stepped on it, the spider wouldn't even flatten) Mattress is filthy and bloody. Spiderwebs everywhere. Obviously this place has not been kept clean at all.\nThis place is ran by incompetent and unclean people.\n\nEdit : (my response to the owner)\nIt doesn't matter what time a customer checks in. If the hotel is available to be booked, it means the hotel should be in safe living conditions. The owner has a failed logic. Just because i checked in after the hours, doesnt mean the place should be unliveable. The fact is there were 6 BIG spiders in the room. The mattress itself was disgusting, blood and bed bugs. This means the owners didn't care to keep the place clean and sanitary. \"Oh, someone died in this bed? Lets just replace the sheets and use the mattress again\".\n\nI arrived at 9pm. Dropped my luggage off because i had a meeting and then left the hotel room and came back at 5am to sleep. Then i discovered all these issues.",
            "time": 1696366565,
            "translated": false
        },
        {
            "author_name": "siqi zheng",
            "author_url": "https://www.google.com/maps/contrib/100775586102876481065/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL8l7ypBEMpFY70TNXJI3gY_LBvbxwmGaLrVci8oG-HvfN5UQ=s128-c0x00000000-cc-rp-mo",
            "rating": 1,
            "relative_time_description": "a year ago",
            "text": "Worst place we have ever stayed, moldy walls that made me cough constantly, no soundproofing, no rest at all in the middle of the night from the pub next door and its loud music! We ended up staying elsewhere because we couldn't cancel booking, which was a big loss! And to call and harass us after we returned the key to check out and leave, with the manager losing the key herself, but questioning us aggressively over the phone and trying to make us responsible for her losing the key, was infuriating!",
            "time": 1695588842,
            "translated": false
        }
    ]
}