{
    "name": "Campanile",
    "rating": 4,
    "reviews": [
        {
            "author_name": "li yen de yacobis",
            "author_url": "https://www.google.com/maps/contrib/105714662049801526694/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXC28v6U4MC6g9H_BosTX9eS5qcfO9tShRF-M_9ixACB_9vs_QO=s128-c0x00000000-cc-rp-mo",
            "rating": 2,
            "relative_time_description": "a month ago",
            "text": "Location of this property  is great. Near to all the tourist areas by metro, bus or tram.\nRooms are outdated,  found mold in the bathroom  and carpet is pretty gross.\nI showed them the pictures,  and they changed my room for another one less dirty .\nI guess for the price  is what you get . Also they forgot about cleaning my room the first day . I brought it up to them and they apologize.\nPlace is decent but I wouldn't  stay again .\nBreakfast  buffet is pretty good.\nThe staff is mostly teenagers  running the front desk and check in area , so when I complaint about the lack of cleanliness the girl at the front desk seemed  bothered about it.\nLike I said location is great . Rooms are 1 star .",
            "time": 1729094021,
            "translated": false
        },
        {
            "author_name": "M Tanveer Malik",
            "author_url": "https://www.google.com/maps/contrib/117872691168287641773/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXhxulW8o5r9z5h0G5zLwwLcvZO0x3FvRNsJ9H6krwNVbRl655H=s128-c0x00000000-cc-rp-mo",
            "rating": 1,
            "relative_time_description": "2 months ago",
            "text": "Disappointing Experience – Below Expectations\n\nOur stay at Campanile Warszawa Centrum Hotel was far from satisfactory. Unfortunately, we encountered several issues that made our experience uncomfortable and disappointing.\n\nFirstly, the room was quite average with poor ventilation and no air conditioning, making it stuffy and difficult to relax. The mattresses were extremely uncomfortable, made from low-quality springs, which left me with back pain throughout the stay. The lack of proper ventilation in the bathroom only added to the discomfort.\n\nTo make matters worse, we were not provided with basic amenities like room slippers. When we requested them, we were asked to pay extra, which was both surprising and frustrating. Additionally, the bedding was not properly cleaned, which is something we expect from any reputable hotel.\n\nLastly, the breakfast was very underwhelming. For 45 PLN per person, we expected more variety and quality, but what we got was barely satisfactory—a basic spread that didn't justify the price.\n\nOverall, the experience was disappointing, and we felt the hotel did not meet basic hospitality standards. We won’t be recommending this hotel based on our stay.",
            "time": 1726866994,
            "translated": false
        },
        {
            "author_name": "Pietro Galinta",
            "author_url": "https://www.google.com/maps/contrib/112432571950440622677/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXkyCaYl8R-EBDQb22Y8HsbzuJA42Zx56XgovTWadGPY9tiUPDo=s128-c0x00000000-cc-rp-mo",
            "rating": 1,
            "relative_time_description": "4 weeks ago",
            "text": "The position is good to go to Expo 21. The room clean but not the best at all. Services and the staff are awful. We asked for a bottle of water at 9 pm but “the kitchen was closed”, this is simply unacceptable. The staff seem do not want to fulfill your needs but create barriers. Not suggested.",
            "time": 1730971227,
            "translated": false
        },
        {
            "author_name": "Ryan Jeffrey",
            "author_url": "https://www.google.com/maps/contrib/110405642191954509489/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJNabiSD0AvFSuhD-jD92UEZCwtVwiJpmFRZVkY8ZckVMABXg=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "4 months ago",
            "text": "Was an amazing time visiting Warsaw. The hotel was so great, friendly and helpful staff working there. The location was great amazing and overall a great stay. My only negative would be the mattress was a little hard. But it was an amazing stay can’t fault it.",
            "time": 1722971104,
            "translated": false
        },
        {
            "author_name": "Paulina Sapinska",
            "author_url": "https://www.google.com/maps/contrib/110786929936828785378/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKWpslrV_kQcOrFRobNWgQzSjDskl8K59Vx-UznSDE9Gg0a-A=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "We stayed at the hotel for six nights while visiting family in Warsaw. The hotel is very clean and the staff were very friendly. The hotel is located very close to the Central railway station, trams, shopping mall and also accessible to central Warsaw and Old Town by foot (or public transport).",
            "time": 1725130794,
            "translated": false
        }
    ]
}