{
    "name": "Radisson Blu Sobieski Hotel, Warsaw",
    "rating": 4.3,
    "reviews": [
        {
            "author_name": "olga zlobinskaya",
            "author_url": "https://www.google.com/maps/contrib/107525595279872477084/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUROyJuXU-O5HN335sX4iOlVhXZLmZE4dgR_zpeEUDVfSC9hSs=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 2,
            "relative_time_description": "a week ago",
            "text": "The hotel has potential but falls short in some areas. While the breakfast was excellent, the beds were comfortable, and it was nice to be able to let fresh air in, the overall experience was let down by a few issues. The towels were old, the toilet seat was broken, and despite requesting a bathrobe, it never arrived. Additionally, there were stains on the carpet and a half-empty bottle of Pepsi left in the fridge from a previous guest, suggesting a lack of attention to cleanliness. With improvements in maintenance and housekeeping, it could be a much better stay.",
            "time": 1732279007,
            "translated": false
        },
        {
            "author_name": "Vicente Rives Molina",
            "author_url": "https://www.google.com/maps/contrib/114033886350577382730/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW6FnE25CXqoZia7UA867_wbQOu5qwjE3cMsYa1gQ7Q7GcBamh9=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "a week ago",
            "text": "Very good hotel. It is very cheap, even if you include breakfast in your reservation, which is highly recommended. The rooms anf bathrooms are big. Very convenient for the offices areas and not far from the airport. Not so convenient for tourism in the city centre",
            "time": 1732354869,
            "translated": false
        },
        {
            "author_name": "Alexander Holomozyi",
            "author_url": "https://www.google.com/maps/contrib/107955626888523272333/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUyvCNOGbi69jlIsOz5cSVHjj-rGCDpNcf4teOznp6wC5quhRulqA=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "I recently stayed at what I believe is one of the best Radisson hotels in Eastern Europe. While the exterior might not be the most modern or flashy, the rooms inside are top-notch. The bed was large and comfortable, and the renovations are done with great attention to quality. Everything you need is there.\n\nBut the real standout? The breakfast. It's honestly one of the best I've ever had in a hotel—great quality and a huge variety of dishes. As a Radisson Club premium member, I was given a room on the top floor, late checkout until 2 PM, and a lovely surprise box in my room with snacks, a Coke, and a handwritten note from the guest manager. It was such a thoughtful touch. Five stars across the board from me!",
            "time": 1725003456,
            "translated": false
        },
        {
            "author_name": "Carlos Lopez-Mariscal",
            "author_url": "https://www.google.com/maps/contrib/106577623935396700005/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJOFLDC92lHU6MK43Amf78KGg8ujgNcHDjnm-G6zD-VGF03yA=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "**Radisson Blu Sobieski: A Gem in the Heart of Warsaw**\n\nIf you're looking for a hotel that offers a perfect blend of comfort, convenience, and exceptional service, the Radisson Blu Sobieski in Warsaw is an absolute must-stay. The hotel's prime location puts you within walking distance of the city's most iconic landmarks, making it easy to explore Warsaw's rich history and vibrant culture. The area is safe and close to local and regional transit.\n\nOne of the highlights of my stay was the incredible breakfast buffet. With a wide variety of delicious options, from freshly baked pastries to savory hot dishes, there was something to satisfy every palate. The quality and freshness of the food were top-notch, making it the perfect way to start the day.\n\nThe staff at the Radisson Blu Sobieski were incredibly attentive and friendly. They went out of their way to ensure that my stay was as comfortable and enjoyable as possible. From the moment I arrived, I felt welcome and valued.\n\nWhile the rooms are on the smaller side, they are impeccably clean and well-maintained. The modern decor and comfortable furnishings create a cozy and inviting atmosphere. Despite their size, the rooms have everything you need for a relaxing stay.\n\nOverall, I had a fantastic experience at the Radisson Blu Sobieski. The hotel's excellent location, delicious breakfast buffet, and attentive staff make it a top choice for travelers visiting Warsaw. I would highly recommend it to anyone looking for a memorable and comfortable stay in the Polish capital.",
            "time": 1725565810,
            "translated": false
        },
        {
            "author_name": "Williams Geraci",
            "author_url": "https://www.google.com/maps/contrib/117371432486840896600/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKrrzkYJOu3sbIGtu3iuGuVlZ_sunvxXbDNFOHTR5DAh8ttMGk=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "3 months ago",
            "text": "Really comfy and clean hotel.\nSuperior rooms are quite big with a huge bed and a sofa.\nPosition is excellent, few mins from all the main locations, walking distance to the central area., and there is also a bay in front of the hotel for taxi pick-up.\n\nIf you can choose, opt for the Garden View rooms, as the ones that face the main road are noisy due to the traffic during the week days.\n\nExcellent breakfast, with lots of choices.",
            "time": 1724747387,
            "translated": false
        }
    ]
}