{
    "name": "Hotel AS Zagreb",
    "rating": 4.6,
    "reviews": [
        {
            "author_name": "Pav Poulli",
            "author_url": "https://www.google.com/maps/contrib/113490406351634566156/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXJQ-TJ7h8TrSuBOtkiru7RI04CEaq3SnZJCy8JPPynVBF35cuG=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "I had two days break out of my work and I really enjoyed it at this beautiful AS Hotel. Thanks guys I really appreciate, you all are very good and helpful 😊 Thanks I will come again.",
            "time": 1728292697,
            "translated": false
        },
        {
            "author_name": "Arpic !!!",
            "author_url": "https://www.google.com/maps/contrib/116523521038441725163/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUX7q5LTKhiy2XxdzGpRrAlApguZW-zlOrDU6ghfAdgdQs9RWg=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "4 months ago",
            "text": "Hotel was nice, staff helpful, location nice and relaxing. We loved it here and we hope we will return soon! Special thanks to the hotel AS team!",
            "time": 1722759487,
            "translated": false
        },
        {
            "author_name": "Dr. Reviewer",
            "author_url": "https://www.google.com/maps/contrib/111009069558010957853/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW5mFUZTKdz7VangH1jm4jKWhg0N4nCCrNEcrWSW40GEAQGn-lC=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 4,
            "relative_time_description": "a year ago",
            "text": "The hotel is very well located in Zagreb center and yet in the middle of the woods (a park) which will give you peace of mind and at the same time you're very close to the center that you can reach either walking or driving.\nThe rooms are spacious compared to other hotels, with big windows.\nI really liked the very classic details of the hotel (heavy old keys, paintings, furniture..etc).\nThe building is from inside is very classic, yet from outside is modern😍.\nThe car parking is available and free.\nThe breakfast finishes at 11 a.m., which is very convenient if you are on vacation and you wanna wake up late. Even during the last day, the waiter waited for us even more, and he was very kind and welcoming.\nThe food was really good.\nThe staff ( reception and restaurant) are really kind, friendly and helpful.\n\nThere are few points to be taken into consideration, especially since it is ((a 4-star hotel))\n1. There was no kettle in the room. When we asked, they were very kind to bring a hot water for the baby, but kettle is really important to be in the room.\n2. I asked for an ironing machine. Unfortunately, they don't have one !!! and even no laundry service in the hotel! I was really embarrassed as I had a flight the next day, and even the town laundries were closed on Sunday 😅\n3. The room was very warm as AC was not On yet in April. I know it was cold outside but the room itself was really warm from inside. I had to open the windows and wake up early in the morning by the cars and the birds noise 😅💔.\n\nAnyway I really recommend to stay here",
            "time": 1683040624,
            "translated": false
        },
        {
            "author_name": "Aldo Moscaroli",
            "author_url": "https://www.google.com/maps/contrib/108091278065213137970/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKQepuTqqXM5Y78qbq7pGHjnjnSt7lWA59aoH6iVigX0QEjbg=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 4,
            "relative_time_description": "a month ago",
            "text": "Old hotel, refurbished but still rather old, though very well maintained.",
            "time": 1728481402,
            "translated": false
        },
        {
            "author_name": "Grayson James",
            "author_url": "https://www.google.com/maps/contrib/114573711907918157489/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKnqzwU9nc2V8ZGTIb3U_4zjfOt8zCZ9Ar15bBdkfBLZypRSg=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "a year ago",
            "text": "The staff are English speaking, and very helpful. There are free A3 sized maps of Zagreb in the foyer. The rooms are sumptuous and well furnished. The hotel is a 20 min walk from Britanski (British) Square, which is the start of the city centre. In 30 to 35 mins, you can walk to the main square. Always call for 1717 Taxis  if you need one. Their prices are good and they won't rip you off if say you want to go to or from the Central shopping mall. They charged us 8 Euros to go back to the Hotel, whereas other chancers at the Mall wanted between 25 and 35 Euros. The concierge can call them. The hotel is in a quiet and beautiful location with Al fresco dining. For those used to UK hotel's you will not find tea and coffee making facilities in your room. But you can order drinks. There is a wonderful restaurant there, and the steak was marvellous, but it is expensive. It's not like a Premier Inn with an adjoining Beefeater. Having said that, there are several restaurants at Branski Square and many more within a further 10 minute walk. And if your tired after eating out 5 Euros will cover your taxi fare back to Hotel AS. We will definitely go back.",
            "time": 1696952111,
            "translated": false
        }
    ]
}