{
    "name": "Pri zvoncu",
    "rating": 4.7,
    "reviews": [
        {
            "author_name": "Daniele Palumbo",
            "author_url": "https://www.google.com/maps/contrib/109196301903513778573/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUV2F6nbjD11SPdFboXZwsb_AcJDXs8_UHepgfZtqUJGQR0q8A=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "2 months ago",
            "text": "It's a restaurant where you can feel the atmosphere of Zagreb. The interior design is simple but gives a warm feeling.\n\nThere are a wide choice of dishes, from starters to main dishes, passing through the delicious second dishes to finish with a tasty palacinka. You can eat chicken, turkey, veal, beef and lamb, all prepared in different ways\nThey have a good selection of beers and wines, the service is",
            "time": 1727393275,
            "translated": false
        },
        {
            "author_name": "Mirna Vasic",
            "author_url": "https://www.google.com/maps/contrib/109490382792136796295/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKJ2gnTRCXMNElwbOBfC7D49Gvbg-0RvH_bgPXx7325KLQrzik=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "4 months ago",
            "text": "Very nice rustic-style restaurant with excellent food. Everything was just perfect from the start. The service, the food, the atmosphere, simply everything was great. The waiters are very attentive and quick and the food is delicious! We had several different starters, main courses and desserts, everything was delicious and the portions were generous! I can warmly recommend this restaurant!",
            "time": 1720529446,
            "translated": false
        },
        {
            "author_name": "narcoleptic_moose 67",
            "author_url": "https://www.google.com/maps/contrib/102903971158108505358/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWXMHr4yKARNDYdJcQtuna2v2fAeEqhyPHM8jviHFnoKbl4I4tBEg=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "Outstandingly delicious food. It is on the pricer side, but you are absolutely getting your money's worth. Atmosphere and service also up to par.",
            "time": 1730706831,
            "translated": false
        },
        {
            "author_name": "Denislav Kandev",
            "author_url": "https://www.google.com/maps/contrib/114357166650427429738/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU2f_z_DPk_LqyDbus1WNl69j1JqSVzBnAjqZlgh5f3HeRVzJvj=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 4,
            "relative_time_description": "6 months ago",
            "text": "You may be wandering why there is a 4 stars and everything else is 5... Well I will tell you - I went there with somehow very high hopes and expectations. 4.6, relatively far away from the city center and all the tourist traps there, and a local Croatian cuisine... So what I got was a bit disappointing, but definitely delicious. And the disappointment is all because of my high expectations. I went there, a very polite staff member pointed me to a table. I went through the menu, which is very big... I saw few dishes that caught my attention but I wasn't sure. I've asked the waiter to recommend me something - a starter, salad, main and dessert with the only request to be as local cuisine as possible, because I do want to try Croatian meals. He explained that everything is homemade and it is local. And the  offered me the Zvoncu steak, explaining it is big enough to not need a starter, a mixed salad and beans a side. The salad was good, tasty and with the right amount of vinegar. The star of the evening was the steak. It was absolutely delicious, made exactly as it should be - medium rare. For this I have nothing to say but superlatives. The beans - I had a lot of beans in my life, so I wasn't impressed... Beans are beans. The huge disappointment was the dessert... I've asked him for something local, instead I got a generic chocolate cake with Berry jam and cream... It was delicious, but all around me people were eating something that seems a lot better. But still it is my fault not to ask for it specifically. So final summation: delicious steak, definitely worth the money. For everything else - trust your stomach and take whatever makes it send a request to your brain.\nI will visit the place again and this time ask for whatever I want and I am sure my experience will be 5/5 stars.\nPS: The prices are a bit high... But probably it is because the place has a reputation among the locals... But be advised...",
            "time": 1715376521,
            "translated": false
        },
        {
            "author_name": "M M",
            "author_url": "https://www.google.com/maps/contrib/117915969064250075335/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJENJ0P8gpxQZ8D0iOrhDgG0q_XT15CqmmCoYlaBO1vm4E37g=s128-c0x00000000-cc-rp-mo-ba3",
            "rating": 5,
            "relative_time_description": "5 months ago",
            "text": "Amazing beef shank, no need to preorder but minimum portion is for two people.\nStaff is kind and efficient.\nRecommended for meat lovers.",
            "time": 1720102345,
            "translated": false
        }
    ]
}