{
    "name": "Mali Medo",
    "rating": 4.5,
    "reviews": [
        {
            "author_name": "Shane Hollingsworth",
            "author_url": "https://www.google.com/maps/contrib/104737503829862436033/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUPfqivj5VoIyDyZULgXHbV_vHo0-DdivoHt3tp3_2C78OZCR4=s128-c0x00000000-cc-rp-mo-ba4",
            "rating": 4,
            "relative_time_description": "5 months ago",
            "text": "Great portions.. ok prices, charming atmosphere of the old town albeit quite busy. Tastes good. Its a safe choice.\nWe got to watch Croatia play on a massive screen they set up with all the locals, which made for a memorable experience.. but other then that this place is average",
            "time": 1718876745,
            "translated": false
        },
        {
            "author_name": "Gabriel Mihai",
            "author_url": "https://www.google.com/maps/contrib/104670416735436447602/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWC3joLi2kLcogi9VmevsVdIzLdAh7uhLzqo2MPTPq0PPY8CDG6=s128-c0x00000000-cc-rp-mo-ba6",
            "rating": 1,
            "relative_time_description": "2 months ago",
            "text": "Taking into account that the restaurant was recommended to us by locals, I am sure that the quality of the dishes offered is good. Its location is central (not far from the Cathedral), with tables inside and outside, along the street.\nUnfortunately, we didn't manage to eat there on September 26 because of an extremely rude waiter who, once we sat down at a four seats with backrest  table (we were a couple) once  almost all others (seats with or without backrest)  were free, he asked us (grinning  aggressivelly ) to move to a smaller one, threatening that otherwise \"he will charge us for extra 10 euros\". Being asked if this is an  internal rule of the restaurant, he cheekily replied that \"it is his rule\".\nBefore leaving, we asked another waiter if those \"extra 10 euros\" requested by the rude one  are part of his  restaurant's policies. He denied obviously, evaluating   what his colleague did  as abnormal and unprofessional",
            "time": 1727676061,
            "translated": false
        },
        {
            "author_name": "Wei Jie Ng",
            "author_url": "https://www.google.com/maps/contrib/116971330207301352737/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWfh60IavIoHEAHFBiDZaTDzyOAq06oRMnwntCdXDxiPAZkQLTI=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 4,
            "relative_time_description": "a month ago",
            "text": "Asians will probably find it salty here.\n\nBut still pretty decent food. The crepe which they call pancakes are great when warm.",
            "time": 1728277067,
            "translated": false
        },
        {
            "author_name": "Mackers",
            "author_url": "https://www.google.com/maps/contrib/116106802133830329013/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVWVWTmDkIqh4_x0ee6aG-SlqHPSJTQ8R8d4NtH_VElAY_D7hnOFQ=s128-c0x00000000-cc-rp-mo-ba5",
            "rating": 1,
            "relative_time_description": "5 months ago",
            "text": "Terrible management but pretty good food and great atmosphere, especially when locals are singing and having fun. Good food, particularly the cevapi, pljeskavica, and gnocchi dishes. Beer is very good. Unfortunately, we have been to lied to by this establishment on more than one occassion, when items that we did not order appeared on our bill, or they tried to upcharge us and claim we ordered a liter of beer when instead we ordered 1/2 liter. Prices are way up since pre-covid. Can no longer support this establishment.",
            "time": 1720288650,
            "translated": false
        },
        {
            "author_name": "Ana E.",
            "author_url": "https://www.google.com/maps/contrib/115614642943998286191/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLKN88l9yAX3B-hsqp7p6mm08Y9EOB70itZO_6EwzxqtJ45Pg=s128-c0x00000000-cc-rp-mo",
            "rating": 1,
            "relative_time_description": "3 months ago",
            "text": "Worst Place ever! Brought my Boyfriend for the first time to Croatia and was expecting a bit nicer People. The Staff was very unfriendly, had to wait for ages to order and then the same thing till we got our food. The waiter was very stressed and in a bad mood, when taking our order he didn't even look in our eyes. Also while we were paying, he was talking with other people because there was a issue with a table next to us. After the payment went through by card, he didn't even say thank you or goodbye!! I was very upset and thought thank you very much for giving us and especially my Boyfriend such a bad memory of Zagreb on the first day!!",
            "time": 1723149661,
            "translated": false
        }
    ]
}