{
    "post_title": "Podaljšani kroji M",
    "post_author": "Gregor988",
    "post_score": 10,
    "post_url": "https://www.reddit.com/r/Ljubljana/comments/1hipx41/podaljšani_kroji_m/",
    "comments": [
        {
            "author": "Acceptable_Tomato548",
            "body": "rabiš podaljšane rokave, ampak vedi da linije ki majo podalsane rokave niso poceni nazalost govorim iz izkusenj",
            "score": 3,
            "created_utc": 1734722960.0
        },
        {
            "author": "qoqoon",
            "body": "Mam iste probleme, konkretno s t-shirti, ze cel lajf. Vse je prekratko po 5 pranjih. XL in vecje cifre so isto dolge kot L, samo sirse. I hate it.",
            "score": 3,
            "created_utc": 1734725422.0
        },
        {
            "author": "imisstonystark3000",
            "body": "Sem na istem vsakič, ko je treba menjat plašč :,). Najboljše izkušnje do zdaj sem imel s Peek & Cloppenburg pa tu pa tak v kakšnem thriftu najdeš kak gem",
            "score": 3,
            "created_utc": 1734780453.0
        },
        {
            "author": "Outrageous-Group-252",
            "body": "Js mam probleme s hlacami, za noben dnar na svetu ne najdm pravih velikosti pa sm biu cez vse trgovine ze veckrat. Iskreno verjetno je edina moznost potem je da kupis malo prevelke pa ti jih sivilja skrajsa alpa da ti po meri izdelajo",
            "score": 1,
            "created_utc": 1734748515.0
        },
        {
            "author": "Niri87",
            "body": "S Oliver https://www.soliver.si/c/moski/oblacila/podaljsani-kroji/",
            "score": 1,
            "created_utc": 1734760987.0
        },
        {
            "author": "tenebrigakdo",
            "body": "H&M ima na spletni strani na voljo podaljšane majice z dolgimi rokavi. V živo jih na žalost nisem našla. Izgledajo 'normalen' kroj, niti slim fit niti široke. Za bunde žal ne znam svetovat, moj (187 cm, 80 kg) ima rad oversize videz, tako da samo izbere dovolj veliko. Mogoče ima smisel pogledat New Yorker in podobne 'najstniške' trgovine, vsaj za ženske velikokrat podpirajo bolj vitke postave.",
            "score": 1,
            "created_utc": 1734776874.0
        },
        {
            "author": "Gre-Gor80",
            "body": "Super nova ==> peek-cloppenburg",
            "score": 1,
            "created_utc": 1734779967.0
        },
        {
            "author": "2dmaxxx",
            "body": "Half Price suknjiči in srajce številka 98. Moraš pa malo pobrskati. Večkrat.\n\n+1 za Peek&Cloppenburg",
            "score": 1,
            "created_utc": 1734867362.0
        },
        {
            "author": "ltnvc",
            "body": "T-shirti - primark muscle ali slim fit xxl, potem po sušenju postane kroj perfect.",
            "score": 1,
            "created_utc": 1734934041.0
        },
        {
            "author": "Gregor988",
            "body": "Za plašče je Sense idealka. Res da plačaš več, ampak je kvalitetna roba.",
            "score": 3,
            "created_utc": 1734780587.0
        },
        {
            "author": "Gregor988",
            "body": "Kaj pa na AboutYou? Tam lahko iščeš po širini in dolžini. Ali pa Seliger, tam imajo enako",
            "score": 1,
            "created_utc": 1734757742.0
        },
        {
            "author": "tenebrigakdo",
            "body": "New Yorker ima kavbojke na dve številki in začnejo s širino 28 za moške, to je res za suhce.. Iirc imajo dolžine do 36.\n\nEnkrat sem na internetu našla EU spletno štacuno za visoke moške, ne spomnim se točnega imena, ampak nekaj na varianto 'just tall'. Imajo res veliko izbiro ozkih in dolgih hlač. Malo pogooglaj, ziher bo padlo ven.",
            "score": 1,
            "created_utc": 1734777084.0
        },
        {
            "author": "powernapheadpillow",
            "body": "Tole. V S Oliverju sem že kdaj kej našel.",
            "score": 1,
            "created_utc": 1734947602.0
        }
    ]
}