{
    "post_title": "Some of my favourite pics of the country taken this year - what’s your favourite thing about England? ",
    "post_author": "coffeewalnut05",
    "post_score": 344,
    "post_url": "https://www.reddit.com/gallery/1hk99lh",
    "comments": [
        {
            "author": "tradegreek",
            "body": "“We may be a small country, but we're a great one, too. The country of Shakespeare, Churchill, the Beatles, Sean Connery, Harry Potter. David Beckham's right foot. David Beckham's left foot, come to that”",
            "score": 36,
            "created_utc": 1734907792.0
        },
        {
            "author": "TCHS27",
            "body": "I definitely love Your football most of all. I am an American with English blood on both sides of my Family so I have always had a soft spot for England. I love Your coastal areas they are absolutely beautiful. All around just a beautiful country!",
            "score": 11,
            "created_utc": 1734907374.0
        },
        {
            "author": "IcemanGeneMalenko",
            "body": "I love the aesthetics in autumn when out hiking, especially more into November when it's normally being raining. Shiny footpaths/roads, leaves everywhere, grey skies, misty but still a bit of colour about. Sounds drab but I find it so nice.",
            "score": 8,
            "created_utc": 1734906535.0
        },
        {
            "author": "AppearanceMaximum454",
            "body": "Pendeen lighthouse heading west is an incredible stretch of coastline especially if you are brave enough to stay on the path closest to the cliff. When you hit Kenidjack valley you feel like you have walked through time. There isn’t a coastal walk in the world as interesting and spectacular. It has it all.",
            "score": 3,
            "created_utc": 1734910146.0
        },
        {
            "author": "ClockworkOpalfruit",
            "body": "I love that I live in an urban area but we can drive 20 minutes in any direction and reach the seaside, the hills, the moors, or a country village. I feel really lucky to be able to live like that. \n\nI took an American friend in a tour of my region a few years ago, she was blown away by the rich history we have, historical buildings, varied environments. \n\nShe was in the assumption that all of England is either London or castles.",
            "score": 5,
            "created_utc": 1734911271.0
        },
        {
            "author": "AnonymousTimewaster",
            "body": "I've said since uni that the history is probably my favourite part about England. I believe we have the oldest continuously running political system in the world, certainly of any major nation at any rate. England has been a remarkably stable nation for at least the last 800 years. And it's all tremendously well documented. I think the way we treat history as a nation is outstanding. I don't think there's anywhere in the world that can quite match our pure abundance and accessibility of history, since most of it is also accessible for free. So many stately homes, all with their own unique pasts. And then you drive through the Lake District and you're left wondering how long the structures have been there for. I often thing some of the drystone walls used by farmers must have been in place for centuries in some instances.",
            "score": 2,
            "created_utc": 1734917032.0
        },
        {
            "author": "Njosnavelin93",
            "body": "We speak English which is the only language I know and I'm not a second class citizen who has to jump through hoops to stay here. If language and being British didn't make you a second class citizen in Europe then I wouldn't necessarily be here, who knows.",
            "score": 1,
            "created_utc": 1734956358.0
        },
        {
            "author": "Odd-Willingness7107",
            "body": "I have to say ever since I discovered that Britain is one of the most environmentally destroyed countries in the world, it really took the shine away from the countryside.\n\nAll the heavily forested areas are gone. Now we have woodlands and small scattered forests. The trees cannot regenerate because the deer population is wildly out of control because most natural predators were eradicated, such as bears, wolves and lynx. Many bird species, especially predators like eagles and raptors, were eradicated. \n\nEven the seas weren't safe. 100 years ago the Humber estuary was home to Europe's largest oyster beds. 50 years ago they went extinct in the area. They never naturally returned. However, they have now imported some oysters from elsewhere in Europe in order to help them return. Ironically the Humber used to have a large export market to help strengthen mainland European populations. Burbot, a large fish, are also extinct.\n\nMost of the marshes and wetlands have been drained and the rivers artificially straightened, which in turn adversely effects fish reproduction. Our rivers are polluted and our seas are full of raw human sewage.",
            "score": -1,
            "created_utc": 1734909254.0
        },
        {
            "author": "Entropy907",
            "body": "Joy Division, The Cure, Wire, The Fall, Echo & The Bunnymen, New Order, Siouxsie & The Banshees … the list never ends.",
            "score": 11,
            "created_utc": 1734911480.0
        },
        {
            "author": "ysgall",
            "body": "Wasn’t Sean Connery from Edinburgh… in Scotland?",
            "score": 3,
            "created_utc": 1734913290.0
        },
        {
            "author": "woolyweasel",
            "body": "Did you watch Love Actually last night too?!",
            "score": 2,
            "created_utc": 1734912074.0
        },
        {
            "author": "Odd-Willingness7107",
            "body": "Sean Connery was a wife beater and proud of it.",
            "score": -5,
            "created_utc": 1734909354.0
        },
        {
            "author": "coffeewalnut05",
            "body": "Thank you! I’ve never been to the States but would love to experience the diversity and scale of the country",
            "score": 5,
            "created_utc": 1734908446.0
        },
        {
            "author": "coffeewalnut05",
            "body": "Yes! That sparkling effect after rain is so underrated. I especially love seeing the droplets on grass, leaves and flowers.",
            "score": 2,
            "created_utc": 1734908503.0
        },
        {
            "author": "coffeewalnut05",
            "body": "Facts, love Cornwall and always aching to go back and explore more. It’s so peaceful and beautiful.",
            "score": 4,
            "created_utc": 1734910320.0
        },
        {
            "author": "coffeewalnut05",
            "body": "I love that about living here too! You’re never far from stunning countryside and/or sea.",
            "score": 2,
            "created_utc": 1734911323.0
        },
        {
            "author": "coffeewalnut05",
            "body": "I think the shine is always there. Nature is very resilient, and the countryside feels quite unique to here, which I notice when I go abroad. I do believe there’s ample opportunities for rewilding though - there just needs to be political will. But we’ve made great progress in restoring nature over the years.",
            "score": 3,
            "created_utc": 1734909372.0
        },
        {
            "author": "SleipnirSolid",
            "body": "I just think the country is generally shit but thanks for giving me a few concrete reasons I can list in future if people ask me why I'm not proud of the country.",
            "score": 1,
            "created_utc": 1734962910.0
        },
        {
            "author": "CookinCheap",
            "body": "The Young Ones!",
            "score": 3,
            "created_utc": 1734915603.0
        },
        {
            "author": "Wooden-Agency-2653",
            "body": "I'm going with the Edinburgh was originally an English city argument I reckon",
            "score": 6,
            "created_utc": 1734916046.0
        },
        {
            "author": "tradegreek",
            "body": "Do I need to tell you it’s a silly quote from a film as well? 🤣 but yes he was Scottish when it suited him and the quote is about Britain rather than England…",
            "score": 1,
            "created_utc": 1734913386.0
        },
        {
            "author": "tradegreek",
            "body": "No ha what was it on? I just love the end bit about David Beckham 🤣",
            "score": 2,
            "created_utc": 1734912153.0
        },
        {
            "author": "tradegreek",
            "body": "It’s a silly quote from a film don’t let it get to you",
            "score": 5,
            "created_utc": 1734909428.0
        },
        {
            "author": "TCHS27",
            "body": "Always Friend. I’m sure neither of Us fully appreciate Our countries but that is only natural. Most everything here in America is rooted in England. I have never been able to take in a football match in England, I’m a massive Chelsea fan and can’t wait to go to Stamford Bridge!",
            "score": 3,
            "created_utc": 1734908732.0
        },
        {
            "author": "jbkb1972",
            "body": "Cornwall is the best place in the world.IMO",
            "score": 3,
            "created_utc": 1734912381.0
        },
        {
            "author": "Unlikely_Shirt_9866",
            "body": "The UK is quite a small island and is one of the most nature-depleted countries in the world. The government need to be really careful about allowing building on every green space we have. I hate the way that rural towns are absorbed by the inexorable march of new roads and buildings to become part of a horrible urban sprawl with all green spaces obliterated. I dread to think what a mess it'll be in another 100 years. Glad I won't be here to see it.",
            "score": 1,
            "created_utc": 1734955024.0
        },
        {
            "author": "Entropy907",
            "body": "Gang of Four \n\nDepeche Mode \n\nBauhaus",
            "score": 3,
            "created_utc": 1734916026.0
        },
        {
            "author": "WyleyBaggie",
            "body": "Ok then I'll go with the whole of England was Welsh argument :-)",
            "score": 0,
            "created_utc": 1734950565.0
        },
        {
            "author": "ysgall",
            "body": "He was Scottish. Not just ‘when it suited him’. I can’t think of an instance when he was anything other than Scottish - even when he was playing Robin Hood!",
            "score": 2,
            "created_utc": 1734914128.0
        },
        {
            "author": "woolyweasel",
            "body": "It was. #christmasclassic...always make me think we need a Prime Minister like Hugh Grant in that film too!",
            "score": 1,
            "created_utc": 1734912296.0
        },
        {
            "author": "HollowWanderer",
            "body": "I hear you guys have a 'New' Hampshire. What's it like? I'm from the old Hampshire but I like the look of the autumn forests",
            "score": 4,
            "created_utc": 1734914015.0
        },
        {
            "author": "Entropy907",
            "body": "Was all in on this until I saw Chelsea.",
            "score": 3,
            "created_utc": 1734911415.0
        },
        {
            "author": "coffeewalnut05",
            "body": "I don’t think we’re that nature depleted, rather many of our native species (especially plants) have been replaced by non-native species introduced during empire. \n\nWe certainly have fertile soil and good weather conditions for nature to flourish, we’ve just altered ecosystems beyond recognition in a lot of respects. One sore point is our lack of forest though.",
            "score": 1,
            "created_utc": 1734955140.0
        },
        {
            "author": "CookinCheap",
            "body": "The Damned! David Bowie! The Chameleons! Fad Gadget! Cocteau Twins (ok Scottish but)! The Jam! The Specials! The fuckin' Clash!",
            "score": 2,
            "created_utc": 1734917831.0
        },
        {
            "author": "tradegreek",
            "body": "It’s more a dig at the fact that he spent so little time in Scotland for someone that “loved Scotland so much” but yea he didn’t really change his roles but he was a hell of a actor with great comedic timing",
            "score": 1,
            "created_utc": 1734914336.0
        },
        {
            "author": "TCHS27",
            "body": "To be honest I have never been to New Hampshire. I hear it’s beautiful in Autumn but brutal in the winter. I just don’t go out to that area of the country.",
            "score": 3,
            "created_utc": 1734920828.0
        },
        {
            "author": "TCHS27",
            "body": "It happens, We all have Our different clubs We support, I think We can agree that English football is a beautiful game!",
            "score": 2,
            "created_utc": 1734920893.0
        },
        {
            "author": "Entropy907",
            "body": "Sex Pistols \n\nP.I.L.\n\nThe Smiths (but Morrissey is a twat)\n\nPortishead\n\nOasis \n\nCould do this all day.",
            "score": 4,
            "created_utc": 1734918830.0
        },
        {
            "author": "Entropy907",
            "body": "Can’t stop watching it.  Even as as a Spurs supporter 😂",
            "score": 2,
            "created_utc": 1734921290.0
        },
        {
            "author": "TCHS27",
            "body": "Why can’t You support Palace, West Ham or even Brentford? 🤣 Do You have to be a Spurs fan? I’m playing, it is a beautiful game and I wake up early every Saturday and Sunday in America to watch any match I can.",
            "score": 1,
            "created_utc": 1734921487.0
        },
        {
            "author": "Entropy907",
            "body": "Idk.  I went with Spurs like a decade ago and I’m in for life.  For better or worse.  And by that I mean, worse.",
            "score": 1,
            "created_utc": 1734921641.0
        },
        {
            "author": "TCHS27",
            "body": "I feel and respect that. I fell in love with Chelsea back in the Super Frankie Lampard days especially in 07, 08. Those colors and the crest and the fact they are in London. Love them, I’ve spent hundreds of dollars on kits and other merch. I can’t wait to get over there to see them again play.",
            "score": 2,
            "created_utc": 1734921857.0
        },
        {
            "author": "Entropy907",
            "body": "My wife is a Chelsea fan so that can get kinda weird.",
            "score": 2,
            "created_utc": 1734922032.0
        },
        {
            "author": "TCHS27",
            "body": "Oh wow I bet it can get rather intense on derby day in Your household. Big Ange has an exciting system and I was completely wrong about Him being able to come and have success in the English top flight. I respect Spurs as another big club I London and I think Son is class, but I’ll need them to cut it out when they come to the Bridge 🤣",
            "score": 2,
            "created_utc": 1734922256.0
        }
    ]
}