{
    "post_title": "Ligt het aan mij of is die milieuzone gewoon krom",
    "post_author": "Dylano_VZ",
    "post_score": 0,
    "post_url": "https://www.reddit.com/r/Amsterdam/comments/1hkm6va/ligt_het_aan_mij_of_is_die_milieuzone_gewoon_krom/",
    "comments": [
        {
            "author": "___Torgo___",
            "body": "Beide brommers zijn schadelijk voor het het milieu (en je mede Amsterdammers) maar in ogenschouw nemend dat je een investering gedaan hebt wordt de uitfasering in fases gedaan. De 2009 brommer heeft twee jaar meer afgeschreven dan de 2011 brommer en is dus eerder aan de beurt (om uitgefaseerd te worden). Tijd voor een (elektrische) fiets, speed pedelec of electrische brommer.",
            "score": 10,
            "created_utc": 1734958132.0
        },
        {
            "author": "TheBlackestCrow",
            "body": "Dat kan inderdaad krom voelen. Enkel moet er voor een milieuzone ergens een grens getrokken worden en in dit geval is het een bouwjaar.\n\nHet meest ideale was een milieuzone op basis van daadwerkelijke uitstoot. Enkel lijkt mij dit veel moeilijker om in te kunnen voeren dan een harde grens zoals een bouwjaar.",
            "score": 5,
            "created_utc": 1734957972.0
        },
        {
            "author": "Jose_Zueco",
            "body": "2 takt..? Wegwezen met die stinkzooi uit Amsterdam...",
            "score": 7,
            "created_utc": 1734958138.0
        },
        {
            "author": "jeandolly",
            "body": "Ja het is krom. Dat er nog steeds mensen op die stinkende teringherriedingen rondrijden is nog krommer.",
            "score": 5,
            "created_utc": 1734958999.0
        },
        {
            "author": "PM_ME_WINDMOLENS",
            "body": ">De scooter is de meest vervuilende vorm van vervoer in de stad. De scooter stoot meer vervuilende stoffen uit dan een vrachtwagen per gereden kilometer. Daarbij is de 2-takt scooter nog eens extra vervuilend.\n\nIk ben echt super blij dat je niet de stad in komen in ieder geval",
            "score": 3,
            "created_utc": 1734958993.0
        },
        {
            "author": "dullestfranchise",
            "body": "Het is krom, maar er moet ergens een simpele grens getrokken worden om het makkelijk te kunnen handhaven.",
            "score": 1,
            "created_utc": 1734958198.0
        },
        {
            "author": "Dylano_VZ",
            "body": "Ik snap het ook wel, maar mij lijkt een betere grens om naar de milieu code te kijken. Nu kan ik niet meer naar mn mooie stad waar ik ben geboren en getogen tot ik mijn motorrijbewijs heb, maar cantas zijn nog steeds op elke hoek te zien (love naar de cantas tho)",
            "score": 2,
            "created_utc": 1734960634.0
        },
        {
            "author": "thisBookBites",
            "body": "Je KAN best. Er zijn meer manieren dan je brommer.",
            "score": 1,
            "created_utc": 1734961951.0
        }
    ]
}