{
    "post_title": "What Brussels looked like in the 1980s Through These Fascinating Photos",
    "post_author": "rebeccahubard",
    "post_score": 83,
    "post_url": "https://bygonely.cc/brussels-1980s-photos",
    "comments": [
        {
            "author": "HereHaveAQuiz",
            "body": "Okay where is all the rubbish? How is it so clean",
            "score": 45,
            "created_utc": 1734853170.0
        },
        {
            "author": "Comfortable-Bonus421",
            "body": "Mostly all recognisable, except rue Ravenstein.\nWhat happened there. It used to be a shopping street?",
            "score": 13,
            "created_utc": 1734852646.0
        },
        {
            "author": "SharkyTendencies",
            "body": "Lol Fritland is still there XD",
            "score": 9,
            "created_utc": 1734863632.0
        },
        {
            "author": "Thecatstoppedateboli",
            "body": "Nice pictures! It seemed so clean and organized. Too many cars though. It got really fucked up in 40 years.",
            "score": 12,
            "created_utc": 1734859060.0
        },
        {
            "author": "abysmalbutterfly",
            "body": "Beautiful pictures!\n\n\nBut those saying it was better in the past. I disagree. \n\n\nThese photos hide the absolute disgrace of many city cancers that happened in this period. Hip streets of today were fairly empty, St-Gery, Rue Dansaert. \n\n\nYou can see them here which include many pictures of the previous link (https://www.flickr.com/photos/52086447@N00/sets/72157638982316363/)\n\n\nBrusselisation, mass unemployment, violent attacks of the CCC, frequent murders... Bruzz wrote a few times about this period (https://www.bruzz.be/dossier/de-grauwe-jaren-1980).\n\n\nThere are different problems the city has nowadays, but it has improved compared to those times",
            "score": 13,
            "created_utc": 1734875563.0
        },
        {
            "author": "Brilliant_Owl9189",
            "body": "Still looked like Belgium , nice",
            "score": 4,
            "created_utc": 1734882310.0
        },
        {
            "author": "conchita_puta",
            "body": "Crazy to see Barriere without potholes, and also notice the roundabout sign.",
            "score": 6,
            "created_utc": 1734857047.0
        },
        {
            "author": "AZ4400",
            "body": "The most interesting picture is picture number 20. You can see a poster with “Venez vivre à Bruxelles” (“Come live in Brussels”). It’s a reminder of how poorly Brussels was perceived at the time, with many people deciding to leave the city. Now, just put up an apartment for rent or sale, and you’ll receive offers within hours.",
            "score": 5,
            "created_utc": 1734891053.0
        },
        {
            "author": "MoDeutschmann",
            "body": "Thanks for sharing!",
            "score": 2,
            "created_utc": 1734857620.0
        },
        {
            "author": "Doridar",
            "body": "I'm probably in the background of one of these pictures after July 1984",
            "score": 2,
            "created_utc": 1734869387.0
        },
        {
            "author": "Col_bob113",
            "body": "So, more crowded today, less clean. But much more beautiful today...",
            "score": 6,
            "created_utc": 1734854629.0
        },
        {
            "author": "AZ4400",
            "body": "Brussels in the 70s, 80s, and 90s was an ugly, dirty city. And boring as hell! There was literally nothing. We can criticize Brussels as much as we want now, but the massive influx of young Europeans and young Flemish people completely transformed the cultural scene—though it also brought gentrification.\nI swear that in the 90s at 10pm the city was dead. ",
            "score": 3,
            "created_utc": 1734890569.0
        },
        {
            "author": "AeonWealth",
            "body": "Wow... gay street didn't look gay (I wonder when it started to turn?) and City2 already existed!\n\nBut the Wolowes still seem to look the same!",
            "score": 2,
            "created_utc": 1734904897.0
        },
        {
            "author": "p_rapache",
            "body": "Most striking? Not as many cars as today but already s… up the city",
            "score": 1,
            "created_utc": 1734869469.0
        },
        {
            "author": "External-Bank-6859",
            "body": "I have known those times.\nMuch better. Less crowded.\nPoliticians really fucked it up.\nBy letting way too many people settle in Brussels.\nThe population growth should have been stopped in the 90’s.\nCertainly when most of this growth is a burden on welfare and other services like security.\nPS is a curse.",
            "score": -7,
            "created_utc": 1734848659.0
        },
        {
            "author": "Delicious_Lime1906",
            "body": "The roads are not pretty. They always look so broken. Why ? I have known brussels in the late 80's. Has always looked grey with broken roads. But the atmosphere of center city has always been magical.",
            "score": 0,
            "created_utc": 1734873035.0
        },
        {
            "author": "dexterie",
            "body": "Even with way more cars, it looks clean and nice. Civilised. Not the dystopian unintegrated mess we have now. These pics make me sad…",
            "score": 0,
            "created_utc": 1734958328.0
        },
        {
            "author": "Photosama",
            "body": "well.. you know..",
            "score": -4,
            "created_utc": 1734867282.0
        },
        {
            "author": "Col_bob113",
            "body": "No, it's rue Neuve...",
            "score": 9,
            "created_utc": 1734854515.0
        },
        {
            "author": "StashRio",
            "body": "Your own links provide the reason why Brussels is today a mess. Too much immigration, which completely changed the character of Molenbeek, Schaerbeek, Sint Joos and other parts of the city. People were protesting about it then and being called racist and marginalised. Today, even the migrant middle class does not want to live in many of these areas, by my reckoning more than half of Brussels. How can you say it’s better today, when Brussels has been effectively ghettoised and rendered ungovernable? Sure , the gentrified and trendy bits and pieces of Brussels are “better”….!",
            "score": -4,
            "created_utc": 1734876689.0
        },
        {
            "author": "bluemyeyes",
            "body": "Yes, true.\nBruxelles used to be quite dull, boring and poor. \nIt's much better nowadays.",
            "score": 2,
            "created_utc": 1734914441.0
        },
        {
            "author": "bluemyeyes",
            "body": "I agree, it's so much better know, and I am personally very happy to welcome immigrants and expats that make the city so much more interesting and alive.",
            "score": 2,
            "created_utc": 1734914288.0
        },
        {
            "author": "zajijin",
            "body": "I don't understand the negativity of people.\n\nJust look at the people place de la monnaie, seems peaceful and safe. No way I'd sit there now.",
            "score": 14,
            "created_utc": 1734853875.0
        },
        {
            "author": "bluemyeyes",
            "body": "I have known those time too and I disagree. \nIt was very poor back then, and some places were very dangerous and much dirtier than today ( thinking about Saint Gilles and Dansaert, for instance).\nAlso, the city was quite boring with not as much happening culturally speaking. \nI think the city has mostly flourished thanks to the immigrants and all the big melting pot it created.\nHaving people from all over the world living here is a very big chance.",
            "score": 2,
            "created_utc": 1734914183.0
        },
        {
            "author": "parabodick",
            "body": "This feels like satire lol",
            "score": -8,
            "created_utc": 1734851291.0
        },
        {
            "author": "Miiirx",
            "body": "Ok boomer",
            "score": -13,
            "created_utc": 1734851417.0
        },
        {
            "author": "AdventurousTheme737",
            "body": "Do explain? Or talking about the Moroccan immigrants who've been in Brussels since the 60's?",
            "score": 2,
            "created_utc": 1734868139.0
        },
        {
            "author": "External-Bank-6859",
            "body": "Il n’y pas plus aveugle que celui qui ne veut pas voir.",
            "score": 2,
            "created_utc": 1734890924.0
        },
        {
            "author": "Frequentlyaskedquest",
            "body": "? Lol that sounds like a you problem",
            "score": -1,
            "created_utc": 1734873224.0
        },
        {
            "author": "External-Bank-6859",
            "body": "There were more bars and clubs than today.\nMost museums were free.\nDirty not worse by a long mile.\nMore insecurity who are you kidding.\nThere was another shoot in Anderlecht.\nPas plus aveugles que celui qui ne veut pas voir.\nHow deluded can you be?",
            "score": 2,
            "created_utc": 1734929885.0
        },
        {
            "author": "External-Bank-6859",
            "body": "Is that you:\n\nDon't forget the immigrant population that tends to concentrate in Brussels and results in a lot of poverty and social resources  drainage.",
            "score": 1,
            "created_utc": 1734930058.0
        },
        {
            "author": "Thecatstoppedateboli",
            "body": "Spoken like a real teenager",
            "score": 4,
            "created_utc": 1734858914.0
        },
        {
            "author": "Demiker",
            "body": "Don't you just hope he falls for it now? Great how you can make a comment rascist with absolutely no reason. I hope you find peace some day.",
            "score": -1,
            "created_utc": 1734870356.0
        },
        {
            "author": "Photosama",
            "body": "No obviously I'm not talking about Moroccans from the 60s... but you knew that already.",
            "score": -3,
            "created_utc": 1734872600.0
        },
        {
            "author": "AdventurousTheme737",
            "body": "Are you talking about me?",
            "score": 1,
            "created_utc": 1734872779.0
        },
        {
            "author": "AdventurousTheme737",
            "body": "Do elaborate",
            "score": 4,
            "created_utc": 1734872801.0
        },
        {
            "author": "Demiker",
            "body": "I'm commenting on your comment yes.",
            "score": 0,
            "created_utc": 1734879844.0
        },
        {
            "author": "Photosama",
            "body": "several periods of migrant crises that concenrate many different cultures in certain areas which means assimilation happened more difficult, mostly in Brussels, long waiting lists for asylum seekers result in poverty among migrants then results to crime and organized crime by communities who are among themselves as i said. rivalries and conflicts from those regions brought over to here as they are mixed together causes issues. Many things like this has made Brussels shitty to be honest. \n\nYour comment about the Moroccans from the 60s was a cute attempt but ridiculous as people tend to change in 80 years. Afghanistan isn't the same as it was  in the 60s.. Why even ask me to explain when you have already made up your mind beforehand.",
            "score": 4,
            "created_utc": 1734873410.0
        },
        {
            "author": "Frequentlyaskedquest",
            "body": "Dont waste your time they dogwhistle for a reason..",
            "score": 2,
            "created_utc": 1734873174.0
        },
        {
            "author": "AdventurousTheme737",
            "body": "Ah there we go :)",
            "score": -2,
            "created_utc": 1734878918.0
        },
        {
            "author": "Dizzy_Guest2495",
            "body": "Its pretty well known that people from poorer countries tend to litter more and they do not teach their kids to be clean",
            "score": -1,
            "created_utc": 1734879081.0
        },
        {
            "author": "Photosama",
            "body": "Go ahead, what was wrong?",
            "score": 7,
            "created_utc": 1734885379.0
        },
        {
            "author": "Frequentlyaskedquest",
            "body": "https://preview.redd.it/u5dt3y56lg8e1.png?width=1080&format=pjpg&auto=webp&s=40bfee7534ebbdee1e0e33ae50eeb101035fa573\n\nLol people like you used to complain about the same shit targetting italians, greeks and Spaniards...",
            "score": 2,
            "created_utc": 1734897887.0
        },
        {
            "author": "Dizzy_Guest2495",
            "body": "Sorry but what exactly is wrong with what I said? ",
            "score": 1,
            "created_utc": 1734899581.0
        },
        {
            "author": "Frequentlyaskedquest",
            "body": "See the picture from the 80s, and think about how ridiculous that stance may sound today. Was the issue intrinsic to Spaniards and Italian who today you see as equals, or was it the context around them?",
            "score": 1,
            "created_utc": 1734899739.0
        },
        {
            "author": "Dizzy_Guest2495",
            "body": "The photo showing how arabs behave?\n\nI dont get it, I dont speak german",
            "score": 0,
            "created_utc": 1734902237.0
        },
        {
            "author": "Frequentlyaskedquest",
            "body": "You can reverse search the image for the source and the full context.\n\nWhat you should get though, without the german, is that it depicts a stereotypical view whoch encompasses all of the giest workers (not just those from the middle east and north africa), or do you not see the spaghetti eating?\n\nThat goes back to the point I was making before... these tropes and stereotypes are not new.. you guys just moved the goalposts",
            "score": 2,
            "created_utc": 1734910531.0
        }
    ]
}