{
    "post_title": "Was geht ab im Dezember 2024?",
    "post_author": "paulihunter",
    "post_score": 38,
    "post_url": "https://www.reddit.com/r/hamburg/comments/1h3rsvf/was_geht_ab_im_dezember_2024/",
    "comments": [
        {
            "author": "AchtCocainAchtBier",
            "body": "Geil, wieso sehe ich den Thread zum ersten Mal? \n\nHab leider erst im Januar was am Start, hoffe da gibt es wieder so einen Post.",
            "score": 15,
            "created_utc": 1733019777.0
        },
        {
            "author": "JanuarNoe",
            "body": "Danke für den Post.",
            "score": 3,
            "created_utc": 1733045007.0
        },
        {
            "author": "DrRadon",
            "body": "Ich freu mich auf justice in der Sporthalle. Müsste am 12. sein.",
            "score": 3,
            "created_utc": 1733104002.0
        },
        {
            "author": "Must_be_wrong_here",
            "body": "Nach Jahren schaff ich’s endlich zu den Hamburger Goldkehlchen!",
            "score": 2,
            "created_utc": 1733080962.0
        },
        {
            "author": "YoshiEgg23",
            "body": "Hi Deutschlanders!  \nAre restaurants open on New Year’s Eve in Hamburg ??  \nIn Italy it’s tradition to have a big dinner at a restaurant on the 31st.  \nAny tips are appreciated!\n\nEdit: found it! First time using opentable, really helpful",
            "score": 2,
            "created_utc": 1734813667.0
        },
        {
            "author": "paulihunter",
            "body": "Machen wir schon seit Juni, freu mich total das es gut ankommt. Meine Hoffnung war das es ein wenig mehr Community-Gedanken schafft und Leuten einen kleinen Überblick über Events gibt.\n\n  \nSollte dein Event relativ früh im Januar sein kannst dus auch gerne kommentieren. Dann füge ich es der Liste schonmal hinzu.",
            "score": 12,
            "created_utc": 1733020151.0
        },
        {
            "author": "AchtCocainAchtBier",
            "body": "Ne, ist leider Ende Januar. Entweder 30./31. \n\nNoch nicht ganz sicher. Folge dem Ganzen aber jetzt aufmerksamer!\n\nEdit: Ist auch mega nice, dass ihr das macht! Auch mit Bewegungsmelder. So habe ich in Zukunft echt alles direkt im Blick!",
            "score": 3,
            "created_utc": 1733020433.0
        },
        {
            "author": "paulihunter",
            "body": "Momentan siehts so aus das es solche Posts weiter geben wird, also behalte es im Gedanken und poste es nächstes mal.\n\n  \nBei anderen Ideen für den Sub oder Posts schreib uns gerne :)",
            "score": 3,
            "created_utc": 1733020579.0
        }
    ]
}