{
    "post_title": "aumento posti di blocco in giro per milano e hinterland?",
    "post_author": "maddiahane",
    "post_score": 14,
    "post_url": "https://www.reddit.com/r/milano/comments/1hhwoiq/aumento_posti_di_blocco_in_giro_per_milano_e/",
    "comments": [
        {
            "author": "Pepps88",
            "body": "Non so se fosse un caso, ma ieri ho notato parecchie volanti in giro, più del normale. In giro in senso a controllare eh, ho visto che stavano facendo controlli fermando automobilisti, quindi ocio",
            "score": 12,
            "created_utc": 1734632757.0
        },
        {
            "author": "__deep__",
            "body": "Sì, ho notato più polizia urbana in giro, ma stazionari a certi incroci. Impossibile dire cosa facciano",
            "score": 7,
            "created_utc": 1734644187.0
        },
        {
            "author": "mikkysixx",
            "body": "Si anche io l'ho notato girando martedì. Something something pesca a strasco per giustificare il nuovo codice della strada. Tra un mese tutti di nuovo in caserma. [Sabato flexavano](https://tg24.sky.it/cronaca/2024/12/16/codice-strada-violazioni) 19000 pattuglie per fare 5000 verbali (!) e trovare 14 (!!!) persone positive al test droga.",
            "score": 4,
            "created_utc": 1734679351.0
        },
        {
            "author": "Bubablu1",
            "body": "Zero.",
            "score": 5,
            "created_utc": 1734631545.0
        },
        {
            "author": "mangiapizzaa",
            "body": "Io si esattamente dal giorno di inizio.",
            "score": 2,
            "created_utc": 1734639735.0
        },
        {
            "author": "SpecialistTrash233",
            "body": "Di giorno non ci sono quasi mai ( tranne che nel caso di manifestazioni) . Di notte fossi in te eviterei guidare. ",
            "score": 2,
            "created_utc": 1734684906.0
        },
        {
            "author": "Ipatovo",
            "body": "Di giorno stai tranquillo, la sera ti direi anche perché i test (tranne quelli dei carabinieri) non sono così precisi da rilevare quantità minime di fumo passivo. Se proprio vuoi stare tranquillo inventati una scusa la sera e fai guidare qualcun altro",
            "score": 2,
            "created_utc": 1734701618.0
        },
        {
            "author": "dodgeunhappiness",
            "body": "Dicembre è il mese più violento dell'anno, soprattutto la vigilia di capodanno dove tra alcol ed adulteri ci scappa sempre la scazzottata.",
            "score": 1,
            "created_utc": 1734681135.0
        },
        {
            "author": "ObviousResource5702",
            "body": "Di giorno non si nota differenza, non c'è un aumento dei controlli, la sera non saprei dirtelo perchè evito di andarci per non correre rischi di nessun tipo.",
            "score": 1,
            "created_utc": 1734688584.0
        },
        {
            "author": "guidocarosella",
            "body": "Si, succede ogni volta che cambia il codice della strada, niente di nuovo...",
            "score": 1,
            "created_utc": 1734697369.0
        },
        {
            "author": "Justalbypt",
            "body": "con il nuovo codice della strada, si stanno divertendo 👀",
            "score": 1,
            "created_utc": 1734817992.0
        },
        {
            "author": "interstellartopmovie",
            "body": "Ti prendi uber e ciao",
            "score": -16,
            "created_utc": 1734638115.0
        },
        {
            "author": "lukkemela",
            "body": "Meno male. La certezza della pena è ciò che serviva, non questo inasprimento delle pene populista e inutile",
            "score": 9,
            "created_utc": 1734633758.0
        },
        {
            "author": "nozni",
            "body": "Sì perché in Italia grazie ai cialtroni al governo i prezzi degli ncc sono accessibili a tutti",
            "score": 17,
            "created_utc": 1734639670.0
        },
        {
            "author": "RammRras",
            "body": "Bisogna spezzare le gambe a tutti questi criminali. Invece di fare indagini serie e impegnate non ne abbiamo voglia.",
            "score": 2,
            "created_utc": 1734647291.0
        },
        {
            "author": "interstellartopmovie",
            "body": "esattamente, a Milano costa praticamente uguale al taxi, non molto di più - probabilmente non l’hai mai provato",
            "score": -8,
            "created_utc": 1734645635.0
        },
        {
            "author": "nozni",
            "body": "Ti sfugge che sono proprio i prezzi il problema",
            "score": 6,
            "created_utc": 1734645680.0
        },
        {
            "author": "interstellartopmovie",
            "body": "Prezzi di mercato, tratta media 20/30 euro - anzi, a Roma e Napoli ho speso pure di più e in Europa costa certamente di più",
            "score": -8,
            "created_utc": 1734645750.0
        },
        {
            "author": "nozni",
            "body": "In Europa costa di più? La concorrenza schiaccia i prezzi verso il basso, bolt, Uber pop, lyft tutto illegale in Italia",
            "score": 4,
            "created_utc": 1734645849.0
        },
        {
            "author": "interstellartopmovie",
            "body": "Ovviamente parliamo degli stessi servizi, ovvero di Uber Black.  Mentre i classici taxi costano uguale se non di più in Europa",
            "score": -1,
            "created_utc": 1734647188.0
        }
    ]
}