{
    "post_title": "Hochbahn Weihnachtsanimation gut oder nervig?",
    "post_author": "flow1an",
    "post_score": 179,
    "post_url": "https://www.reddit.com/gallery/1hjxvjh",
    "comments": [
        {
            "author": "ElAlejandro_HH",
            "body": "Nervig finde ich die nicht, nur den Fakt dass die unglaublich lange gehen. Ist sogar unabhängig von der „Information“. Wie oft stehe ich Barmbek am Bahnhof und starre gefühlt ne Ewigkeit auf die kack Anzeige nur um zu lesen, dass die U-Bahn in 4 Minuten kommt. Kann man die Minutenanzeige nicht dauerhaft einblenden? Ne ich glaube damit sind die beim HVV überfordert.",
            "score": 200,
            "created_utc": 1734872065.0
        },
        {
            "author": "NocturnalHabits",
            "body": "Die zwei links im ersten Bild schiessen aufeinander?",
            "score": 23,
            "created_utc": 1734874009.0
        },
        {
            "author": "PossibleCulture2199",
            "body": "Ist nett. Für ein paar Tage. \n\nNoch ärgerlicher finde ich es, wenn bei einer langfristigen Störung auf einer völlig irrelevanten Linie die ganze Zeit hin- und hergeblättert wird, bevor mir die Ankunftszeit des einen Zuges angezeigt wird, an dem ich eigentlich interessiert bin. Mir ist es in Barmbek egal, dass ich bei Horner Rennban in eine andere U2 umsteigen müsste. Schon gar nicht für Monate.",
            "score": 17,
            "created_utc": 1734882870.0
        },
        {
            "author": "lulusz",
            "body": "die 10 sekunden zu warten, um die abfahrtszeit zu sehen, sollte doch drin sein. ich finds nett",
            "score": 96,
            "created_utc": 1734872039.0
        },
        {
            "author": "Dribbler040",
            "body": "Löst in mir pure Kindheitsgefühle aus - also definitiv gut.",
            "score": 32,
            "created_utc": 1734872017.0
        },
        {
            "author": "DevAlaska",
            "body": "Ist doch nett",
            "score": 7,
            "created_utc": 1734878830.0
        },
        {
            "author": "PremiumBamboo",
            "body": "Ich finde die sehr süß die Animation",
            "score": 6,
            "created_utc": 1734891532.0
        },
        {
            "author": "Curious-Steak9208",
            "body": "Ist doch süß 😗",
            "score": 14,
            "created_utc": 1734873285.0
        },
        {
            "author": "SimonOfHH",
            "body": "Ich find's gut und nicht nervig",
            "score": 12,
            "created_utc": 1734872960.0
        },
        {
            "author": "tidditm",
            "body": "Man könnte in der Ecke einfach eine Minutenzahl einblenden ohne ein langes „in 2 Minuten“ spart Platz für mehr Infos.",
            "score": 7,
            "created_utc": 1734875637.0
        },
        {
            "author": "Ok_Breadfruit4176",
            "body": "Genug Wurstbürgertum, ich bitte dich.",
            "score": 3,
            "created_utc": 1734882247.0
        },
        {
            "author": "RileyNotRipley",
            "body": "Irgendwie beides? Finde es niedlich und es freut mich immer wenn ich es sehe. Nach mehrfacher Wiederholdung denkt man sich dann irgendwann \"okay, ich hab's verstanden\". Aber da man ja idR nie länger als 5 Minuten am Gleis steht habe ich nichts dagegen. Bei Verspätungen insbesondere den etwas deutlicheren ist es dann ein bisschen weniger angenehm 😂",
            "score": 3,
            "created_utc": 1734883300.0
        },
        {
            "author": "Ledenu",
            "body": "Die geht schon ziemlich lang und es ist recht unpraktisch, dass sie die Abfahrtszeit überdeckt, aber sie ist ziemlich süß und ich mag sie total gern.",
            "score": 2,
            "created_utc": 1734889194.0
        },
        {
            "author": "_strawberry_2011",
            "body": "Du sollst dein Leben bisschen mehr ,,genießen“",
            "score": 2,
            "created_utc": 1734904523.0
        },
        {
            "author": "German_Irukandji1337",
            "body": "Ich mag 3s und hatte es schon vermisst 🥰",
            "score": 2,
            "created_utc": 1734879374.0
        },
        {
            "author": "yumyumnoodl3",
            "body": "Sehe ich eher als Tourismusmaßnahme und davon abgesehen einigermaßen erträglich",
            "score": 2,
            "created_utc": 1734880792.0
        },
        {
            "author": "Fandango_Jones",
            "body": "Find lustig. Genau wie die Fussball Ergebnisse.",
            "score": 2,
            "created_utc": 1734880680.0
        },
        {
            "author": "SeriousPlankton2000",
            "body": "…animation gut oder nervig?\n\nNervig. Immer.",
            "score": 1,
            "created_utc": 1734873450.0
        },
        {
            "author": "OhaAMK92",
            "body": "Auch wenn ich damit aufwachsen bin , und das echt nostalgisch finde , sollte demnächst mal modernisiert werden.",
            "score": 1,
            "created_utc": 1734885539.0
        },
        {
            "author": "Creative_TechNerd",
            "body": "Nicht nervig, aber vollkommen überflüssig. Nutzlose Information.",
            "score": 1,
            "created_utc": 1734906890.0
        },
        {
            "author": "lontrachen",
            "body": "Eher neutral. Es hat nach all den Jahren das Wow-Effekt verloren für mich.",
            "score": 1,
            "created_utc": 1734910642.0
        },
        {
            "author": "FairydustRoselia",
            "body": "Finde die echt süß, aber das die Informationen blockieren, nervt ordentlich",
            "score": 1,
            "created_utc": 1734917356.0
        },
        {
            "author": "ProfessionalHuman187",
            "body": "Mal den grundsätzlichen,positiven Ansatz kommentarlos akzeptieren, ohne dass da eine Diskussion ausgelöst wird, scheint nicht mehr möglich. \n\nBeispiel : „Ich mag Dich“ \n„Ich finde Dich toll“\n\nWieso, weshalb,warum ‚,was willst Du ? \n\nEinfach mal ruhig sein und etwas positives als solches auch hinnehmen . Kommt schon genug Scheiss über die Medien über uns herein. \n\nDie Demagogie ist die große Schwester der Diktatur",
            "score": 1,
            "created_utc": 1734921799.0
        },
        {
            "author": "GodOfWebaccounts",
            "body": "egal",
            "score": 1,
            "created_utc": 1734945346.0
        },
        {
            "author": "seitansbabygoat",
            "body": "Ahaha also sorry aber die ubahnen fahren doch eh alle paar Minuten 😅 ich bin auf die S3/S5 angewiesen und gucke nie vorher, wann die nächste kommt, ich lauf einfach zum Bahnhof und in maximal 8 minuten kommt eh eine. Außer es ist irgendein Polizeieinsatz oder sowas, aber das erfährt man dann ja auch sehr schnell. Hab auf eine Ubahn noch nie mehr als 6 Minuten gewartet. Mich juckt das null",
            "score": 1,
            "created_utc": 1734874922.0
        },
        {
            "author": "chili_ratata",
            "body": "Nicht alles muss schnell sein, du bist doch in den Weihnachtsfeiern, mach dir keinen Stress wegen der Anzeige. Just relax.",
            "score": 0,
            "created_utc": 1734872890.0
        },
        {
            "author": "Posti61",
            "body": "Die Bahn kommt doch eh alle 2-5min, je nach Linie. Und die Animation geht ja nun auch recht schnell.\nDavon abgesehen, hättest du eine Alternative zur Bahn genommen, wenn da jetzt 5min statt 2min stehen würde oder hättest du einfach weiter gewartet?\nWenn du weiter gewartet hättest, ist die Frage nach der Animation und dem Anzeiger mMn. hinfällig.",
            "score": -1,
            "created_utc": 1734872399.0
        },
        {
            "author": "Schwibbels",
            "body": "Ich brauche keine Tafel, die mir schöne Feiertage wünscht. Genauso dämlich wie Parkautomaten, die \"Danke\" sagen, wenn ich ein Ticket ziehe.\n\nEntweder der Bus-/Bahnfahrer oder Ticketverkäufer wünscht mir direkt ein schönes Fest oder die lassen es bleiben - was auch okay ist.\n\nVon daher versperren diese vermeintlich netten Wünsche nur die Informationen, wegen denen ich in erster Linie auf die Tafel schaue.",
            "score": -5,
            "created_utc": 1734875379.0
        },
        {
            "author": "heklu",
            "body": "Die sollen nicht nerven, kriegen absolut nichts auf die Kette, aber Hauptsache schöne Animationen",
            "score": -12,
            "created_utc": 1734872336.0
        },
        {
            "author": "Fit_Instruction_3931",
            "body": "Skibidi",
            "score": -6,
            "created_utc": 1734873370.0
        },
        {
            "author": "etillxd",
            "body": "Genauso wenn ich z.B. an der U3 stehe und die Anzeige erstmal ewig irgendeine Info zu einer U1 Sperrung anzeigt die mich gerade viel weniger interessiert als wann einfach die nächste U3 kommt.",
            "score": 65,
            "created_utc": 1734872762.0
        },
        {
            "author": "Pikaael",
            "body": "Eine dauerhafte Anzeige der Wartezeit finde ich auch gut!",
            "score": 8,
            "created_utc": 1734877486.0
        },
        {
            "author": "DatJocab",
            "body": "Bei der S-Bahn ist die dauerhaft eingeblendet. Das kriegt nur die Hochbahn nicht hin.",
            "score": 6,
            "created_utc": 1734878838.0
        },
        {
            "author": "mici012",
            "body": "Könnte man oben beim Ziel noch mit rein machen. Muss ja nicht \"in 4 Minuten\" sein ... ein \"4'\" würde ja schon reichen.",
            "score": 3,
            "created_utc": 1734888401.0
        },
        {
            "author": "neuersand",
            "body": "also vielleicht doch ein bisschen nervig?",
            "score": 8,
            "created_utc": 1734873935.0
        },
        {
            "author": "Posti61",
            "body": "Dauerhaft einblenden wäre top, allerdings hast du dann ja kaum noch Platz für die, teilweise, tollen Animationen.",
            "score": -1,
            "created_utc": 1734872489.0
        },
        {
            "author": "flow1an",
            "body": "Nee ist ein U-Bahn Zug. Kein S-Bahn Zug 😅",
            "score": 23,
            "created_utc": 1734874310.0
        },
        {
            "author": "Rattlecruiser",
            "body": "weihnachtliche U4-Fahrgäste doing weihnachtliche U4-Fahrgäste-things",
            "score": 4,
            "created_utc": 1734874365.0
        },
        {
            "author": "flow1an",
            "body": "Finde ich eigentlich auch. Aber es sind locker 30sek. Auch nicht wild ... Aber ufff 😆",
            "score": 18,
            "created_utc": 1734873161.0
        },
        {
            "author": "lHagenl",
            "body": "Digga, wenn ich auf meine Uhr gucke, dann will ich die Zeit wissen und keine dumme Animation sehen. Die Anzeigedinger haben exactly EINEN Job",
            "score": 3,
            "created_utc": 1734890065.0
        },
        {
            "author": "-eccentric-",
            "body": "Und selbst dann: man hat doch ein Handy in der Hand",
            "score": -2,
            "created_utc": 1734879069.0
        },
        {
            "author": "flow1an",
            "body": "Gerade in der Großstadt gibt es nicht wenige, die auch an diesen Tagen arbeiten 😉",
            "score": 14,
            "created_utc": 1734873234.0
        },
        {
            "author": "MoreConsideration153",
            "body": "vergeudete Zeit in den Öffis kostet mich Lebenszeit",
            "score": 1,
            "created_utc": 1734944035.0
        },
        {
            "author": "LordOfTheSnow566",
            "body": "Die U1 fährt oft alle 10, noch später alle 20 Minuten. Und die nutzlosen Animationen kommen ja auch auf Anzeigen, die gar nicht am Bahnsteig sondern z.B. im Fußgängertunnel sind und wo man wissen möchte, ob man sich beeilen sollte oder nicht.\n\nIn allen anderen Großstädten der Welt gibt's auch die Zeit bis zur übernächsten Bahn (teilweise sogar noch weitere), damit man ggf. eine Bahn überspringen kann, wenn die nächste zu voll ist. Auch das kriegt die Hochbahn nicht hin, weil die Anzeige 80% mit Informationen vollgekleistert wird, die mit der aktuellen Fahrt gar nichts zu tun haben.",
            "score": 3,
            "created_utc": 1734877833.0
        },
        {
            "author": "Great_Capital1248",
            "body": "... Wünschst du dem Personal denn auch ein frohes Fest? :)",
            "score": 1,
            "created_utc": 1734896722.0
        },
        {
            "author": "r0xx0rd_teh_x0xxOr",
            "body": "Hochbahn gut, sbahn schlecht.",
            "score": 6,
            "created_utc": 1734872483.0
        },
        {
            "author": "MrFlow",
            "body": "Die Hochbahn muss einfach mal die Anzeigetafeln dringend modernisieren, selbst die DB hat bei der S-Bahn Hamburg mittlerweile zu 90% an den Stationen neue digitale LED-Displays (mit Zusatzinfos wie aktuelle Wagenauslastung etc.) statt diese 80er Monochrom Anzeigetafeln der Hochbahn.",
            "score": 19,
            "created_utc": 1734882186.0
        },
        {
            "author": "Great_Capital1248",
            "body": "Kommt mit den neuen Schirmen :)",
            "score": 3,
            "created_utc": 1734896602.0
        },
        {
            "author": "Posti61",
            "body": "Dann komme ich einfach aus einer anderen Zeit.\nIch hatte als Kind noch das Fahrplanbuch zuhause und bin dann entsprechend los. Unterwegs gibt's an den Haltestellen Aushänge und heutzutage sogar etliche Apps, zusätzlich zu der HVV, auf denen man Live Informationen sehen kann.",
            "score": 1,
            "created_utc": 1734883100.0
        },
        {
            "author": "Schwibbels",
            "body": "Wenn mir spontan danach ist oder ich in ein Gespräch mit denen gerate, dann wünsche ich denen auch schöne Feiertage :)\n\nIch brauche nur kein Schild, welches mir etwas wünscht - das ist einfach unpersönlich und daher für mich unbedeutsam\n\nEdit: Die Frage war ja, ob man die Schilder gut oder nervig findet :D",
            "score": 1,
            "created_utc": 1734898581.0
        },
        {
            "author": "heklu",
            "body": "Beides unterirdisch schlecht.",
            "score": -3,
            "created_utc": 1734875110.0
        },
        {
            "author": "Great_Capital1248",
            "body": "Läuft gerade ein Projekt zu, bin ich beteiligt :-) Sollten über die nächsten Jahre ersetzt werden nach und nach (Beginn im nächsten Jahr)",
            "score": 15,
            "created_utc": 1734896563.0
        },
        {
            "author": "PeterEdding",
            "body": "Genaugenommen sind das auch digitale LED-Displays ;-)",
            "score": 4,
            "created_utc": 1734888766.0
        },
        {
            "author": "PeterEdding",
            "body": "Vielleicht noch ein Hinweis: Diese eher simplen aber dafür sehr kontrastreichen Anzeigen sind für (einige, viele?) Sehbehinderte viel besser abzulesen als die fancy neuen LCD Bildschirme. Auch ein Grund, warum zum Beispiel in den S-Bahnen ein simples, bernsteinfarbenes LED-Laufband installiert ist.",
            "score": 4,
            "created_utc": 1734892027.0
        },
        {
            "author": "_tinydragonboy",
            "body": "90er tatsächlich. Die Hochbahn wird wohl den Lagerbestand bei Solari Udine aufgekauft haben, da man laut eigener Aussage noch welche im Lager hat.\n\nAber mindestens die folgenden Züge im Wechsel mit dem Fahrtverlauf wird man ja eigentlich darstellen können.",
            "score": 3,
            "created_utc": 1734884053.0
        },
        {
            "author": "michael__sykes",
            "body": "Sind die Dinger nicht zuverlässig? Dachte immer, das sei der Hauptgrund. Die modernen Anzeigen erlebe ich wesentlich häufiger defekt, als die Anzeigen bei der Hochbahn.",
            "score": 3,
            "created_utc": 1734907517.0
        },
        {
            "author": "PossibleCulture2199",
            "body": "Klingt interessant! Kannst du uns mehr darüber erzählen?",
            "score": 2,
            "created_utc": 1734942158.0
        },
        {
            "author": "MoreConsideration153",
            "body": "das ist doch eine reine Konfigurationsfrage.",
            "score": 1,
            "created_utc": 1734943688.0
        },
        {
            "author": "MrFlow",
            "body": "Ist halt schade dass so etwas bei der Entwicklung nicht berücksichtigt wurde, man hätte die LED-Anzeigen auch im \"Nachtmodus\" entwickeln können mit einem schwarzen Hintergrund und kontrastreicher weißer Schrift.",
            "score": 1,
            "created_utc": 1734892930.0
        },
        {
            "author": "rckhppr",
            "body": "Solari Udine… ja das Design sieht aus wie 1990 Norditalien… passt",
            "score": 2,
            "created_utc": 1734889486.0
        },
        {
            "author": "Kazuma98",
            "body": "Sicher das die noch welche haben? Horner Rennbahn hieß es das da nur Platzhalter sind weil man keine mehr hat und eh neue Anzeigen kommen sollen",
            "score": 1,
            "created_utc": 1734915995.0
        },
        {
            "author": "Great_Capital1248",
            "body": "Ist alles noch in der Aufbauphase, also allzu viel leider nicht. Aber allgemein werden die Bildschirme eher denen bei der DB bzw. S-Bahn ähneln.",
            "score": 5,
            "created_utc": 1734944988.0
        },
        {
            "author": "_tinydragonboy",
            "body": "Vllt sind die im Lager auch für Oldenfelde und Elbbrücken draufgegangen.\n\nIch weiß auf jeden Fall, dass die Anzeiger für die HafenCity-U-Bahn generalüberholte Geräte sind, die vorher in Schlump und Billstedt hingen.\nAn diesen beiden Orten wurden wiederum einfarbige, von der AKN übernommene Anzeiger eingebaut.",
            "score": 2,
            "created_utc": 1734919042.0
        }
    ]
}