{
    "post_title": "Deutz: Frau auf Gleise geschubst und schwer verletzt – Zeugen halten Verdächtige fest.",
    "post_author": "Schnaeuzerkowski",
    "post_score": 33,
    "post_url": "https://www.ksta.de/koeln/koelner-innenstadt/deutz/koeln-deutz-frau-auf-gleise-geschubst-und-schwer-verletzt-927135",
    "comments": [
        {
            "author": "jcrestor",
            "body": "Gefährliche Körperverletzung oder nicht eher versuchter Mord? Jemanden in einen Bereich zu schubsen, der den sicheren Tod bedeuten kann, ist für mich weit mehr als gefährliche Körperverletzung.",
            "score": 30,
            "created_utc": 1734956596.0
        },
        {
            "author": "Thr0w4w4y4cc0815",
            "body": ">Unabhängig voneinander bestätigten die Zeugen, was auf dem Videomaterial bereits gesichtet wurde: Die verwirrt wirkende Frau wird verdächtigt, die 48-Jährige auf die Gleise geschubst zu haben.\n\nQualitätsjournalismus :D\n\nIch denk es wurde ne 50 jährige in den Gleisbereich geschubst?!",
            "score": 15,
            "created_utc": 1734952375.0
        },
        {
            "author": "Elvis_the_lobster",
            "body": "die Nationalität der Täterin muss nur geklärt werden...\n\nJa, ne, is klar :(",
            "score": 1,
            "created_utc": 1734963546.0
        },
        {
            "author": "M4pl3g0d",
            "body": "Was die pisse wieder den steuerzahler kostet",
            "score": -80,
            "created_utc": 1734953228.0
        },
        {
            "author": "SenselessTV",
            "body": "Versuchter Mord it is. Zumindest wurden bisherige vergehen in dem Stil in der Vergangenheit vor Gericht geahndet.",
            "score": 3,
            "created_utc": 1734959403.0
        },
        {
            "author": "Ok_Buy_5292",
            "body": "Zahlendreherchen",
            "score": 3,
            "created_utc": 1734953423.0
        },
        {
            "author": "AndiArbyte",
            "body": "Du ich denke die Beamten und Rettungskräfte ohnehin im Dienst waren. Also bezahlt wurden, jetzt mussten sie ausrücken, ok gut, bissl Sprit und Verschleiß.    \nSo wild find ich das jetzt nicht.",
            "score": 35,
            "created_utc": 1734953707.0
        },
        {
            "author": "Minimum-Ad3598",
            "body": "das hat sich deine Mutter bei dir auch gedacht",
            "score": 9,
            "created_utc": 1734957232.0
        },
        {
            "author": "jcrestor",
            "body": "Also einfach ein weiterer Fehler im Artikel? Da war von schwerer Körperverletzung die Rede.",
            "score": 1,
            "created_utc": 1734960505.0
        },
        {
            "author": "M4pl3g0d",
            "body": "Das meine ich nicht geht um den circus danach, Gerichtskosten Psychatrie im idealfall knast aber auch das kostet",
            "score": -46,
            "created_utc": 1734953806.0
        },
        {
            "author": "Weirdaholic",
            "body": "naja, solange dieser Straftatbestand noch nicht festgestellt wurde und es entsprechend zu einer Verurteilung kommt, ist es noch kein versuchter Mord. Ihr greift der Justiz vor. Ich denke zwar auch, dass es darauf hinauslaufen wird. Aber das Urteil sprechen Richter aus, und keine Reporter.\n\nSo ganz allgemein: Es gab in der Vergangenheit genug Fälle, in denen eine vorverurteilende Berichterstattung die Gerüchteküche angeheizt und damit Ermittlungen behindert bzw. beeinflusst haben. Als ein Beispiel: https://de.m.wikipedia.org/wiki/Tu%C4%9F%C3%A7e_Albayrak",
            "score": 3,
            "created_utc": 1734962407.0
        },
        {
            "author": "seagair",
            "body": "Es geht hier um ein Menschenleben und nicht um die Kosten. Ein solch kühles Kalkül gibt es sonst nur von Politikern, die ausrechnen ab wie vielen Verkehrstoten sich eine Ampel lohnt.",
            "score": 30,
            "created_utc": 1734954225.0
        },
        {
            "author": "Rinkus123",
            "body": "Welcher Alternative schlägst du vor?",
            "score": 3,
            "created_utc": 1734959096.0
        },
        {
            "author": "RijnBrugge",
            "body": "Ja es wäre besser wann diese Leute die Hilfe bekommen würden BEVOR die jemand auf die Gleise schubsen, nicht?",
            "score": 2,
            "created_utc": 1734959690.0
        },
        {
            "author": "UsualCircle",
            "body": "Mach doch mal nen Vorschlag was du mit solchen Leuten stattdessen machen würdest",
            "score": 1,
            "created_utc": 1734962880.0
        },
        {
            "author": "M4pl3g0d",
            "body": "Ein Menschenleben was ein anderes unschuldiges bewusst auslöschen wollte?",
            "score": -38,
            "created_utc": 1734954469.0
        },
        {
            "author": "Herr_Unterberg01",
            "body": "Sorry aber deine Aussagen hier bezüglich psychischen Erkrankungen zeigt ja, dass du moralisch nicht weit weg von Straßenbahnschupsern stehst.",
            "score": 31,
            "created_utc": 1734955241.0
        },
        {
            "author": "Physical_Afternoon25",
            "body": "Eben nicht bewusst, du Spezialist. Wenn sie krank ist, braucht sie Hilfe, damit sie sowas nicht wieder macht. Was ist deine Alternative? An die Wand stellen und erschießen?",
            "score": 13,
            "created_utc": 1734955176.0
        },
        {
            "author": "Biggathanyou",
            "body": "Ich glaub der braucht selbst eine Therapie… 🤷‍♂️",
            "score": 16,
            "created_utc": 1734956127.0
        },
        {
            "author": "FatherCaptain_DeSoya",
            "body": ">Eben nicht bewusst\n\nImmer langsam, noch sind die Umstände ungeklärt. Wenn sich etwa im Zuge der Ermittlungen herausstellen sollte, dass die Beschuldigte ihr eventuell verordnete Psychopharmaka nicht oder in nur unzureichenden Maße eingenommen hat, wird sie verurteilt. \n\nAlso abwarten.",
            "score": 2,
            "created_utc": 1734962290.0
        }
    ]
}