{
    "post_title": "Bilfria helgerna på Sveavägen blir permanenta",
    "post_author": "swedish_tcd",
    "post_score": 77,
    "post_url": "https://www.mitti.se/nyheter/de-bilfria-helgerna-pa-sveavagen-blir-permanenta-6.3.266152.826882a7f8",
    "comments": [
        {
            "author": "pimmen89",
            "body": "”Trafiken på Sveavägen har länge väckt starka känslor. En synpunkt är att bilarna är en del av en levande stad, medan andra uppger att de blir störda av trafiken, särskilt på kvällar och nätter.”\n\nJa, en stad känns så levande när alla blåser förbi i en anonym metallåda, utan att stanna och handla något.",
            "score": 26,
            "created_utc": 1734959661.0
        },
        {
            "author": "GillyLvLz",
            "body": "Great decision!",
            "score": 20,
            "created_utc": 1734953305.0
        },
        {
            "author": "Wise-Salamander5427",
            "body": "Vad bra, målet bör vara att omvandla alla bilvägar i Stockholms innerstad till helt trafikfria. Städerna åt människorna, inte bilarna!",
            "score": 23,
            "created_utc": 1734952478.0
        },
        {
            "author": "ResearcherOk7685",
            "body": "Bra, väldigt mycket trevligare utan trafiken.",
            "score": 3,
            "created_utc": 1734963059.0
        },
        {
            "author": "TorkelTolle",
            "body": "Bra, det blir en gata mindre att bli rammad av en skåpbil på!",
            "score": 1,
            "created_utc": 1734954175.0
        },
        {
            "author": "jakobjonsson",
            "body": "Grattis Stockholm! Man får vad man röstar på.",
            "score": 1,
            "created_utc": 1734957733.0
        },
        {
            "author": "Republiken",
            "body": "Oj, kors i taket",
            "score": 0,
            "created_utc": 1734955003.0
        },
        {
            "author": "yoghurt_bob",
            "body": "Jag kanske är korkad men innebär inte detta bara att bilarna irrar runt på mindre parallellgator istället? Ändringar bör vara permanenta och förutsägbara, inte massa temporära omledningar hela tiden. Och att tvinga smågator att ta mer trafik känns bakvänt.",
            "score": -1,
            "created_utc": 1734958790.0
        },
        {
            "author": "Gludens",
            "body": "Överraskande. /s Känns som att det inte hände någonting där men... bra grej kanske... \n\nLOL\n\n\"– Vi vill göra det mesta möjliga av det här, säger Lars Strömgren (M).\" I ingressen står det att han är Moderat. Slarvig journalist.",
            "score": -15,
            "created_utc": 1734948423.0
        },
        {
            "author": "Big_Departure3049",
            "body": "förutom när du behöver ta en Uber då, eller om du vill att någon affär i innerstaden ska få leveranser",
            "score": 8,
            "created_utc": 1734955914.0
        },
        {
            "author": "AttTankaRattArStorre",
            "body": "Skitkul att transportera en soffa från Liljeholmen (eller var man nu får ställa bilen) via tunnelbanan in till sin innerstadslägenhet... Är du dum i huvudet? Har du någonsin bott i innerstaden?",
            "score": 1,
            "created_utc": 1734958584.0
        },
        {
            "author": "Rhaj-no1992",
            "body": "Bo i stad är ju hemskt, alldeles för mycket folk. Förorter ftw.",
            "score": -1,
            "created_utc": 1734957189.0
        },
        {
            "author": "snakemansweden",
            "body": "Ja, det är verkligen fantastiskt!",
            "score": 7,
            "created_utc": 1734959453.0
        },
        {
            "author": "I_poop_deathstars",
            "body": "Bara för att vara tydlig med de som inte läst artikeln, det är MP som dragit i spakarna. Väldigt bra beslut!",
            "score": 0,
            "created_utc": 1734961922.0
        },
        {
            "author": "yoghurt_bob",
            "body": "Man får ju miljöpartiet som trafikborgarråd oavsett vad man röstar på i Stockholms kommun…",
            "score": 0,
            "created_utc": 1734961989.0
        },
        {
            "author": "pimmen89",
            "body": "Det gjorde de inte när det var på prov, folk struntade i att ta bilen genom innerstan istället. Ökar du genomfarten ökar du trafiken.",
            "score": 10,
            "created_utc": 1734959594.0
        },
        {
            "author": "lindberghbaby41",
            "body": "All tillgänglig data visar att biltrafiken generellt minskar om det blir krångligare att ta bilen på större gator",
            "score": 11,
            "created_utc": 1734960190.0
        },
        {
            "author": "GurraJG",
            "body": "Nästan som att man kan undanta vissa fordon från trafikförbud...",
            "score": 31,
            "created_utc": 1734957232.0
        },
        {
            "author": "Crucial_Contributor",
            "body": "Märkligt att butikerna på alla de gator som redan är bilfria verkar klara sig på något mystiskt sätt",
            "score": 14,
            "created_utc": 1734957001.0
        },
        {
            "author": "Kikkifestis",
            "body": "Eller när rulltrappan/hissen/dörren går sönder. Eller när det sprutar avloppsvatten ur toaletten, eller när det blir becksvart. ",
            "score": 2,
            "created_utc": 1734956363.0
        },
        {
            "author": "Papercoffeetable",
            "body": "Eller vill bli av med sopor, eller behöver hantverkare, eller behöver polis, ambulans, brandbilar… äh jag ger upp.",
            "score": 0,
            "created_utc": 1734957076.0
        },
        {
            "author": "Wise-Salamander5427",
            "body": "Visst, i ett samhälle där det viktiga är försäljning och utbyte av pengar så kan jag förstå att bilar är en grundsten varpå resten av samhället vilar. Frågan är dock om det är det vi bör ha?",
            "score": -5,
            "created_utc": 1734957003.0
        },
        {
            "author": "pimmen89",
            "body": "Köp leverans hem då? Leveranser är undantagna.",
            "score": 6,
            "created_utc": 1734959521.0
        },
        {
            "author": "Wise-Salamander5427",
            "body": "Bor nära Odenplan",
            "score": 3,
            "created_utc": 1734958657.0
        },
        {
            "author": "jakobjonsson",
            "body": "Allt är sant tills sista meningen.",
            "score": 1,
            "created_utc": 1734962246.0
        },
        {
            "author": "jakobjonsson",
            "body": "Ja, tyvärr finns det för få riktiga konservativa i stan.",
            "score": -2,
            "created_utc": 1734962217.0
        },
        {
            "author": "lgLindstrom",
            "body": "Sveavägen är en genomfartsled (norr öst) och jag tror inte de som kör där gör det för nöjes skull.\nVarför inte göra någon av parallellgatorna bilfria i stället?",
            "score": 0,
            "created_utc": 1734960759.0
        },
        {
            "author": "MrOaiki",
            "body": "Det vill säga inte ”helt trafikfria” som föregående talare skojfriskt ropade.",
            "score": 3,
            "created_utc": 1734961592.0
        },
        {
            "author": "Ran4",
            "body": "För att de ligger nära andra icke bilfria gator..",
            "score": -6,
            "created_utc": 1734958272.0
        },
        {
            "author": "vodkapastan",
            "body": "Tänk om man kunde komma på lösningar? Kanske tillåta viss trafik som transporter och yrkesfordon. Nej. Inga lösningar. Bara problem 😤",
            "score": 8,
            "created_utc": 1734961466.0
        },
        {
            "author": "ResearcherOk7685",
            "body": "Ja, man kommer givetvis låta hela bostadsområden slockna snarare än att låta en tjänstebil köra fram. Garanterat.",
            "score": 1,
            "created_utc": 1734963133.0
        },
        {
            "author": "lindberghbaby41",
            "body": "Tror du innerligt att bilfria gator innebär att polis och sopbilar inte får komma in?",
            "score": 12,
            "created_utc": 1734960098.0
        },
        {
            "author": "Kleulkao",
            "body": "Bilar brukar vara ett betydande problem för ambulans och brandbil. Bygger man ordentlig infrastruktur för gående, cyklister, och kollektivtrafik så kan den användas av dem också med med följd av att de kommer snabbare dit de ska.",
            "score": 6,
            "created_utc": 1734960711.0
        },
        {
            "author": "LeTonVonLaser",
            "body": "Tycker att allt det där kan lösas med ett rörpost-liknande system som vi bygger under marken",
            "score": 2,
            "created_utc": 1734960054.0
        },
        {
            "author": "ResearcherOk7685",
            "body": "Ja, man kommer garanterat att låta folk dö snarare än tillåta att ambulans eller polis kör på bilfria gator. Garanterat.",
            "score": 1,
            "created_utc": 1734963179.0
        },
        {
            "author": "AttTankaRattArStorre",
            "body": "Så ingen som bor i innerstaden ska någonsin få köpa något större än typ en stekpanna utan att betala extra för transport? Detta är bara en av alla saker som gör bilförbud uppenbart efterblivet.",
            "score": -2,
            "created_utc": 1734960517.0
        },
        {
            "author": "AttTankaRattArStorre",
            "body": "Använde du tunnelbanan och apostlahästarna när du flyttade in i din nuvarande lägenhet?",
            "score": 3,
            "created_utc": 1734960567.0
        },
        {
            "author": "ConvenientTetrahedon",
            "body": "Då borde du veta hur vanligt det är med folk som har bil för att uträtta diverse liknande ärenden som bor i området. Så städerna åt människorna innefattar även bilar till de som bor där och vill ha det, vilket estimerat är en majoritet av den vuxna befolkningen där.",
            "score": 1,
            "created_utc": 1734964201.0
        },
        {
            "author": "pimmen89",
            "body": "Det finns andra sätt att åka den riktningen, och när det gjordes på prov så ökade inte trafiken på parallellgatorna, folk åkte bara mindre bil genom innerstan.",
            "score": 4,
            "created_utc": 1734962169.0
        },
        {
            "author": "MrOaiki",
            "body": "För att det inte är lika symbolpolitiskt tydligt.",
            "score": 1,
            "created_utc": 1734961643.0
        },
        {
            "author": "Crucial_Contributor",
            "body": "Nej, det är för att leveranser självklart är tillåtna även i bilfria områden",
            "score": 24,
            "created_utc": 1734958639.0
        },
        {
            "author": "Kikkifestis",
            "body": "Blir väl lite svårt om man omvandlar alla bilvägar till helt trafikfria? Känns som att den visa salamandern inte hade tänkt igenom sin idé.\n\nPersonligen tycker jag att en kompromiss med något liknanade nyttofordonstillstånd hade varit bra. Få bort folk som ska till sin arbetsplats och de boende i stans bilar först och främst, samtidigt tillåter man yrkestrafik som ska in och arbeta i stan.",
            "score": 2,
            "created_utc": 1734963588.0
        },
        {
            "author": "EishLekker",
            "body": "Läs den ursprungliga kommentaren igen. ”Helt trafikfria” betyder exakt vad orden säger. HELT fria från ALL form av trafik. Inga undantag alls.\n\nJag säger inte att det skulle bli så i praktiken. Jag går bara efter vad hen faktiskt skrev.",
            "score": 1,
            "created_utc": 1734964187.0
        },
        {
            "author": "pimmen89",
            "body": "Det låter inte riktigt lika hemskt som alla de samhällsproblem som bilar i innerstan för med sig. Så dyrt är det inte att beställa hem möbler.",
            "score": -3,
            "created_utc": 1734962223.0
        },
        {
            "author": "ResearcherOk7685",
            "body": "Jag använde en flyttfirma som använde en lastbil som hör till firman.  \nDe utförde dessutom flytten på en vardag, inte på en helg.",
            "score": 1,
            "created_utc": 1734963416.0
        },
        {
            "author": "moopey",
            "body": "Bor också vid Odenplan - använde flyttfirma. \n\n\nKöpte ny säng så tog jag hemleverans",
            "score": 1,
            "created_utc": 1734963699.0
        },
        {
            "author": "ConvenientTetrahedon",
            "body": "Även om total trafik minskade så leddes ändå delar av trafiken om till mindre gator vilket då leder till ökad trafiken där, iaf enligt Stockholm Stad själva.\n\nhttps://vaxer.stockholm/projekt/vasastan/bilfria-helger-pa-sveavagen/",
            "score": 1,
            "created_utc": 1734964017.0
        },
        {
            "author": "EishLekker",
            "body": "Läs den ursprungliga kommentaren igen. ”Helt trafikfria” betyder exakt vad orden säger. ***HELT*** fria från ***ALL*** form av trafik. Inga undantag alls.",
            "score": 1,
            "created_utc": 1734964102.0
        },
        {
            "author": "AttTankaRattArStorre",
            "body": "Det är bara ett exempel. Ska en barnfamilj med 2-3 barn släpa på 5-6 resväskor genom spärrarna till tunnelbanan och pendeltåg (alternativt på gatorna till centralen) kl. 04:00 på morgonen när de ska på resa utomlands? Ska gamla pensionärer eller rörelsehindrade som har svårt att röra sig ta sig hela vägen ut till förorten för att kunna åka bil för att hälsa på familjen? Ska jag behöva ta taxi ut till Nacka för att hälsa på bekanta? Ska jag behöva anlita DHL för att transportera mina verktyg ut till båten för en dags arbete? Ska jag behöva ringa ambulans om jag behöver ta mig in till sjukhuset i ett icke-akut men ändå allvarligt läge?\n\nBilen är nödvändig, det finns inga som helst problem med bilar i innerstaden som ens kommer i närheten av kaoset som skulle uppstå om de förbjöds.",
            "score": -1,
            "created_utc": 1734962656.0
        },
        {
            "author": "EishLekker",
            "body": "Läs den ursprungliga kommentaren igen. ”Helt trafikfria” betyder exakt vad orden säger. HELT fria från ALL form av trafik. Inga undantag alls.",
            "score": 1,
            "created_utc": 1734964318.0
        },
        {
            "author": "AttTankaRattArStorre",
            "body": "Så tanken är att det ska svärma varutransporter, taxibilar och flyttbilar överallt hela tiden? Och normala personer kommer behöva lägga tusentals kronor i månaden på att anlita svindyra transportfirmor (eller taxibolag) för att transportera saker som enkelt hade gått in i en bil - bara för att MP-blivna hottentottar i innerstaden ska kunna göra kullerbyttor och spela kort på Sveavägen mitt på dagen?",
            "score": 1,
            "created_utc": 1734964251.0
        },
        {
            "author": "pimmen89",
            "body": "Ta en taxi från Arlanda kl 04:00 istället, och använd färdtjänst om du är rörelsehindrad, de är undantagna från förbudet.\n\nFörvara verktygen i båtskjulet om de är tunga, varför behöver du ha dem i lägenheten för?\n\nJag vet inte vad det är för kaos du tror hade uppstått om fler områden blir bilfria i innerstan, men jag ser inte så mycket kaos i Nürnberg eller Barcelona när de införde det. Vad tror du hände där? Istället har det blivit bättre för näringslivet, de rörelsehindrade, skattebetalarna, barnfamiljerna, pensionärerna, folkhälsan, personsäkerheten mm.",
            "score": 0,
            "created_utc": 1734963792.0
        }
    ]
}