{
    "post_title": "What is the purpose of this scam?",
    "post_author": "PigWithAntlers",
    "post_score": 72,
    "post_url": "https://www.reddit.com/r/copenhagen/comments/1hjyeb4/what_is_the_purpose_of_this_scam/",
    "comments": [
        {
            "author": "Forty__Three",
            "body": "The scam is:\n1. You say yes when they ask you, they go with you to look for it\n2. They don’t have the exact one he needs. But he says they probably do in another shop. You said you would help him, so he tries to get you to go to the other shop.\n3. You don’t want to go to the other shop but you feel bad because you already said yes to help\n4. He helpfully suggests you take out cash and give it to him and he’ll go to the other shop. \n5. You end up giving him 1-200kr in cash thst you wouldn’t have considered otherwise",
            "score": 190,
            "created_utc": 1734878002.0
        },
        {
            "author": "NasserAjine",
            "body": "Yes that's a scam. Not sure what the purpose is, might be for resale, but it's certainly a scam.",
            "score": 62,
            "created_utc": 1734874078.0
        },
        {
            "author": "cickafarkfu",
            "body": "The purpose is not to get the baby formula. They want money.  This is an old scam, sometimes they include their children too.\n\nThey want to gain the empathy of the people by asking for the formula first.  When they buy it for them and hand it to them, they will engage in a conversation and start sharing how desperate and terrible their situation is.\n\nThe formula is only the catch, they usually target women and old people. If someone is willing to buy the formula they know they are likely to give them money too.\n\nThat's why he said it is not the good formula, he wanted to manipulate you into giving him money instead of going back to the store. That's why he said that nonsense about the expiry date, but then he felt like he can't scam you so he just moved on to the next person.",
            "score": 29,
            "created_utc": 1734876672.0
        },
        {
            "author": "UndocumentedTuesday",
            "body": "Don't contribute to it thanks",
            "score": 47,
            "created_utc": 1734876884.0
        },
        {
            "author": "Tml1668",
            "body": "They will still try to return for cash. They will tell the store that they have purchased the wrong kind, maybe exchange for sometning else. Booze, cigarettes, snus. Cigarettes and snus is not hard to sell 😉",
            "score": 36,
            "created_utc": 1734874134.0
        },
        {
            "author": "Mediocre-One1",
            "body": "I know this guy, he tried this trick on me too a while back and I did almost exactly like you did - well I suggested the small bricks but when he declined saying it was the “wrong brand” and that his baby would get sick, I knew he was tricking me. He’s really pathetic that guy, rather fat fella, right? He has been around for quite some time…",
            "score": 9,
            "created_utc": 1734896938.0
        },
        {
            "author": "West_Show7473",
            "body": "If any tourists are reading this: no babies in Denmark are going to go hungry unless their parents don’t care at all and are spending money on drugs/alcohol/cigarettes instead. Even then, there is a lot of state support for low-income and vulnerable parents. Don’t support these scammers.",
            "score": 11,
            "created_utc": 1734890328.0
        },
        {
            "author": "JakobDM",
            "body": "Oh man.. I just realized I fell for that scam a few years ago.  \nThe specific baby powder wasn't there, and there was an ATM just a few meters away from the store..",
            "score": 6,
            "created_utc": 1734894659.0
        },
        {
            "author": "DecentHighlight1112",
            "body": "There are several steps that follow, depending on how willing and easy a target you are. The next step is asking for cash, alternatively a loan of 200-400 DKK, either in cash. Typically, you’re very close to an ATM. The next step is asking for your phone number so they can supposedly repay you via MobilePay. However, that never happens. Instead, the scammer will call you later, claiming to be in a desperate situation and needing to borrow more money. The same scam is common near gas stations, where they claim to need cash for fuel or a bus ticket. When they’re most aggressive, they’ll step in front of a cyclist, blocking your way so you can’t move on until you talk to them.",
            "score": 3,
            "created_utc": 1734889074.0
        },
        {
            "author": "I_LIKE_SEALS",
            "body": "I saw it at Kvickly on Nørrebrogade a couple of weeks ago",
            "score": 1,
            "created_utc": 1734905821.0
        },
        {
            "author": "Henrikbetjent",
            "body": "Was he from Somalia ? Dark skinned ? Haha I know him.",
            "score": 1,
            "created_utc": 1734911580.0
        },
        {
            "author": "Alternative_City9216",
            "body": "Oh no, not this guy. He scammed me once. Not falling for his BS again.",
            "score": 1,
            "created_utc": 1734940082.0
        },
        {
            "author": "jacobtf",
            "body": "It's like when people ask for money for a ticket at the train station, and when you say \"I'll buy you the ticket and follow you to the train\" instead of giving them cash and they suddenly start changing their story.\n\nPull the other one, this one's got bells on it.",
            "score": 1,
            "created_utc": 1734943645.0
        },
        {
            "author": "irtiq7",
            "body": "Most of these scammers are from Romania",
            "score": 1,
            "created_utc": 1734945511.0
        },
        {
            "author": "Celthric317",
            "body": "There's a woman in the 365discount on Amagerbrogade 29 that does this all the time. I've told her no more than once.",
            "score": 1,
            "created_utc": 1734953985.0
        },
        {
            "author": "ssssss_hhhhhhh",
            "body": "Ppl use it to cut up drugs",
            "score": -5,
            "created_utc": 1734875256.0
        },
        {
            "author": "Limp-Munkee69",
            "body": "I had a guy try this on me while I was on my way into a bar. He comes up, explains the whole thing. Points to the candy store across the street and he says if I can come with him in there to buy baby formula.\n\nI tell him it's a candy store. He asks me for money, I tell him if he can find me an open store that sells baby formula I will go with him and buy it for him.\n\nHe says no and asks me for cash. I say no, sorry, i have none (this was a lie).",
            "score": 26,
            "created_utc": 1734889966.0
        },
        {
            "author": "Morten14",
            "body": "I dunno, I once got scammed by this and all he wanted was the baby formula",
            "score": 25,
            "created_utc": 1734882965.0
        },
        {
            "author": "Juus",
            "body": "There is good resale value in baby formula. A few years ago we had a problem with Chinese tourists buying way too much baby formula, because they could resell it at home for much more.",
            "score": 9,
            "created_utc": 1734891575.0
        },
        {
            "author": "PigWithAntlers",
            "body": "Ok, that makes sense. I actually remember the exact one he asked for not being available when I looked at the shelf. So he probably knew they didn't carry that one in dry form so he could ask to go somewhere else.\n\nThe funny thing about this story is that I ended up getting my money back, I just took the packages he had left when I returned hours later and returned them in the shop! But I saw him again the other day when cycling past, he had his hooks in a young guy. I regret not turning around and warning him.",
            "score": 6,
            "created_utc": 1734893338.0
        },
        {
            "author": "taskum",
            "body": "Oh wow, I had this exact thing happen to me. A guy approached me in a supermarket and asked in broken English if I could buy some baby formula. He said that his baby at home needed a special formula due to allergies, but that the store didn’t have that brand. So he was asking if I could come with him to the pharmacy and buy the (very expensive) allergy-friendly baby formula. I was short on time that day and didn’t have cash, so I told him I was very sorry but I that couldn’t help.\n\nHad a weird feeling about the whole thing afterwards.",
            "score": 7,
            "created_utc": 1734893811.0
        },
        {
            "author": "incognito_dk",
            "body": "Damn, that is me. Feeling pretty stupid rn",
            "score": 3,
            "created_utc": 1734889387.0
        },
        {
            "author": "Bitter_Air_5203",
            "body": "Aha!\n\nMy girlfriend actually fell for this scam. \nThey went to two shops next to each other and they didn't have the correct formula. I can't remember if she ended up giving him money or not.\n\nBut I actually wondered what the point was, but of course the formula is the way to gain sympathy.\n\nWe had a little talk about gypsies that afternoon. \n\nAnd luckily she stopped feeding them.",
            "score": 6,
            "created_utc": 1734888859.0
        },
        {
            "author": "pannenkoek0923",
            "body": "I never carry cash anyway so good luck scamming me\n\nNot like I'm going to mobilepay them anyway",
            "score": 1,
            "created_utc": 1734951725.0
        },
        {
            "author": "tepkel",
            "body": "It's bait. They use it to lure babies in, then sell the babies.",
            "score": 66,
            "created_utc": 1734877404.0
        },
        {
            "author": "KoreaNinjaBJJ",
            "body": "They probably don't care. But isn't reselling baby formula illegal? There are very strict rules about baby formula.",
            "score": 14,
            "created_utc": 1734875664.0
        },
        {
            "author": "VonBassovic",
            "body": "It’s 100% for resale. Dried formula is a lot more expensive outside of Denmark, so it resells well.",
            "score": 10,
            "created_utc": 1734879053.0
        },
        {
            "author": "ChickEnergy",
            "body": "They cant exchange it if they dont have the bon",
            "score": 18,
            "created_utc": 1734874691.0
        },
        {
            "author": "taskum",
            "body": "I also nearly fell for this scam last year. I never carry cash but asked if the guy had MobilePay because then I’d send him so money for the formula. I’m not sure he understood what I meant, because he just wanted me to follow him instead. Maybe to an ATM or a different store, I dunno. But I didn’t have time and had to leave.\n\nSo weird reading other people in here describe the exact same scenario I went through. I had no idea this was such a common scam.",
            "score": 2,
            "created_utc": 1734910329.0
        },
        {
            "author": "hazily",
            "body": "If somebody ever steps in front of my bicycle I’d run them over.",
            "score": 3,
            "created_utc": 1734890431.0
        },
        {
            "author": "chu-cabra",
            "body": "He tricked me in SuperBrugsen on Godthåbsvej..",
            "score": 1,
            "created_utc": 1734913212.0
        },
        {
            "author": "NasserAjine",
            "body": "In that case, wouldn't it be simpler to just buy it?",
            "score": 7,
            "created_utc": 1734875919.0
        },
        {
            "author": "ssssss_hhhhhhh",
            "body": "Only happened to me in New York",
            "score": 0,
            "created_utc": 1734875277.0
        },
        {
            "author": "dtewfik",
            "body": "They can return the baby formula for cash",
            "score": 26,
            "created_utc": 1734888942.0
        },
        {
            "author": "wynnduffyisking",
            "body": "Baby formula is apparently surprisingly easy to sell on the black market 🤷🏻‍♂️",
            "score": 2,
            "created_utc": 1734909394.0
        },
        {
            "author": "Preacher987",
            "body": "That's because the baby formula in China was full of not so good stuff... Wouldn't say poison but it was close.",
            "score": 3,
            "created_utc": 1734910531.0
        },
        {
            "author": "yankee-in-Denmark",
            "body": "thats kinda hilarious. Good outcome.",
            "score": 1,
            "created_utc": 1734960143.0
        },
        {
            "author": "trolsor",
            "body": "That brand in danmark is called Althera . And it is not possible to buy from any supermarket and parents knows that fact because that spesific baby formula only used by doctors sugestion and only sold by apoteket  . He were lying .  It is a scam from the get go,",
            "score": 8,
            "created_utc": 1734904751.0
        },
        {
            "author": "Ofiller",
            "body": "This is the best answer so far",
            "score": 3,
            "created_utc": 1734891978.0
        },
        {
            "author": "DecentHighlight1112",
            "body": "Its not",
            "score": 4,
            "created_utc": 1734889137.0
        },
        {
            "author": "ZzangmanCometh",
            "body": "That's a good vending, Hansi.",
            "score": 69,
            "created_utc": 1734875981.0
        },
        {
            "author": "Tml1668",
            "body": "I've seen it happen.",
            "score": 1,
            "created_utc": 1734875014.0
        },
        {
            "author": "Henrikbetjent",
            "body": "If he was dark skinned then its him. He lives in Amager. He's actually a nice guy.",
            "score": -2,
            "created_utc": 1734914925.0
        },
        {
            "author": "Straight-Hope-7810",
            "body": "Many supermarkets are not allowed to take returns of baby formulas, probably for this reason.",
            "score": 15,
            "created_utc": 1734892491.0
        },
        {
            "author": "LunchHot9029",
            "body": "I think babies died.",
            "score": 3,
            "created_utc": 1734922615.0
        },
        {
            "author": "WenRambo",
            "body": "Maybe we can use that in another afsnit.",
            "score": 21,
            "created_utc": 1734878308.0
        },
        {
            "author": "ChickEnergy",
            "body": "I'm sguda on juleferie",
            "score": 6,
            "created_utc": 1734892457.0
        },
        {
            "author": "aaseandersen",
            "body": "Yes, he clearly needs a bong!",
            "score": 4,
            "created_utc": 1734884824.0
        },
        {
            "author": "TowJamnEarl",
            "body": "And many are unscrupulous.",
            "score": 3,
            "created_utc": 1734898182.0
        },
        {
            "author": "_Damale_",
            "body": "That's not the reason. \n\nThe reason is that formula is treated the same as cooled or frozen products, for safety reason they can't take it back and resell it.\n\nImagine the shit storm if some nut job had  tampered with it and they resold it to someone who then fed it to their infant.",
            "score": 2,
            "created_utc": 1734962113.0
        },
        {
            "author": "Straight-Hope-7810",
            "body": "That makes a lot of sense. In general you can't return foodstuffs unless it's bad or tampered with.",
            "score": 1,
            "created_utc": 1734962203.0
        },
        {
            "author": "_Damale_",
            "body": "Exactly, and in any and all cases, if it has left the store premises, they need to discard it.",
            "score": 1,
            "created_utc": 1734962757.0
        }
    ]
}