{
    "post_title": "Min flickvän vill ha del av en eventuell framtida vinst?",
    "post_author": "Sea-Variation-9740",
    "post_score": 30,
    "post_url": "https://www.reddit.com/r/stockholm/comments/1hkk74r/min_flickvän_vill_ha_del_av_en_eventuell_framtida/",
    "comments": [
        {
            "author": "oskich",
            "body": "Räntan är ju en kostnad för att kunna bo i lägenheten, hade det varit tal om att även betala del av amortering så kan man förstå hennes tankegång. Du får ju dra av 30% av dina räntekostnader på skatten, så ta ränta x 0,7 plus avgiften och driftskostnader och splitta jämt.",
            "score": 91,
            "created_utc": 1734946835.0
        },
        {
            "author": "Strobljus",
            "body": "Om hon inte tar risken så ska hon inte få vinsten?",
            "score": 76,
            "created_utc": 1734946727.0
        },
        {
            "author": "utterbutternutter",
            "body": "Skriv samboavtal! Om ni skulle göra slut behöver ni ha avtalat att din bostad inte är en del av samboegendomen, annars kan hon tvinga dig att sälja och dela hela vinsten från försäljningen, inklusive din kontantinsats. Kan vara värt att betala en jurist för att dra upp ett avtal. \n\nRimligtvis betalar hon hyra till dig, typ halva avgiften + halva räntan efter ränteavdraget.",
            "score": 33,
            "created_utc": 1734948416.0
        },
        {
            "author": "spiderpigbegins",
            "body": "Hon får väl köpa in sig i lägenheten med så stor andel som hon vill ta del av vinsten.\n\nFör mig låter det helt korrekt att hon får betala halva månadskostnaden om ni ska bo där tillsammans. När hon äger lägenheten kan hon få ta del av eventuell vinst från punkten hon köpt. \n\nVarför ska hon vara berättigad någon vinst alla bara för att ni bor tillsammans i din lägenhet?",
            "score": 45,
            "created_utc": 1734946426.0
        },
        {
            "author": "MidnightSnackyZnack",
            "body": "Räntan är en del av boendekostnaden. Det har inget med ägandeskap eller amortering att göra.\nHyr du så betalar du räntekostnader åt hyresvärden.\nLuktar lite räkmacka?",
            "score": 63,
            "created_utc": 1734948199.0
        },
        {
            "author": "beebop013",
            "body": "Få den värderad och hon för köpa in sig på halva det priset?\nHon slipper ju i nuläget också risken att lgh går ner i värde.",
            "score": 47,
            "created_utc": 1734946352.0
        },
        {
            "author": "prs1",
            "body": "Fullt rimligt att ni delar på avgift och räntekostnad men efter avdrag då. Om du inte redan räknat med det blir det blir hennes del 3100:-. Helt orimligt att hon skulle få del av vinsten bara för att hon är med och betalar räntan tycker jag.",
            "score": 29,
            "created_utc": 1734946599.0
        },
        {
            "author": "LobL",
            "body": "Hon betalar halva avgiften och halva räntan (efter ränteavdrag). Vill hon ha del av vinsten får hon väl också bära risken och också köpa halva bostadsrätten.",
            "score": 10,
            "created_utc": 1734949813.0
        },
        {
            "author": "bdrizzle871",
            "body": "Flytta inte ihop om ni ska hålla på att bråka om ekonomin redan nu\nOm ni väljer ändä att flytta ihop så kommer ni att bo tillsammans i några år och sedan separera\nSwedish lyfestyle 😎",
            "score": 15,
            "created_utc": 1734947280.0
        },
        {
            "author": "rebs92",
            "body": "Öh, hon kan ju få försöka hitta en hyresrätt för 4k.\nOch vad skulle hon ha för rätt på en vinst utan att ha någon faktiskt insättning... Alltså, hur fan tänker folk.\n\nMen, ni amorterar inte?! Galet.",
            "score": 24,
            "created_utc": 1734946427.0
        },
        {
            "author": "Neither_Row1898",
            "body": "Bostadens värdeökning är ett resultat av bundet kapital. Kommer din framtida sambo ingå med kapitaltillskott och att köpa in sig i bostaden? Historisk avkastning inte en garanti för framtida avkastning, är hon villig att ta hälften av förlusten om du skulle sälja till förlust i framtiden? \n\nAntar att ni är unga och att det är din första lägenhet. Dela /2 på boendekostnaden (ränta, amortering, avgift, el, vatten och övriga fasta kostnader) och se till att du skriver ett undertecknat avtal där du och din framtida sambo avtalar sambolagens bodelningsregler.",
            "score": 14,
            "created_utc": 1734947011.0
        },
        {
            "author": "caelestis42",
            "body": "Alltså antingen äger man och tar del av alla kostnader och sedan även eventuell uppsida, eller så hyr man och då får man betala rimlig hyra. 8000 / 2 = 4000 kr är rimlig hyra. Kan förstå hennes tankar kring räntka men å andra sidan hade hon aldrig kunna hyra så billigt som en brf-avgift utgör. Möjligen att hon skulle betala lite mindre, 3-3500 kr pga ränteavdrag etc men absolut inte 1000 kr. Sedan se till att skriv samboavtal och annat som tydligt reglerar och inte ger henne rätt till vinst så det inte kan uppstå problem i framtiden.",
            "score": 5,
            "created_utc": 1734950238.0
        },
        {
            "author": "Doenicke",
            "body": "Eftersom ert förhållande verkar vara en enbart ekonomisk uppgörelse rekommenderar jag att ni sätter er ner med en advokat istället för att fråga reddit.",
            "score": 4,
            "created_utc": 1734950808.0
        },
        {
            "author": "r6CD4MJBrqHc7P9b",
            "body": "Jag kan inte fatta att jag är den som säger det här, men ärligt talat; skippa den giriga hönshjärnan och låt henne försöka hitta boende för 1000 kr någon annan stans.\n\nMan blir ju fan äcklad. Hur kan hon hitta på något sånt här?",
            "score": 5,
            "created_utc": 1734951541.0
        },
        {
            "author": "Bissemannen",
            "body": "Jag är förvånad över att alla kommentarer handlar om hur det ska lösas praktiskt. Är det något jag lärt mig i livet är det att en girig och snål person kan man varken leva med eller ändra. Det är sannolikt att du så fort ni flyttat ihop stöter på andra liknande problem. Mitt råd är att se detta som ett varningstecken och att överväga om du verkligen vill leva ihop med en sådan människa.",
            "score": 12,
            "created_utc": 1734949999.0
        },
        {
            "author": "differenthings",
            "body": "Den eviga diskussionen mellan verklighetsfrånvända (i ditt fall din tjej) och övriga (du). Det ni kan göra är att bortse från de faktiska kostnaderna för lånet. Istället får hon betala marknadspris för vad det kostar att bo inneboende med någon i motsvarade lägenhet. Detta innebär med största sannolikhet att det blir dyrare för henne, men är det det hon vill för att slippa känna att hon \"betalar för lånet\" så.",
            "score": 13,
            "created_utc": 1734946790.0
        },
        {
            "author": "GoddessofWvw",
            "body": "Se till att ha ett samboavtal undeteknat av era båda framtaget av en jurist. Det kostar omkring 1000 kr om det är standard grejer som detta och tar några minuter att göra, seb erbjuder tex detta via tjänster som lexly. Skriver hon inte under detta får du slänga ut henne. Har hon bott längre än 6 månader utan riskerar du att förlora hälften av allt även fast du ägt det sedan tidigare då några nyare dommar från gick praxis om de regler som ska gälla, om du köpt det för att bo där själv och ägde de innan ni flyttade ihop ska det nämligen icke delas vid en sepperation. Men det händer iallafall. \n\nVill hon ej betala hälften är det golddigger varning. Byt ut henne om hon vägrar. Det finns 3 miljarder andra, jobbigare om ni har barn med mera. Bara schysst om det händer tidigt.",
            "score": 4,
            "created_utc": 1734947825.0
        },
        {
            "author": "Impressive-Form1431",
            "body": "Hon ska betala halva avgift och ränta men vill hon betala extra i form av ammortering så får hon väll göra det och sedan äger hon endast så mycket hon lagt in.\n\nDå ger du henne möjligheten att lägga in pengar i ammortering iaf om hon önskar det",
            "score": 5,
            "created_utc": 1734947751.0
        },
        {
            "author": "Bkarm1995",
            "body": "Du betalar för bostaden och hon betalar för maten och annat som krävs för hemmet?",
            "score": 7,
            "created_utc": 1734946173.0
        },
        {
            "author": "Historical-Pen-7484",
            "body": "Hon kan ju köpa halva bostaden, och så tar du de pengarna och sätter på ISK i stället.",
            "score": 2,
            "created_utc": 1734950000.0
        },
        {
            "author": "tom_bank",
            "body": "Om hon vill vara med och ta del av en eventuell vinst så bör hon även vara beredd på att hjälpa till med att ta en eventuell förlust vid försäljning.\n\nDvs om du säljer för 200k förlust så får hon stå för 100k av det (om det är 50% av vinsten hon förväntar sig). Tveksam till om hon tycker det låter så kul...",
            "score": 2,
            "created_utc": 1734951302.0
        },
        {
            "author": "kosdo",
            "body": "De ba dumpa henne",
            "score": 2,
            "created_utc": 1734952345.0
        },
        {
            "author": "divaddivaddivad",
            "body": "Är hon med och delar på en eventuell förlust med?",
            "score": 2,
            "created_utc": 1734952836.0
        },
        {
            "author": "naalat",
            "body": "Lgh är din, du har köpt och står på lånet. Hon ska betala hyra till dig (typ som att hon skulle hyra hälften av lgh). Hyran ska va rimlig för vad hon hade behövt betala om ni hyrde den. Du betalar 8 000 i månaden, 4 000 var är väldigt rimligt oavsett om man hyr eller inte.\n\nNär du säljer lgh ska hon inte få något då hon endast hyrt in sig hos dig. Om ni sedan väljer att köpa en ny bostad tsm så blir det en typ av vinst med tanke på att ni har råd att köpa en bättre bostad. Sedan skriver ni avtal på hur mycket kontantinsats ni lagt in, skiljer ni er får ni tillbaka de pengar ni lagt. \n\nDetta är vad jag gjort och tycker det inte är mer än rättvist.",
            "score": 2,
            "created_utc": 1734952956.0
        },
        {
            "author": "Apachez",
            "body": "Den rättvisa lösningen för att slippa framtida problem när/om du och din flickvän går skilda vägar är att hon får betala 50% av brf-avgiften medan hon bor i din lägenhet medan du får betala 100% av ränte och amorteringskostnaderna.\n\nSe till att få ner detta på papper med vittnen som vidimerar innehållet som ni bägge har därefter varsitt exemplar av.\n\nSen när ni fortfarande är ihop efter ett par år och väljer att flytta till gemensamt boende så ni kan då dela på kostnaden gällande lånen med den kvarvarande huvudbryn att om ni skiljer er därefter så blir det lättast att sälja lägenheten och dela på kostnaderna (och ev. vinst) även då.",
            "score": 9,
            "created_utc": 1734947351.0
        },
        {
            "author": "tompasten",
            "body": "Det logiska är att i samband med att hon flyttar in värdera bostaden och därmed så är det hennes startvärde om hon skall betala hälften av kostnaden. Sen får man dra av sådant som tex din kontantinsats med mera..\n\nVärt o notera att den svängdörren går åt 2 håll, går värdet ner och ni separerar så får hon betala dig för att flytta då halva värdeminskningen är hennes o betala för.",
            "score": 4,
            "created_utc": 1734946400.0
        },
        {
            "author": "Any_Layer8916",
            "body": "Jag hade personligen inte flyttat ihop med denna människa då hon endast tänker på pengarna. Enklaste du kan göra är att dumpa henne.",
            "score": 4,
            "created_utc": 1734951006.0
        },
        {
            "author": "Apprehensive-Yard-59",
            "body": "Rimligast är att hon betalar halva avgiften och halva räntan efter ränteavdraget eftersom du får tillbaks på skatten för det om du inte redan jämkat. \nSka hon dela på eventuell vinst/förlust måste hon ju köpa halva lägenheten av dig. Tänkte hon att hon skulle ha rätt till halva vinsten utan att ta någon risk alls?? 😅😆",
            "score": 3,
            "created_utc": 1734949193.0
        },
        {
            "author": "BullionZon",
            "body": "Självklart ska ni dela 50/50. Detta är inte Dubai liksom.",
            "score": 4,
            "created_utc": 1734949434.0
        },
        {
            "author": "Mundane_Prior_7596",
            "body": "Ja, som folk konstaterar, samboavtal är nödvändigt och att hon i nuläget ska ha del i framtida värdeökning är röd flagg, absurt och idiotiskt. Speciellt som du kan ta bra mycket mer för en inneboende i en garderob. Däremot har jag en annan fråga som ingen har tagit upp. Om man på allvar älskar varandra och provar att bo ihop ska man kanske fundera på att den som har högre lön och fetare bankkonto tar lite mer av räkningar och restaurangnotor? Motsatsen är väl girigt? ",
            "score": 1,
            "created_utc": 1734951381.0
        },
        {
            "author": "zodiaken",
            "body": "Din flickvän har en skev bild av verkligheten.. \n\nJag har redan sett ett antal inlägg med korrekt svar, dvs, hon måste vara delägare för att kunna ta del av en framtida vinst. Den vinsten har inget med hyra och ränta att göra då det faktisk är antagligen den minsta möjliga kostnaden hon hade fått betala oavsett om du ägde lägenheten eller nån annan. Frågar hon alltid sin hyresvärd om eventuell framtida vinst eller? 😂",
            "score": 1,
            "created_utc": 1734951819.0
        },
        {
            "author": "Sture-Bergwall",
            "body": "Jävla bönder i denna tråd. Kalla inte hennes andel ränta, kalla det hyra.",
            "score": 1,
            "created_utc": 1734951933.0
        },
        {
            "author": "Kanelbullah",
            "body": "Avgiften 50/50 är rimlig. Räntan däremot tycker ska anpassas mot vad hon skulle ha betalt om hon bodde själv.\nSå om hon betalar 5000 idag själv och hon sen skulle få betala 1000 med dig. Så skulle jag lägga fram att hon betalar 2000 extra, det är 50% av 4000. Hon sparar ändå 2000 kr varje månad. \nEdit: Och vinsten behåller du själv.",
            "score": 1,
            "created_utc": 1734952130.0
        },
        {
            "author": "SpaceTransaction",
            "body": "Om det ska vara någorlunda rättvist så bör hon betala halva avgiften pluss halva räntan beräknad på 50 % av lägenhetens värde minus ränteavdrag. Vill hon ta del av värdeökning får hon köpa in sig.",
            "score": 1,
            "created_utc": 1734952142.0
        },
        {
            "author": "lukaskruger",
            "body": "Räntekostnad efter avdrag och avdrag är eran gemensamma kostnad. Om ni tjänar väldig olika kan du ju vara schysst och betalar olika delar beroende på vad ni har för inkomst. Ska hon ha vinsten måste hon köpa in sig.",
            "score": 1,
            "created_utc": 1734952890.0
        },
        {
            "author": "angry-adult",
            "body": "dela på amortering? nja i det fallet tycker jag nog att man ska ha någon form av delägarskap i lägenheten. men annars är det rimligt att dela lika på ränta+avgift tycker jag. så fungerar det vid andrahandsuthyrning.",
            "score": 1,
            "created_utc": 1734952893.0
        },
        {
            "author": "Shazvox",
            "body": "Svårt att avgöra. Om hon vill ha del av vinsten ska hon även stå för en del av lånet, inte bara pröjsa ränta.\n\n\nOm hon inte ska ha del av vinsten bör ni bara dela på de löpande kostnaderna (ev renoveringskostnader, förbättringar etc kan diskuteras då hon kommer dra nytta av det, men ej ta del av värdeökningen som uppkommer av de). Sedan kan man fundera på om ränta bör ingå i de löpande kostnaderna eller ej.\n\n\nDet säkraste rådet jag kan ge er är att komma fram till vad som känns rättvist *för er*, för ni kommer inte hitta någon objektiv rättvisa i denna fråga.",
            "score": 1,
            "created_utc": 1734953437.0
        },
        {
            "author": "yanushki",
            "body": "Jag flyttade själv in i min sambos bostadsrätt och  när vi flyttade till gemensamt så gjorde sambon million vinst vid försäljningen. Vafan skulle jag ta del av den för när jag gått in med 0 kronor?\nJag betalade såklart hyra till sambon som vi kom överens om.\n\nLite fräckt av din tjej att förväntas få ta del av ev framtida vinst. Lite pengakåt kan tyckas. Spelar ingen roll om hon ska bo där och betala hyra och hur länge.\n\nVad säger dina föräldrar om saken?",
            "score": 1,
            "created_utc": 1734954358.0
        },
        {
            "author": "Tight-Temporary-8672",
            "body": "Det jag hade gjort här är att erbjuda henne en  skräddarsydd samboavtal att hon får betala högre hyra till dig än hälften (ex. 5000 kr istället för 4000 kr) men att allt hon betalar över hälften blir uppsparad, så att vid eventuella vinster får hon den andel av vinsten som hon betalat in.\n\nex. låt oss säga att bostaden kostade 1 miljon kronor. Istället för att betala 4000 kr som är halva kostnaden för hyran betalar hon 5000 kronor. 1 tusen kronor går till en sparkonto varje månad. på ett år blir det 24000 kronor, på 10 år blir det 240000 kr.\n\nLåt oss säga att bostaden 10 år senare blir såld och det blir en vinst på 100000 kronor. eftersom lägenheten kostade en miljon när han köpte den och hon betalat in 240000 kronor, kan vi räkna ut hennes andel av vinsten bå detta sätt:\n\n240 000 / (1 000 000 + 240 000) = 0,1935 = 19,35 procent\n\nAlltså, om hon betalar 5000 kr till dig istället för 4000 kronor i 10 års tid har hon enligt en sådan avtal rätt till 19,35% av vinsten.\n\nPå så sätt blir det rättvist, för du och föräldrarna har ju ändå lagt ner en massa pengar på hyresbostaden redan + hyran du betalar nu.",
            "score": 1,
            "created_utc": 1734954422.0
        },
        {
            "author": "kalashej",
            "body": "Jag kan väl förstå lite hur hon tänker, även om det inte känns helt rätt. Det låter enklast att hon köper in sig i halva lägenheten isf. Sen håller jag inte med om att hon inte får del av vinsten. Om ni senare vill köpa något större så kommer ju 100% av vinsten gå in i det nya boendet, oavsett vem som vinsten officiellt står på.",
            "score": 1,
            "created_utc": 1734954568.0
        },
        {
            "author": "AccomplishedYam5060",
            "body": "Skriv samvoavtal. Om ni flyttar isär sen, så har hon rätt till hälften av  bostadsrättens  värde.",
            "score": 1,
            "created_utc": 1734955201.0
        },
        {
            "author": "AppleWithGravy",
            "body": "Tänker mig halva avgiften och 35% av räntan då du får tillbaka 30% på skatteåterbäringen.",
            "score": 1,
            "created_utc": 1734956438.0
        },
        {
            "author": "Gastkram",
            "body": "Hur vill din flickvän göra vid eventuell förlust? Ska hon betala tillbaka till dig då? Finns ingen logik i det hon föreslår. Som det ser ut nu så tar du på dig all risk, så varför ska hon ha del av eventuell vinst? I förskott dessutom??\n\nDäremot får du/dina föräldrar göra avdrag för räntan. Det hade jag kunnat tänka mig att kompensera för genom att hon betalar lite mindre, så att ni delar lika på den faktiska kostnaden.",
            "score": 1,
            "created_utc": 1734956927.0
        },
        {
            "author": "Jekkegokk",
            "body": "Om hon vill ta del av eventuell vinst får hon väl gå in med motsvarande kontantinsats och köpa in sig? Inte svårare än så. Räntan är vad det kostar att ha lägenheten. Skillnad hade varit om du krävde halva amorteringen men med ränta och avgift betalas inte lånet och hon ska således betala hälften av dina kostnader.",
            "score": 1,
            "created_utc": 1734958348.0
        },
        {
            "author": "Tall-Bodybuilder-391",
            "body": "Var smart OP. EVENTUELLA VINSTER SKA ÅTERINVESTERAS I ERT FRAMTIDA LIV. Verkar som att du exkluderas. \n\nOP bör betala 65/35 med kvinnan.",
            "score": 1,
            "created_utc": 1734958480.0
        },
        {
            "author": "oeverton_",
            "body": "Hon känner alltså att det skulle vara rimligt att hon betalar 1000:-/mån i hyra? På riktigt?",
            "score": 1,
            "created_utc": 1734959659.0
        },
        {
            "author": "MelodicSpeed1435",
            "body": "Jag hade nog ifrågasatt hela förhållandet. Antingen är hon efterbliven som inte förstår grundläggande ekonomi eller så är hon en girig leech. Inget av det är attraktivt öht.",
            "score": 1,
            "created_utc": 1734961292.0
        },
        {
            "author": "john_cooltrain",
            "body": "Enda rimliga är att ni värderar lägenheten hos en mäklare och hon köper in sig på en andel.",
            "score": 1,
            "created_utc": 1734962992.0
        },
        {
            "author": "Svintiger",
            "body": "Hon tror ni är gifta. Underligt beteende ärligt talat.",
            "score": 1,
            "created_utc": 1734963106.0
        },
        {
            "author": "ResearcherOk7685",
            "body": "Vill hon ta del av vinsten får hon ju köpa in sig i lägenheten. Räntan är en del av den faktiska kostnaden för att kunna bo där. \n4000 är vansinnigt billigt för en bostad i Stockholm.",
            "score": 1,
            "created_utc": 1734963661.0
        },
        {
            "author": "pellegrino6000",
            "body": "Hon låter rejält girig, ska ha eventuell vinst men kommer inte vara exponerad mot risk.\n\nFreerider, kanske bäst att fundera om det är rätt tjej?",
            "score": 1,
            "created_utc": 1734963704.0
        },
        {
            "author": "NeoGoober",
            "body": "I lägenheten jag och min sambo delar, men jag äger, betalar sambon bara halva BRF-avgiften och halva elen/bredbandet/hemförsäkring etc. medan hela lånekostnaden betalas av mig. Jag tjänar visserligen mycket mer än sambon, vilket kanske påverkar synen på det hela.\n\nJag tycker spontant att du själv borde betala för ditt lån.",
            "score": 1,
            "created_utc": 1734947743.0
        },
        {
            "author": "Entire_Impression_50",
            "body": "Akta dig för denna Dam",
            "score": 1,
            "created_utc": 1734949622.0
        },
        {
            "author": "Illustrious-Aside-46",
            "body": "Acceptera aldrig att bli dominerad av din flickvän. Tro mig, jag är gammal, jag vet.\n\nStäll ett ultimatum, som inte är förhandlingsbart, hon betalar hälften av samtliga gemensamma kostnader, även mat och försäkringar. Eller så kan ni bo på varsitt håll. Jag har alltid gjort så, det har alltid accepterats, och jag har blivit ekonomiskt oberoende delvis pga att mina boendekostnader halverats under lång tid.\n\nMen ärligt talat, det bästa är om ni inte flyttar ihop. När ni gör det kommer det skapa friktion, främst hos henne. Hon kommer börja störa och irritera sig på hur du är, och hon kommer sluta ha den romantiska bilden av dig som hon (förhoppningsvis) har inledningsvis, och istället se den realistiska bilden av dig. Hon kommer förstås försöka dölja hur hon känner, men det kommer sippra ut. \n\nNär man flyttar ihop har de flesta även mindre sex, och sexet blir sämre, mindre passionerat. Du bör vara medveten om det. \n\nHon verkar vilja ekonomiskt utnyttja dig för ditt boende. Det är en stark varningssignal. Hade hon verkligen älskat dig, känt passionerat för dig, hade hon gladeligen betalat mer än du gör. En kvinna som älskar en man är villig att göra uppoffringar för att vara med honom. \n\nDu har även slitage på möbler och bostad att ta hänsyn till. Samt din förlust av frihet och kontroll över Ditt hem. Ta bra betalt för slitage. \n\nFörsök vara kall och rationell, och låt dig inte luras av din förälskelse eller törst efter sex. \n\nByter du någonsin lägenhet, och om hon flyttar med, så får hon automatiskt rätt till halva den nya lägenheten! Enligt sambolagen, vilket visar att hela samhällssystemet finns för att ekonomiskt gynna just kvinnor, på förälskade mäns bekostnad. \n\nVar väldigt försiktig. Vill hon inte ens bära hälften av era kostnader så kommer det bara förvärras med tiden. \n\nKvinnor kommer och går. Skydda dina tillgångar, bostad och pengar. \n\nLycka till unge man..",
            "score": -1,
            "created_utc": 1734950032.0
        },
        {
            "author": "skumt",
            "body": "Ja alltså att hon ska betala av ditt lån blir ju lite skevt. Avgiften fine dela på den och andra fasta kostnader. Annars får hon ju köpa in sig i lägenheten om hon ska ha del av eventuell vinst. Kan ju också bli förlust så inget är ju garanterat där.",
            "score": -4,
            "created_utc": 1734946558.0
        },
        {
            "author": "Papercoffeetable",
            "body": "Now, I ain’t sayin’ she a gold digger\n\n(When I’m in need) But she ain’t messin’ with no broke -\n\n🎶",
            "score": -3,
            "created_utc": 1734946878.0
        },
        {
            "author": "SpaceCommissar",
            "body": "Jag håller med henne. Varför ska hon hjälpa till att betala av din bostad om hon inte får delägarskap?\n\nAvgift till föreningen, el, internet, mat och annat som ni förbrukar är en sak, jag utgår från att såna kostnader vet ni bäst själva hur ni delar upp. Men pengar som går till din investering, som du sen äger och kan sälja senare i livet, bör du stå för själv om du inte vill dela eventuell vinst eller förlust med henne sen.",
            "score": -11,
            "created_utc": 1734946751.0
        },
        {
            "author": "tthompa",
            "body": "Inte rättvis att hon betalar av räntan på ditt lån som hon inte kommer få tillbaka. Mest rättvist är att ni delar avgiften+el procentuellt på inkomst. Om du tjänar 60% av hennes lön betalar du 20% mer, utöver amortering+ränta som du betalar själv.",
            "score": -4,
            "created_utc": 1734949384.0
        },
        {
            "author": "Barneyk",
            "body": "On du inte vill dela med dig av vinsten är det helt orimligt att hon ska vara med och betala din ränta.\n\nAtt vara så här småsint och gnidig i en relation är i mina ögon helt sjukt.\n\nKompromissen för er tycker jag skulle vara att hon betalar halva avgiften och ingen ränta om du vill vara ensam ägare av lägenheten.\n\nNär jag flyttade ihop med min sambo så gick jag in med hela kontantinsatsen och vi skrev samboavtal där jag får tillbaka hela handpenningen och att vi delar lika på all eventuell vinst.\n\nAtt gå in i en samborelation där man delar på kostnaderna men vill hålla vinsten för sig själv eftersom man har lagt kontantinsatsen hade i min bok varit en dealbreaker.\n\nDet är väl en person man vill dela sitt liv med och dela på även ekonomiska framgångar?\n\nJag förstår inte hur man relaterar till sin partner om man inte tänker så.",
            "score": -2,
            "created_utc": 1734949782.0
        },
        {
            "author": "Quiet_Fix9589",
            "body": "Det är inte rimligt att betala på ett lån hon inte tagit och som inte kommer se eventuell vinst på. Hennes förslag om halva avgiften låter bra. Annars får hon köpa in sig.",
            "score": -10,
            "created_utc": 1734946492.0
        },
        {
            "author": "MaxVonk",
            "body": "Hur som helst ska ni skriva ett samboavtal. Skydda din egendom och din investering. Jag hade lagt upp det på följande sätt, du fortsätter att betala räntan, ni delar på avgift till föreningen, el, försäkring osv. Dela upp matkostnader på hälften rakt av. \n\nJag misstänker att du vill bo kvar i lägenheten om ni skulle separera?",
            "score": 0,
            "created_utc": 1734947753.0
        },
        {
            "author": "markizoffline",
            "body": "Betala själv för lägenheten och hon kan betala för maten och andra avgifter på kanske 4000 kr per månad, så slipper ni bråka om lägenheten om det skulle ta slut mellan er.",
            "score": 0,
            "created_utc": 1734948993.0
        },
        {
            "author": "Glittering_Water3645",
            "body": "Rimligt i mitt anseénde:\n\nDu betalar\n\nRänta och amortering\n\nNi delar på\n\nBostadsrättsavgift\n\nDu är ägare av bostadsrätt och får hela värdeförändringen vid försäljning.\n\nOm hon vill dela på värdeökningen vid framtida försäljning så får hon betala av lånet med en summa som motsvarar din ursprungliga kontantinsats i bostaden + det du redan amorterat av. I det fallet delar ni på ränta och amortering på kvarvarande del av lånet. Då är bostadsrätten hälften hennes och hälften din.",
            "score": -1,
            "created_utc": 1734956329.0
        },
        {
            "author": "flushkill",
            "body": "Hon har rätt, betalar hon ränta ska hon naturligtvis få en del av vinst.  Men det är inte frågan, varför ska hon betala ränta på ett hus DU äger.  För att undvika konstiga situationer bör du inte ens vilja detta.  Det är ditt hus, du betalar.  Jag skulle tillåta henne att bo hyresfritt och betala för mat eller något.  Det är en win win, och inga konstiga konstruktioner som kan bli otäcka i ett potentiellt uppbrott.",
            "score": -1,
            "created_utc": 1734958141.0
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": -2,
            "created_utc": 1734946983.0
        },
        {
            "author": "JennyDarukat",
            "body": "This is the way",
            "score": 9,
            "created_utc": 1734947532.0
        },
        {
            "author": "Kaffepaus_",
            "body": "Att betala ränta är ju att betala för risken.",
            "score": -45,
            "created_utc": 1734947595.0
        },
        {
            "author": "oskich",
            "body": "Gäller dock inte om TS bodde ensam i lägenheten innan de blev sambos. Bostad inköpt  för gemensamt nyttjande delas dock 50/50 vid separation, oavsett vem som betalat den.\n\nSamboavtal är tryggast att ha i vilket fall som helst 😁",
            "score": 16,
            "created_utc": 1734952220.0
        },
        {
            "author": "rehditt",
            "body": "Nej det stämmer inte. Det gäller endast om man flyttar in i bostaden samtidigt (eller från början köper den med avsikt att flytta in tillsammans i den).\n\nSkriver man inget avtal har man dock rätt till 50% av egendom som är inköpt EFTER samboskapet. Man behöver definitivt inte upprätta avtalet via jurist. Det finns mallar på nätet. Bra att se till att ha en neutral tredjepart som vittne dock till själva signeringen.",
            "score": 8,
            "created_utc": 1734952265.0
        },
        {
            "author": "ValidSignal",
            "body": "Redan köpt lägenhet blir inte samboegendom. Det är om man köper en lägenhet som är tänkt att nyttjas av båda.",
            "score": 2,
            "created_utc": 1734952287.0
        },
        {
            "author": "Silvervarg",
            "body": "Det är klart rimligt att köpa in sig i lgh. och därmed dela på kostnaden för lånet och vinsten.",
            "score": 6,
            "created_utc": 1734950335.0
        },
        {
            "author": "Oberheimz",
            "body": "Ja det är inte så att avgiften motsvarar hyran för en hyresrätt, avgiften går ju till föreningens gemensamma kostnader för att hålla huset i drift och skick. Det är fullt rimligt att dela på just räntekostnaden, om hon vill dela på eventuell vinst får hon i så fall köpa in sig i lägenheten så hon också delar på risken. Hela det här upplägget är ändå fördelaktigt för henne.",
            "score": 2,
            "created_utc": 1734959267.0
        },
        {
            "author": "yanushki",
            "body": "Håller med",
            "score": 2,
            "created_utc": 1734954421.0
        },
        {
            "author": "Removable_speaker",
            "body": "Det är en del av investeringen också. För att kunna äga bostaden tar man ett lån och betalar ränta på lånet.\n\nBästa är nog att komma överens om en rimlig hyra.",
            "score": 4,
            "created_utc": 1734951736.0
        },
        {
            "author": "Latringuden",
            "body": "Räntan är kostnaden för att ta lån från banken för att köpa lägenheten, det är inte en kostnad för att bo i den.",
            "score": 1,
            "created_utc": 1734959245.0
        },
        {
            "author": "ParreNagga",
            "body": "Fuck mäklare!",
            "score": -2,
            "created_utc": 1734951296.0
        },
        {
            "author": "Apachez",
            "body": "Värdering säger absolut ingenting. Chatgpt kan troligtvis bättre värdera din lägenhet än random mäklare.",
            "score": -9,
            "created_utc": 1734950562.0
        },
        {
            "author": "thegamer1338minus1",
            "body": "Till nuvarande marknadspris",
            "score": 5,
            "created_utc": 1734954460.0
        },
        {
            "author": "Sea-Variation-9740",
            "body": "Nej ingen amortering så länge jag studerar är väl tanken.",
            "score": 4,
            "created_utc": 1734946660.0
        },
        {
            "author": "LankyTradition6424",
            "body": "Amortering är inte en del av boendekostnaden. Den ska hon under inga omständigheter vara med och betala om hon inte samtidigt får andel i ägandet med motsvarande amorterat belopp.",
            "score": 2,
            "created_utc": 1734958474.0
        },
        {
            "author": "OrangeBliss9889",
            "body": "Exakt, det är ett girigt resonemang och ett försök att utnyttja dig OP.",
            "score": 4,
            "created_utc": 1734953892.0
        },
        {
            "author": "spisplatta",
            "body": "De är ju unga och har kanske inte funderat så mycket över ekonomiska frågor förut. Då är det inte självklart vem som är girig och snål. Kan mycket väl vara så att hon tror att det är OP som försöker utnyttja henne och därför sätter ner foten.",
            "score": 1,
            "created_utc": 1734963041.0
        },
        {
            "author": "C4-BlueCat",
            "body": "Har du koll på vad mat kostar?",
            "score": 2,
            "created_utc": 1734950314.0
        },
        {
            "author": "Svartvit1",
            "body": "Varför nedröstas detta? Detta är en fantastisk lösning på girig flickvän.  \n\nMen för att svara på din fråga OP, amortering är ett sparande till fördel för dig, ränta är en avgift för att du \"köpt\" lånet, hade hon betalat amortering hade man kanske behövt snacka om vinst, men ränta bör bara ses som pengar som behöver kastas i sjön varje månad och ingenting som kommer tillbaka senare.",
            "score": 4,
            "created_utc": 1734946479.0
        },
        {
            "author": "Erwigstaj12",
            "body": "Det inses ganska lätt att ditt förslag är orättvist om du tittar på siffrorna. 1000kr i boendekostnad existerar inte för människor som inte blir subventionerade.",
            "score": 4,
            "created_utc": 1734954287.0
        },
        {
            "author": "tischan",
            "body": "Håller definitivt med att de skall komma överens om ett samboavtal där lägenheten klar görs. \n\nTycker dock inte att ditt förslag är rättvist på långa vägar. \n\n50% av räntan och avgiften är mycket skäligt. Var är el, försäkring, bredband, renovering, risk att priset går ner etc.\n\nHon nämner inte att han ska får en del av vinsten för det kapital som hon kan investera? Vi pratar en halv lägenhet summa plus hon slipper amortering.",
            "score": 9,
            "created_utc": 1734949366.0
        },
        {
            "author": "Silvervarg",
            "body": "Detta! Hon ska inte betala av ett lån du valt att ta. Däremot rimligt att betala till föreningen för att få bo där. Hon ska också betala hälften av elen/bredband/mat et c. Sådant som krävs för att leva och som hon ändå skulle ha betalat om hon bodde själv.\n\n\n\nEftersom hon inte betalar lånet (ränta+amortering) ska hon inte ha del i eventuell vinst.\n\n\nDet bästa vore om hon kunde spara motsvarande andel som hon skulle betalat för det, till den dagen ni köper bostad gemensamt.\n\n\nGår ni skilda vägar så ha detta på papper enligt ovanstående talare.",
            "score": -1,
            "created_utc": 1734950128.0
        },
        {
            "author": "EishLekker",
            "body": "Räntekostnader är att se som en boendekostnad. \n\nÄven om man mot förmodan inte behöver låna pengar alls för köp av lägenhet så är det ändå pengar man låser in, och som man inte kan få avkastning på, på börsen eller bankkonto.",
            "score": 1,
            "created_utc": 1734951209.0
        },
        {
            "author": "Pythe1337n",
            "body": "Skriver ju att de inte amorterar, så betalar inte av en krona på lånet.",
            "score": 11,
            "created_utc": 1734947537.0
        },
        {
            "author": "larschanders",
            "body": "Hon betalar ju inte av hans bostad. Han amorterar inte",
            "score": 12,
            "created_utc": 1734946932.0
        },
        {
            "author": "hestenbobo",
            "body": "Hur är det rättvist att OP ska betala mer på avgiften+el bara för att han tjänar mindre pengar än henne?",
            "score": 2,
            "created_utc": 1734951028.0
        },
        {
            "author": "EishLekker",
            "body": "> Inte rättvis att hon betalar av räntan på ditt lån som hon inte kommer få tillbaka. \n\nVadå ”betalar *av*”? Betala av innebär att man minskar på lånet, dvs amortering. \n\nRäntan ses som en del av boendekostnaden.",
            "score": 1,
            "created_utc": 1734950895.0
        },
        {
            "author": "caelestis42",
            "body": "Då betalar hon också in halva förlusten till hans konto vid förlustförsäljning? Helt galet att hon bara skulle betala halva avgiften, det om något är småsint och gnidigt.",
            "score": 2,
            "created_utc": 1734950405.0
        },
        {
            "author": "Neither_Row1898",
            "body": "Fullt rimligt i och med att det grundar sig i bostadens värde. Vad det egentligen kostar om man inte binder kapital i bostaden. Hon har inte tagit lånet men nyttjar objektet för lånet, vilket är bostaden.",
            "score": 7,
            "created_utc": 1734947350.0
        },
        {
            "author": "differenthings",
            "body": "Han binder kapital, tar hela risken att värdet minskar, betalar nästan alla kostnader och hon betalar en avgift långt under marknadspris för hyra av motsvarande boende. Skön verklighet du lever i.",
            "score": 2,
            "created_utc": 1734957541.0
        },
        {
            "author": "finalina78",
            "body": "Läs texten",
            "score": 0,
            "created_utc": 1734947434.0
        },
        {
            "author": "oskich",
            "body": "Då får hon väl köpa in sig 50/50 på lånet också, räntan är ju bara en kostnad för att bo.",
            "score": 46,
            "created_utc": 1734947866.0
        },
        {
            "author": "LobL",
            "body": "Nej, det är en kostnad som du bär även i en hyresrätt. Risken för en BR är inköpspris vs försäljningspris.",
            "score": 9,
            "created_utc": 1734949761.0
        },
        {
            "author": "greenlightabove",
            "body": "Jo, men en mycket liten del av den. \nOm OP och hans föräldrar betalat 990 000kr i insats + ränta vid försäljning och flickvännen då betalat 10 000kr i ränta skulle hon kunna hända rätt till 1 % av vinsten. \n\nMen det förblir en vinst hon aldrig hade kunnat nå utan deras kapital, så inget hon självklart har rätt till. Frågan om hon är med och splittar ev förlust blir ju också väldigt relevant. \n\nSumma sumarum sjukt girig fråga av henne. Jag hade fan hoppat av lycka över att kunna bo i Stockholm för 4000kr i månaden.",
            "score": 13,
            "created_utc": 1734948587.0
        },
        {
            "author": "Resaren",
            "body": "Nej det är att betala för rätten att nyttja lägenheten, precis som en hyra. I en hyreslägenhet betalar din hyra bostadsägarens ränta, men inte förväntar du dig en del av värdeökningen som kompensation?",
            "score": 12,
            "created_utc": 1734948584.0
        },
        {
            "author": "MidnightSnackyZnack",
            "body": "Men alla hyresvärdar lägger räntan på den som hyr. Förstår inte varför detta är annorlunda? Hyrorna förändras beroende på räntorna. Det har vi väl sett ganska tydligt nu. De lägger ju även på för underhåll,slitage etc. Vilket OP också borde göra om han ska stå själv för reparationskostnader, egentligen?",
            "score": 14,
            "created_utc": 1734952398.0
        },
        {
            "author": "ResearcherOk7685",
            "body": "Situationen innebär att OP blir hennes hyresvärd. Hans kostnad för lägenheten är lånets ränta samt avgiften. Han hyr ut lägenheten till henne för halva den totala kostnaden. \nPå samma sätt som du inte får ta del av värdeutveckligen för en hyresvärds bostadsbestånd ska inte hon ta del av värdeutveckligen för lägenheten.",
            "score": 2,
            "created_utc": 1734963777.0
        },
        {
            "author": "vimpelvims",
            "body": "Precis, detta är viktigt",
            "score": 3,
            "created_utc": 1734957386.0
        },
        {
            "author": "Flamsoi",
            "body": "Det är klokt om ni har schysst ränta, då överstiger ändå börsens utveckling, inflation och värdeökning på bostaden själva räntan.",
            "score": 1,
            "created_utc": 1734957368.0
        },
        {
            "author": "EishLekker",
            "body": "Menar du att det är ett bättre eller sämre alternativ för OP?",
            "score": 2,
            "created_utc": 1734951016.0
        },
        {
            "author": "Apachez",
            "body": "Ja övriga driftskostnader kan man såklart ta med men här handlade det om lägenheten i sig och inte hur många kubikmeter varmvatten hushållet förbrukat etc. Dessutom är varmvatten, bredband, kabeltv etc många gånger redan inkluderar i brf-avgiften.\n\nOm hon vill köpa loss tex 50% av lägenhetens inköpspris för att därefter kunna ta del av 50% vid ev. försäljning så är det annan femma.\n\nKnepiga med sånt upplägg är vad som händer när hon eller du har vänstrat eller intresset för varandra har svalnat så ni inte längre är ett par?\n\nRätt ruttet att då även behöva lämna lägenheten du hade från tiden innan ni blev ihop eller tvingas ta lån för att köpa ut motparten.\n\nMest rättvisa och minst risk är att OP står kvar på lånet och hon får pröjsa 50% av dom gemensamma kostnaderna såsom:\n\n- BRF-avgiften.\n- Bredband (om den inte ingår).\n- Kabel-TV (om den inte ingår).\n- Varmvatten (om den inte ingår).\n- Mat\n- Gemensamma inköp till bostaden (köper ny soffa eller säng eller TV etc).\n\nSe till att upprätta ett sambo-avtal.\n\nSedan när ni bott ihop ett par år så kan OP antingen ändra ägarförhållandet för lägenheten till 50% genom att hon får betala 50% av inköpspriset och därmed även blir berättigad till 50% av framtida försäljningspris eller (vilket ger mindre huvudvärk särskilt den dagen ni går skilda vägar) flytta till nytt gemensamt boende som ni från början pyttsat in 50% vardera i.\n\nSån här är skittrist i början av en relation men \"you will thank me later\" den dagen ni går skilda vägar att då ha på papper ev. samboavtal, äktenskapsförord etc. Samma lika att inte skapa fler problem än vad du behöver från början.\n\nAtt flytta ihop är en stor grej och ger bara onödig huvudvärk att från dag 1 sätta sig i skiten.\n\nDvs ni kanske om 3 mån inser att det här med att bo ihop var inte något för er och har hon då bara pröjsat för BRF-avgiften och ev. driftskostnader så är det inga ekonomiska problem att lösa mellan er.\n\nMen om ni då redan har skrivit om ägarförhållandet för befintliga lägenheten så blir det inte bara att hon flyttar ut utan OP tvingas ta lån för att köpa loss henne eller tvingas själv flytta för att få faktiska försäljningspriset som sedan ska delas (samma lika om det blir kvarvarande skuld då ska den såklart också delas).",
            "score": 1,
            "created_utc": 1734951258.0
        },
        {
            "author": "Gastkram",
            "body": "Fast nu är ju inte ränta en avbetalning.",
            "score": 1,
            "created_utc": 1734957343.0
        },
        {
            "author": "SpaceCommissar",
            "body": "Förvisso sant, det missade jag, men jag hade aldrig hjälpt någon att betala av bostaden utan att få ta del av kakan sen.",
            "score": -5,
            "created_utc": 1734947095.0
        },
        {
            "author": "tthompa",
            "body": "Inser att jag skrev fel! Menade att om hans lön är högre än hennes så bör de räkna ut den procentuella skillnaden och sen betala därefter. Tänkte 60-40 förhållande till varandras löner, inte 60% av hennes lön som jag skrev. \nSå, om hans lön är 40.000 och hennes 30.000 av en avgift (utan räntan) på 7.000 borde han betala 4.000 och hon 3.000.",
            "score": 1,
            "created_utc": 1734951561.0
        },
        {
            "author": "tthompa",
            "body": "Jag ser det som en skillnad eftersom det inte är hon som köpt lägenheten, hon flyttar ju in till en lägenhet som han äger. Räntekostnaden är ju på lånet som han står på. Men väljer hon att köpa in sig i lånet och lägenheten är det rimligt att hon även betalar del av räntan. Inte annars.",
            "score": 2,
            "created_utc": 1734951871.0
        },
        {
            "author": "Barneyk",
            "body": "Att vara hyresvärd åt sin egen sambo är för mig helt sjukt.\n\nMen vi har väl olika syn på relationer.\n\nVi försäljning får man dela på kostnaderna om försäljningen inte täcker dom efter att kontantinsatsen dragits.",
            "score": 0,
            "created_utc": 1734951702.0
        },
        {
            "author": "Quiet_Fix9589",
            "body": "Om han hade hyrt ut till henne hade han inte fått ta betalt för räntan. Jag förstår inte varför det skulle skilja sig nu. I sådana fall är det bättre att låta henne köpa sig in på lägenheten så samtliga blir ägare.",
            "score": -1,
            "created_utc": 1734948890.0
        },
        {
            "author": "Glittering_Water3645",
            "body": "Allt det där gör han redan idag. Skillnaden är att han slipper betala halva bostadsrättsavgiften jämfört med idag så fortfarande en förbättring för hans egna ekonomi.\n\nSka man kräva att sin partner betalar hälften av allt så får man dela på ägandeskapet också på det sättet jag beskrev.",
            "score": 1,
            "created_utc": 1734957854.0
        },
        {
            "author": "Apachez",
            "body": "Fast så länge han står på 100% av lånet så har hon 0% risk i det hela.\n\nSkorpar det till sig så är det han som blir av med lägenheten och i värsta fall hamnar hos kronofogden och får betalanmärkningar etc.",
            "score": 6,
            "created_utc": 1734950486.0
        },
        {
            "author": "angry-adult",
            "body": "objektivt fel skulle jag säga. räntan betalar du för att du får låna pengar.",
            "score": 1,
            "created_utc": 1734952956.0
        },
        {
            "author": "Removable_speaker",
            "body": "Om du betraktar din sambo som hyresgäst i din lägenhet är det rätt att tänka så.  \nEtt annat sätt att tänka är att en sambo är en person man delar sitt liv med, inklusive sin ekonomi.  \nDet finns inte bara ett rätt svar här utan det beror på hur man ser på sin relation.",
            "score": 12,
            "created_utc": 1734952776.0
        },
        {
            "author": "already_tomorrow",
            "body": ">Men alla hyresvärdar lägger räntan på den som hyr. \n\nHyresvärdar är vinstdrivande, ska en pojkvän verkligen hantera flickvännen som ett redskap för att skapa vinst?!",
            "score": 2,
            "created_utc": 1734955727.0
        },
        {
            "author": "tischan",
            "body": "Instämmer men tycker att hon ska köpa in sig så borde det vara till dagens pris. Har skett mycket på senaste åren finns vissa bostäder som tappat värde och vissa som gått upp. Lika bra att göra en/två värderingar. \n\nAtt flytta ihop är idag med dagens sambo regler ett juridiskt ekonomiskt beslut och bör hanteras som det.",
            "score": 1,
            "created_utc": 1734960097.0
        },
        {
            "author": "Silvervarg",
            "body": "Nej, det är ingen avbetalning, håller jag med om. \n\n\nMen hur mycket inflytande över lånet skulle du ge till den som betalar halva kostnaden för det? Jag tycker det berättigar ännu mer till del av vinsten. Hade känts som att jag bekostar någon annans lån utan att få något tillbaka.\n\nJag tycker: krångla inte till ekonomin, låt henne betala för saker som hon har/kan få inflytande över (jag liknar avgiften till föreningen som \"hyra för att bo i huset\" så delas lika av den anledningen).\n\nEller, om man kan tänka sig göra det mer rättvist, göra som föreslås längre ned och låta den som flyttar in köpa in sig och därmed vara lika ansvarig. Flyttar man isär så är det tydligt vad som gäller: köp ut den andra.\n\nEller sälj lgh och köp en ny 50:50.",
            "score": 1,
            "created_utc": 1734964198.0
        },
        {
            "author": "differenthings",
            "body": "Vilket hon alltså inte skulle göra. Såatte.",
            "score": 9,
            "created_utc": 1734947332.0
        },
        {
            "author": "finalina78",
            "body": "Men i detta fall är det ett icke-problem eftersom de ju inte amorterar",
            "score": 8,
            "created_utc": 1734947366.0
        },
        {
            "author": "EishLekker",
            "body": "Problemet verkar vara större än att du ”missat” något. Du har helt enkelt inte förstått att inbetalning av ränta inte är att ”betala av” något. \n\nRäntan är en kostnad för att ha lånet, och lånet krävs för att kunna bo där. Det är således en kostnad för att bo där. \n\nFör att kunna ha anspråk på en eventuell framtida vinst så behöver hon antingen lagt in en del av insatsen själv, eller att hon betalar en del av amorteringen. Plus att hon måste vara beredd på att hon även är delansvarig för en eventuell förlust.",
            "score": 1,
            "created_utc": 1734951607.0
        },
        {
            "author": "EishLekker",
            "body": "Räntekostnaderna är för hela lånet, som är för hela lägenheten. Hon använder en del av lägenheten genom att bo där. Således är det rimligt att hon står för en del av kostnaderna. \n\nAlternativet är att hon blir inneboende rent juridiskt, och betalar en hyra där han har rätt att ta ut en avkastningsränta. Det skulle garanterat bli dyrare för henne.",
            "score": 2,
            "created_utc": 1734952686.0
        },
        {
            "author": "vimpelvims",
            "body": "Vadå hyresvärd?\nDet handlar väl om att dela på kostnader som en lägenhet kostar?\n\nAtt dela på avgift + halva räntan efter ränteavdrag är det rimliga.\n\nDet är den fasta avgiften för lägenheten. De amorterar ju inte, så det är ju ingenting som han får tillbaka.\n\n\nOm de får nyttja lägenheten likadant så ska väl kostnaderna delas lika? Varför ska han betala mer när hon bor där lika mycket?\n\n3100kr blir det för henne i detta fallet. Vilket är en rimlig kostnad.\n\nAtt han får vinsten vid försäljning handlar ju inte om räntan eller avgiften utan det kapital som han lagt in vid köp av lägenheten. Han står ju för en risk med det kapitalet samt de pengar han lånat, han kan förlora pengar eller tjäna pengar. Men det har ju inget med avgiften eller räntan att göra.\n\nAtt glida in på en räkmacka och pröjsa 1000kr för att bo känns som riktiga Ove Sundberg fasoner\n\n\nOm de hade bott i en hyresrätt ska hon inte betala någonting då? Det är ju förenings lånekostnader\n\n\nPrecis som avgiften vid en bostadsrätt så det det mesta föreningens lånekostnader.\n\nMan gör ju ett aktivt val när man flyttar någonstans, är det för dyrt eller ej.\nMen du kan ju inte sitta och snylta på din sambo för att du vill bo bättre än du gör. #leech",
            "score": 2,
            "created_utc": 1734957752.0
        },
        {
            "author": "caelestis42",
            "body": "kanske. jag tycker man ska dela lika eller så rättvist det går.",
            "score": 1,
            "created_utc": 1734961874.0
        },
        {
            "author": "Neither_Row1898",
            "body": "> Om han hade hyrt ut till henne hade han inte fått ta betalt för räntan. Jag förstår inte varför det skulle skilja sig nu. \n\nDet stämmer, hyr man ut så får man inte ta betalt för bankens aktuella effektiva utlåningsränta. Räntekostnaden, avgiften för lånet, är ett bindande avtal mellan banken och låntagaren. Hyresgästen och banken har inget avtal, således har hyresgästen inte heller möjlighet att påverka räntekostnaden genom amortering eller bindningstid. Hyresvärden får därför inte ta betalt för aktuell effektiv utlåningsränta gentemot hyrestagare.\n\nDet man istället gör vid ett hyresavtal är att ta hänsyn till bostadens värde, Kapitalkostnaden, den beräknas som en skälig, årlig avkastningsränta på bostadens marknadsvärde. Det spelar ingen roll om hyresvärden har fått bostaden gratis, betalat den kontant eller lånat pengar. Kapitalkostnaden tar inte hänsyn till bankens aktuella effektiva utlåningsränta.\n\nSe ’§ 4 Andra stycket Lag (2012:978) om uthyrning av egen bostad\n\nVid en tvist om hyran ska hyresnämnden, om inte en högre hyra följer av en prövning enligt 12 kap. 55 § jordabalken, fastställa den till ett belopp som inte påtagligt överstiger kapitalkostnaden och driftskostnaderna för bostaden. Kapitalkostnaden beräknas som en skälig avkastningsränta på bostadens marknadsvärde. Hyresnämnden får dock inte fastställa en högre hyra än vad som följer av hyresavtalet.’\n\n> I sådana fall är det bättre att låta henne köpa sig in på lägenheten så samtliga blir ägare.\n\nJa, absolut det är en god idé.",
            "score": 1,
            "created_utc": 1734951280.0
        },
        {
            "author": "hestenbobo",
            "body": "Kapitalkostnader får du visst räkna med när du sätter hyra.",
            "score": 1,
            "created_utc": 1734951511.0
        },
        {
            "author": "EishLekker",
            "body": "> Om han hade hyrt ut till henne hade han inte fått ta betalt för räntan. \n\nVad är den stora skillnaden mellan det, och att ta ut en skälig avkastningsränta, vilket är helt lagligt?\n\nFaktum är att evigt lagen har kan rätt att begära mer pengar om hon slutar ses som inneboende som betalar hyra. Blir det bättre för henne då?",
            "score": 1,
            "created_utc": 1734951906.0
        },
        {
            "author": "differenthings",
            "body": "Att dela på ägarskapet är naturligtvis ett alternativ. Utöver det kan man lägga upp kostnaden på tusen olika sätt så länge alla är med på det men om målet är att det ska bli 50/50 rättvist så är det bisarrt att tro att halva avgiften räcker. Att OP haft kostnaden ändå är ju ett nytt kreativt sätt att motivera det hela som naturligtvis går åt båda hållen - vad skulle flickvännen betala om hon INTE bodde hos OP? Tänker du likadant om OP skulle hyra ut ett rum? Att endast halva avgiften är nog som hyra.\n\nVad sker om lägenheten är avgiftsfri (som är fallet i flera föreningar med bra läge) och lånet är 10 miljoner? Är det rättvist att ena parten betala hela den höga kostnaden och tar hela risken då medan den andre bor gratis (de hade ju haft kostnaden ändå).",
            "score": 1,
            "created_utc": 1734959301.0
        },
        {
            "author": "Resaren",
            "body": "Det stämmer att räntan är priset banken kräver för att täcka deras risk. Men risken för låntagaren ligger i skulden, dvs lånekapitalet, och hur det är investerat. OPs partner är ingen låntagare och bär således inte den väsentliga delen av risken. Hon bär en liten del av risken i form av risken för ränteökning som kan omvandlas till en hyresökning, eller risken att tvingas flytta om OP inte kan betala tillbaka bolånet. Men detta är jämförbart med den (låga) risknivå en vanlig hyresgäst tar, och de förväntar sig inte en del av bostadens värdeökning som kompensation. Den dealen finns inte på marknaden, för att det är en dålig deal för bostadsägaren och går inte ihop matematiskt.",
            "score": 2,
            "created_utc": 1734958171.0
        },
        {
            "author": "MidnightSnackyZnack",
            "body": "Ursäkta mig men det är OPs tjej som förväntar sig vinst på hans affär och han verkar inte OK med det så jag bara lyfter båda sidorna på myntet.",
            "score": 9,
            "created_utc": 1734953196.0
        },
        {
            "author": "ResearcherOk7685",
            "body": "Med den rationalen borde hon köpa in sig i lägenheten så att hon kan ta del även om den går med förlust. Som det är nu låter det som om hon vill betala bara 12.5% av den faktiska kostnaden, utan att ta någon risk. Det är inte särskilt schysst och solidariskt av henne i ett samboförhållande.",
            "score": 2,
            "created_utc": 1734963854.0
        },
        {
            "author": "MidnightSnackyZnack",
            "body": "Så de betalar inte räntor för att de är vinstdrivande eller vad menar du? Jag har inte någonstans påstått att han ska tjäna pengar på henne. \n\nMen det går på båda hållen. Man kan också sätta saker i lite perspektiv, 4k kontra vadå, 8k för några kvadrat att bo på själv? Bara tänker fritt nu men det hade ju låtit henne spara mer än om hon hade betalat 6+ i månaden om hon bott i egen lägenhet. Pengar hon hade kunnat lägga undan och spara, börsen etc. OP sitter i en bra sits (bostadsmässigt) och hon förväntar sig att ta del av det oavsett vad.\n\nSom jag skrev tidigare, jag lyfter bara båda sidorna på myntet. Personligen så hade jag värderar bostaden och låtit henne köpa in sig i bostaden om hon velat enligt värderingen de kommit överens om.\n\n\nAlternativt sålt bostaden illa kvickt och betalat alla kostnader inklusive hennes del av avgiften för att slippa eventuella tjafs i framtiden, sen köpt tillsammans.\n\nKomplicerade saker tycker jag. Tro det eller ej men jag tycker också att man ska kunna dela på allt rakt upp och ner osv osv men verkligenheten är inte alltid så och känslor gör ju allting mer komplicerat så klart.",
            "score": 2,
            "created_utc": 1734956619.0
        },
        {
            "author": "ResearcherOk7685",
            "body": "Det är inte vinstdrivande när hon betalar hälften av den faktiska boendekostnaden.  \nHon vill betala 1000 spänn av den faktiska boendekostnaden på 8000, du tycker väl för fan inte på allvar att det är ett schysst beteende och så man behandlar någon man älskar?",
            "score": 1,
            "created_utc": 1734964083.0
        },
        {
            "author": "tthompa",
            "body": "Ja det har du faktiskt rätt i, är villig att ändra min åsikt! Då anser jag att räntan bör delas procentuellt enligt löneskillnaderna minus det 30% avdragsgiltiga.",
            "score": 2,
            "created_utc": 1734953424.0
        },
        {
            "author": "Quiet_Fix9589",
            "body": "Utifrån en schablon ja. Inte räntan i sig.",
            "score": 1,
            "created_utc": 1734952602.0
        },
        {
            "author": "Glittering_Water3645",
            "body": "Amorteringen tycker jag låninnehavaren ska stå till 100% för. Det är ju ett belopp som betalar av den privata skulden och blir så pass en betalning till sig själv. Att någon annan skulle betala den kostnaden anser jag vara orimligt.\n\nSen kan man inkludera räntekostnaden i delad boendekostnad tillsammans med bostadsrättsavgift, absolut. Det är lite av en gråzon om trådskaparen vill äga boendet till 100%.\n\nJag hade åtminstone krävt hälften av bostadsrättavgiften, matavgifter, reparationer, elavgiften, VVS-avgifter, hemförsäkringen och abonnemang båda nyttjar även då jag äger boendet till 100%.",
            "score": 1,
            "created_utc": 1734960223.0
        },
        {
            "author": "already_tomorrow",
            "body": "Inte på hans affär som hänt tidigare, utan på investeringen som händer varje månad. Du måste ta i beräkning att hon kommer gå miste om värdeökningen i en egen bostad under den tid som de är meningen att vara ett par för resten av livet.",
            "score": 0,
            "created_utc": 1734955661.0
        },
        {
            "author": "hestenbobo",
            "body": "Inte är direkt bundet till låntagarens räntekostnad men en högre kostnad än den faktiska räntekostnaden i de allra flesta fall. I och med att OP inte amorterar vet vi att belåningsgraden är under 50% så för att kapitalkostnaden ska vara mindre än räntekostnaden krävs att bostad tappat väldigt mycket i värde.",
            "score": 1,
            "created_utc": 1734953407.0
        },
        {
            "author": "MidnightSnackyZnack",
            "body": "Ursäkta mig igen men ränta tycker jag mer tillhör boendekostnad än investering även om jag inte tycker du har helt fel.",
            "score": 0,
            "created_utc": 1734956777.0
        }
    ]
}