{
    "post_title": "Weihnachtsmarkt / Christmas market Megathread!",
    "post_author": "paulihunter",
    "post_score": 16,
    "post_url": "https://www.reddit.com/r/hamburg/comments/1gqes91/weihnachtsmarkt_christmas_market_megathread/",
    "comments": [
        {
            "author": "muuhsz",
            "body": "Vielleicht mal ne andere Frage als \"wo gibt's den besten Glühwein\"...\n\nGibt es eine Übersicht, wo man für ein paar Leute Plätze reservieren kann oder könnt ihr was empfehlen?\nIch habe schon solche Fässer auf Märkten aller Art gesehen oder auch gesehen, dass man Hütten teilweise reservieren kann. Hat jemand Erfahrungen damit?",
            "score": 6,
            "created_utc": 1731522484.0
        },
        {
            "author": "MineRevolutionary595",
            "body": "Wo gibt es denn schönes Kunsthandwerk und nicht nur die Standardware (Kerzen, Weihnachtssterne, etc,), die es so vermutlich bundesweit gibt?",
            "score": 4,
            "created_utc": 1731568909.0
        },
        {
            "author": "Mountain_Cicada_3694",
            "body": "Nachdem schon nach dem besten Glühwein gefragt wurde: Wo gibts denn die besten Crêpes, gebrannten Mandeln oder Champignonpfannen/Grünkohl mit Pinkel? Ich futter mich gern durch Weihnachtsmärkte, mit Winterspeck wirds nicht so schnell kalt.",
            "score": 3,
            "created_utc": 1732227148.0
        },
        {
            "author": "Pory02",
            "body": "Weiß jemand, ob es dieses Jahr irgendwo Langos gibt? Las jetzt nur angeblich auf dem DOM, der endet aber bald. Hoffte auf dem Weihnachtsmarkt beim Rathaus, da gab es aber nur was ähnliches namens Pfaffenglück.",
            "score": 3,
            "created_utc": 1733411322.0
        },
        {
            "author": "Pory02",
            "body": "Oh geile Idee! Ich wollte schon letztes Jahr ne Weihnachtsmarkt Tour machen, was dann nicht klappte. Das wird mir helfen! :D",
            "score": 2,
            "created_utc": 1731529031.0
        },
        {
            "author": "mysterystruggle",
            "body": "Weiß jemand weihnachtsmärkte auf denen es Baumstrietzel  zu kaufen gibt?",
            "score": 2,
            "created_utc": 1732715925.0
        },
        {
            "author": "supergraeme",
            "body": "Hello all. Do the bigger markets have bars that sell beer?",
            "score": 2,
            "created_utc": 1733231561.0
        },
        {
            "author": "DryTumbleweed5310",
            "body": "Welchen Weihnachtsmarkt findet ihr am schönsten und warum? :) Also von der Atmosphäre her, ein Markt auf den ihr immer wieder am liebsten geht?",
            "score": 2,
            "created_utc": 1733430575.0
        },
        {
            "author": "Marthiel",
            "body": "Bin auf der Suche nach den besten Käse Spätzle auf einem HH Weihnachtsmarkt. Hat jemand eine Empfehlung?",
            "score": 2,
            "created_utc": 1733781592.0
        },
        {
            "author": "Pory02",
            "body": "Habe endlich Langos gefunden! In Bergedorf bei dem Abschnitt wo diese alte Burg ist. Da haben sie auch bayrischen Döner! Sehr lecker!",
            "score": 2,
            "created_utc": 1734453041.0
        },
        {
            "author": "TroubleBubble29",
            "body": "StrandPauli ist ein recht kleiner Markt und ich glaube gut für gemütliches Beisammensitzen. Ich wollte nach Geschenken gucken und es gab nur zwei Stände, die nichts mit Essen zu tun hatten. Also war ne kurze Runde rüber😄",
            "score": 2,
            "created_utc": 1731530216.0
        },
        {
            "author": "Secret_Writing8805",
            "body": "Hi\nI’m a YouTuber and I’m looking for someone, preferably a girl, who would like to join me and explain the Christmas market and the city of Hamburg to me. Who’s interested?",
            "score": 1,
            "created_utc": 1733395939.0
        },
        {
            "author": "dk7as",
            "body": "https://www.fleetweihnachtsmarkt.de/weihnachtsfeier/\n\nDie haben da ein riesen Zelt und so kleine Lounges... Vllt kann man da auch für Gruppen reservieren.",
            "score": 2,
            "created_utc": 1731648656.0
        },
        {
            "author": "American_Streamer",
            "body": "Die vier hier einmal ausprobieren - aber keine Garantie, dass es die Sachen dann nicht auch am Ende bundesweit gibt:\n\n[https://marktplatz-der-manufakturen.com/events](https://marktplatz-der-manufakturen.com/events)\n\n[https://www.st-michaelis.de/gemeinde/weihnachtsmarkt-am-michel](https://www.st-michaelis.de/gemeinde/weihnachtsmarkt-am-michel)\n\n[https://www.hamburg.de/tourismus/weihnachten-hamburg/weihnachtsmarkt-hamburg/adventsmesse-koppel-66-307168](https://www.hamburg.de/tourismus/weihnachten-hamburg/weihnachtsmarkt-hamburg/adventsmesse-koppel-66-307168)\n\n[https://advents-norderstedt.de](https://advents-norderstedt.de)",
            "score": 3,
            "created_utc": 1731587587.0
        },
        {
            "author": "Pory02",
            "body": "Ich hatte gestern beim Jungfernstieg Kaminbrot, aber das war deftig. Den Kuchen fand ich jetzt nicht, aber wir haben in Hamburg nen eigenen Laden dafür. [Trdlo-Factory](https://trdlo-factory.de/).",
            "score": 2,
            "created_utc": 1733410966.0
        },
        {
            "author": "Pory02",
            "body": "Some could have \"Glühbier\". A hot beer. But mostly it is \"Glühwein\". It is Christmas. People like to drink something else there but I'm sure some also have beer. Look around and ask. ^^",
            "score": 2,
            "created_utc": 1733410712.0
        },
        {
            "author": "paulihunter",
            "body": "Nice! Danke fürs Update und freut mich das du gefunden hast wonach du suchst. Bist du jetzt extra von Weihnachtsmarkt zu Weihnachtsmarkt gepilgert?",
            "score": 2,
            "created_utc": 1734454940.0
        },
        {
            "author": "DeineZehe",
            "body": "Gleiches für wandsbeker „winterzauber“ das ist echt ein Trauerspiel. Da gibt es allerdings nur fressbuden und eine plastikbahn für Schlittschuhe Bratwurst im Brötchen dafür nur 7€ /s",
            "score": 5,
            "created_utc": 1731566104.0
        },
        {
            "author": "Pory02",
            "body": "Dude, why a girl? That sounds like you only want to use your \"status\" to have an easier way on her!",
            "score": 3,
            "created_utc": 1733410550.0
        },
        {
            "author": "Pory02",
            "body": "Jap. Und das unter schmerzen. 8D\" Wollte das letztes Jahr schon machen und dann brach ich mir das Bein paar Tage vor Weihnachten. 8D",
            "score": 2,
            "created_utc": 1734457882.0
        },
        {
            "author": "CMYKawa",
            "body": "Der Winterzauber ist echt nur für die Leute, die nicht abwarten können (öffnet immer schon am 1. November) und für eben nen überteuerten Glühwein trinken.\n\nCrêpes und Mandeln waren diesmal echt unterirdisch.",
            "score": 3,
            "created_utc": 1731568834.0
        },
        {
            "author": "Secret_Writing8805",
            "body": "Just make a video about a Christmas market. When the video is made up of a girl and a boy, the video is beautiful",
            "score": 1,
            "created_utc": 1733421133.0
        },
        {
            "author": "EnvironmentalWing597",
            "body": "Ja, alles unterirdisch. Wir wollten da mal Eggnog trinken (oder das was die als so etwas angeboten haben). Wir sind dann nach Hause und haben uns unseren Eggnog selbst gemacht.",
            "score": 3,
            "created_utc": 1731598036.0
        }
    ]
}