{
    "post_title": "this scammer found me 🤦‍♂️",
    "post_author": "Wooden-Secret5698",
    "post_score": 97,
    "post_url": "https://www.reddit.com/r/Barcelona/comments/1hjyjsr/this_scammer_found_me/",
    "comments": [
        {
            "author": "DisciplineSevere438",
            "body": "What did he take from you?",
            "score": 19,
            "created_utc": 1734874664.0
        },
        {
            "author": "Traditional-Hunt4040",
            "body": "I have become heavily invested at this point, any tips as to where I can spot this guy?",
            "score": 17,
            "created_utc": 1734878324.0
        },
        {
            "author": "nychearts812",
            "body": "Imagine if this infamous Irish guy put as much effort into getting an actual ‘acting’ job how successful he could be …\n\n![gif](giphy|hICcvNYh7VQjiCq8dC|downsized)",
            "score": 44,
            "created_utc": 1734875542.0
        },
        {
            "author": "CptRicardo",
            "body": "Living in the area for 10 years and I never had the luck to meet this Irish actor.",
            "score": 5,
            "created_utc": 1734878997.0
        },
        {
            "author": "No_Refrigerator_2917",
            "body": "Yeah the Irish nitwit is still around.",
            "score": 6,
            "created_utc": 1734879390.0
        },
        {
            "author": "carleschorda",
            "body": "He disappears and resurfaces but once he’s back, I see him every couple weeks either around gran via/urgell or pl letamendi areas.",
            "score": 6,
            "created_utc": 1734879722.0
        },
        {
            "author": "Yisus_of_Hentai",
            "body": "He got me a couple weeks ago, and found him again the week later. It's saddening seeing him using his wit for that but well, he teaches naive guys like me a good lesson for a cheap price...",
            "score": 4,
            "created_utc": 1734893944.0
        },
        {
            "author": "deliso1",
            "body": "He got me about 1 year ago near metro Urgell. It's almost comforting how good he was, I tell myself he deserved the 10€ just for the story and acting.",
            "score": 4,
            "created_utc": 1734905626.0
        },
        {
            "author": "WhichBrick9784",
            "body": "He got me a couple of months ago in passeig de gracia. Told me he was robbed upon arrival and couldn’t find his hotel. Let him call someone off my phone who he claimed was his mum but I didn’t really believe it. I didn’t give him any cash but was very suspicious",
            "score": 3,
            "created_utc": 1734890101.0
        },
        {
            "author": "wmbrum",
            "body": "Yeah we had someone who did this as a full time job in my hometown Redditch. He used to run around asking for money because his car was broken down in a different town and needed whatever you could spare to get him there. After 10yrs and many disguises the story ran thin. Tbh the effort he put in it would have been easier having a full time job. Remember to help but not give.",
            "score": 3,
            "created_utc": 1734914832.0
        },
        {
            "author": "Just4kicks19",
            "body": "I remember the American guy in a suit jacket who would sit at plaza catalunya and pull that.",
            "score": 2,
            "created_utc": 1734889279.0
        },
        {
            "author": "kingpashmina",
            "body": "happened to me too lol. i saw him again near eixample the other day! pathetic life",
            "score": 2,
            "created_utc": 1734906149.0
        },
        {
            "author": "Adventurous_Mood2652",
            "body": "Wow i think this guy approached me a couple of times in Rotterdam a few years back",
            "score": 2,
            "created_utc": 1734917914.0
        },
        {
            "author": "SwedishConan",
            "body": "Pictures?",
            "score": 2,
            "created_utc": 1734938718.0
        },
        {
            "author": "iTeachClassics",
            "body": "Just take it as you would've paid for the performance. Which apparently was pretty good if you gave him money.",
            "score": 1,
            "created_utc": 1734886008.0
        },
        {
            "author": "nmurgui",
            "body": "I saw some guy like this in universitat subway asking around and also in arc de triomf. \n\n\nWhat's he like? The one I saw was redhead, mohicano fade hairstyle, 1.78m or so",
            "score": 1,
            "created_utc": 1734954183.0
        },
        {
            "author": "sebastiansmit",
            "body": "Oh shit, met this guy at the start of september",
            "score": 1,
            "created_utc": 1734961927.0
        },
        {
            "author": "peludosinfe",
            "body": "His heart",
            "score": 60,
            "created_utc": 1734874907.0
        },
        {
            "author": "520throwaway",
            "body": "I once found him along gran via. Dude does NOT look like what you might think a Irish person would look like.",
            "score": 8,
            "created_utc": 1734882022.0
        },
        {
            "author": "The_Primate",
            "body": "He's quite a nasty fucker tbh. Once he realises that his routine isn't working he can turn quite hostile. He's a junkie and a wrong 'un, best avoided.",
            "score": 8,
            "created_utc": 1734895329.0
        },
        {
            "author": "Baduixerx3000",
            "body": "Found him in street enric granados with consell the cent I suppose he would be in that area, the mf tricked the fuck out of me",
            "score": 9,
            "created_utc": 1734879246.0
        },
        {
            "author": "Beautiful-Building30",
            "body": "He approached me alone on a bench opposite Universitat. Assuming be alone and have luggage and a phone might attract the guy.",
            "score": 4,
            "created_utc": 1734890925.0
        },
        {
            "author": "SaucerShot",
            "body": "Odds are that you have seen him but not identified him if you are in eixample. Ive seen him like 4 times already.",
            "score": 1,
            "created_utc": 1734961774.0
        },
        {
            "author": "ZingBotDingus",
            "body": "He has dark brown hair and usually wears it up in a bun.",
            "score": 1,
            "created_utc": 1734958836.0
        },
        {
            "author": "Dano-D",
            "body": "And the very next day he gave it away",
            "score": 26,
            "created_utc": 1734887916.0
        },
        {
            "author": "Silent_Property_2302",
            "body": "Agreed…\n\nI’m Irish myself and I was surprised that this guy had an Irish accent. \n\nHe does not look like a stereotypical Irish person.\n\nIt was late at night when he approached me and before I heard his Irish accent I would have thought he was Moroccan or maybe Indian? \n\nNot sure exactly but he must have grown up in Ireland as he seems to have a cork accent from Ireland\n\nI told him I couldn’t help and he got aggressive with me and started shouting saying how could I not help another Irish person \n\nThe only reason I didn’t help him out was because I suspected he was the same person that is always mentioned in this group",
            "score": 17,
            "created_utc": 1734887657.0
        },
        {
            "author": "Adventurous-Air-9656",
            "body": "This year, to save him from tears",
            "score": 14,
            "created_utc": 1734890189.0
        },
        {
            "author": "520throwaway",
            "body": "It is possible to learn and accurately fake accents. Professional actors do this all the time.",
            "score": 4,
            "created_utc": 1734888360.0
        },
        {
            "author": "peludosinfe",
            "body": "He'll give it to someone special",
            "score": 15,
            "created_utc": 1734890505.0
        },
        {
            "author": "ht_825",
            "body": "I’m pretty sure he’s not actually Irish, he puts too much emphasis on it like no other Irish person ever has",
            "score": 4,
            "created_utc": 1734914539.0
        }
    ]
}