{
    "post_title": "En av mina favoritbilder från min resan - Slakthusområdet ",
    "post_author": "ShroomEnthused",
    "post_score": 36,
    "post_url": "https://i.redd.it/ixs6t60blg8e1.jpeg",
    "comments": [
        {
            "author": "Real_Razzmatazz_3186",
            "body": "Det finns något fint och rogivande med områden i stan som känns lite övergivna på något sätt. Säkert för att man är en torsk för sci-fi dystopier (tex Bladerunner). Det är som en egen ensam värld mitt i smeten bara några steg från vardagsstressen.",
            "score": 17,
            "created_utc": 1734899680.0
        },
        {
            "author": "Stokholmo",
            "body": "Till höger går Hallgränd. Rakt fram ses Stora Skorstensgatan, med dess stora skorsten. Byggnaden till höger uppfördes 1907–1912, med flera senare ombyggnader. Har använts för diverse verksamheter inom slakt och kötthantering. Det finns inte längre något slakthus i området.\n\nByggnaden till vänster byggdes 1986–1988 för Bankgirocentralen. Då innebar betalningar hantering av stora mängder papper och det krävdes en ganska stor byggnad. Numera går byggnaden under namnet Palmfelt Center, med flera olika hyresgäster.",
            "score": 11,
            "created_utc": 1734902092.0
        },
        {
            "author": "Purple_Cat9893",
            "body": "Nu minns jag varför jag var full senast jag var på den där gatan.",
            "score": 3,
            "created_utc": 1734900623.0
        },
        {
            "author": "Spare-Stay1892",
            "body": "Stora Skorstensgatan represent!",
            "score": 3,
            "created_utc": 1734901835.0
        },
        {
            "author": "Aintandsmall",
            "body": "Jag kommer ihåg när jag skulle till hus7 eller vad det var. Gick från gullmarsplan för att sedan möta ett jävla staket som jag fick gå runt efter en evighet för att sedan inse att Globens station låg precis vid hus7 i praktiken.",
            "score": 2,
            "created_utc": 1734934165.0
        },
        {
            "author": "SpringFuzzy",
            "body": "Det är ok att säga att du är deprimerad, det finns stöd att få.",
            "score": 6,
            "created_utc": 1734899312.0
        },
        {
            "author": "veganchilean",
            "body": "Jag har gått där mååånga gånger tidigt på morgonen. Alla mina polare har frågat mig hur jag vågar, då det är bara skumma typer som går där dom tiderna. Jag har då svarat \"exakt därför\" och lett rått. De har då varit märkvärdigt tysta.... nästan högljud tystnad. Uuuuundrar varför. Hihiiii",
            "score": 1,
            "created_utc": 1734939741.0
        },
        {
            "author": "copperwoods",
            "body": "Olle Häger?",
            "score": 2,
            "created_utc": 1734908007.0
        },
        {
            "author": "ShroomEnthused",
            "body": "Tack så jättemycket för beskrivningen!",
            "score": 1,
            "created_utc": 1734911672.0
        },
        {
            "author": "ShroomEnthused",
            "body": "Varför saga du det? Jag tror att det ett skämt, men jag hade verkligen den bästa tiden i mitt liv där! (stockholm) 😂",
            "score": 6,
            "created_utc": 1734901588.0
        },
        {
            "author": "SuperUranus",
            "body": "Är ju bara sköna människor i Slakthusområdet.\n\nAtt kolla på soluppgången från Slakhusets terrass en fin, varm sommarkväll tillsammans med massor dansvänliga människor som är höga på ecstacy är bara mysigt.",
            "score": 2,
            "created_utc": 1734947893.0
        },
        {
            "author": "Stokholmo",
            "body": "Nej. Han är död.",
            "score": 1,
            "created_utc": 1734949930.0
        },
        {
            "author": "veganchilean",
            "body": "Precis min åsikt, jag låter dom tro på sin åsikt",
            "score": 1,
            "created_utc": 1734959162.0
        },
        {
            "author": "copperwoods",
            "body": "Jo, fast han kan ju vara en källa till inspiration ändå? Hur som, kul att hans berättarstil lever vidare!",
            "score": 1,
            "created_utc": 1734955691.0
        }
    ]
}