{
    "post_title": "Anyone else notice how good the WiFi on the tube is today?",
    "post_author": "sharj94",
    "post_score": 36,
    "post_url": "https://www.reddit.com/r/london/comments/1hkkw4g/anyone_else_notice_how_good_the_wifi_on_the_tube/",
    "comments": [
        {
            "author": "are_wethere_yet",
            "body": "Most other Tube-like systems have 4/5G in the tunnels… we struggle to get signal even when it’s above ground (e.g. the Osterley dead spot).",
            "score": 48,
            "created_utc": 1734949825.0
        },
        {
            "author": "jmr1190",
            "body": "International tourists generally wouldn't have access to tube wifi anyway, I wouldn't have thought. Some with a local sim might, but that's a low proportion, and the proportion of those that are accessing the wifi is even lower.",
            "score": 5,
            "created_utc": 1734954420.0
        },
        {
            "author": "CrabbyKrabs",
            "body": "I prefer to disable WiFi when on the tube and just use 4G/5G - it connects much much faster and have had download speed of over 100MB even in the tunnel section. I even do all my apps update while on the tube thesedays 😊😊",
            "score": 6,
            "created_utc": 1734954482.0
        },
        {
            "author": "MissionFig5582",
            "body": "Yeah man, I celebrated by face-timing mum for the whole journey home. She talks really loudly these days as her hearing is going, but nobody seemed to mind.",
            "score": 3,
            "created_utc": 1734955744.0
        },
        {
            "author": "findthemistke",
            "body": "But what’s the password ?",
            "score": 0,
            "created_utc": 1734949465.0
        },
        {
            "author": "Gooooglemale",
            "body": "The mobile coverage is getting better! Decent stretch of the northern line has it now.",
            "score": 15,
            "created_utc": 1734950207.0
        },
        {
            "author": "secretlondon",
            "body": "The locals probably campaigned against masts",
            "score": 2,
            "created_utc": 1734960471.0
        },
        {
            "author": "BradlinhoM",
            "body": "The subsurface lines are the most annoying ones for me. Like we're only just below the roads why is there no 4/5g and even the TfL wifi doesn't work!",
            "score": 2,
            "created_utc": 1734954419.0
        },
        {
            "author": "Accurate_Prompt_8800",
            "body": "Osterley dead spot is horrible. I thought it was just my network, so it’s not just me!",
            "score": 1,
            "created_utc": 1734950118.0
        },
        {
            "author": "OxbridgeDingoBaby",
            "body": "Osterley? I get good reception there on both Vodafone and O2. The only part I hate is when you go into the tunnel at Earls Court and then (I think?) to Green Park there is no reception or 4G/5G service annoyingly.",
            "score": 1,
            "created_utc": 1734950474.0
        },
        {
            "author": "RFCSND",
            "body": "I guess it depends who they are piggybacking off",
            "score": 1,
            "created_utc": 1734956706.0
        },
        {
            "author": "ramakitty",
            "body": "This is what's so frustrating about wifi on the tube - it could be so good but the authentication is so slow by the time you've connected you've started to leave the station. If anyone from TFL is reading, please implement 802.11k/v/r on your wifi APs or similar!",
            "score": 7,
            "created_utc": 1734954736.0
        },
        {
            "author": "polkadotska",
            "body": "Hunter2",
            "score": 5,
            "created_utc": 1734950360.0
        },
        {
            "author": "trooperer",
            "body": "They paused the expansion for some reason though? Hopefully they will continue soon, I need that gap between Camden and KX filled 😁 oh and that tiny drop around Highgate as well",
            "score": 3,
            "created_utc": 1734950892.0
        },
        {
            "author": "HeartyBeast",
            "body": "The word “just” in “just below” is doing quite a bit of work there. A couple of meters of concrete is not the best thing for mobile coverage ",
            "score": 1,
            "created_utc": 1734962067.0
        },
        {
            "author": "Nicebutdimbo",
            "body": "Why? 4g/5g is a much better solution.",
            "score": 1,
            "created_utc": 1734957817.0
        },
        {
            "author": "RobSamson",
            "body": "That's just asterisks...",
            "score": 3,
            "created_utc": 1734951818.0
        },
        {
            "author": "Gooooglemale",
            "body": "Lizzie line rollout just finished 2 weeks ago. Looks like the northern line gaps will be sorted next year …. Then we’ll be able to enjoy teenagers TikTok’s non stop all the way from morden to Moorgate! :-)\n\n“Large sections of central London now have coverage, and work is underway to expand coverage along the Northern line towards Morden, as well as between King’s Cross St Pancras and Moorgate by the end of the year and early 2025. Coverage on the Bakerloo line will shortly be extended along the tunnelled sections between Piccadilly Circus and Embankment, with further stations along the line, as well as the Piccadilly and Victoria lines, set to get coverage in the coming months.”\n\nhttps://groundtransportgroup.com/news-and-media/mobile-coverage-on-the-entire-elizabeth-line-complete-ahead-of-festive-season/",
            "score": 5,
            "created_utc": 1734951349.0
        },
        {
            "author": "RetepNamenots",
            "body": "Have they paused it? I've noticed stretches and stations south of London Bridge have been getting coverage over the last two or three weeks.",
            "score": 2,
            "created_utc": 1734955977.0
        },
        {
            "author": "CrabbyKrabs",
            "body": "I thought the highgate bit been 'fixed'? I've been getting signal all the way from Highgate to EF for about a month now!!",
            "score": 1,
            "created_utc": 1734954643.0
        },
        {
            "author": "BradlinhoM",
            "body": "I mean, relative to having wifi on the deep level tubes, it is pretty much just below the road",
            "score": 1,
            "created_utc": 1734963966.0
        },
        {
            "author": "xenomorph-85",
            "body": "hope they do battersea power station section for northern line",
            "score": 2,
            "created_utc": 1734953775.0
        },
        {
            "author": "secretlondon",
            "body": "Yes it started at Clapham Common and is spreading! Maybe next year I’ll be able to check my email all the way to Tooting!",
            "score": 1,
            "created_utc": 1734960522.0
        },
        {
            "author": "trooperer",
            "body": "Hm, maybe it's EE acting out. But I still have some interruptions. It's nothing major, it's definitely first world problems at this point to be honest:)",
            "score": 1,
            "created_utc": 1734959393.0
        }
    ]
}