{
    "post_title": "New years eve in Zagreb",
    "post_author": "Environmental-Key405",
    "post_score": 0,
    "post_url": "https://www.reddit.com/r/zagreb/comments/1hk2bo0/new_years_eve_in_zagreb/",
    "comments": [
        {
            "author": "Party-Cake5173",
            "body": "Well, on the main square there will be a New Year programme with local artists and now internationally famous Baby Lasagna so there's that...",
            "score": 7,
            "created_utc": 1734887935.0
        },
        {
            "author": "Ashamed_Car_4545",
            "body": "Checkout biggest hotels for dinner and party, might be worth",
            "score": 1,
            "created_utc": 1734891049.0
        },
        {
            "author": "TradicionalniAteist",
            "body": "Old Oharmacy Pub\nBuzz",
            "score": 1,
            "created_utc": 1734891860.0
        },
        {
            "author": "zzzvvvvv",
            "body": "I 5000 nepalaca",
            "score": -5,
            "created_utc": 1734900536.0
        },
        {
            "author": "quantumdotnode",
            "body": "You invited them. I don’t like the passive aggressive racism in Croatia. These people go to your country, work their asses off for shitty low wages, they’re generally polite and law abiding, yet they get looked down on by 99% of Croatians. Also it’s the season of goodwill. Study that 🎄",
            "score": 6,
            "created_utc": 1734902266.0
        },
        {
            "author": "zzzvvvvv",
            "body": "Pricajmo malo o tome sto se dogodilo prosle godine, pipkali su curice na koncertu na trgu. Policija je intervenirala, njih nekoliko je okruzilo djevojcice i pipkala ih iako su im roditelji bili nekoliko metara dalje, uspjele su se maknuti i reci roditeljima koji su obavijestili policiju. \n\nPricajmo malo o tome kako je zenama kad prolaze po trgu kad na svakom stupu sjedi njih petnajstak i ne skidaju pogled i sline. O maloljetnicama da ne pricam.\n\nPricajmo malo o tome kako se ponasaju kad prodes u mraku pored njih sama. \n\nPricajmo malo o njihovoj kulturi i higijeni i sto bi mogli poci po krivu sto se toga tice.\n\nPricajmo malo o njihovim zdravstvenim kartonima, cjepljenju, bolestima i slicno.\n\nJebe mi se za goodwill jer se o nekim stvarima ne smije prestati pricati. \nI ne nismo ih mi pozvali vec nasa vlada. \nPa vidimo se veceras u 18 kod hnk",
            "score": -1,
            "created_utc": 1734952955.0
        },
        {
            "author": "MonsterAzr",
            "body": "I opet nisu oni krivi za to nego ljudi koji su ih doveli( HDZ usrani)",
            "score": 1,
            "created_utc": 1734960109.0
        }
    ]
}