{
    "post_title": "Qual è la miglior provincia in Lombardia? e la più sottovalutata?",
    "post_author": "None",
    "post_score": 6,
    "post_url": "https://www.reddit.com/r/lombardia/comments/zm24sq/qual_è_la_miglior_provincia_in_lombardia_e_la_più/",
    "comments": [
        {
            "author": "lfasterthanyou",
            "body": "Provincia di Chiavenna",
            "score": 2,
            "created_utc": 1671064355.0
        },
        {
            "author": "FragrantOcelot312",
            "body": "Provincia di Varese",
            "score": 2,
            "created_utc": 1674743150.0
        },
        {
            "author": "None",
            "body": "Como / Sondrio",
            "score": 1,
            "created_utc": 1717925972.0
        },
        {
            "author": "alex_rayz",
            "body": "Credo che la peggiore sia Lodi a mani basse.",
            "score": 1,
            "created_utc": 1692078939.0
        },
        {
            "author": "Mapkoz2",
            "body": "Sondrio. Sondrio.",
            "score": 1,
            "created_utc": 1695636520.0
        },
        {
            "author": "Crazy_Ad6531",
            "body": "Como, Sondrio e Varese secondo me sono buoni candidati. Però secondo me le province disegnate attualmente dall'Italia non rappresentano bene la suddivisione culturale e delle varianti linguistiche della lingua Lombarda. Una sottovalutata è probabilmente quella di Varese. Quella di Lecco è bella come territori naturali, ma la città di Lecco non mi fa troppo impazzire perché rispetto ad altri capoluoghi di provincia ha molti meno monumenti medievali o resti storici che invece a me appassionano molto.",
            "score": 1,
            "created_utc": 1703337152.0
        },
        {
            "author": "Marsupial27",
            "body": "Chiavenna non è una provincia, bensì una valle (con capoluogo omonimo) situata in Provincia di Sondrio, che a mio avviso è la migliore provincia lombarda oltre che la più sottovalutata.\r  \n\r  \nLa Valtellina con la sua identità ben definita è una meta molto caratteristica: cucina unica, prodotti tipici, costumi folcloristici, tradizioni e feste distinte, accento inconfondibile, ecc.\r  \n\r  \nOltretutto è una delle poche province lombarde che di fatto è ancora lombarda.",
            "score": 5,
            "created_utc": 1681334537.0
        },
        {
            "author": "None",
            "body": "Non ci sono mai stato a Chiavenna, com'è?",
            "score": 2,
            "created_utc": 1671108248.0
        },
        {
            "author": "acetaldeide",
            "body": "Varese?\n\nMai visto persone più tristi e chiuse.",
            "score": 2,
            "created_utc": 1709537038.0
        },
        {
            "author": "Glittering-Summer-48",
            "body": "[la migliore provincia lombarda oltre che la più sottovalutata](https://www.igorvitale.org/il-piu-alto-tasso-di-suicidi-in-italia-e-in-valtellina/)",
            "score": 2,
            "created_utc": 1695512848.0
        },
        {
            "author": "lfasterthanyou",
            "body": "Nono, è provincia di Chiavenna",
            "score": 1,
            "created_utc": 1681347326.0
        },
        {
            "author": "lfasterthanyou",
            "body": "Carina se ti piace la quiete e la montagna",
            "score": 2,
            "created_utc": 1671110119.0
        },
        {
            "author": "Crazy_Ad6531",
            "body": "Mi dispiace, ma questa è una boiata e lo dico da persona di Como (ricordo che Como e Varese sono mega rivali).",
            "score": 1,
            "created_utc": 1710356410.0
        },
        {
            "author": "Wide-Concert980",
            "body": "E te credo, il sud del varesotto è diventato praticamente hinterland di Milano, soprattutto dal punto di vista viabilistico e ambientale.",
            "score": 1,
            "created_utc": 1715002438.0
        },
        {
            "author": "mansonfry",
            "body": "Chiavenna si trova in Provincia di Sondrio",
            "score": 3,
            "created_utc": 1685433755.0
        },
        {
            "author": "Marsupial27",
            "body": "Non so se stai trollando o meno, ti assicuro comunque che non esiste una provincia di Chiavenna. Vedi la mappa nel link qui sotto.\r\n\n[Mappa delle province della Lombardia](https://i.imgur.com/Sv0b4MN.png)",
            "score": 2,
            "created_utc": 1681366302.0
        },
        {
            "author": "acetaldeide",
            "body": "Dato il tema non ci sono statistiche da esibire, è ovviamente un'opinione personale (con molte conferme aneddotiche di conoscenti), come lo è la tua risposta.\n\nMi si dice che il territorio stesso del varesotto trasmetta una certa tristezza e pesantezza dell'animo, cosa che nel comasco non ho mai avvertito (disclaimer: non sono di Como).",
            "score": 1,
            "created_utc": 1710405074.0
        },
        {
            "author": "lfasterthanyou",
            "body": "Tutta propaganda valtellinese",
            "score": 1,
            "created_utc": 1685436498.0
        },
        {
            "author": "mansonfry",
            "body": "Ma non è assolutamente vero. Spero tu stia scherzando, ci sarebbe da preoccuparsi altrimenti",
            "score": 1,
            "created_utc": 1685436595.0
        },
        {
            "author": "lfasterthanyou",
            "body": "È dalle tre leghe che Chiavenna comanda sopra la valtellina.\nL'idea di provincia di Sondrio è oppressiva e fascista",
            "score": 1,
            "created_utc": 1685436937.0
        },
        {
            "author": "Marsupial27",
            "body": "La Provincia di Sondrio fu istituita nel 1815, ben oltre un secolo prima del fascismo. Per volontà peraltro di Girolamo Stampa, rappresentante ufficiale della Valchiavenna al Congresso di Vienna.\n\nInfine, geograficamente la Valchiavenna non è altro che una valle laterale della Valtellina, non dissimile dalla Valmalenco o dalla Val Poschiavo. Il fiume Mera era per sua natura affluente diretto dell'Adda; solo nel 1858 ne fu regolato artificialmente l'alveo.",
            "score": 2,
            "created_utc": 1687011915.0
        },
        {
            "author": "flumen_mapping",
            "body": "La Valchiavenna è una valle che si può benissimo considerare a se visto la sua posizione geografica non continua alla Valtellina e il suo passato storico che è per molto tempo legato al contesto valtellinese ma lo è anche differente. Considerare la Valchiavenna come valle laterale della Valtellina è soltanto un errore, e lo dico da valtellinese",
            "score": 2,
            "created_utc": 1691655364.0
        }
    ]
}