{
    "post_title": "Looking for vehicle ",
    "post_author": "Far-Tie4787",
    "post_score": 26,
    "post_url": "https://www.reddit.com/r/Birmingham/comments/1hkaysl/looking_for_vehicle/",
    "comments": [
        {
            "author": "slowbike",
            "body": "Look into using the Birmingham on Demand van app. If your home and your work are within their service area you will only pay $1.50 per ride. Beats the pants off Uber. Could also be listed as Via on Demand in the app store.",
            "score": 39,
            "created_utc": 1734914334.0
        },
        {
            "author": "moretimelessmess",
            "body": "no car but I’ll keep an eye out for you kid. Ik it’s tough but keep your head up and keep searching. the worst thing to do now is give up. something good will happen eventually, merry Christmas to you as well.",
            "score": 11,
            "created_utc": 1734911238.0
        },
        {
            "author": "johnsmith98989",
            "body": "How far is work, could you bike it?",
            "score": 2,
            "created_utc": 1734915764.0
        },
        {
            "author": "35242",
            "body": "Where do you live?  (Generally speaking). \n\nSomeone may be in the same vicinity and willing to help you out with rides.\n\nAlso, ask around work.  If they have an employee bulletin board where schedules and such are posted, ask the boss if they'd mind allowing you to put \"ride needed\" notice up. \n\nCoworkers could be a great source of help.",
            "score": 1,
            "created_utc": 1734950453.0
        },
        {
            "author": "CharacterBig6915",
            "body": "My neighbor has an older Honda Civic that's been sitting on the street for a long while. I know they have intentions of selling it, but it's been sitting there for whatever reason. I'll check with them on it and see what they're asking.",
            "score": 1,
            "created_utc": 1734958321.0
        },
        {
            "author": "musicmanbham",
            "body": "Just curious, where do you work?",
            "score": 0,
            "created_utc": 1734913132.0
        },
        {
            "author": "Far-Tie4787",
            "body": "youre an absolute baller bro, thank you",
            "score": 12,
            "created_utc": 1734914417.0
        },
        {
            "author": "LimeRepresentative48",
            "body": "I’ve never heard of this, it great.  I wish they came to Moody.",
            "score": 5,
            "created_utc": 1734916825.0
        },
        {
            "author": "Far-Tie4787",
            "body": "Thanks man I appreciate it.",
            "score": 6,
            "created_utc": 1734911427.0
        },
        {
            "author": "ProfessionalLoss6220",
            "body": "OP might want to check into the Redemptive Cycles Earn-a-Bike program. Community service in exchange for a bike+ lock/helmet etc.",
            "score": 9,
            "created_utc": 1734920046.0
        },
        {
            "author": "Far-Tie4787",
            "body": "Currently washing dishes at a restaurant (wont disclose due to preferred anonymity and embarrassment of life path) in metro BHAM area tho",
            "score": 15,
            "created_utc": 1734913329.0
        },
        {
            "author": "trashtownalabama",
            "body": "Check with moody city hall I've seen a st clair county bus type thing for transportation but I'm not sure what the requirements are.",
            "score": 1,
            "created_utc": 1734946644.0
        },
        {
            "author": "MichaelStipend",
            "body": "You’re working and trying to get in a better spot. Nothing to be embarrassed about. Good luck out there.",
            "score": 27,
            "created_utc": 1734913982.0
        },
        {
            "author": "musicmanbham",
            "body": "No need to feel embarrassed about working ANY job. Every job needs somebody to work it. And any job is better than doing nothing! I was just wondering what area you worked to see if I would be able to help in any way.",
            "score": 19,
            "created_utc": 1734913715.0
        },
        {
            "author": "Far-Tie4787",
            "body": "check PM",
            "score": 4,
            "created_utc": 1734913819.0
        },
        {
            "author": "CharacterBig6915",
            "body": "This for real. If anyone ever job shames you then they're entitled, snobby, or just a plain ass. Work is work and a job is a job, no matter what it is. You should never feel embarrassed for contributing and making money, whatever way you're able. I get on to younger people at my work when they delineate their past jobs into \"real\" ones and not. We all do different stuff, but it's all valid work and contributions, otherwise the job wouldn't exist.",
            "score": 1,
            "created_utc": 1734958134.0
        }
    ]
}