{
    "post_title": "Kosovo Election Polling",
    "post_author": "Dadino99",
    "post_score": 8,
    "post_url": "https://i.redd.it/zb6qy2o02g8e1.jpeg",
    "comments": [
        {
            "author": "Highwater_Pants",
            "body": "Sjom fort tu ja majt krahun VV-se bre po inshallah e mer shumicen se me ju dasht me hi ne koalicion mut bohet puna krejt hiq ma progress ska me pas veq stagnim tu shty mesveti edhe rrezik qe mahen prap zgjedhje mas 2 vjete. Une personalisht edhe mos mem pelqy VV ja kisha dhan voten veq mos me pas qisi probleme mrena koalicionit e kryeminister vs ministra.",
            "score": 4,
            "created_utc": 1734929167.0
        },
        {
            "author": "teshmjaispat",
            "body": "![gif](giphy|l4HnKwiJJaJQB04Zq|downsized)",
            "score": 5,
            "created_utc": 1734893259.0
        },
        {
            "author": "AIbanian",
            "body": "ALJBIN ZAIMA KURTI",
            "score": 1,
            "created_utc": 1734963464.0
        },
        {
            "author": "Zhidezoe",
            "body": "Nuk besoj  qe LVV mundet me marr ma shume se 40% te votave, njejte qysh nuk e shoh LDK mbas PDK ne renditje, ma merr mendja qe LDK ka me pas ngritje ma te madhe sidomos nga votuesit e Vjoses e ne anen tjeter PDK nuk po kandidon as me kryetarin e vet e as me ata figurat e larta te partise. LVV ka me pas ulje se ma larte kurre smundet asni parti me shku, plus ka qene nje qeveri e deshtuar, perjashtim veriut te Kosoves nuk e ka asnje arritje ne pjeset e tjera te Kosoves",
            "score": -12,
            "created_utc": 1734893461.0
        },
        {
            "author": "Prudent-Papaya6953",
            "body": "krejt mire bre, veq me qito taksa ne prone qe o ka don me i qit LVV, 700 mi nanat ko me na qi. sidomos neve te prishtines",
            "score": -5,
            "created_utc": 1734900381.0
        },
        {
            "author": "big_cat112",
            "body": "Rrogat jon ngrit, korrupsioni u ul, u fuqizu ligji, kto sjon arritje?",
            "score": 15,
            "created_utc": 1734893773.0
        },
        {
            "author": "trimigoku",
            "body": "Per VV pajtohna ama per PDK e LDK jo, shkaku se qysh pe shoh njerzit jon pak nostalgjik per investimet ne infrastruktur qe jom ba gjat qeverive te PDK-s. Qajo nostalgji ka me shty PDK-n ma nalt se LDK-n edhe pse PDK  nuk i ka do prej figurave ma te njohura ne qender.",
            "score": 2,
            "created_utc": 1734944660.0
        },
        {
            "author": "Pristine10887",
            "body": "Sa kan me kan taksat se sjom rrjedha?",
            "score": 4,
            "created_utc": 1734911572.0
        },
        {
            "author": "Aioli_Tough",
            "body": "Secili shtet i ka kto taksa, e kjo shkon per t'mir t'shtetit. Mark Aureli ka thene : \"Dicka qe nuk i bon dem qytetit, nuk i bon dem as qytetarit.\"\n\nPlus kto taksa jan veq per patundshmerite komerciale, dmth lokalet, apo banesat qe jane me qira.\n\nme ni lokal 200k, me taksen minimale (0.20%) ti ke me pagu 400 euro n'vjet, apo 33.50 euro n'muaj.\n\nLokali qe ka vlere 200k, me formule ekonomike (5% capitalization rate) ti bjen 10.000 Euro n'vjet n'qira, apo 833euro n'muajt, dmth pi qiras 833 euro ty apet t'mbesin perafersisht 800 euro.\n\nMos u brengos o vlla se boll keni, 33 Euro per shtet s'jan kurgjo. S'boni shpi me to.",
            "score": 2,
            "created_utc": 1734958071.0
        },
        {
            "author": "HeizGuderian",
            "body": "Po fol me boots e LDK",
            "score": 13,
            "created_utc": 1734894712.0
        },
        {
            "author": "g4sh1ani",
            "body": "U fuqizu ligji tha xd",
            "score": -1,
            "created_utc": 1734897084.0
        },
        {
            "author": "Aioli_Tough",
            "body": "prej 0.10% deri n 1% t'vleres t prones. Duke hyp ma nalt prej vleres.",
            "score": 1,
            "created_utc": 1734957441.0
        },
        {
            "author": "Pristine10887",
            "body": "Qka jon 1% per marakli",
            "score": 1,
            "created_utc": 1734959757.0
        }
    ]
}