{
    "post_title": "Autostrada ne Kosove",
    "post_author": "griffim90",
    "post_score": 35,
    "post_url": "https://i.redd.it/bhfl1er96h8e1.jpeg",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Please maintain decorum and refrain from responding in an offensive or trolling manner as this post has been categorized as a Discussion, failing to do so, will result in a ban for at least 7 days!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/kosovo) if you have any questions or concerns.*",
            "score": 1,
            "created_utc": 1734906006.0
        },
        {
            "author": "Lgkp",
            "body": "Edhe une jam nKosove per momentin edhe jam dakord qe ka pjesa ne autostrade qe jane ne gjendjen e rend. Kur bjen shi bohet edhe 100 her ma keq\n\nBile edhe ma keq neper magjistrale, shume rrezik\n\nEdit: quditna qe ka njerz ktu qe guxojn me vozit 150 km/h kur jane rrugt ne ket gjendje",
            "score": 24,
            "created_utc": 1734906324.0
        },
        {
            "author": "gaziway",
            "body": "Dritat jane vetem kur ka dalje/hyrje ne auostard. Ka probleme po e vertet, po dirtat nuk jane njeri nder to.\nPs. Mos bo foto duke vozit sidomos ne autostrad me. Duaje pakes vetem.",
            "score": 8,
            "created_utc": 1734915592.0
        },
        {
            "author": "farquaad_thelord",
            "body": "kurkun nevrop autostradat skan drita a sa i perket sinjalistikes tdopt ki shum tdrejt",
            "score": 13,
            "created_utc": 1734907827.0
        },
        {
            "author": "-mamiii",
            "body": "Keto jane problemet ma tvogla qe i kemi me rruge nkosove lol",
            "score": 2,
            "created_utc": 1734907899.0
        },
        {
            "author": "Eldergrise",
            "body": "https://preview.redd.it/nhgedgq68k8e1.png?width=1080&format=pjpg&auto=webp&s=e348b09a8e3f2cd6d24fbe5b7a8ec28f71290a3e\n\nMdoket e ki kuptu keq qka ka dasht me shkru me drita. Mir e ka se ska kerka nkosov drita nautostrad, gati gjethka nevrop ka. Jon tmontum amo nal gjeth.",
            "score": 1,
            "created_utc": 1734942967.0
        }
    ]
}