{
    "post_title": "What does Brussels has to offer?",
    "post_author": "Lostintheisle",
    "post_score": 17,
    "post_url": "https://www.reddit.com/r/brussels/comments/1hk5cux/what_does_brussels_has_to_offer/",
    "comments": [
        {
            "author": "JohnLePirate",
            "body": "If you are driven by beers made by bastards in a swamp, you go to Brussels. ",
            "score": 99,
            "created_utc": 1734895638.0
        },
        {
            "author": "aubenaubiak",
            "body": "Functional chaos? Brussels is surrealism turned into reality.",
            "score": 55,
            "created_utc": 1734895062.0
        },
        {
            "author": "Sibren5",
            "body": "Let me take a stab at this, super interesting question - thanks for sharing! \n\nI believe Brussels sends a message of connection and community. **You should belong.**   \nIt's a place where people think they will be for a year or 2 and then end up staying for a year or 20. Many people arrive alone, for a job / internship / study / ... and you can really feel the openness to meet new people here. It's not London or Paris. For most Belgians outside the city it's an unfamiliar place. Weather can be gray & wet, and public transport can be unreliable. All these things really guide people to the real value there is in building a small community and starting to feel like they belong here. Given most people were new & alone here one day, even established groups of friends are very eager to invite new members in, and adopt them in their circle. I truly think the level of depth in connections to be made here is quite unique.",
            "score": 68,
            "created_utc": 1734900232.0
        },
        {
            "author": "Naniiiiponaniii",
            "body": "Free shoes, toilets, soga's, fridge and so much more can be found just on the street  \nidk who is spawning them but I like it",
            "score": 18,
            "created_utc": 1734896333.0
        },
        {
            "author": "t0on",
            "body": "Brussels is the most surprising city I know. Has ugly buildings/most art nouveau monuments per capita. Has a reputation for being grey/has so many amazing parks and is next to a huge forest. Is surrounded by Flanders/is bilingual and home to a crazy amount of linguistic and cultural diversity for a relatively small capital. Brussels is simply unable to be boring, and while many people complain about \"the chaos\", I think it's what makes people come back.",
            "score": 27,
            "created_utc": 1734897791.0
        },
        {
            "author": "Unusual_Dream_601",
            "body": "European/international institutions?\n\nBrussels has a lot to offer in terms of international politics, diplomacy etc",
            "score": 33,
            "created_utc": 1734895783.0
        },
        {
            "author": "bricart",
            "body": "Bruxelles is one of the most multicultural cities in the world. You can meet people from everywhere, food from a lot of places...\n\nThe EU if you are in politics.\n\nAnd on the Belgian scale, it offers cultural activities that no other cities are close to have",
            "score": 37,
            "created_utc": 1734897120.0
        },
        {
            "author": "No_Objective_3882",
            "body": "Despite complaining about the weather 24/7 I love Brussels. To me, its the place that everyone can find themselves because there is always something to do given your type- art, cinema, politics, multicultural, green parks, bars, food etc. and despite being a capital is quite affordable, so its a perfect balance. I love that I get a decent apartment by paying 1k whereas i have friends in paris, ams, or berlin which with the same amount have little studios. Taxes are high its true, but overall you can find a good balance as there is an interesting job market. I really want to mention cinemas here. I really love the variety of small, independent cinemas. The amount of film festivals and everything that allows you to touch independent films. And also people here can be quite nice. I know people from all over the world and i have created my little friend families here. I dont often take the time to appreciate my time in Bxl but I guess its time to write a loveletter to being Bruxelloise❤️",
            "score": 5,
            "created_utc": 1734922000.0
        },
        {
            "author": "Morningssucks",
            "body": "A bit of a different answer, maybe more on a micro scale\n- great place to raise kids: lots of parcs and activities. \n- hidden gems all over the place\n- the culture is fantastic\n- affordable universities\n- great restaurants\n- PARTY!!! The music scene is amazing. Spent most of my yought in music bars/ discos that were a lot more affordable than in other cities\n- and last but not least: Brussels is both an international city and a village. Everybody knows everbody « via via »",
            "score": 6,
            "created_utc": 1734929820.0
        },
        {
            "author": "StashRio",
            "body": "Only a career in the EU institutions and other intergovernmental entities like NATO and diplomatic missions . Nothing else. Every form of initiative and entrepreneurship is taxed at ridiculous levels. \n\nThis small capital city instead of taking the huge benefit and advantage of having the EU institutions based here to leverage upwards and create a dynamic and varied economy has instead done nothing of this sort. It jist  relies on the easy money of the institutions and international organisations which by my reckoning are some 30% of the economy..\n\nBut if you are an EU official or work with NAtO, it is great . You pay an average of approximately 21% in tax, have a great pension lined up, and higher salaries (more than twice the average)",
            "score": 17,
            "created_utc": 1734896610.0
        },
        {
            "author": "Only-pizzaz",
            "body": "What does Brussels have to offer ffs",
            "score": 10,
            "created_utc": 1734895012.0
        },
        {
            "author": "dainty_wordsmith",
            "body": "It's the only real melting pot in Belgium. Everyone can feel at home here, and it's relatively safe . You can get food and other stuff from all over the world. It's very walkable and public transport is great compared to other Belgian cities. Lots and lots of affordable restaurants. Shitloads of concerts, exhibitions, and galleries. Every 'commune' has its own identity. The streets can be dirty and not well maintained, but there are architectural gems everywhere. There's parks and forests for walking. You're one hour away from the seaside, the Ardennen, and with Eurostar and 2 airports, you can easily travel anywhere. I ❤️ Bxl.",
            "score": 9,
            "created_utc": 1734899360.0
        },
        {
            "author": "AMoonShapedAmnesiac",
            "body": "If you're asking what kind of passion makes people move to Brussels, then it's generally a passion for Europe and European affairs. Believe it or not, there are people passionate about the EU.",
            "score": 5,
            "created_utc": 1734912058.0
        },
        {
            "author": "TumweeSlothman",
            "body": "Sprouts",
            "score": 5,
            "created_utc": 1734897094.0
        },
        {
            "author": "ash_tar",
            "body": "It's a big city in compact size. Great cultural offer, mainstream and underground, yet no really large distances.",
            "score": 5,
            "created_utc": 1734898178.0
        },
        {
            "author": "dxbatas",
            "body": "Waffles of course. What a question !",
            "score": 2,
            "created_utc": 1734903476.0
        },
        {
            "author": "Internal-Ad7642",
            "body": "It's the fourth biggest power centre on Earth (behind Washington, Beijing and Moscow), is located in a country with three of the best ten music festivals in the world (with a good underground scene too!), is a global business hub, and it probably has one of the more diverse food scenes on the continent. That's before you get to the decent quality of life, and the seemingly endless things to do and people to meet passing through. \n\nI am convinced people just love to complain, rather than take what life is offering them. Huge opportunities for whatever you want to do, and most would rather let their lives slip through their hands, to moan about weather and bins and waste it.",
            "score": 5,
            "created_utc": 1734900142.0
        },
        {
            "author": "abysmalbutterfly",
            "body": "In short: money. \n\nWhether it's a well paid job in one of the many institutions or their affiliated companies, shady jobs in the black market, or unemployment benefits. You can survive with fairly little money, and the cost of living is lower compared to other nearby capitals. \n\nIt has obviously much more to offer, but I doubt many dream of one day moving to Brussels. People come here without a plan, get connected with people, find roots, and stay. One year becomes a few, a few become ten. You settle down, start a family, before you know it, it's difficult to move.",
            "score": 3,
            "created_utc": 1734908083.0
        },
        {
            "author": "Forward_Body2103",
            "body": "Brussels offers an exceptional level of mediocrity. A few things are terrible, a few things are great. The rest is a resounding “meh.” The best part of living in Brussels is that it is easy to go somewhere else cool away from here.",
            "score": 2,
            "created_utc": 1734905486.0
        },
        {
            "author": "hoovegong",
            "body": "Are you writing an article?",
            "score": 1,
            "created_utc": 1734898047.0
        },
        {
            "author": "frugalacademic",
            "body": "Quite good public transport. YOu don't need a car in Brussels. Anywhere else in Belgium, you need a car or you are somewhat isolated from the world. \n\nFor the rest I have gradually started to dislike the city. The pedestrian zone is a good thing but for the rest I find housing to be expensive and not worth it.",
            "score": 1,
            "created_utc": 1734897616.0
        },
        {
            "author": "Nearox",
            "body": "Bruxelles ma (pou-)belle",
            "score": 1,
            "created_utc": 1734906927.0
        },
        {
            "author": "Oldthriftmaan",
            "body": "Brussel is the definition of “meh” as a city.\n\nWhere to begin? If you don’t work in the institutions there is very little career opportunities which means that there is a high concentration of bureaucrats. Cities that concentrate one industry can become very boring since there is no diversity. Basically you’re either Belgian or your work in the institutions (aka the Brussel bubble).\n\nThe architecture goes from charming to terrible and since it is a small city the terrible is hard to escape. Sure you can live in Ixelles if you can afford it but as an intern you’re more likely to live in shitty areas like st Josse or matonge. These places are not exactly “unsafe” but they are dirty, grey and all-in-all depressing. Don’t even get me started on the parliament side of Brussel where you can find the commission,l and all the other institutions within a stone-throw. It’s just disgusting, there is not tentative to make this place inspiring. The US has the White House we have…the Berlaymont which looks like a dystopian building directly from 1984. It is supposed to represent 450+ million people… \n\nThe center is very nice with that old medieval vibe and the grand place is worth seeing. But that’s pretty much it.",
            "score": 0,
            "created_utc": 1734949203.0
        },
        {
            "author": "Italian_warehouse",
            "body": "If you want to live in EU continent but don't want to learn another language besides English, move to Brussels. (Yes the Scandinavian countries speak perfect English too but they are very cold)",
            "score": -1,
            "created_utc": 1734897540.0
        },
        {
            "author": "IndependentPudding85",
            "body": "Nothing, is a place you end up when you studied politics and don’t have enough experience to emigrate to a well-established city",
            "score": -13,
            "created_utc": 1734895758.0
        },
        {
            "author": "Hungry_Fee_530",
            "body": "Smell of onions, sticky sidewalks. Reasonably priced rent",
            "score": -1,
            "created_utc": 1734904485.0
        },
        {
            "author": "assymetri",
            "body": "Despite never been there, I imagine it as a mixture of Montréal, Toronto and Vancouver, so like a super tiny Canada in Europe: the billingualism of the first (also the abundance of english/french speakers), the multicultural atmosphere of the 2nd and the on-street drug usage and ample amount of homeless people of the third",
            "score": -1,
            "created_utc": 1734922679.0
        },
        {
            "author": "sunnynihilist",
            "body": "Without the EU and the related bureaucratic institutions, I have no idea how Brussels positions itself. Most expats work in the EU. Very boring. The city doesn't have any defining qualities. Unable to attract interesting people to settle down. It's like a big blur of mediocrity and amatuerism.\n\nIn London and Paris, there are many interesting and charming neighborhoods to explore. In Brussels, none. Some random individual buildings or attractions can be interesting, but the city as a whole is forgettable and depressing. Brusselization truly ruined the city.",
            "score": -5,
            "created_utc": 1734909198.0
        },
        {
            "author": "CarelessLet4431",
            "body": "Poverty, criminality and rampant welfare abuse",
            "score": -3,
            "created_utc": 1734912965.0
        },
        {
            "author": "Goldentissh",
            "body": "Geuze ftw",
            "score": 13,
            "created_utc": 1734897059.0
        },
        {
            "author": "AnIrkenInvader",
            "body": "As a Mexican, trust me, I can relate",
            "score": 8,
            "created_utc": 1734895810.0
        },
        {
            "author": "riikc",
            "body": "Third Mexican chiming in, at least in Mexico I know the people are competent at being corrupt. Here we face massive incompetence which a different type of bad.",
            "score": 2,
            "created_utc": 1734951088.0
        },
        {
            "author": "SharkyTendencies",
            "body": "Why is this answer not higher? I'd give +10000 upvotes to this if I could!\n\n> It's a place where people think they will be for a year or 2 and then end up staying for a year or 20.\n\nOof. Too real. \n\nI first came here in 2007 on Erasmus. I went back home, but... I never left. I visited frequently, and finally made the move in 2017. Been here ever since. 2025 will be 8 years. \n\nBrussels \"adopts\" people. It's a very strange phenomenon. For the people who are here for 3 months then go back? Nah, fam, you were a tourist with a job.\n\nPeople who are here for a few years, speak a local language to a decent level, and integrate themselves in local society (not *just* the Expat crowd) get adopted, and one day, they wake up and they \"belong\".\n\nThere's some sort of connection this city offers - hell, I've had discussions with close friends who agree with me about who exactly is the personification of Brussels. (Most of us agree that she's a woman.)",
            "score": 16,
            "created_utc": 1734904347.0
        },
        {
            "author": "Schoritzobandit",
            "body": "I think the fact that people don't typically come here out of a desire for the *city itself* is part of what makes it very nice. In London, Paris, and especially (if I may say) in Amsterdam, you meet tons of people who liked the aesthetic image of the city, and who moved there - in part - out of a desire to be *the kind of person who would live there*. Brussels has almost none of this, and it's great. It really removes a lot of pretention from foreigners who move to Brussels, which helps with the culture of the city on the whole. \n\nThis is probably helped by the fact that everyone learns that the correct attitude to take towards Brussels is to complain about it and to massively exaggerate its flaws. If rolling my eyes at this all the time is the price I pay for a city without much of a yuppie expat culture, then I'll pay it happily. \n\nOn a more serious note, I think Brussels offers a ton of activities and events for a city of its size, which is in no small part thanks to the density of (especially European) foreigner groups. It's expensive compared to much of the rest of the world, but compared to London, Paris, or Amsterdam, it's quite cheap. I would say that you get a lot of \"bang for your buck\" out of life here.",
            "score": 2,
            "created_utc": 1734954612.0
        },
        {
            "author": "Lostintheisle",
            "body": "thanks much for sharing your reflection! i do find this one of the most engaging and believable descriptions of *what Brussels has to offer.* As a recent mover, this sounds both exciting and scary at the same time! \n\nI have a question if you don't mind, does Brussels allow to lay on deep roots on the long-term? (only if you can answer up to your personal experience)... like can one expat feel really from the city, connected with the culture, and is possible to start a family here and have like 'Brussels' connection? \n\nI find this one of the most interesting aspects. I have lived in few cities and always see strong identities in the cities reflected and enforced with national identities. In Brussels, this is not the case imo, and I think is largely because of what you say, large influx of people coming and leaving (at least in the small professional circle I engage with)",
            "score": 3,
            "created_utc": 1734905078.0
        },
        {
            "author": "hanzoplsswitch",
            "body": "Well said. It really is a unique city. ",
            "score": 4,
            "created_utc": 1734899135.0
        },
        {
            "author": "Parola321",
            "body": "Indeed, they are killing any form of entrepreneurship and they managed to make run away all the big companies, from Volkswagen to Audi and soon Volvo they are all running away from the country of 65% tax on salaries and 70% tax on bonuses!",
            "score": 2,
            "created_utc": 1734899741.0
        },
        {
            "author": "AreUAlien",
            "body": "I love Brussels for many reasons, but how anyone can laud its \"walkability\" and public transport in any way is beyond me. This city's urban planning hasn't evolved since the 60s outside of Brussels 1000 and this should revolt any sensible person.",
            "score": 0,
            "created_utc": 1734905527.0
        },
        {
            "author": "pepipox",
            "body": "Foreigners come to belgium for two reasons, work or following life.",
            "score": 1,
            "created_utc": 1734930033.0
        },
        {
            "author": "Lostintheisle",
            "body": "haha not at all, just interested in the discussion and spark ideas i can relate to",
            "score": 0,
            "created_utc": 1734899417.0
        },
        {
            "author": "Undergroundninja",
            "body": "I am from Montreal, I have lived in Brussels. Don’t ever compare us to Brussels, ew.",
            "score": 1,
            "created_utc": 1734958588.0
        },
        {
            "author": "AdventurousTheme737",
            "body": "Don't know where you go. But there's so many charming neighbourhoors, where to even begin.",
            "score": 1,
            "created_utc": 1734919025.0
        },
        {
            "author": "ouaisoauis",
            "body": "as a fellow mexican, I find the Mexican mess to at least have a logic to it",
            "score": 8,
            "created_utc": 1734898066.0
        },
        {
            "author": "abiggerhammer",
            "body": ">Brussels \"adopts\" people.\n\nThis is exactly what happened to me. My husband and I had been living in Leuven and made friends at Hackerspace Brussels. Then he died suddenly. Without my even asking, our friends from HSBXL descended on Leuven like a horde of vikings, and within four days they had moved me into a new apartment in Brussels.\n\nNext summer I'll have been here 14 years.",
            "score": 15,
            "created_utc": 1734924122.0
        },
        {
            "author": "Sibren5",
            "body": "Thank you, great thoughts! I think you touch on something very real with the *\"people not moving to Brussels because they want to be the type of person who lives there\"*.",
            "score": 1,
            "created_utc": 1734956025.0
        },
        {
            "author": "SharkyTendencies",
            "body": "> does Brussels allow to lay on deep roots on the long-term?\n\nYes, but you also need to work for them. \n\nThis is not a city that will slap you in the face, scream IT'S THE FUCKING EIFFEL TOWER, and throw an ID card at you.\n\nYou need to visit the city over and over. You need to see the same people, the same places, and listen to the stories from before. Brussels is intimately connected with its past as a poor, yet vibrant, musical, and theatrical city. There are ghosts of this past everywhere, but very few people still know where to look.\n\n> like can one expat feel really from the city, connected with the culture, and is possible to start a family here and have like 'Brussels' connection?\n\nMany locals have precious little to do with \"expats\". \n\nWhile I obviously can't speak for all locals, see it like this: They're people who move in, tend to live in one area (Schuman), tend to work for the same employer (EU-centric jobs), generally speak a foreign language (English), stick to themselves, complain about everything (housing, administration... you name it), and leave after a year or two because they got some other opportunity elsewhere. \n\nWould *you* be lifelong friends with someone if you knew there was a time limit?\n\nMany locals limit themselves to being acquaintances.\n\nIf you want to get to know the *real* Brussels, I don't think you can do it in English. It simply won't happen.",
            "score": 9,
            "created_utc": 1734905895.0
        },
        {
            "author": "Sibren5",
            "body": "Thank you! \n\n>... like can one expat feel really from the city, connected with the culture, and is possible to start a family here and have like 'Brussels' connection?\n\nYes. I do believe so. I agree with u/SharkyTendencies on the language; a basic understanding of French will help a lot, but I've seen people starting families here after moving & slowly starting to like it more as a place to settle down. \n\nThings that can help to \"become Bruxelois\" IMO - non-exhaustive, just some ideas: join an independent sports club and go there regularly at the same time to meet the same people (climbing is great for that), talk to owners of small cafés and restaurants, go to boutique movie theaters rather than the big chains, go vote (big one to mentally feel \"part of the city\"), explore the venues for arts & culture (e.g. musical concerts, ...), go watch a game of USG, talk to strangers, invite friends of friends and join events by friends of friends, go read a book at one of these old school \"Brussels\" cafés while people watching, ... In short, as in every city, honestly, get out there. You're paying premium for real estate in a big vibrant city with tons to do at your doorstep, make use if it to the fullest!",
            "score": 3,
            "created_utc": 1734943921.0
        },
        {
            "author": "TravellingBelgian",
            "body": "Brussels is very much walkable. You can easily go from one point to another on foot without feeling like you are endangering your life. At least our sidewalks are broad enough, not like the 50cm-wide ones like in Paris.",
            "score": 5,
            "created_utc": 1734918109.0
        },
        {
            "author": "hoovegong",
            "body": "Fair enough. I might be misreading you, but I think you are asking about Brussels by comparison with other cities as an active and free choice made by mobile people. Most people here (I mean in Brussels, not the subset and numerically unrepresentative sample of people who are in Brussels and on Reddit) aren't making that kind of choice.\n\nFor the subset who are, it is, IMHO: EU and EU adjacent employment offer; *comparatively* less expensive western European well connected capital city cost of living; lower cost of entry (high levels of EN); compact with high cultural offer.",
            "score": 1,
            "created_utc": 1734900841.0
        },
        {
            "author": "Lostintheisle",
            "body": "thanks much for this! much food for thought!",
            "score": 0,
            "created_utc": 1734906211.0
        },
        {
            "author": "Lostintheisle",
            "body": "yes I agree - my question is mostly targeted from the pov of flexible, moving professional people that work white-collar jobs.  \nThanks for sharing your perspective!",
            "score": 2,
            "created_utc": 1734905185.0
        }
    ]
}