{
    "post_title": "No water in Building since 12h",
    "post_author": "SpecificSea5005",
    "post_score": 2,
    "post_url": "https://www.reddit.com/r/Riga/comments/1hgm10f/no_water_in_building_since_12h/",
    "comments": [
        {
            "author": "citizen2002",
            "body": "Hello there!\n\nYeah, unfortunately, the communication burst sometimes happens in Riga, especially in Pārdaugava. The worst I had was 3 days. The most recent one was a week ago? It lasted from 16 until next morning's 5. Rīgas Ūdens even delivered water to the neighborhood. But worry not, they are most likely fixing the problem now and will be all night so the problem could be done by tomorrow morning. If it's not, then I suggest in the future keeping 2 or 3 five liter water bottles filled with tap water just in case pipes burst again.",
            "score": 2,
            "created_utc": 1734473361.0
        },
        {
            "author": "neonzzzzz",
            "body": "> The water company is currently repairing it, but lets say after 12h of not flushing the toilet we maybe have some other problems and Nobody is doing anything. We don't even know how long it will take.\n\nWhat can you do? Guess you don't want to help fix it for Rigas udens yourself, guess your only option is to buy water in shop until it's fixed.",
            "score": 2,
            "created_utc": 1734523876.0
        },
        {
            "author": "T-2-P-3",
            "body": "Buy a 5 liter water bottle and pour it down the toilet, same thing as flushing it",
            "score": 2,
            "created_utc": 1734551291.0
        },
        {
            "author": "citizen2002",
            "body": "And most importantly. I forgot to mention how to approach the situation right now. Well. If it already lasts for 12 hours, then most likely in the evening, there was a water truck that delivered the water to the street, which is cut off from the water communications. Your best bet now is to either wait till the morning or visit 24/00 shops. I know only 2 of them. One is in the centre near the  Ziedoņdārzs and the second one is in the Pārdaugava not far from RSU university, but there could be more. Hope it helps!",
            "score": 2,
            "created_utc": 1734473818.0
        }
    ]
}