{
    "post_title": "Nuova App ATM con abbonamento digitale e redesign",
    "post_author": "xEchDaniel",
    "post_score": 51,
    "post_url": "https://i.redd.it/0bh62a6o587e1.jpeg",
    "comments": [
        {
            "author": "nozni",
            "body": "Ma perché mi dice nessuna tessera per quanto riguarda l’abbonamento?",
            "score": 24,
            "created_utc": 1734365089.0
        },
        {
            "author": "CapitalistFemboy",
            "body": "A me esce [questo](https://imgur.com/f8salz0), qualcuno sa cosa significa versione digitale? No perché se mi danno il QR Code mi tengo la tessera, se posso usare l'abbonamento dal wallet senza bisogno di aprire l'app allora converto subito.\n\nEdit: leggo che viene letto con il bluetooth. Non mi sembra una gran tecnologia.",
            "score": 11,
            "created_utc": 1734365736.0
        },
        {
            "author": "emkay92",
            "body": "Non ottimale che i preferiti non compaiano nella home.\n\nPoi mancano alcune fermate degli autobus, ad esempio tutte quelle della 62 in direzione Porta Romana (l'altra direzione invece sì). Non so se anche altre linee hanno lo stesso bug.",
            "score": 9,
            "created_utc": 1734373492.0
        },
        {
            "author": "MandehK_99",
            "body": "Tempo fa su questo sub non si discuteva mica sul perché non facessero le tessere digitali? Qualcuno diceva che sarebbe stato problematico perché uno avrebbe potuto \"duplicare\" la tessera su più dispositivi o cose del genere",
            "score": 7,
            "created_utc": 1734370930.0
        },
        {
            "author": "MandehK_99",
            "body": "Stamattina non ho potuto controllare quando passava il bus perché l'app (versione Android) era inutilizzabile, all'ora di pranzo la situazione sembrava già essere migliorata però ci sono ancora un po' di problemi di usabilità. Spero che facciano sul serio e li sistemino senza far passare mesi o anni",
            "score": 5,
            "created_utc": 1734371076.0
        },
        {
            "author": "likeeatingpizza",
            "body": "Non ci credo che hanno tolto da dark mode.... Qualcuno l'ha trovata?",
            "score": 5,
            "created_utc": 1734371384.0
        },
        {
            "author": "Ideon_",
            "body": "qualcuno che ha usato l'abbonamento digitale sa dire se è comodo ? \n\nnon dover portare la tessera fisica sarebbe un sogno per me, ma ho paura che il procedimento di tirar fuori il telefono e navigare l'app richieda troppo tempo.",
            "score": 5,
            "created_utc": 1734422843.0
        },
        {
            "author": "w0b",
            "body": "Ma l'abbonamento non me lo caricano automaticamente?",
            "score": 4,
            "created_utc": 1734364416.0
        },
        {
            "author": "Malobestin0",
            "body": "Interessante.  \nSi sa se l'obliterazione con biglietto/abbonamento avviene ancora con QR code o hanno trovato un modo per usare l'NFC o qualcosa di più comodo?",
            "score": 4,
            "created_utc": 1734364733.0
        },
        {
            "author": "MrSkullKollektor",
            "body": "Esperienza utente schifosa come sempre. E poi la dark mode??? Mannaggia",
            "score": 3,
            "created_utc": 1734374014.0
        },
        {
            "author": "HereBcINeedHelp",
            "body": "Io ho l'abbonamento (under27 urbano) in convenzione con l'Esselunga, però con gli abbonamenti convenzionati non puoi metterlo nell'app",
            "score": 2,
            "created_utc": 1734371821.0
        },
        {
            "author": "Pmcgslq",
            "body": "sinceramente mi da fastidio che l'info ascensori sia stata spostata dalla home ma apprezzo la nuova UI",
            "score": 2,
            "created_utc": 1734375463.0
        },
        {
            "author": "logosfabula",
            "body": "🙌",
            "score": 1,
            "created_utc": 1734374698.0
        },
        {
            "author": "Hollowbolt",
            "body": "Nuovo aggiornamento del atm è schifoso.",
            "score": 1,
            "created_utc": 1734436130.0
        },
        {
            "author": "rdmusrnm0",
            "body": "Ho digitalizzato per sbaglio la vecchia tessera ATM, invece di quella nuova dove ho l’abbonamento in convenzione con Telepass. Dovrei eliminare la tessera attualmente digitalizzata per poter digitalizzare quella nuova, ma non è tecnicamente possibile, né tramite app né chiamando l’assistenza.\n\nQuindi state attenti: la digitalizzazione è per la vita e non si torna più indietro!\n\nCome può essere possibile che abbiano pensato a un sistema del genere?",
            "score": 1,
            "created_utc": 1734593355.0
        },
        {
            "author": "hellomoto8999",
            "body": "ma alla fine qualcuno ha avuto il coraggio di usarlo? :D",
            "score": 1,
            "created_utc": 1734682789.0
        },
        {
            "author": "Stock-Ant3756",
            "body": "Ho notato che le tessere digitalizzate non funzionano sulla linea S, mentre la metropolitana va bene, qualcun altro ha il mio stesso problema?",
            "score": 1,
            "created_utc": 1734721493.0
        },
        {
            "author": "Unbundle3606",
            "body": "Idem, io ho un abbonamento annuale già attivo, sul sito lo vedo (stesse credenziali che ho usato per loggarmi nell'app). L'app mi dice nessuna tessera.\n\nEDIT: sono arrivato al punto dove lista le tessere fisiche e vedo la mia. Mi da l'opportunità di renderla digitale. Mi arriva un messaggio che dice che mi disattiverà definitivamente la tessera fisica. Nessun accenno all'abbonamento in corso, nessuna rassicurazione che mi verrà mantenuto! Non cliccherò mai quel pulsante di conferma. Non so perché mi aspettavo di meglio, come al solito esperienza utente fatta col c*lo.",
            "score": 20,
            "created_utc": 1734368897.0
        },
        {
            "author": "LelixSuper",
            "body": "Hai un abbonamento convenzionato (tipo con Esselunga)? Ho notato che quelli convenzionati non sono mostrati neanche sul sito dell'ATM.",
            "score": 1,
            "created_utc": 1734372930.0
        },
        {
            "author": "Princesss988",
            "body": "Io ho dei biglietti nel wallet da usare in caso di emergenze che salgo magari sui bus al volo e mi sono spariti 🤣",
            "score": 1,
            "created_utc": 1734384010.0
        },
        {
            "author": "Saggio82",
            "body": "Non so se può aiutare, ma non vedevo nemmeno io la tessera, quindi sono andato su Acquista - Abbonamenti - Tessere fisiche - Rendi digitale (sotto la tessera fisica). Probabilmente lo avevi già fatto.",
            "score": 1,
            "created_utc": 1734452650.0
        },
        {
            "author": "InformalRich",
            "body": "A parer mio, come già successo in passato, ATM ha lanciato la nuova applicazione senza fare alcuna tipologia di test.\n\nPer dirti: nei primi 2 giorni non mi riconosceva nemmeno il mio account ATM.",
            "score": 1,
            "created_utc": 1734514312.0
        },
        {
            "author": "xEchDaniel",
            "body": "Effettivamente mi sarei aspettato un’integrazione migliore con Apple/Google wallet",
            "score": 14,
            "created_utc": 1734366708.0
        },
        {
            "author": "MornwindShoma",
            "body": "Userà BT LE, che è decisamente diverso. Ci fai tecnologie come il Fast Pair di Android. L’unica cosa in comune con BT è la banda.",
            "score": 3,
            "created_utc": 1734381495.0
        },
        {
            "author": "likeeatingpizza",
            "body": "Già meglio di quella di Trenord che lo fa con un QR code",
            "score": 0,
            "created_utc": 1734370897.0
        },
        {
            "author": "aragost",
            "body": "La fermata sotto casa mia viene saltata causa lavori e viene riportato come se non avesse proprio linee. Aggiungo preferiti e non succede niente. Mi dice che non ho tessere anche se ho una normalissima tessera con abbonamento urbano. Il widget stato metro sempre tra le palle ma gli altri avvisi una volta visti spariscono per sempre. Lo scrolling e tutte le interazioni a 2fps. Insomma, non benissimo. Forse invece che rifarla ogni anno potrebbero farla una volta ma bene",
            "score": 3,
            "created_utc": 1734422746.0
        },
        {
            "author": "InformalRich",
            "body": "Ma anche banalmente il fatto che prima, cliccando su una fermata e poi su una data linea, potevi cliccare \"vedi su linea\" e ti caricava tutto il percorso della linea. Ora invece, non si sa bene perché, questo tasto è stato eliminato e devi fare tutto il giro dell'oca per trovarlo.\n\nSe fosse stato possibile, avrei detto a quelli di ATM di guardarsi come è fatta l'applicazione del TPL di Helsinki, che è la migliore che abbia mai visto.",
            "score": 1,
            "created_utc": 1734514470.0
        },
        {
            "author": "According_to_Mission",
            "body": "Infatti la tessera fisica viene disattivata se attivi quella digitale.\n\nIl che per me rende il servizio completamente inutile, meglio avere quella fisica che almeno non rischi ti si scarichi il cellulare.",
            "score": 7,
            "created_utc": 1734450963.0
        },
        {
            "author": "_TobiIsAGoodBoy_",
            "body": "Il motivo credo che sia che non è stato un semplice aggiornamento, la gestione dell'app è passata da un'azienda ad un'altra quindi è proprio nuova a tutti gli effetti e si vede che non hanno voluto mettere la dark mode (o forse più probabile non hanno fatto in tempo).",
            "score": 2,
            "created_utc": 1734429218.0
        },
        {
            "author": "mrcrs",
            "body": "Devi andare su acquista",
            "score": 3,
            "created_utc": 1734366072.0
        },
        {
            "author": "Odd_Comparison7360",
            "body": "io per l'obliterazione del biglietto singolo sono passato direttamente al pagamento col wallet: più veloce e meno problematico del qr code.",
            "score": 3,
            "created_utc": 1734365472.0
        },
        {
            "author": "xEchDaniel",
            "body": "A quanto ho letto per iPhone avviene tramite bluetooth, per Android via NFC ([qui](https://www.atm.it/it/ViaggiaConNoi/Abbonamenti/Pagine/Abbonamentosultelefono.aspx), sotto la sezione ”Per viaggiare, si convalida con l’app”",
            "score": 3,
            "created_utc": 1734365948.0
        },
        {
            "author": "Street-Inspectors",
            "body": "Entrambi, l’NFC ha una larga latenza per ora, meglio QR code.",
            "score": 1,
            "created_utc": 1734569767.0
        },
        {
            "author": "Hungry_War_2290",
            "body": "C'è scritto sul sito ATM:\n\n**Anche gli abbonamenti convenzionati, quelli agevolati ISEE e quelli con Esselunga si possono mettere sul telefono**\n\nBasta **salvare la tessera sulla app e passare all’abbonamento digitale** seguendo le istruzioni. \n\n**Quando l’abbonamento scade**:\n\n* rivolgetevi al vostro referente, se avete un **abbonamento convenzionato**",
            "score": 2,
            "created_utc": 1734373245.0
        },
        {
            "author": "hellomoto8999",
            "body": "abbonamento convenzionato? in che senso?",
            "score": 1,
            "created_utc": 1734373540.0
        },
        {
            "author": "MandehK_99",
            "body": ">Nessun accenno all'abbonamento in corso, nessuna rassicurazione che mi verrà mantenuto! Non cliccherò mai quel pulsante di conferma.\n\nUn po' too much ahahah, siamo veramente a questi livelli di paranoia?",
            "score": 8,
            "created_utc": 1734371188.0
        },
        {
            "author": "CapitalistFemboy",
            "body": "Beh insomma, vorrei proprio vedere come funziona con il bluetooth quando ci sono 5 tornelli in fila. E quanto ci mette ad aprirsi. E quante volte l'app sarà offline/buggata",
            "score": 1,
            "created_utc": 1734374139.0
        },
        {
            "author": "MandehK_99",
            "body": "Sono d'accordo, ma riguardo la tua motivazione... Sono uno che non perde mai nulla, ma perdere la tessera dell'atm nel mio caso sarebbe comunque più probabile del trovarmi col cellulare scarico 😂",
            "score": 1,
            "created_utc": 1734455446.0
        },
        {
            "author": "w0b",
            "body": "Ho visto, grazie. Comunque, visto che disattiva quella fisica, aspetto che lo testino gli altri.",
            "score": 6,
            "created_utc": 1734368086.0
        },
        {
            "author": "Malobestin0",
            "body": "Finchè rimani nella cerchia Mi1-Mi3 sì.\n\nMa per le mie esigenze il wallet/carta di credito è problematico perchè non si può usare sui treni fuori città (forse anche il qr code, ma tanto è talmente scomodo e inutilizzabile che ho dovuto per forza fare il biglietto cartaceo)",
            "score": 4,
            "created_utc": 1734365703.0
        },
        {
            "author": "Unbundle3606",
            "body": "Invece di integrarsi con Google Wallet, hanno fatto un'app NFC alternativa a Google Wallet.\n\nPoteva andare peggio, ma poteva anche andare meglio. \n\nCosì, se ci si dimentica di aprire a mano l'app ATM, parte direttamente il pagamento del biglietto singolo con la CC registrata in Wallet, anche se si ha un abbonamento attivo...",
            "score": 5,
            "created_utc": 1734370591.0
        },
        {
            "author": "Saggio82",
            "body": "Confermo, per iPhone solo via bluetooth o QR Code. Non l'ho ancora usata (questo mese non ho abbonamento attivo), ma già si capisce che si impallerà tutto nel momento in cui proverò ad utilizzarla. Ad ogni modo c'è un nota sotto la tessera che avvisa che \"l'app deve essere aperta sulla sezione wallet. In alternativa il lettore potrebbe leggere la carta del wallet dell'iPhone al posto della tessera dell'abbonamento\". A questo punto la tessera fisica rimane ancora la scelta migliore. Peccato perchè speravo nell'integrazione con il wallet di iOS in modo da poter passare tramite NFC di iPhone o meglio ancora dell'apple watch. :-(",
            "score": 5,
            "created_utc": 1734453845.0
        },
        {
            "author": "Malobestin0",
            "body": "Ah figo!  \nPurtroppo mi sembra di capire che invece per i biglietti siamo rimasti col QR\n\n[https://www.atm.it/it/ViaggiaConNoi/Biglietti/Pagine/Bigliettoapp.aspx](https://www.atm.it/it/ViaggiaConNoi/Biglietti/Pagine/Bigliettoapp.aspx)\n\nSpero sia solo questione di tempo...",
            "score": 2,
            "created_utc": 1734366946.0
        },
        {
            "author": "Hungry_War_2290",
            "body": "che se lo prendi con i punti Esselunga hai un forte sconto.",
            "score": 2,
            "created_utc": 1734373612.0
        },
        {
            "author": "hellomoto8999",
            "body": "francamente si. concordo con la paranoia.",
            "score": 15,
            "created_utc": 1734373293.0
        },
        {
            "author": "aragost",
            "body": "Visto il livello francamente scarsino di come è fatta la app mi sembra una preoccupazione più che ragionevole",
            "score": 5,
            "created_utc": 1734422937.0
        },
        {
            "author": "Unbundle3606",
            "body": "Stiamo entrambi parlando di un'app sviluppata da ATM?",
            "score": 5,
            "created_utc": 1734374597.0
        },
        {
            "author": "jacksp666",
            "body": "Ci vai tu all'atm point con fila / attesa di tre ore a spiegare che con la nuova app è sparito l'abbonamento se poi succede? E chissà se te lo sistemano poi, magari ti dicono di chiamare l'assistenza..",
            "score": 2,
            "created_utc": 1734440162.0
        },
        {
            "author": "AsocialRedditer",
            "body": "sì, e a ragion veduta.",
            "score": 1,
            "created_utc": 1734556551.0
        },
        {
            "author": "likeeatingpizza",
            "body": "Mi turba di più il fatto che abbiano tolto la dark mode guarda",
            "score": 2,
            "created_utc": 1734377529.0
        },
        {
            "author": "mrcrs",
            "body": "Io ero pronto ma mi dice che la mia tessera non è compatibile",
            "score": 1,
            "created_utc": 1734368172.0
        },
        {
            "author": "Odd_Comparison7360",
            "body": "mi sono mosso fino a villa fiorita/carugate con tanto di uso dell'autobus e non ho avuto problemi (ma l'ho fatto giusto una volta, solitamente per la metro vado a cologno nord)",
            "score": 1,
            "created_utc": 1734365840.0
        },
        {
            "author": "MandehK_99",
            "body": ">Invece di integrarsi con Google Wallet, hanno fatto un'app NFC alternativa a Google Wallet.\n\nMa seriamente? Potrebbe essere perché Google fa pagare per rendere la carta disponibile su Wallet?",
            "score": 2,
            "created_utc": 1734371435.0
        },
        {
            "author": "hellomoto8999",
            "body": "mai notato :O",
            "score": 1,
            "created_utc": 1734373874.0
        },
        {
            "author": "AsocialRedditer",
            "body": "idem",
            "score": 1,
            "created_utc": 1734556538.0
        },
        {
            "author": "MandehK_99",
            "body": "Hahahah capisco il cinismo ma allo stesso tempo sono convinto che si siano posti il problema",
            "score": 2,
            "created_utc": 1734376020.0
        },
        {
            "author": "MandehK_99",
            "body": "Ok ma mi sembra un pessimismo un po' estremo\n\nStavolta stanno davvero puntando sull'app, stanno anche sostituendo i cartelli degli orari alle fermate del bus con dei cartelli che includono qr code per scaricare l'app.",
            "score": 0,
            "created_utc": 1734440677.0
        },
        {
            "author": "InternationalDay3400",
            "body": "Potrebbe essere un abbonamento in convenzione?",
            "score": 1,
            "created_utc": 1734370519.0
        },
        {
            "author": "MandehK_99",
            "body": "Da quanto tempo hai la tessera? La mia sarebbe dovuta scadere nel 2021, non ho ancora provato a fare la conversione in digitale",
            "score": 1,
            "created_utc": 1734370811.0
        },
        {
            "author": "Malobestin0",
            "body": "Non lo metto in dubbio, ma ATM è abbastanza chiara\n\n*il pagamento con carta di credito* ***vale solo sulle linee ATM (non vale sulle linee S che attraversano il passante ferroviario, né sui treni)***\n\n[https://www.atm.it/it/ViaggiaConNoi/Biglietti/Pagine/Biglietticoncarta.aspx](https://www.atm.it/it/ViaggiaConNoi/Biglietti/Pagine/Biglietticoncarta.aspx)",
            "score": 5,
            "created_utc": 1734366024.0
        },
        {
            "author": "mrcrs",
            "body": "No, regolare da 330",
            "score": 1,
            "created_utc": 1734370538.0
        },
        {
            "author": "mrcrs",
            "body": "La mia sarebbe dovuta scadere a gennaio 24. Potrebbe centrare che era una vecchia tessera studenti? E ora sono non studente over 27? Quando riesco faccio un salto all’ATM point",
            "score": 1,
            "created_utc": 1734370941.0
        },
        {
            "author": "InformalRich",
            "body": "> il pagamento con carta di credito vale solo sulle linee ATM (non vale sulle linee S che attraversano il passante ferroviario, né sui treni)\n\nSe non erro succede perché i controllori di Trenord non hanno ancora modo di verificare il pagamento con i loro palmari (e questa roba va avanti ormai da anni).",
            "score": 1,
            "created_utc": 1734514670.0
        },
        {
            "author": "MandehK_99",
            "body": "Anche la mia è una vecchia tessera studenti, però sono ancora under 27",
            "score": 1,
            "created_utc": 1734371506.0
        }
    ]
}