{
    "post_title": "Looking to meet people ",
    "post_author": "LordEdrion",
    "post_score": 1,
    "post_url": "https://www.reddit.com/r/Luxembourg/comments/1hkjpgi/looking_to_meet_people/",
    "comments": [
        {
            "author": "Glittering_Shirt5274",
            "body": "Try « Time left ». You have dinner with people you don’t know and who are most of the time new in the city, just like you. \n\nYou can also take salsa classes. Women outnumber men.",
            "score": 5,
            "created_utc": 1734948855.0
        },
        {
            "author": "spritemarkiv",
            "body": "Join a choir. The girl to guy ratio is usually 5:1. As a guy it won't matter if you can sing. It's also a great way to meet new friends.",
            "score": 6,
            "created_utc": 1734944043.0
        },
        {
            "author": "MathematicianDry2437",
            "body": "Welcome to Luxembourg! I have come to realize that Adult friendship is tough everywhere and not just in Luxembourg.\n\nWhat do you enjoy doing for hobbies, that is the easiest way to make friends anywhere. You like to read join a book club, you like to cycle join a cycling club etc \n\nAlso, if you are a Christian, the church is a good place as well to meet people and make friends. \n\nI like great discussions too. Happy to be messaged , if  you want to hang out and discuss diverse topics over coffee or tea.",
            "score": 2,
            "created_utc": 1734951475.0
        },
        {
            "author": "Artistic-Occasion-55",
            "body": "I guess it would mostly depend on what you are interested in ? e.g. what are typical \"things\" you enjoy sharing with others e.'g music/ concerts, sharing food, nature outings, etc?",
            "score": 1,
            "created_utc": 1734958500.0
        },
        {
            "author": "InspectorJacko859",
            "body": "In the choirs I know most of the ladies are over 60... unless there are others...",
            "score": 5,
            "created_utc": 1734950051.0
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "created_utc": 1734944210.0
        },
        {
            "author": "spritemarkiv",
            "body": "Check out voicesinternational.lu",
            "score": 2,
            "created_utc": 1734954071.0
        },
        {
            "author": "AutoModerator",
            "body": "Hi, your Reddit account is not allowed to comment in our community. Low comment karma is not trusted. You are only allowed to post. Until you have a trusted account with enough postive karma to satisfy our Automoderator, please accept the answers you are given.  If you have a support-related inquiry, please search the community for similar posts, including the weekly *Megathreads* which are pinned to the top of our home page. Take the time to learn about being a good Redditor. Consult these resources ( r/NewToReddit | https://www.reddit.com/r/help/| https://support.reddithelp.com/hc/en-us/p/redditor_help_center ) \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Luxembourg) if you have any questions or concerns.*",
            "score": 1,
            "created_utc": 1734944211.0
        },
        {
            "author": "Anxious-Armadillo565",
            "body": "And the university choir. They recruit from the general public as well, especially men",
            "score": 1,
            "created_utc": 1734958003.0
        }
    ]
}