{
    "post_title": "Routemaster at Cannon Street",
    "post_author": "Reasonable-Try2033",
    "post_score": 49,
    "post_url": "https://i.redd.it/lkqji9b9wj8e1.jpeg",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "# Upvote/Downvote reminder\n\nLike this image or appreciate it being posted? Upvote it and show it some love! Don't like it? Just downvote and move on. \n\n*Upvoting or downvoting images it the best way to control what you see on your feed and what gets to the top of the subreddit*\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/london) if you have any questions or concerns.*",
            "score": 1,
            "created_utc": 1734938971.0
        },
        {
            "author": "Lets_trythisone",
            "body": "They’re run by a private company, you can hop on and pay which is only a little more than a normal bus, staff are great & buses immaculate but don’t book in advance, they don’t run to the timetable or both to responding to emails so it’s more a case just grabbing one when you can.",
            "score": 8,
            "created_utc": 1734942515.0
        },
        {
            "author": "SilverGoon",
            "body": "There have been heritage buses on the 15 bus route for years. I worked on the upgrade of bank station (2017-2019) and would see them all the time",
            "score": 3,
            "created_utc": 1734943585.0
        },
        {
            "author": "Qualabel",
            "body": "That's Bank (station) though",
            "score": 13,
            "created_utc": 1734940715.0
        },
        {
            "author": "Lets_trythisone",
            "body": "[https://londonerbuses.co.uk/heritage-route-t15/](https://londonerbuses.co.uk/heritage-route-t15/)",
            "score": 3,
            "created_utc": 1734942557.0
        },
        {
            "author": "blitzandheat",
            "body": "First time in london?",
            "score": 4,
            "created_utc": 1734941163.0
        },
        {
            "author": "SleepyTester",
            "body": "I used to love getting a Routemaster from Liverpool St when it was still in regular service back in 2001. Even then it felt like a little slice of London history and something to treasure because it would soon be gone.\n\nNice to see one working the streets on London today. I’m surprised (but pleased) tfl are allowed to still use them for actual bus services",
            "score": 2,
            "created_utc": 1734940218.0
        },
        {
            "author": "Vivid_Pink_Clouds",
            "body": "I loved being able to hop on and off at will. Can we get that back post Brexit?",
            "score": 2,
            "created_utc": 1734940245.0
        },
        {
            "author": "DistractedByCookies",
            "body": "God, they are just so much more charming than modern models. Simply iconic.",
            "score": 1,
            "created_utc": 1734943701.0
        },
        {
            "author": "I_am_John_Mac",
            "body": "I love how that station entrance only came into existence two years ago, yet it blends in and looks like it has been there for years.",
            "score": 1,
            "created_utc": 1734950327.0
        },
        {
            "author": "CS1703",
            "body": "Tried to ride one of these a few years back, didn’t do contactless, I wonder if it’s changed post covid?",
            "score": 1,
            "created_utc": 1734952840.0
        },
        {
            "author": "johnngnky",
            "body": "if only they had gps tracking 😔",
            "score": 1,
            "created_utc": 1734949494.0
        },
        {
            "author": "starderpderp",
            "body": "I had no idea I could actually hop on when I saw these buses! I just thought it was someone renting out the old bus for a corporate/social thing!\n\nThanks for letting us know!",
            "score": 1,
            "created_utc": 1734955460.0
        },
        {
            "author": "HighburyAndIslington",
            "body": "The street itself is Cannon Street, though.",
            "score": 17,
            "created_utc": 1734942223.0
        },
        {
            "author": "Reasonable-Try2033",
            "body": "Nope. Been here all my life.",
            "score": 2,
            "created_utc": 1734950875.0
        },
        {
            "author": "Reasonable-Try2033",
            "body": "I just say I didn’t realise it had been there that long. But you’re right about it blending in.",
            "score": 1,
            "created_utc": 1734951017.0
        },
        {
            "author": "Lets_trythisone",
            "body": "If they did you’d see there’s probably on two buses working when they claim there’s 8 🤣",
            "score": 3,
            "created_utc": 1734950961.0
        },
        {
            "author": "Lets_trythisone",
            "body": "I only noticed it when I finally got on one after an hour wait! I think it’s about 75p more than your average bus. If I still used that route I’d travel that way every time one pulled up.\n\nIt’s only that route though, so pay attention, we don’t want you accidentally ending up at a wedding reception",
            "score": 2,
            "created_utc": 1734957003.0
        },
        {
            "author": "MissKatbow",
            "body": "Wouldn’t you say on Cannon Street then?  Unless you were by a junction with Cannon Street maybe.",
            "score": 6,
            "created_utc": 1734944989.0
        },
        {
            "author": "starderpderp",
            "body": "Hahaha. One of my best friends hires these for her weddings it's why I originally thought these buses were for corp/social events. \n\nThank you for the info!",
            "score": 2,
            "created_utc": 1734960101.0
        },
        {
            "author": "Reasonable-Try2033",
            "body": "To clarify the location, ON Cannon Street outside the new entrance to Bank Station and a stones throw away from Cannon Street Station!",
            "score": 2,
            "created_utc": 1734950944.0
        },
        {
            "author": "Lets_trythisone",
            "body": "Well, I’ve spent a morning promoting a company that really don’t deserve it but we’ve got to keep these route Masters on the road",
            "score": 1,
            "created_utc": 1734961867.0
        }
    ]
}