{
    "post_title": "Hova vigyek régi erdész gyűrűt javításra?",
    "post_author": "MrP-YL",
    "post_score": 15,
    "post_url": "https://www.reddit.com/r/budapest/comments/1hjycxb/hova_vigyek_régi_erdész_gyűrűt_javításra/",
    "comments": [
        {
            "author": "jucusinthesky",
            "body": "Mi lassan 30 éve járunk Budaörsre a Máthé ékszerészetbe, javíttatni, formából öntetni, rajz alapján… messze van de megéri.",
            "score": 11,
            "created_utc": 1734874721.0
        },
        {
            "author": "Necessary_Pollution",
            "body": "Én annak idején a karika gyűrűket csináltattam a Mihailovics Manufaktúrában, Mihailovics Andrással (régen Soroksáron dolgozott, most a 17. kerület). Megbízható, precíz, kifejezetten igényes, viszont nem tudom, hogy foglalkozik-e javítással, de egy kérdést szerintem megér.\n\nLink: [Mihailovics Manufaktúra](https://www.mihalovitsmanufaktura.hu/)",
            "score": 6,
            "created_utc": 1734875349.0
        },
        {
            "author": "Icy-Window-181",
            "body": "Én tudom, hol készítik ezeket a gyűrűket, vagy legalábbis 10+ éve hol készítették. Ugyanilyenem van, csak lófejjel (a kőszegi lovászoknak készítenek ilyet, illetve a mezőgazdasági szaknak búzakalásszal - a sulitól tudom, én nem oda jártam).\n\nMegpróbálom kideríteni, de valahol a Ferenciek tere környékén volt az ékszerész, aki nekem is csinált ilyet.",
            "score": 5,
            "created_utc": 1734876046.0
        },
        {
            "author": "AdvantageAutomatic30",
            "body": "Sopronban évente 40-50 db-t adnak el. Na ott javítják is.",
            "score": 5,
            "created_utc": 1734877221.0
        },
        {
            "author": "Fun-Jellyfish1",
            "body": "https://ekszerkeszito.hu/ Ferenciek terénél van.",
            "score": 5,
            "created_utc": 1734883486.0
        },
        {
            "author": "Natural-Put",
            "body": "Nem tudom miért gondolod hogy az ékszerészek ne tudnák a dolgukat. Abból élnek.",
            "score": 6,
            "created_utc": 1734874155.0
        },
        {
            "author": "Capital_Army_1059",
            "body": "Esetleg Sopron, Miskolc, Dunaújváros, talán Székesfehérvár. Ezeken a helyeken őrzik a bányász hagyományokat, ahol elég sok ilyen gyűrű található. Szóval jó eséllyel hozzá értő ékszerész is. :)",
            "score": 1,
            "created_utc": 1734905038.0
        },
        {
            "author": "Tight_Web_3162",
            "body": "[https://www.belvarantik.hu](https://www.belvarantik.hu) Belvárosi Antikvitás, Veres Pálné utca",
            "score": 1,
            "created_utc": 1734910170.0
        },
        {
            "author": "Gwellian",
            "body": "Én is itt vettem annó, anyukám erdész volt, neki volt, én nagyon megszerettem, azért nem adta nekem mert az is el volt vékonyodba, ezért ott vettünk nekem egy újat.",
            "score": 1,
            "created_utc": 1734900307.0
        },
        {
            "author": "MrP-YL",
            "body": "Az ékszerekhez persze értenek, de az erdész gyűrű ördöglakat is egyben. Lehet valaki harminc éve ékszerész, de ha még életében nem látott ilyet, nem fogja tudni hogyan kell visszahajlítani rendesen.\n\nAztán lehet hogy nem olyan ritka ez a fajta gyűrű mint gondolom, de ez az amit nem tudok.\n\nMeg persze nem minden ékszerbolt egyenlő. Olvastam pár nem kicsit rémisztő véleményt google mapen egyes helyekről.",
            "score": 0,
            "created_utc": 1734875080.0
        },
        {
            "author": "kress5",
            "body": "kerdezz korbe a kozeli erdeszeteknel, agrar sulikban ha nagyon felsz egy atlag ekszeresztol, de azokba is siman behemetsz megkerdezni tudnak-e vele kezdeni valamit\n\npar eve meg adtak ilyen gyurut szoval nem ilyen krisztus elotti ez a dolog",
            "score": 6,
            "created_utc": 1734875864.0
        },
        {
            "author": "kepzol",
            "body": "Ha csak ez aggaszt akkor lehet kicsit túlgondolod a dolgot. Ez a típusú gyűrű egyáltalán nem ritka, a legtöbb ékszerész találkozhatott már ilyennel, mivel hosszú évtizedek óta hagyomány a viselése a selmeczi utódiskolák hallgatóinak körében. Szóval elég könnyen találhatsz olyat akire bátran rábízhatod, csak ne plázafolyosós bóvliárushoz menj, hanem rendes órás-ékszerészhez. Egyébként öröm látni, hogy nem hagysz elkallódni egy ilyen tárgyat, remélem sikerül megjavíttatnod.",
            "score": 5,
            "created_utc": 1734879066.0
        },
        {
            "author": "Natural-Put",
            "body": "Szerintem meg túlbonyolítod. Spekulálsz mindenen ahelyett hogy bemennél a legközelebbi ékszerészhez és megkérdeznéd mi a helyzet.",
            "score": 4,
            "created_utc": 1734875216.0
        },
        {
            "author": "CloudCalmaster",
            "body": "Mátrafüredi és a Soproni erdész suliban tutira adnak ilyet. Gondolom van egy fix emberük aki csinálja. Egy telefon és adnak kontaktot.",
            "score": 5,
            "created_utc": 1734878124.0
        }
    ]
}