{
    "post_title": "Find a friend this week!",
    "post_author": "AutoModerator",
    "post_score": 8,
    "post_url": "https://www.reddit.com/r/Birmingham/comments/1hfiky5/find_a_friend_this_week/",
    "comments": [
        {
            "author": "Ok-Cockroach-7257",
            "body": "25m Always looking for friends who like the outdoors and cats, I just got a new townhouse, and I know I'm going to go crazy living alone. So I'd like to meet some new friends, I run a surplus store and love antiques. I have 2 cats I rescued who are the sweetest, I'm 2 years sober. Love me some insomniacs like myself, also would love an Italian food lover because I want to take someone to Italian",
            "score": 2,
            "created_utc": 1734435323.0
        },
        {
            "author": "but_heres_the_meower",
            "body": "25f, looking for female friends! I want an accountability buddy for personal goals(study, career, health, etc) who I can also just hang out with. Like if u want body double for studying, practicing art skills, so on and so forth, I'm right here!!!\n\nI'm currently:\n- preparing to change career\n- studying for CompTIA Network+ certification \n- trying to find ways to get back into art: drawing, painting, just tried terra cotta sculpting last weekend, interested in making collage, etc. I use both digital and traditional mediums, but would like to rely less on digital and exlore more traditional mediums. I'm a burnt out ex art student.\n- ESL speaker\n- not an avid gamer but currently hooked on stardew valley for like 3rd time & also trying start playing Minecraft \n- I LOVE CATS!!!!!!!\n- I'm a lesbian, married since last August 💖\n- my top 3 artists on spotify wrapped this year was Haifa Wehbe, Sir Mix-a-lot, and Zemfira\n\nI moved from another state to a small town near auburn, then to bham, so I'm itching to find new people here  Let's meet, chat & grow together!!",
            "score": 2,
            "created_utc": 1734640748.0
        },
        {
            "author": "ih8myself420",
            "body": "Hi all! 24F here. I love thrifting/antiquing, anything outdoors, journaling, and recently I’ve been trying to tap back into my creative side more with art. I’ve also been trying to get back into roller skating and yoga, those are always better with a friend! Additionally, I currently work with kids with autism which keeps me busy during the week, but I’d love to meet new people in the evenings/weekends and find some chill, like-minded people!",
            "score": 1,
            "created_utc": 1734527415.0
        },
        {
            "author": "Grand-Hospital8803",
            "body": "20f\nCollege student \nLikes roller skating \nAlmost done with comp sci degree",
            "score": 1,
            "created_utc": 1734586243.0
        },
        {
            "author": "cutesymochi",
            "body": "Hi! I’m looking for at least one more girl friend to play Stardew with! I have 2 other girl friends that play Stardew and Id love to have a little 4 girl Stardew group going! We’re all in our 20s and we play on pc. I/we use discord too!",
            "score": 1,
            "created_utc": 1734703409.0
        },
        {
            "author": "ClarpTibbs",
            "body": "28m looking for some male friends! I’ll save the long story, but I stepped out of religion and trying to find a community outside of the church. I’m down with pretty much anything outside, motorcycles, bars/food, hangouts with pets (my wife and I have a Great Dane), and low skill video games. I also work in animation and do a little photography so open to anything creative!",
            "score": 1,
            "created_utc": 1734927752.0
        },
        {
            "author": "Ok-Cockroach-7257",
            "body": "I just got a townhouse and need furniture. I'm looking for an antiquing buddy. I'll message you",
            "score": 1,
            "created_utc": 1734560908.0
        },
        {
            "author": "Ok-Cockroach-7257",
            "body": "@ih8myself",
            "score": 1,
            "created_utc": 1734647395.0
        },
        {
            "author": "Xelliz",
            "body": "Gz on the pending IT degree.  Are you looking at any certifications?",
            "score": 1,
            "created_utc": 1734661436.0
        },
        {
            "author": "Grand-Hospital8803",
            "body": "Is that a social handle or a mean comment? I can’t tell",
            "score": 1,
            "created_utc": 1734647755.0
        },
        {
            "author": "Grand-Hospital8803",
            "body": "Nope. Just finished a hellish semester. Just been enjoying the break",
            "score": 1,
            "created_utc": 1734662183.0
        },
        {
            "author": "Ok-Cockroach-7257",
            "body": "Lol social handle, u/ih8myself420",
            "score": 1,
            "created_utc": 1734648200.0
        }
    ]
}