{
    "post_title": "Please build a metro… traffic is horrible ",
    "post_author": "Megatron3600",
    "post_score": 59,
    "post_url": "https://www.reddit.com/r/Vilnius/comments/1higsdf/please_build_a_metro_traffic_is_horrible/",
    "comments": [
        {
            "author": "krispisss",
            "body": "Ok we start tomorrow",
            "score": 177,
            "created_utc": 1734689720.0
        },
        {
            "author": "JoshMega004",
            "body": "I'll get right on that.\n\nThanks though. I never realized that having big city traffic jams in a mid size city was bad until today.",
            "score": 53,
            "created_utc": 1734689762.0
        },
        {
            "author": "Tamsta-273C",
            "body": "Or lets build zeppelins, it's cool, it doesn't need roads or tunnels",
            "score": 27,
            "created_utc": 1734690963.0
        },
        {
            "author": "Ill_Special_9239",
            "body": "Somehow smaller or similar population cities (Tallinn, Thessaloniki, Charleroi, Copenhagen, Helsinki, Lille, Lyon, Rennes, Toulouse, Nurnberg, Brescia, Catania, Bilbao) all have either a metro or an S-Bahn type of public transportation. Vilnius acts like we have no money to fund this but half of these cities have smaller budgets, significantly more corruption and still got it done. We have no excuses - other than incompetency and narrow-mindedness.",
            "score": 24,
            "created_utc": 1734711432.0
        },
        {
            "author": "HeyManNiceShot11",
            "body": "Ok, you’re financing",
            "score": 20,
            "created_utc": 1734690802.0
        },
        {
            "author": "ganriki_medis",
            "body": "Next year we will have a few more boats on Neris! That will solve everything!",
            "score": 16,
            "created_utc": 1734691007.0
        },
        {
            "author": "LongPickle",
            "body": "Hi,\n\nCurrently I am too busy. But I have it scheduled for 2030. \n\nKind Regards,\n\nLongPickle",
            "score": 14,
            "created_utc": 1734696705.0
        },
        {
            "author": "GrynaiTaip",
            "body": "You hope that everyone will jump into metro and then the streets will be empty and you will be able to drive your car without issues everywere?\n\nYeah, everyone else has the same plan.\n\nFunny thing: today I had to drive across the city a few times, traffic at 1pm was hell, yet somehow at 5pm (regular peak traffic jams) it was almost empty. What took me almost an hour at 1pm now took just 20 minutes.",
            "score": 12,
            "created_utc": 1734719199.0
        },
        {
            "author": "aurimux",
            "body": "No thank you, traffic is bad during christmas craze? You are part of that traffic, so please get out of the car",
            "score": 10,
            "created_utc": 1734704707.0
        },
        {
            "author": "PasDeTout",
            "body": "Laughs in London traffic jams.\n\nI would like trams though. I think they’re very good ways of moving people around. And to get cyclists off pavements and onto roads.",
            "score": 6,
            "created_utc": 1734718720.0
        },
        {
            "author": "LinasIsTaken",
            "body": "I hate Zuokas mayor...but he was right in 2005.(Or in which year) .. Vilnius needs a metro. But it's expensive. And i think in 30 years, it's not gonna happen. Not even start talking about that",
            "score": 5,
            "created_utc": 1734702890.0
        },
        {
            "author": "blaivas007",
            "body": "Ok. You are funding this, right?",
            "score": 4,
            "created_utc": 1734699025.0
        },
        {
            "author": "depressedsoul027",
            "body": "No, no, lets use the boats in the river",
            "score": 3,
            "created_utc": 1734693488.0
        },
        {
            "author": "Rich_Organization_15",
            "body": "Nah, won't work - you can’t get locals out of their cars, so I would suggest a Vilnius Loop - Musk’s Vegas Loop-like, but with Priuses instead of Teslas ;-)",
            "score": 3,
            "created_utc": 1734697071.0
        },
        {
            "author": "MadamIzolda",
            "body": "Doesn't make sense to dig on our not-too-dencely packed town. A tram line or an overground/DLR style rail would make more sense.\n\n\n\n\nBut I agree, cars in VLN often make me want to move somewhere else",
            "score": 3,
            "created_utc": 1734780026.0
        },
        {
            "author": "alteregooo",
            "body": "how about no\n\nyou can start using the current public transportation instead",
            "score": 4,
            "created_utc": 1734705206.0
        },
        {
            "author": "ApprehensiveTruck655",
            "body": "Impossibile to biuld a metro in Vilnius. The city was disegned so bad that in some streets you do not even have sidewalks.",
            "score": 8,
            "created_utc": 1734690685.0
        },
        {
            "author": "Firm-Chest-7628",
            "body": "Traffic in Vilnius can be solved fast and cheap. Metro is very expensive. Too expensive",
            "score": 9,
            "created_utc": 1734690436.0
        },
        {
            "author": "Friendly_Ostrich8320",
            "body": "Hi guys,\nThinking about visiting Vilnius and other cities in Lithuania and using public transports to go to places I want to go.",
            "score": 2,
            "created_utc": 1734692517.0
        },
        {
            "author": "Shetakubas",
            "body": "Cashapp 500€. Will get on it immediately👍",
            "score": 2,
            "created_utc": 1734704483.0
        },
        {
            "author": "somerandomnamei",
            "body": "Zuokas, is that you Brother?",
            "score": 2,
            "created_utc": 1734706494.0
        },
        {
            "author": "mantroomen",
            "body": "Or metro-tram and independent bus lanes",
            "score": 2,
            "created_utc": 1734719530.0
        },
        {
            "author": "Phalanges-Magnum",
            "body": "How about just don't drive mmmmkay",
            "score": 2,
            "created_utc": 1734744498.0
        },
        {
            "author": "Rand2Bs",
            "body": "OR charge entrance to central Vilnius a fee of €12 per day, but before that, sort out public transport starting with buses. If the city can't operate a bus schedule, how fhey will manage with the underground/metro..",
            "score": 2,
            "created_utc": 1734756615.0
        },
        {
            "author": "dissmisa",
            "body": "Sure. That would be 2,3 trillion euros and we finish 2089. Maybe…",
            "score": 2,
            "created_utc": 1734782333.0
        },
        {
            "author": "Mountain-Caramel4149",
            "body": "Sure.\nStarting right after stadium is finished :/",
            "score": 2,
            "created_utc": 1734784966.0
        },
        {
            "author": "Outrageous_Log_6727",
            "body": "Several billion euros and off we go.",
            "score": 2,
            "created_utc": 1734788832.0
        },
        {
            "author": "senisjura",
            "body": "Many traffic jams would be reduced if everyone had schools or kindergartens in their own neighborhoods. However, we continue to build new ones without investing in the necessary infrastructure.",
            "score": 2,
            "created_utc": 1734816509.0
        },
        {
            "author": "Kornjii",
            "body": "Personally, a better alternative to this would be investing money in the available public transport systems. Increasing the frequency of the buses for ex., will help reduce the number of private vehicles on the roads and thus relieve traffic congestion. Building a metro sounds very attractive, but it is an intricate project that requires much planning and time and costs a great amount of money.",
            "score": 2,
            "created_utc": 1734820279.0
        },
        {
            "author": "bronele",
            "body": "It's the last working days before holidays/new year. At this time of the year every town needs a metro.\nThere's more movement on the streets, more sales, bigger queues at the parcel lockers.\nPlease be more mindful, try not to let your emotions take over and let them out on other people.\n\nEverybody has places to be, everyone is in a hurry, not just you.",
            "score": 2,
            "created_utc": 1734701420.0
        },
        {
            "author": "dimkasuperf",
            "body": "Eventually we'll have to do it. I'd say we're just in a stage of denial now.",
            "score": 1,
            "created_utc": 1734699279.0
        },
        {
            "author": "baltbcn90",
            "body": "Yeah you're not wrong. The road system is a disaster. This medium size city (600k) has worse traffic than cities with millions of people in other parts of Europe. The metro idea would be too expensive. I do think adding in more designated turn lanes (center and sides), green arrows, allowing right turns on red and 3-4 trams lines would help and a cheaper solutions. Adding more bike lanes in a country were its cold, dark and rainy/snowy 9 months per year seems ridiculous.",
            "score": 1,
            "created_utc": 1734701207.0
        },
        {
            "author": "nerodiskburner",
            "body": "Start walking.",
            "score": 1,
            "created_utc": 1734706942.0
        },
        {
            "author": "CiupapaMunianio",
            "body": "How could we not think of that earlier?! 😮😮😮",
            "score": 1,
            "created_utc": 1734739196.0
        },
        {
            "author": "CarpetOnDaWall",
            "body": "Just live in a proper town and dont have such problems",
            "score": 1,
            "created_utc": 1734810056.0
        },
        {
            "author": "OriginalTuna",
            "body": "maybe monorail?",
            "score": 1,
            "created_utc": 1734851239.0
        },
        {
            "author": "MN1976MN",
            "body": "😅😅😅😅🤡🤡🤡",
            "score": 1,
            "created_utc": 1734852118.0
        },
        {
            "author": "NewMeasurement1070",
            "body": "So Zuokas was right all along 😅",
            "score": 1,
            "created_utc": 1734862010.0
        },
        {
            "author": "Dziki_Jam",
            "body": " Metro has nothing to do with traffic if you suck at urban design. And you can get rid of traffic without building metro. \nSo, I’d suggest demanding good urban design instead of vanity fair project that will suck the money and leave the traffic jams.",
            "score": 1,
            "created_utc": 1734880027.0
        },
        {
            "author": "C-Class_hero_Satoru",
            "body": "Never had problem with public transport in Vilnius, public transport go on bus line and has priority.\n\nOr do you talk about driving a car? I don't know how metro is going to make traffic better if you don't plan to use it. The problem that most Lithuanians choose car vs public transport, and unlike in western Europe we have a stereotype that public transport is for poor people.\n\nPeople think \"let's build metro, so traffic for my car will be better\" but if everyone is going to think like that it won't change anything. You have to be committed to use public transport.",
            "score": 1,
            "created_utc": 1734933127.0
        },
        {
            "author": "Low_Station_5864",
            "body": "Yesyesweneedmetrobruh",
            "score": 1,
            "created_utc": 1734946384.0
        },
        {
            "author": "arxxas",
            "body": "We will draw more bicycle lines",
            "score": 2,
            "created_utc": 1734689714.0
        },
        {
            "author": "toroidthemovie",
            "body": "No metro, just a tram.",
            "score": 1,
            "created_utc": 1734697590.0
        },
        {
            "author": "mainhattan",
            "body": "A metro from where to where? :-)\n\nVilnius is a village, not a city.\n\nAll it really needs is fewer cars, and genuine enforcement of the actual traffic laws.\n\nThere is plenty of scope for improving traffic, encouraging use of public transport, walking, bikes, etc etc etc.\n\nAll it will take is enough citizens to actually calm down, think clearly, and work together.\n\nTherefore I do not see it happening in my lifetime ;-p",
            "score": 1,
            "created_utc": 1734727797.0
        },
        {
            "author": "mirtis_rusams",
            "body": "lmao and be sensical? fuck no let's build 2 more stadiums",
            "score": 1,
            "created_utc": 1734714740.0
        },
        {
            "author": "prepsaro",
            "body": "I would say neither metro or tram will solve the problem. The biggest problem is the suburbs with poor to zero social infrastructure. People are obliged to depend on private cars in order to get to work and take their children to kindergardens, schools, etc. It's been growing problem for the last 20 years and it's only escalating further exponentially. I don't know the solution either, unfortunately.",
            "score": 1,
            "created_utc": 1734859425.0
        },
        {
            "author": "AssumptionExtra9041",
            "body": "Traffic is actually really horrible, although the public transportation isn't bad. But I guess increasing wealth leads to.higher car ownership which currently shows its challenges in a non-car-centric city design",
            "score": 1,
            "created_utc": 1734690406.0
        },
        {
            "author": "I_like_bloos",
            "body": "Can't. Too much historically significant stuff underground\nEdit: trams would be nice tho",
            "score": 0,
            "created_utc": 1734698396.0
        },
        {
            "author": "Intelligent_Algae_84",
            "body": "go back to your country",
            "score": -1,
            "created_utc": 1734698252.0
        },
        {
            "author": "Megatron3600",
            "body": "Thank you",
            "score": 29,
            "created_utc": 1734691519.0
        },
        {
            "author": "Megatron3600",
            "body": "I wouldn’t call 401 sq km mid size",
            "score": 3,
            "created_utc": 1734690627.0
        },
        {
            "author": "vxndel",
            "body": "please no more zeppelins in the sky, one is enough",
            "score": 10,
            "created_utc": 1734691145.0
        },
        {
            "author": "Unhappy-Poetry-7867",
            "body": "Why are you looking back?? Look to the future! Only flying cars for me, please!",
            "score": 0,
            "created_utc": 1734737303.0
        },
        {
            "author": "DJRichardo",
            "body": "As estonian i don’t agree. Vilnius traffic was really good, easy going and simple. Tallinn is fcked up. Mostly thanks to Russians.",
            "score": 1,
            "created_utc": 1734919182.0
        },
        {
            "author": "Fresh-Band-3333",
            "body": "With the number of hills in Vilnius, the cost will be insane. And how do you think metro will go through Neris? It will not? Good luck complaining about people jams near bridge areas",
            "score": 1,
            "created_utc": 1734873617.0
        },
        {
            "author": "Unhappy-Poetry-7867",
            "body": "Yea and Vilnius still doesn't have a stadium. So I wouldn't rush with any metro.",
            "score": -1,
            "created_utc": 1734737364.0
        },
        {
            "author": "senisjura",
            "body": "Tallin doesnt have metro and their \"s-bahn\" is same shit we got going from Vilnius to for example Trakai",
            "score": -1,
            "created_utc": 1734816282.0
        },
        {
            "author": "mainhattan",
            "body": "For sure that's part of it. A very car-brained city.",
            "score": 1,
            "created_utc": 1734727920.0
        },
        {
            "author": "ex0oleg",
            "body": "Get out of the car and do what? Tell me better alternative. Public transportation sucks in Vilnius",
            "score": 4,
            "created_utc": 1734779225.0
        },
        {
            "author": "Dziki_Jam",
            "body": "If complainers don’t use the busses, why would they use the metro?\nAnd here’s how our further might go:\n- They don’t use the busses because they suck. \n- Why do you think the metro won’t suck?\n- Because we will build it properly.\n- How can we build the metro properly if the busses suck?\n\nSo, I’d suggest fixing busses. That’s cheaper. Traffic is all about organizing it, there’s no silver bullet.",
            "score": 1,
            "created_utc": 1734880509.0
        },
        {
            "author": "mirtis_rusams",
            "body": "imma pass, going one hour from the fucking station to the university? i have better ways to spend that time.",
            "score": 1,
            "created_utc": 1734714835.0
        },
        {
            "author": "No_Men_Omen",
            "body": "Too expensive, yes. But the advantage of the metro system is that one can ignore most of the city design flaws. Trams, on the other hand, are much more reliant on the existant road network. Yet I believe we should build tram network first, and then to plan for metro, if needed.",
            "score": 8,
            "created_utc": 1734693756.0
        },
        {
            "author": "arxxas",
            "body": "Will you keep us here waiting for the solution forever?",
            "score": 22,
            "created_utc": 1734693129.0
        },
        {
            "author": "fbecart",
            "body": "Buses are great in Vilnius (use the App called Trafi to quickly find your way). Also, the center is so small you can do a lot just walking.",
            "score": 1,
            "created_utc": 1734941442.0
        },
        {
            "author": "mirtis_rusams",
            "body": "everything other than Vilnius you'd be set",
            "score": 1,
            "created_utc": 1734714796.0
        },
        {
            "author": "Dziki_Jam",
            "body": "Could you give some researches where we could compare the traffic?",
            "score": 0,
            "created_utc": 1734880986.0
        },
        {
            "author": "Tamsta-273C",
            "body": "What actually works, imagine all botl/wolt food worker would ride around in cars...",
            "score": 16,
            "created_utc": 1734690763.0
        },
        {
            "author": "Parking_Drawer5752",
            "body": "401 sq km is not village",
            "score": 1,
            "created_utc": 1734732575.0
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 20,
            "created_utc": 1734690901.0
        },
        {
            "author": "Megatron3600",
            "body": "Explain",
            "score": 2,
            "created_utc": 1734701020.0
        },
        {
            "author": "Ill_Special_9239",
            "body": "It's ok to have a metro and not be a large city. \n\nWe need a metro, S-Bahn or some sort of light rail system.  \n\nWe also need to accept that Vilnius is not a large city. Not by world or European standards. But no matter where we stand on the size of Vilnius, the fact that there is 0% rail transit options here and all we have are shitty buses is pathetic, to say the least.",
            "score": 16,
            "created_utc": 1734710995.0
        },
        {
            "author": "GrynaiTaip",
            "body": "Two thirds of it is forest.",
            "score": 2,
            "created_utc": 1734781574.0
        },
        {
            "author": "sneakermumba",
            "body": "It is only spread out like that, I read the land size of Vilnius is similar to one of Paris.\nPopulation wise it is mid size",
            "score": 1,
            "created_utc": 1734772881.0
        },
        {
            "author": "Tamsta-273C",
            "body": "Imagine thousands of drones buzzing nonstop above your head. \n\nYou don't want flying cars with current level of technology.",
            "score": 2,
            "created_utc": 1734737742.0
        },
        {
            "author": "Ill_Special_9239",
            "body": "These are all terrible excuses. How do you think Rome, Barcelona or Athens built their metro? Even cities like Kyiv and Minsk have metro, Bucharest, Budapest, Warsaw. Are they all flat and have no riveres? New York built theirs over a 100 years ago, hills and rivers and all. Stockholm has it too. It's just a bunch of excuses for not getting it done.",
            "score": 2,
            "created_utc": 1734905756.0
        },
        {
            "author": "Ill_Special_9239",
            "body": "Right, except Tallinn's S-Bahn connects important points within the city. Unlike Trakai-Vilnius, which is a train that takes people to the city rather than through it.",
            "score": 5,
            "created_utc": 1734821300.0
        },
        {
            "author": "GrynaiTaip",
            "body": "I wasn't part of it, I drove a cargo van. Can't move large stuff on trolleybuses. \n\nEveryone seemingly took a day off for shopping before Christmas, that's the cause of the jams today.",
            "score": 8,
            "created_utc": 1734730367.0
        },
        {
            "author": "senisjura",
            "body": "Ride a bike or walk",
            "score": 2,
            "created_utc": 1734816335.0
        },
        {
            "author": "Bubbly_Pianist_5394",
            "body": "You think public transport sucks in Vilnius? Checkout public transport in India, or checkout the German train service, notoriously known for it's tardiness.",
            "score": 2,
            "created_utc": 1734856271.0
        },
        {
            "author": "aurimux",
            "body": "Its worse alternative, however there is not much options. Either you enjoy traffic in your personal car or enjoy bum smell in the public with everyone touching each other and breathing same musty air",
            "score": 2,
            "created_utc": 1734781284.0
        },
        {
            "author": "Dziki_Jam",
            "body": "I use it all the time and I don’t have a car. It definitely could be improved, but it gets me where I want relatively quick.",
            "score": 1,
            "created_utc": 1734880269.0
        },
        {
            "author": "alteregooo",
            "body": "geras nickname lol",
            "score": 1,
            "created_utc": 1734720090.0
        },
        {
            "author": "ak-92",
            "body": "You can build whole tram network cheaper in 15 years than a single metro line, which can take up to 20 years.",
            "score": 6,
            "created_utc": 1734695745.0
        },
        {
            "author": "Firm-Chest-7628",
            "body": "Just simple return of green pointers would drasticaly imptoved trafic. Also stupid speed bumpers in the middle of roundabouts and remaking roundabouts itself would be beneficial improvement. Also some return of speeding lanes at some places ect ect.\nAlso trafic lights. Is it so hard to make green waves at some places? Fe - laisvės pr.",
            "score": -18,
            "created_utc": 1734695663.0
        },
        {
            "author": "Smodestas",
            "body": "Įsivaizduok, visi dviratininkai vėl į atomobilius suliptų, kiek automobilių srauto padaugėtų.",
            "score": 2,
            "created_utc": 1734703483.0
        },
        {
            "author": "Dziki_Jam",
            "body": "It’s not about this. It’s about population density and how nuodinga are placed. Vilnius is one of the greenest cities because it has lots of forests right in the city. So, I wouldn’t call it a village, but it’s very unique and unusual.",
            "score": 1,
            "created_utc": 1734880818.0
        },
        {
            "author": "AssumptionExtra9041",
            "body": "And you'll probably hate me but I love that so many bike paths are being built recently. The same should go for bus lanes.\n\nMobility is dynamic. People use what is most convenient. If we make busses and cycling more convenient, people will adapt to that. This would be great in terms of noise and air pollution since cars are highly inefficient in dense areas. This also majorly increases public health!",
            "score": 8,
            "created_utc": 1734691781.0
        },
        {
            "author": "AssumptionExtra9041",
            "body": "Well to be specific, I did not particularly point out that it's great, I just said it's not bad xD\n\nI'm a regular commuter in Zurich which is probably the heaven of public transportation. So of course I know what the standard should be. Yet, Vilnius could be doing much worse. Yeah, it's way too overcrowded, especially during rush hour. But that's unfortunately the case in most places...\n\nThe main issue is certainly the punctuality. But that's especially a result of traffic, as busses are for the most parts not separated from regular car traffic (which is a major shortfall of the bus system).\n\nSo I'd agree that it is certainly not great and also is far from perfect. And there's still much to improve. But I'd also say that it is fair enough and improvements might lead to rapid increases in quality.\n\nVilnius should try to get rid of cars as far as possible, especially in the center. This makes space for busses which can then operate much more frequently and reliable.",
            "score": 7,
            "created_utc": 1734691532.0
        },
        {
            "author": "_Lucinho_",
            "body": "The public transport is not the best here, but it's certainly better than in some neighboring cities of similar size. I was in Riga recently, and despite that city having trams, public transport anywhere outside the city center was mostly slow and infrequent. They don't have the live tracking of busses either, so good luck figuring out if your bus that's late is ever coming or not. Also, compared to Vilnius, Riga is severely lacking in bike lanes.",
            "score": 2,
            "created_utc": 1734693821.0
        },
        {
            "author": "Dziki_Jam",
            "body": "Usually folks from ex-USSR countries like to complain about the absence of metro, because in USSR metro was something special, not all cities could afford it.\nSo, it had this aura of something fancy, although “expensive underground tram” sound not as fancy as “metro” while means the same.",
            "score": 1,
            "created_utc": 1734880951.0
        },
        {
            "author": "GrynaiTaip",
            "body": "We should sort out the busses before spending billions on rail that will take a hundred years to complete.",
            "score": -2,
            "created_utc": 1734781626.0
        },
        {
            "author": "Fresh-Band-3333",
            "body": "Vilnius is too small for a metro",
            "score": 1,
            "created_utc": 1734963454.0
        },
        {
            "author": "senisjura",
            "body": "If you consider Naujoji Vilnia impirtant point in the city ours does the same",
            "score": 1,
            "created_utc": 1734821687.0
        },
        {
            "author": "SexHarassmentPanda",
            "body": "Yeah, traffic does legitimately get bad and a metro or something would be nice, but also massive traffic on the Friday before Christmas is basically the norm in any city.",
            "score": 5,
            "created_utc": 1734741064.0
        },
        {
            "author": "No_Men_Omen",
            "body": "For sure, building a working tram system is much more feasible!",
            "score": 5,
            "created_utc": 1734696413.0
        },
        {
            "author": "No_Men_Omen",
            "body": "That's a lot of BS. Even more (minor) changes towards a car-friendly environment within a system that suffers from just that - too many cars. Even worse, you are suggesting to make it more dangerous to be a pedestrian in Vilnius, the opposite to what we really need.",
            "score": 17,
            "created_utc": 1734696766.0
        },
        {
            "author": "bronele",
            "body": "The speed bumpers at the roundabouts are there to stop people driving the speed that stops other vehicles from entering the roundabout, making the traffic worse.",
            "score": 3,
            "created_utc": 1734705839.0
        },
        {
            "author": "No_Men_Omen",
            "body": "Unfortunately, we are clearly moving in an opposite direction. Explosive and chaotic growth of the suburbia is a major factor which will lead to the choking of the whole transportation system. Currently, there are not even talks about how to solve the transportation needs of the new suburbanite class. The official 'plans' of how to increase public transportation share are pure garbage, no connection to the reality whatsoever.",
            "score": 5,
            "created_utc": 1734693638.0
        },
        {
            "author": "Unhappy-Poetry-7867",
            "body": "Can someone explain how trams would be something different than busses?",
            "score": 1,
            "created_utc": 1734737587.0
        },
        {
            "author": "Firm-Chest-7628",
            "body": "Vilnius is of the most lowest populated by density capital in the world. Also, compared to most other capitals has close to zero urban area population around it making. And can easy handle the curent and much bigger amount of cars.\nI have heard this stolupid argument of too many cats multiple times. Green pointers are gone. Millions invested in bike lanes. How many bikes did you seen today? 1?\nMaking artificial trafic jams did not solved anything. Almost nobody refused their cars because of that. The result is - twice bigger trafic jams and twice higher polution (also for the same pedestrians btw)\nAll the Europe managed to workaround with those green pointers, but yeh right, Vilnius for some reason can not.. Because car moving at 5kmh in crossroad making right turn is a big threat to pedestrians...",
            "score": -10,
            "created_utc": 1734697324.0
        },
        {
            "author": "Firm-Chest-7628",
            "body": "The speed bumpers at the roundabouts stops vehicles from entering roundabout because enterer does not know what would be the speed of cars in the round about so they can not calculate right entering moment. Because some cars drops their speed to like 10km/h (especially BMWs) other car drops speed just slightly and others do not change their speed at all.\nThat is why there is a jam in Savanorių pr. roundabout all day long on entering from Tūkstanmecio g. on the entering that is just after that road bumper. There were no ir less jam in that place before.\nAlso, because of the same reason (cars slowing down to dufferent speeds) the whole roundabout and other enterins suffer.\nThis effect even has a name of „phantom trafic jam“ or/and „Traffic wave“ and that wave goes around fckn roundabout all day long without any reason.\n\nThis is an example.\nhttps://m.youtube.com/watch?v=Suugn-p5C1M&pp=ygULVHJhZmljIHdhdnc%3D",
            "score": -2,
            "created_utc": 1734706604.0
        },
        {
            "author": "No_Men_Omen",
            "body": "Trams are much bigger, faster, and more reliable. With permanent infrastructure in place, especially in the suburbs, they also encourage local economic development.\n\nIt is also true that much depends on the implementation. There needs to be complete priority over all other modes of traffic.",
            "score": 4,
            "created_utc": 1734764612.0
        },
        {
            "author": "Ok-Relationship3158",
            "body": "Just one more lane bro",
            "score": 11,
            "created_utc": 1734702818.0
        },
        {
            "author": "errb",
            "body": "On paper Vilnius' population density is low but that's mainly because the administrative area is unusually large. If you take a look at population density of central Vilnius (i.e. excluding neigbourhoods like Naujoji Vilnia, Grigiškės, etc) the density is actually not far off other large urban centers in Europe.\n\n\\---\n\nbtw if removing the \"turn right on red\" rule stopped at least one death, it's worth it. Don't forget that some vehicles have a large turning radius (buses, trucks) and they are extremely dangerous if pedestrians go under their rear wheels. There have been people who died on right turns for this exact reason and speed doesn't have much to do with it.",
            "score": 3,
            "created_utc": 1734706186.0
        },
        {
            "author": "acetonas378",
            "body": "In my hometown green pointers returned about a year ago. They had 0 effect on trafic.\n\n\nFor some reason VMS decided to absorbe nearby forsets. Remon those forests and populatio density becames high.",
            "score": 1,
            "created_utc": 1734706443.0
        },
        {
            "author": "bronele",
            "body": "The speed bumps are designed for 30km/h speed. That's the speed that everyone is anticipating. Some people trying to go over that speed limit (especially BMWs /s) are the problem, making others not sure whether they can go or not.\n\nYou cannot believe that a few BMW vehicles driving 10 km/h is seriously the root of the issue.",
            "score": 1,
            "created_utc": 1734706914.0
        },
        {
            "author": "RandomAccount6733",
            "body": "Been driving in Kaunas for 5 years on the same road. Once they added another lane for someone who turned left traffic was reduced by 50%. And this was 2 years ago. 2 months ago they closed auxiliary road for repairs, traffic went up by 50%.\n\nThis notion that adding lanes \"doesnt reduce traffic\" only works if there is another bottleneck in the system OR there is infinite amount of cars.\n\nI have been to many European cities in western countries of similar size, none of them had this problem with traffic, despite having similar amount of cars. Face it - Vilnius is badly designed, the last Mayor and his staff were absolute tools. And this problem will only get worse as Vilnius will only expand",
            "score": 1,
            "created_utc": 1734871476.0
        },
        {
            "author": "Firm-Chest-7628",
            "body": "Gali daryt nors ir 10. Vistiek bottle neckai dėl debiliškų sprendimų kitur yra. Waršivoj 1 lane keliai juda greičiau, nei pas mus 3",
            "score": 0,
            "created_utc": 1734703061.0
        },
        {
            "author": "Firm-Chest-7628",
            "body": "If you will look just at the „center of vilnius“ yra will have god damn wilage.\n„if removing turn right... at leats one death“\nPoluted air in lithuania kills almost 2000 people a year. And 120 dies in car accidents. Your 1 saved person from turning right red probably causes 10 deaths from polution because of thousands of standing cars what waits for their green light.\n\nSo why in countries where green pointer exists fatality rate in car accidents is much lower?\n\nWhole lithuanians read/car system is a joke because itvis runned by moronic idiots. Additionalnto removing green pointers.. \nIn 10 years lithuania became „country of road bumpers and speed radars“ it is like every 100m is one or another and.... Suprise suprise the fatality in the roads increased. It even became worse that Poland, where roads are more complicated, everyone is speeding in their autobans, there is no speed cams/road bumpers, and the traffic is much more intense.\n\nSoviet era made lithuanians mental slaves who think that restrictions and punishments can solve some things. It is an opposit.\n\nIn germany every day tenths of thousanda people moving in their at 200+kmh daily and have 3x lower road fatality rate than in lithuania with bumper/speed  cam/cop in bushes every 100m.\nBecause we are idiots and brain damaged soviets.",
            "score": 1,
            "created_utc": 1734709453.0
        },
        {
            "author": "Firm-Chest-7628",
            "body": "There two types of speed bumps desigend for different speed areas officialy descrilbed by a goverment/lawJust do some homework before posting. Bumpers designed for 30km/h are at the roads where official speed limit is 30km/h and they are not allowed to be build in areaa where speed limit is 50.\nAnd even if they were, some people would still beak down to 10km/h and another would go 40kmh. That makes trafik ubpredictable for entere. Because I do not know if how much car in roundabout will change speed. That leads to... Just stand on entering to roundabout and be like „damn I could enter roundabout like 5 times if I knew that those cars will slow down so drasticaly“ and/or forcing me to enter roundabout with a risk „sorry for crashing my car in to yours I thought that you will slow down on that bumper as these 5 cars before.\nI do not know why we even have this disscusion. That entering had much less jam before the bumper and this is an empiric fact.\nPS, if I see bmw driving above speed limit it causes zero problems for me entering roundabout because it is obvious wide gap to enter aftar that bnw passes my entering (just a simple logic).\nBumper „designed for xx speed“ is a joke. Because one car with thing tyres/wide rims, hard suspencion and owerall low clearance will ride bump in absolutely diferent speed compares to high tyre, high clearance and soft suspention one.",
            "score": -1,
            "created_utc": 1734707884.0
        },
        {
            "author": "PervySageCS",
            "body": "I was driving in Vilnius 2 weeks ago, also used to Kaunas traffic, and Vilnius streets are just so much more narrow, and on almost every single street, you drive 5 min in a single lane and then you realize at the end that lane can only go right or something. Then you wait 2-3 min for someone to show mercy and let you slide in the other lane to just repeat the same thing again. \n\nIf most of the city had 1 extra lane and few more signs in advance on which lanes you can take, the city would have a lot less traffic. \n\nIn addition to that, the amount of tiny 1 ways that if you miss a turn you have to drive 3 extra kilometres to go to, make the traffic even worse",
            "score": 1,
            "created_utc": 1734888029.0
        },
        {
            "author": "errb",
            "body": "If you want to talk about pollution caused by the automotive industry, we shouldn't be talking about making cars faster and more convenient. You just induce more demand for more cars.\n\nand by saying \"central Vilnius\" I didn't mean \"Senamiestis\", I meant the area that most people think about when they say \"Vilnius\" or \"bad traffic in Vilnius\". Look up the administrative area of the city - a very big chunk of it are national forests and small towns which are also included in those density calculations. If you take these out, Vilnius becomes way more dense.",
            "score": 1,
            "created_utc": 1734710341.0
        },
        {
            "author": "bronele",
            "body": "\"There two types of speed bumps desigend for different speed areas officialy descrilbed by a goverment/lawJust do some homework before posting\"\n\n\"Bumper „designed for xx speed“ is a joke.\"\n\nEnd of discussion.",
            "score": 2,
            "created_utc": 1734708417.0
        },
        {
            "author": "Firm-Chest-7628",
            "body": "You can take or exclude whatevr you want and the result will be the same - Vilnius is much less populated both by just count and/or density  and has multiple times less passangers than most other capital cities.",
            "score": 2,
            "created_utc": 1734710621.0
        },
        {
            "author": "Firm-Chest-7628",
            "body": "Eik, brone, indų plaut geriau",
            "score": -1,
            "created_utc": 1734710423.0
        },
        {
            "author": "errb",
            "body": "It depends on what you’re comparing the numbers to. When you’re stating that it’s one of the least populated cities, I am pointing out the fact that a lot of other cities don’t include forests and surrounding towns in their data. This skews the numbers and makes Vilnius appear way less dense than it actually is.",
            "score": 2,
            "created_utc": 1734710837.0
        },
        {
            "author": "Firm-Chest-7628",
            "body": "So yes. Forests ect. And so what? Hiw does it change the fact of population dencity? Who cares why density is low? If there were houses instead of forests so then density were higher. And?\nThere is big forest near verkiai/zalieji ezerai and thousnads of houses under it.",
            "score": 1,
            "created_utc": 1734711123.0
        },
        {
            "author": "Firm-Chest-7628",
            "body": "OK, just give me an example of other capital city in Europe.",
            "score": 1,
            "created_utc": 1734711349.0
        },
        {
            "author": "errb",
            "body": "Density is population over area. If you include the area where no one lives, it will make the density appear low.\n\nand you're the one who used low density as an argument, not me.",
            "score": 1,
            "created_utc": 1734711349.0
        },
        {
            "author": "Firm-Chest-7628",
            "body": "So yes. If you have huge area with a lot of parks and forests that makes area less populated. So as a result you you have less cars/people for the same squere kilometer than you would have if there were houses instead of parks. So?\nMe myself live in area where is a lot forestes and houses are individual. So that leads lo low trafic in my area. Before I lived in Virsuliškės, where were soviet flat apartments making area dense leading to huge trafic.",
            "score": 1,
            "created_utc": 1734711680.0
        }
    ]
}