{
    "post_title": "Gas and electric costs",
    "post_author": "saae1021",
    "post_score": 0,
    "post_url": "https://www.reddit.com/r/Vilnius/comments/1hkiq9w/gas_and_electric_costs/",
    "comments": [
        {
            "author": "Zorkofskij",
            "body": "It depends on buildings age. Some does not keep heat “in” very good, so you may spend a lot. Like in flat in Justiniskes i was getting for heating and hot water around 120 a month only.",
            "score": 8,
            "created_utc": 1734940017.0
        },
        {
            "author": "baltbcn90",
            "body": "It’s expensive in old town buildings with municipal heating. They charge you per sq meter. I lived in the old town a few years back in a similar size flat and it wasn’t unusual to pay 250-300 for two months.",
            "score": 5,
            "created_utc": 1734947141.0
        },
        {
            "author": "SmartPickIe",
            "body": "What's the bill? Really depends on age and thermal insulation/building's class. We pay up to 100euros for our 140sq. m. house, but building is still quite new.",
            "score": 4,
            "created_utc": 1734940655.0
        },
        {
            "author": "vilniauselektrikas",
            "body": "If it's bellow 250 you're good ",
            "score": 5,
            "created_utc": 1734941180.0
        },
        {
            "author": "LonelyAssignment1680",
            "body": "So what's the bill? Without this info, no one would tell you is it a lot or normal price.",
            "score": 2,
            "created_utc": 1734945460.0
        },
        {
            "author": "F4ctr",
            "body": "You live in Senamiestis, possibly old house which has shitty insulation (if any). And when you pay for m2 of heating, not as a flat but as a whole building, energy costs is divided by m2 for each flat. So you will pay a metric fuckton of money. Get a flat in a renovated house, or newly built one, you will pay \\~100 Euros/month for everything + rent.",
            "score": 1,
            "created_utc": 1734952434.0
        },
        {
            "author": "WOXO0lz",
            "body": "Ive had been living for some time in senamiestis 3 floor apartment of 63sqm or so, it seemed always not that warm and i kept the heating on all the time. I learned to asjust that manually when i dont need the heat that much after getting a monthly bill of around 300 euros.",
            "score": 1,
            "created_utc": 1734957086.0
        },
        {
            "author": "ApprehensiveTruck655",
            "body": "You did not mention how much is the bill or broke it down! So I have no clue what to say about it. However, you should be very aware before renting that the bills are supper important factor to consider, type of building, type of heating, Insulation, does the son reach the place, is there high administration fees. Often people see the place and fall in love with it that wanna rent it asap, but you really have to ask the landlord or the broker to show you previous bills, do not trust \" it should be around 80€/90€\". Good luck",
            "score": 1,
            "created_utc": 1734957878.0
        },
        {
            "author": "Serious-Tea1832",
            "body": "Yeah, agree with this comment. I live in Pašilaičiai and I paid 105 eur for a heating 😄 in tital utility bills - 150 euros",
            "score": 2,
            "created_utc": 1734940624.0
        }
    ]
}