{
    "post_title": "How does second-hand shops here survive the rent prices?",
    "post_author": "AccomplishedAd2396",
    "post_score": 20,
    "post_url": "https://www.reddit.com/r/copenhagen/comments/1hkaqru/how_does_secondhand_shops_here_survive_the_rent/",
    "comments": [
        {
            "author": "SolarSalmon",
            "body": "I think you should go talk to some shopowners. Its a very specific business, and its hard to guess. \n\nAlso I don't think you need to be on a good shoppingstreet, you cater to a specific clientele, they will come find you as long as you pop up on Google maps and do some advertising, especially if you do a niche. \n\nHave you thought about starting on one of the many loppemarked to get a feel of the market.",
            "score": 34,
            "created_utc": 1734940220.0
        },
        {
            "author": "quaid31",
            "body": "The second hand shops aren’t profitable.  They rely on financial support from the owner’s spouse who is typically quite successful.",
            "score": 81,
            "created_utc": 1734922388.0
        },
        {
            "author": "56KandFalling",
            "body": "Most are charities, but for the commercial ones my guess is that they have very low rent, because they've been there since rents were less unfair or they've been lucky and gotten low rent in a co-op because it's been difficult to rent out the space.\n\nIt's really ridiculous that there are lots of empty shops on strøget (almost tumbleweed level in some parts), but prices are still sky high.\n\nI'd try contacting some of the business real estate agents and asking them. You might be able to get a short term lease at a reduced price. That's what an acquaintance did for a pop-up.",
            "score": 4,
            "created_utc": 1734944295.0
        },
        {
            "author": "EmptySoulCanister",
            "body": "Money laundering",
            "score": 4,
            "created_utc": 1734952084.0
        },
        {
            "author": "aKirkeskov",
            "body": "Some are run be volunteers",
            "score": 3,
            "created_utc": 1734935998.0
        },
        {
            "author": "Like-A-Greek-God",
            "body": "They sell sex in the backrooms.",
            "score": 6,
            "created_utc": 1734914865.0
        },
        {
            "author": "annagram_dk",
            "body": "They are run by volunteers. They don't pay VAT. I still thought that they would get reduced rent or similar, but I can't find anything to support that.",
            "score": 2,
            "created_utc": 1734944627.0
        },
        {
            "author": "mathe1337",
            "body": "Some of the housing associations have implemented internal laws that they have to lease out x anount of the living area, and sometimes they cannot ajust the rent without changing the rules thus making it more expensive for everyone - hence some shops are allowed to rent for much cheaper than the market price",
            "score": 2,
            "created_utc": 1734951236.0
        },
        {
            "author": "Senior-Reality-25",
            "body": "Unless you’re selling desirable high end vintage that has a ready market with deep pockets, it’s best to stay away from ‘good’ shopping streets. I look for the best 2nd hand shops on side streets, in suburban shopping centres, and in satellite clumps of oddball stores away from the center.",
            "score": 2,
            "created_utc": 1734954198.0
        },
        {
            "author": "Vacivity95",
            "body": "Most of them are non profits / donation based like røde kors",
            "score": 4,
            "created_utc": 1734921737.0
        },
        {
            "author": "HypothermiaDK",
            "body": "I doubt second hand is 'good business'.",
            "score": 1,
            "created_utc": 1734956727.0
        },
        {
            "author": "nyd5mu3",
            "body": "If you’re in a niche, check out niche shops. Like Ruben og Bobby. They cater to their loyal customers in all kinds of ways, have several services along with selling used niche stuff. Even though the services are ver different, they all appeal to the same “audience”.\n\nNeighborhood matters. Nørrebro is a good spot for some kinds of vintage, Frederiksberg and Vesterbro for other kinds. Usually, it’s a specific street. Selling expensive art? Go for Store Kongensgade.",
            "score": 1,
            "created_utc": 1734959799.0
        },
        {
            "author": "Plastic_Friendship55",
            "body": "The sell used clothes for a higher price than new clothes.",
            "score": -1,
            "created_utc": 1734938245.0
        },
        {
            "author": "readywater",
            "body": "This is the way. There are also sometimes more biz models than you might realize. Eg renting clothes for media or specific events, repairs, and other kinds of consulting. Doing a small thing like Solar suggests will give you a glimpse into the process and viability.",
            "score": 6,
            "created_utc": 1734941764.0
        },
        {
            "author": "coindrop",
            "body": "Is this a known fact or a guess? I know a few second hand shops like Quriosa that has been in business for a long time and they seem to be thriving?",
            "score": 8,
            "created_utc": 1734936337.0
        },
        {
            "author": "56KandFalling",
            "body": "That's not correct, that's only the ones run by charities. The hip second hand shops are definitely for-profit. And, technically, antique shops are second hand shops too.",
            "score": 3,
            "created_utc": 1734944526.0
        },
        {
            "author": "OriginalXX",
            "body": "True in some cases indeed. For many well off individuals where only one is working, it is cheaper to run a business that takes a yearly loss rather than letting the non-working partner do “stay at home” which often entails wasted money on large personal purchases. Spoke with a couple of contractors doing work for people in the northern suburbs of Copenhagen and they experienced it too. Fascinating really.",
            "score": 2,
            "created_utc": 1734954653.0
        },
        {
            "author": "Acidolph",
            "body": "And/or *parents",
            "score": 1,
            "created_utc": 1734934823.0
        },
        {
            "author": "brwnx",
            "body": "never heard of this before",
            "score": 4,
            "created_utc": 1734940399.0
        },
        {
            "author": "rockmus",
            "body": "Thrift sex?",
            "score": 2,
            "created_utc": 1734953916.0
        },
        {
            "author": "fantastiskelars",
            "body": "Amen to that",
            "score": 1,
            "created_utc": 1734915299.0
        },
        {
            "author": "TrumpetsNAngels",
            "body": "Usename .. you know the drill\n🎄😘",
            "score": 1,
            "created_utc": 1734917521.0
        },
        {
            "author": "Mammoth-Divide8338",
            "body": "You mean others are actually getting paid for this ?",
            "score": 1,
            "created_utc": 1734930698.0
        },
        {
            "author": "Ok-Platypus3818",
            "body": "Yes the shitty ones with foreign owners/staff where the window displays never change or the widows are completely covered in clothes (in a very unaesthetic way) are brothels",
            "score": 2,
            "created_utc": 1734933178.0
        },
        {
            "author": "BuckDollar",
            "body": "Quriosa has a large SoMe presence and were part of a long running tv show about 2nd hand pickers. And he’s very talented.",
            "score": 11,
            "created_utc": 1734944808.0
        },
        {
            "author": "Tiffana",
            "body": "I also recall from the tv show that he buys and sells stuff, that never necessarily make it to the shop",
            "score": 1,
            "created_utc": 1734953352.0
        },
        {
            "author": "LovelyCushiondHeader",
            "body": "SoMe?",
            "score": 1,
            "created_utc": 1734956639.0
        },
        {
            "author": "BuckDollar",
            "body": "Social Media:)",
            "score": 1,
            "created_utc": 1734956992.0
        },
        {
            "author": "Mysterious_Yam_3052",
            "body": "Social media",
            "score": 1,
            "created_utc": 1734957042.0
        }
    ]
}