{
    "post_title": "Someone has cut 3 wires on my Christmas decs, This is why we can’t have nice things.",
    "post_author": "catpro911",
    "post_score": 1270,
    "post_url": "https://www.reddit.com/gallery/1hiupbb",
    "comments": [
        {
            "author": "coffeewalnut05",
            "body": "You know, this country would be a much better place if we didn’t have so many horrible, rude, selfish and destructive people in it. \n\nI go litter picking fairly frequently. There’s this one area that I do fairly often and the litter levels vary. But one time I did like a deep clean— a few days later I returned, and it was so unbelievably messy and dirty that I’m 90% sure someone (or people) purposely did it. Amid other acts of vandalism and destruction in our public spaces, monuments, memorials, signs, etc. It’s so pathetic. \n\nI don’t know where we went wrong as a country that many of us don’t respect ourselves or each other, and actively try to destroy others’ happiness and attempts to make this country a nicer place to be, but it’s sad indeed.",
            "score": 290,
            "created_utc": 1734732430.0
        },
        {
            "author": "auntieknickknack",
            "body": "I used to live in a flat with an inconveniently placed assigned parking space, other tenants would flick their cigarettes onto the roof of my car just to be nasty for no reason. People suck, don’t let it put a damper on your Christmas! ",
            "score": 40,
            "created_utc": 1734732367.0
        },
        {
            "author": "Human677",
            "body": "There was a post a few days ago where people were saying that it's a really clean cut if an animal has bitten through it. Hopefully it's that. It's far preferable than having to assume that people are petty and selfish enough to do that.",
            "score": 65,
            "created_utc": 1734733285.0
        },
        {
            "author": "lelypie",
            "body": "If it makes you feel any better I deal with a lot of car wiring that gets eaten by animals, 90% of the time it’s a super clean cut that would fool anyone if they didn’t have the evidence. \n\nYour tree looks lovely!",
            "score": 26,
            "created_utc": 1734771695.0
        },
        {
            "author": "onizuka_eikichi_420",
            "body": "Considering where this thread went, I can’t help but think that A) it was likely the wind blowing that severed the cheap wires and B) that this is a relatively middle class area and if someone cut through these it had nothing to do with the shite people are spewing.",
            "score": 10,
            "created_utc": 1734873360.0
        },
        {
            "author": "ahorne155",
            "body": "There are just some really miserable self centered pathetic, disaffected angry people around who just have to spread that feeling to others through petty acts like this..\nComes in many forms, don't let the bastard's grind you down..",
            "score": 13,
            "created_utc": 1734769321.0
        },
        {
            "author": "prespaj",
            "body": "I’m sorry that’s happened. I’ve noticed in the UK a lot of the problems seem to come from this sense of not wanting good things for other people. I see it a lot on Reddit - “I work 12 hour shifts so you should put up with it”, “I made £3/hour on my apprenticeship so you should be happy with £7”, the litter picking story below, and even slashing other people’s Christmas lights. \n\nI don’t really get it. Isn’t the whole point of life to try and make things nice for yourself and your community? and for the future generations to have an easier and happier life than you did?",
            "score": 6,
            "created_utc": 1734878139.0
        },
        {
            "author": "Suzanna42",
            "body": "My Christmas decorations were chewed through by rabbits, my neighbour has the same tree as you and it got chewed through too... because the cables are near the ground. I have ring footage of the chewing!",
            "score": 5,
            "created_utc": 1734879979.0
        },
        {
            "author": "-myeyeshaveseenyou-",
            "body": "My ex husband had his lights cut as did one of his neighbours. High who did it had been arrested earlier in the day and then released. Was arrested again after the cutting. I think he is having some kind of mental issues unfortunately",
            "score": 4,
            "created_utc": 1734874653.0
        },
        {
            "author": "Opthomas_Prime_21",
            "body": "We have one of those washing lines in the back garden that collapses down, and one time I found that it seemed the line had been cut in a few places. It was a really clean cut so it seemed like it was done with a knife. Turns out it was a fox. \n\nI would assume an animal is the likely culprit here too",
            "score": 3,
            "created_utc": 1734845640.0
        },
        {
            "author": "ReadySaltedWR",
            "body": "I live in a block of 4 housing association flats, with a shared communal entrance lobby type area. I put up a small 3.5ft Christmas tree tucked under the slope of the stairs by the mailboxes, and a wreath on my front door...a few days later I had a woman from Sovereign knocking on my door forcing me to remove them due to 'health and safety'. \n\nMade me think well Merry fucking Christmas to you too then you Christmas Joy stealing bitch. \n\nWhy bloody bother trying to do anything nice at all these days.",
            "score": 2,
            "created_utc": 1734872604.0
        },
        {
            "author": "SlinkyWoo75",
            "body": "We used to put xmas decs outside too, but people would either vandalise or nick them. Same with hanging flower baskets. Unfortunately, the UK seems to be rife with scabby bastards, even the so-called nice areas.",
            "score": 2,
            "created_utc": 1734856059.0
        },
        {
            "author": "Edible-flowers",
            "body": "I've been tempted to cut the wires of a neighbours flashing Christmas lights.  There on day & night & the only way to avoid the migraine inducing flickering is to close our blinds.\n\nI've got no issue with Christmas lights coming on in late afternoon & going off when the owners go to bed.  I feel sorry for our British birds who have to put up with more unnecessary lights all day & all night.\n\nObviously, I won't resort to acts of vandalism.",
            "score": 1,
            "created_utc": 1734892361.0
        },
        {
            "author": "greyspurv",
            "body": "Not that I do not believe you, but how do you KNOW someone cut it and it was not say an animal biting them?  \nSeems like something youngsters would do, it is sad but tbh it is really classic \"boyster things\" But I mean it is also illegal and vandalism do not get me wrong, but at the same time, live and let live, they prob are a troubled individual if they do something like that in many ways that is their own punishment.",
            "score": 1,
            "created_utc": 1734896820.0
        },
        {
            "author": "DidymusDa4th",
            "body": "Went to pub yesterday with a bunch of Christmas hats with my group, one person in the bar asked to borrow Christmas hat for 5 mins, I say sure knowing their probs drunk and just want a laugh with it \n\nImmediately some dude takes it off the top of her head, probably a friend in her group wears it himself, takes it outside with a smug dickhead look on his face like he's hilarious for taking her hat off her, never comes back with it doesn't even look over at me as he leaves even though I'm 100% sure he knew it was mine\n\nIt's like why, why are you just such a fucking tool, it's such a minor thing and it's not like I give a shit about a santa hat, so why are you going out of your way to steal such a mundane thing\n \nThere's just this certain type of person in this country that you can just sense, obviously arrogant, usually decently educated but just uses it to throw around insults pretending to be banter, when their sober they just quietly ostracize you from social stuff or conversations even though you really don't have much interest in their ideas of fun, and when their drunk their actively brazen and cuntish as all their inhibitions fall and you see the full lack of care on display\n\nLike who the fuck hurt you dude, your middle class lifestyle too taxing, gotta let everyone know how miserable you are to be so mediocre despite all the advantages you have?",
            "score": 1,
            "created_utc": 1734906757.0
        },
        {
            "author": "FeedbackOld225",
            "body": "When we got our first home we were absolutely skint. I wanted to at least get some lights up for our first crimbo living together. We put a wee row of outdoor fairy lights along our back fence. Few weeks later, the wire was cut. I was so pissed off!! My husband said, probably some jealous person. Jealous of what? £10 fairy lights from B&M? Every house on the street had lights up. I put another set up & would sit on guard duty 🤣👀. Some people are just miserable cunts. We live in a ground floor flat now, I toyed with the idea of getting wee solar candy cane lights for the front green. Then reasoned why bother? some pig will probably destroy them. Hopefully, it's been a wee curious critter though that fancied the look of your lights.",
            "score": 1,
            "created_utc": 1734907635.0
        },
        {
            "author": "WalksIntoNowhere",
            "body": "Such a shame how few people have any shred of self-respect and dignity in many areas across the UK. Shameless cunts the lot of em. People really do go out of their way to stereotype themselves in this country.",
            "score": 1,
            "created_utc": 1734910584.0
        },
        {
            "author": "citytom2012",
            "body": "A few years ago we had a junkie try and pull the Christmas lights off our home (well fixed with Masonry mounts), then defecated outside our front door. We reported him as he tried to kick in the front doors of our and neighbouring properties... and we didn't want him coming back.\n\nPolice quickly emailed later to say they identified him from cctv and DNA, though he had died in the days following the incident..... and they understood we might be frustrated that he couldn't be prosecuted..... was a bit staggered by the presumed vindictiveness. The guy was still someone's son, clearly unwell, and even after cleaning his diarrhoea from our porch I wouldn't have wished death on him.\n\nIn this instance I'm with other commentators saying don't rule out Foxes, rats or squirrels. I have repaired/replaced god knows how many Garden Lights and fairy lights strings because wild animals play around with them. Rarely do you see much/any signs of chewing. It's worse in summer as foxes in particular seek out water from pipes / hoses, but still happens in the winter.\n\nBitter Apple spray (available on Amazon) deters such animals from chewing on it after a sniff.\n\nBased on the custom Christmas lights in your photo I'm sure you don't need me to explain the relative ease of pigtail splicing Christmas light wire back together.",
            "score": 1,
            "created_utc": 1734928910.0
        },
        {
            "author": "SherlockScones3",
            "body": "I believe this is the consequence of a breakdown in community. Imagine this happening 40/50 years ago, the culprit would’ve been known and then punished. \n\nNow we rarely interact with neighbours because we don’t put down roots. A problem created by our modern lives",
            "score": 1,
            "created_utc": 1734944630.0
        },
        {
            "author": "Capable_War_1335",
            "body": "Someone stole my tiny little curly tree lights, 4 little trees. They stole them by cutting the wire so they are absolutely useless. \nThe street is full of beautiful decorations, my piddly little trees (one very bent because my daughter accidentally broke it when we were putting them up), were the ones they took.",
            "score": 1,
            "created_utc": 1734946412.0
        },
        {
            "author": "Rich-Zombie-5214",
            "body": "Rabbits most likely, they bite clean through and love wires. They don't chew, just clean bites. Please don't blame your neighbors. spraying predator urine can help keep the little critters away from your lights. Even peppermint oil can help keep then from getting bit. Even squirrels like those wires.",
            "score": 1,
            "created_utc": 1734954621.0
        },
        {
            "author": "KitKatDub",
            "body": "Clean cuts *can* be animals, foxes in particular are quite good at severing things cleanly.\n\nAlso, we've had a lot of gale force winds recently - could the wires have been damaged (even on their own mounting) and snapped during the winds?\n\nAs shitty as people can be, I don't see someone just snipping 3 wires and moving on. If they do it at all, they'll do a lot more damage. Vandals aren't really into half arsing stuff like this. They'd either do every wire or cut the whole thing off from the mains in one go.",
            "score": 1,
            "created_utc": 1734959772.0
        },
        {
            "author": "Golarion",
            "body": "Not to be that jerk, but it might not be a nice thing for everyone. The bloat of garish, epilepsy-inducing Christmas decorations that serve nothing but the ego of the people installing them has gotten pretty bad in this country. This one looks fine but maybe your neighbours don't appreciate having flashing multi-coloured strobe lights being blasted through their curtains at every hour of the night. \n\nNot saying they're justified but the older I get, the less I appreciate people coating their entire house in eye-melting, harsh, white-blue LEDs just for their own personal gratification. \n\n\nIt's the same as fireworks. People only think of themselves, and couldn't give a single shit about everyone else in a two mile radius who perhaps don't want to listen to explosions for two months of the year. ",
            "score": -9,
            "created_utc": 1734837564.0
        },
        {
            "author": "cantinabandit",
            "body": "People suck.",
            "score": 39,
            "created_utc": 1734735450.0
        },
        {
            "author": "Astro-Butt",
            "body": "Last summer my local area did several large events to raise money to rebuild a park (all nice quality wood) and a few weeks later it was set on fire by a group of teenagers. What wasn't burnt was covered with graffiti. It was the only park within walking distance for us as well and used to stop there almost every day on the way back from school.",
            "score": 10,
            "created_utc": 1734860409.0
        },
        {
            "author": "Robin061270",
            "body": "It all starts in the home.Ferrel people nowadays.",
            "score": 36,
            "created_utc": 1734777442.0
        },
        {
            "author": "Lumpy_Benefit666",
            "body": "I went litterpicking and id just cleared a railway crossing, when a group of 17-19 year old girls saw me and launched a load of mcdonalds litter from the bridge above me straight at me. A bunch of people saw and rushed to help me clear it up which was nice though.\n\nI then moved onto another area and was skating to get there and some steroid wanker punched me in the stomach whilst i was skating and winded me for a good 15 mins.\n\nI continued picking for like 5 hours, determined to do what i set out to do but i was really struggling towards the end.\n\nTurned out the guy that assaulted me broke 2 of my ribs and bruised my liver. \n\nPeople saw me with the litter equipment and seemed to think i was lowlife scum that deserved to be hurt. \n\nIn reality, id worked a 60hr week but had 2 days off so I was just fucking trying to help the community in this time. \n\nThe steroid guy was never identified, even though there were at least 6 cctv cameras pointing at where he punched me.",
            "score": 16,
            "created_utc": 1734878685.0
        },
        {
            "author": "Baige_baguette",
            "body": "Ride my bike through an underpass on the way to work, everyday there is fresh glass, even after the street sweeper runs through.\n\n Sometimes I'll ride by as the cleaners doing his thing, on the ride back broken glass everywhere. It must be intentional at this point.",
            "score": 6,
            "created_utc": 1734877943.0
        },
        {
            "author": "benjy-bear",
            "body": "I live in a village between two towns, roughly 12 miles apart, the main road that connects them runs through our village and a few other villages, one of the towns got a McDonalds a few years ago, since then, the main road connecting the two towns is littered with McDonald’s wrappers and cups every day. It absolutely infuriates me. There is no need to do that, why can’t these dickheads just keep the rubbish until they get home?",
            "score": 6,
            "created_utc": 1734879107.0
        },
        {
            "author": "NotTukTukPirate",
            "body": "Cram 67 million people onto a relatively tiny island and the law of averages takes over. It's inevitably going to have a massive amount of egocentric, rude and terrible people",
            "score": 4,
            "created_utc": 1734858579.0
        },
        {
            "author": "Tasty_Ad_4548",
            "body": "It started under thatcher, remember when she stated, \"There is no such thing as society\" in 1988 while she was eviscerating the country. The advent of right to buy, and buy to let mortgages along with not allowing councils to build enough homes to replace those sold, destroyed neighbourhoods, created a tory voting landlord class and placed people in precarious short term tenancies. This means no one gives a damn about where they live if they are only going to be there a short amount of time.",
            "score": 23,
            "created_utc": 1734787368.0
        },
        {
            "author": "chummypuddle08",
            "body": "Thanks for litterpicking",
            "score": 6,
            "created_utc": 1734825525.0
        },
        {
            "author": "eimankillian",
            "body": "Man people who littering all the time /  people who just doesn’t follow any rules of any kind / always rude / ruins Christmas for people / blames everything/ everyone except themselves and never does anything to help people. \n\nThey need to be revoke their British citizenship and sent somewhere else.",
            "score": 3,
            "created_utc": 1734878909.0
        },
        {
            "author": "keizai88",
            "body": "It starts at the Top. People’s lives are harder and they are frustrated and angry. \n\nThey see other people getting richer, travelling the globe, buying houses and sports cars…\n\nThey even see people looking younger and better looking with expensive surgery, procedures, supplement’s etc \n\nThey are bombarded with misinformation from professional shit stirrers online, in the news and papers to make them angrier. \n \nThey don’t think they can confront those at the top; many of them are gullible and angry at the wrong people. \n\nSo… they take it out on you.",
            "score": 3,
            "created_utc": 1734882773.0
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 15,
            "created_utc": 1734735773.0
        },
        {
            "author": "Akash_nu",
            "body": "Wish more people had common sense and a sense of clean neighbourhood. I remember it wasn't like this even 10-15 years ago.",
            "score": 2,
            "created_utc": 1734854981.0
        },
        {
            "author": "Cumulus-Crafts",
            "body": "We did a litter pick in our primary school, and I remember litter picking an entire bouncy castle.",
            "score": 2,
            "created_utc": 1734863370.0
        },
        {
            "author": "Edible-flowers",
            "body": "The government used to fund campaigns to remind people to 'Keep Britain Tidy'.  My generation should really know not to throw litter out of car windows or just chuck packaging as we walk.  Perhaps we need to teach younger adults to pop rubbish in their home bins.",
            "score": 2,
            "created_utc": 1734891443.0
        },
        {
            "author": "ldn-ldn",
            "body": "Britain has turned into a nanny state with zero parenting. And then these kids grow up into adults and we have what we have.",
            "score": 2,
            "created_utc": 1734894973.0
        },
        {
            "author": "Car-Nivore",
            "body": "Every time I see someone flick a cigarette butt out of their car window, my desire to simply finger snap shitcunts out of existence dramatically multiplies.",
            "score": 2,
            "created_utc": 1734899752.0
        },
        {
            "author": "Zacs-Dad295",
            "body": "Said it before, and I’ll say it again COVID did a complete number on people’s heads, we were told to think about our own health and to shield ourselves against other people.\n\nPeople’s attitudes changed to a more selfish one, even shopping habits have changed.",
            "score": 2,
            "created_utc": 1734901849.0
        },
        {
            "author": "Due_Ad2052",
            "body": "same. When i put the green or blue bin out, i use a litter picker stick and clean around the side of the house and out front. Fairly often i get people give me dirty looks or say something. Just this week in fact, i was doing it and a car slowed right now and the guy called me a freak and drove off. Barely 60 seconds later they drive back the opposite way and he went \"oi you slag\" and threw a pepsi can at me. I dunno what peoples problem is.",
            "score": 2,
            "created_utc": 1734911370.0
        },
        {
            "author": "nolinearbanana",
            "body": "The problem is that one large group of people decided that punishing low-level ASB was a bad idea, while another even larger group of people started viewing anti-authority behaviour as something to reward.\n\nTake littering - my cousin was spotted throwing down a cigarette in a park by a warden and he tried to fine her. She refused to give any details so the police were called. To the police she gave her address in Dubai, refusing to spell it. He let her go. My aunt and mum who were there at the time were congratulating her and slagging off the warden and the police officer. Now I know if the same story was posted on Facebook, it would go down in a similar fashion.\n\nThe last decent generation is now all but dead. What we're left with is multiple generations of shitty human beings.",
            "score": 2,
            "created_utc": 1734920212.0
        },
        {
            "author": "Rough_Apartment9909",
            "body": "once i thought some kids or wind knocked over everyones bins and i stayed up late one night and here bins falling over i looked out my window and it was foxes all along making all the mess! dragging rubbish out the bins to find any sort of left over food",
            "score": 2,
            "created_utc": 1734959096.0
        },
        {
            "author": "kemb0",
            "body": "No one mentioned it but I used to get irate at people chucking litter over my fence. I realised over time that there were two other culprits: the wind and foxes. Wind would often blow open wheelie bins and spill their contents or just generally whip up stuff in the streets and deposit it in my garden. And foxes would grab anything remotely food smelling and dash in to my garden to eat it in safety before leaving their filth behind in the lawn.\n\nSo I learnt that not all litter was deliberately dropped there by a person. Not saying there aren’t assholes out there, but especially this time of year the wind can suck a lot of litter out of places where litter should be and deposits it elsewhere.",
            "score": 2,
            "created_utc": 1734850813.0
        },
        {
            "author": "Night_Haunter",
            "body": "I feel it starts with Sunday trading in supermarkets. No time for family as those poorer families work in retail which are now open Sundays so don't get to see one another and kids and teens left to own devices",
            "score": 2,
            "created_utc": 1734875786.0
        },
        {
            "author": "MiniMages",
            "body": "Do homeless people gather in specific areas? I use to do something similar where I live and noticed specific parts will always have litter. Later learned some homeless people would gather in thsoe areas and just throw all of their rubbish around.",
            "score": 1,
            "created_utc": 1734880372.0
        },
        {
            "author": "Mysterious_Good927",
            "body": "Import the third world, become the third world.",
            "score": 1,
            "created_utc": 1734892837.0
        },
        {
            "author": "No_Development1126",
            "body": "inequality of opportunity is where this country goes wrong. poor is a mindset, dont let people aspire, they will destroy.",
            "score": 1,
            "created_utc": 1734893524.0
        },
        {
            "author": "VoraciousQueef",
            "body": "Hmmm… I can think of one solution to this…",
            "score": 1,
            "created_utc": 1734896186.0
        },
        {
            "author": "Mr_Cheese_Lover",
            "body": "Thatcher. Made us all see each other as competition rather than comrades. Society is still broken here to this day. It reached into the other states like Scotland too",
            "score": 1,
            "created_utc": 1734897757.0
        },
        {
            "author": "Fit-Mangos",
            "body": "Probably a member of the peaceful religion lol",
            "score": 1,
            "created_utc": 1734904398.0
        },
        {
            "author": "Acerhand",
            "body": "I moved to japan years ago but every time i come home to England i am shocked by the litter and nastiness. \nDont get me wrong - japan has litter. They litter here often but they are more discrete about it.\n\nI came to the conclusion that in Japan people view public places and such as their own property in so that everyone owns it so take care of it(streets etc).\n\nIn the UK people view public property as someone elses, they dont own it and there is some weird resentment of it, and being an easy target they want to ruin it.",
            "score": 1,
            "created_utc": 1734916504.0
        },
        {
            "author": "walmarttshirt",
            "body": "Late to this conversation but I moved to the U.S. I live in a fairly small town in Connecticut. Our local bank is like a living room with sofas and coffee and all of the tellers are sat at desks. Not a plexi glass shield anywhere. All of the gas stations are pretty much the same way. Open desks no plexi glass. \n\nThe local store leaves things outside when it closes at night. Pallets of water, pumpkins in the fall, firewood and vending machines. I couldn’t ever imagine this growing up in Liverpool and it’s such a culture shock. The U.S. has its problems but small town America is amazing. \n\nI even remember walking down the town center and a group of scruffy looking 18-20yo were walking towards me. Instantly I tensed up expecting a confrontation and when they saw me they said “hey how’s it going?” Then moved out of the walkway to let me past. It’s such a difference from a group of young men in Liverpool swinging a punch at me for driving by them on a bike.",
            "score": 1,
            "created_utc": 1734935311.0
        },
        {
            "author": "OccupyGanymede",
            "body": "Some people just want to watch the world burn",
            "score": 1,
            "created_utc": 1734959303.0
        },
        {
            "author": "_Laura-the-explorer_",
            "body": "This is so true. More so since covid, I was doing some education tech contracting around that time and on return from lockdown the kids were trashing everything they could, I suppose a lot of them will not be leaving for college / joining the workforce, they're gonna be in forms rude awakening with their attitudes",
            "score": 1,
            "created_utc": 1734835034.0
        },
        {
            "author": "PaganWillow01",
            "body": "I totally agree! I live in a ‘nice’ area but am amazed at the way people are just awful! So I stick to myself have become antisocial in that I don’t trust many people anymore. For me it is betrayal that cuts deep - betrayal from those who are meant to love you from the off has left me totally alone! 🤷‍♀️ It’s just so sad as I KNOW there are decent folk out there but when you don’t even like your own family what hope is there? I have cut everyone off",
            "score": 1,
            "created_utc": 1734841000.0
        },
        {
            "author": "TheSlamBradely",
            "body": "Nerd alert 🚨",
            "score": 0,
            "created_utc": 1734956085.0
        },
        {
            "author": "PhiveStarA",
            "body": "IMO you’re mad at the wrong people and things. Don’t be pissed at a band-aid when you’re doing nothing to treat the wound. \n\nIt’s manufactured. Easier to keep a population in line when they are fighting with each other. \n\nPeople in power have been using that playbook for centuries, they just didn’t have constant social media and internet access to be bombarded with a general scope of things that are purposefully meant to excite emotions in us one way or another.\n\nIf you treat someone like a dog for so long, they’re gonna not give a fuck, and act like a dog. \n\nIf you give people nothing, with no real hope to ever achieve anything greater, why should they care about the world in a way that benefits anyone but themselves, when the world is selfish and only self-beneficial?",
            "score": 0,
            "created_utc": 1734960673.0
        },
        {
            "author": "coffeewalnut05",
            "body": "This is quite a common phenomenon in this country - being nasty and destructive for no reason. And nobody is ready to talk about it.",
            "score": 29,
            "created_utc": 1734732496.0
        },
        {
            "author": "MandalorianLobster",
            "body": "Yup, rats fricking LOVE wires for some reason, and have got teeth like side cutters.",
            "score": 16,
            "created_utc": 1734860389.0
        },
        {
            "author": "mithrasbuster",
            "body": "Multiple clean cuts as well, human will most likely cut a lead wire,once, animal will cut multiple seemingly at random. That OP says three, makes me think animal",
            "score": 1,
            "created_utc": 1734894125.0
        },
        {
            "author": "Kyle_Rittenhouse_69",
            "body": "What kind of animal would see any purpose in biting through a cable adorned with bright lights?",
            "score": -23,
            "created_utc": 1734740594.0
        },
        {
            "author": "d-ohrly",
            "body": "That's a fairly liberal use of the word tree there",
            "score": 3,
            "created_utc": 1734886938.0
        },
        {
            "author": "ChrisChros87",
            "body": "*looked",
            "score": -8,
            "created_utc": 1734801466.0
        },
        {
            "author": "BraveBoot7283",
            "body": "how do yk it was a middle class area ???",
            "score": 1,
            "created_utc": 1734890396.0
        },
        {
            "author": "blackskies4646",
            "body": "As you said, a lot of miserable cunts want to drag others down to their level.",
            "score": 6,
            "created_utc": 1734884053.0
        },
        {
            "author": "SatiricalScrotum",
            "body": "The most adorable vandals.",
            "score": 1,
            "created_utc": 1734961208.0
        },
        {
            "author": "Accomplished_Boss821",
            "body": "That will be so it won’t offend anyone who might not celebrate Christmas. I highly doubt it was health and safety.",
            "score": 1,
            "created_utc": 1734877340.0
        },
        {
            "author": "Lovelia-",
            "body": "You can buy anti theft kits for hanging baskets, someone stole my baskets and the lock too 🙃",
            "score": 3,
            "created_utc": 1734880378.0
        },
        {
            "author": "AdventurousFrame332",
            "body": "I have a ‘light every thing up for Christmas’  neighbour. I definitely would cut the wires if I had the energy and no migraine",
            "score": 2,
            "created_utc": 1734912244.0
        },
        {
            "author": "Brave_Pain1994",
            "body": "So minor that you had to come on here and make a five paragraph rant about it 😂.\n\nHats off to you though 🤭 for taking the time to write about your ordeal.",
            "score": 1,
            "created_utc": 1734936859.0
        },
        {
            "author": "superkinks",
            "body": "It’s not the same as the fireworks, they’re noisy and often distribute smoke into the immediate environment for people to breathe in. Someone nearby has a giant inflated Santa that lights up. It’s a bit naff, but kids walking past it on the way to school absolutely love it. If you’re bothered by walking past a few houses with brightly coloured lights, maybe you need to have a think if there’s something else that’s actually wrong in your life that’s making you unhappy.",
            "score": 8,
            "created_utc": 1734854145.0
        },
        {
            "author": "Thefdt",
            "body": "I don’t think it’s just for their personal gratification, kids and most normal people quite like tastefully done lights and don’t feel triggered by them. It shows a bit of a sense of pride and community getting them out and set up as it makes the street look festive. \n\nI get some people go overboard and if you ran them all night how that could be irritating in some instances but most have inbuilt timers these days or are turned off when people go to bed",
            "score": 6,
            "created_utc": 1734858222.0
        },
        {
            "author": "DreamOfAzathoth",
            "body": "I don’t think it is for their own personal gratification. I can’t afford to put my own lights up but I love walking around and looking at other peoples’.\n\nThey’re beautiful and it’s nice that some people are taking time out to brighten their community and celebrate Christmas.\n\nJust because you don’t like them doesn’t mean nobody does.",
            "score": 3,
            "created_utc": 1734883894.0
        },
        {
            "author": "Dixie_Normaz",
            "body": "\"The older I get the more of a miserable old git I become\" \n\nFixed that for you victor.",
            "score": 3,
            "created_utc": 1734891014.0
        },
        {
            "author": "Redragon9",
            "body": "I can see why people may not like Christmas lights, but damaging the property of another person is not a good response.",
            "score": 2,
            "created_utc": 1734881046.0
        },
        {
            "author": "LadyLatrine",
            "body": "Total jerk",
            "score": 4,
            "created_utc": 1734842975.0
        },
        {
            "author": "DeadPonyta",
            "body": "I used to live opposite some of these types  and their flashing light display was extremely intrusive even with the curtains and blinds closed.  Sometimes the display was left active all night and made it difficult to sleep. \n\nWhen we asked if they could possibly have a earlier lights-off time they initially kept saying that we were being unfair because it was “for the kids” and people in the road were selfish for complaining but when I pointed out that “the kids” probably weren’t up that late I was met with abuse and distinctly threatening behaviour. \n\nApparently where they used to live EVERYBODY used to have light displays and there was a good natured spirit of competition as to who had the best/biggest display but since they’d moved here everyone was stuck up and should have risen to the challenge!\n\nLuckily they moved away a year later",
            "score": -1,
            "created_utc": 1734849111.0
        },
        {
            "author": "CookieAndLeather",
            "body": "“People, what a bunch of bastards”",
            "score": 14,
            "created_utc": 1734833767.0
        },
        {
            "author": "Kan_Me",
            "body": "\"hell is other people\"",
            "score": 5,
            "created_utc": 1734892876.0
        },
        {
            "author": "SgtJayM",
            "body": "Some people suck",
            "score": 1,
            "created_utc": 1734901534.0
        },
        {
            "author": "WeirdLight9452",
            "body": "When I was a kid we had one of those living fences at my school where they like bent willow in to a fence and let it grow. Almost as soon as it was planted older kids came and jumped all over it and killed it all. I thought people were generally awful from a worryingly young age.",
            "score": 2,
            "created_utc": 1734900402.0
        },
        {
            "author": "hatterSCFC",
            "body": "Not always, remember the woman on the news who put the cat in the wheelie bin for no reason?! Some people are just fucking horrible and it doesn't matter which level of society they come from.",
            "score": 26,
            "created_utc": 1734867155.0
        },
        {
            "author": "Outrageous_Zombie945",
            "body": "Totally agree. I'm my street there's a little parking bay opposite my house. One family uses it, and it's probably 50 steps from their house, yet if they stop at McDonald's, they leave the rubbish on the floor next to the car. I've taken to throwing it over their back fence!  Before I'm questioned, I have cameras on my property and have seen them doing it. They also live halfway between my house and my mums which is why I know how far they are.",
            "score": 8,
            "created_utc": 1734867534.0
        },
        {
            "author": "SubbyLime",
            "body": "I theorise it all starts at the top. When the people in power are shamelessly corrupt and bleeding families dry to enrich themselves and their equally corrupt friends, the young adults see this as the pinnacle of what you can achieve and act accordingly within their sphere of influence, be that; how they influence their followers and people they follow online, how they spend their time with their friends when they go out.  Basically, how low the bar is allowed to be. Trickle down economics doesn't exist but trickle down morality absolutely does imho.",
            "score": 8,
            "created_utc": 1734866509.0
        },
        {
            "author": "Chimpbot",
            "body": "What did Will Ferrell and his family ever do to you?\n\nIt’s “feral”, just for future use. It’ll be pertinent as people continue to get worse.",
            "score": 2,
            "created_utc": 1734874758.0
        },
        {
            "author": "OptimusPrime365",
            "body": "Feral.",
            "score": 1,
            "created_utc": 1734883181.0
        },
        {
            "author": "Far_Net4596",
            "body": "It's Feral. Though I don't think half the people here are intelligent enough to consider just why social order is decaying amongst the lower classes in recent years, and how it's only going to get worse as the years go by.\n\nLet's just see what happens with the new generation, being abused on increasingly prevalent agency contracts, money's new way of skirting all the employment laws we've worked so hard for. Factories and warehouses are phasing out permanent staff *en masse*, to pay *double* what they pay for regular staff (half of which goes to the agency) in order to be able to fire us at will. We'll never own a house, most of us won't afford to have kids and if we do, the future isn't looking bright for them.\n\nThis country is gonna experience what every country does when the robbery of the working class is complete and we're reverted to this new form of modern wage slavery. Problems. MMW it's going to get worse and worse as people have less and less hope. The middle class sold us out to protect themselves and now it's their turn. Your displays of how much money you have, say outside your house to bring \"Christmas cheer\", are targets for angry young people. And deservedly so. Keeping your wealth as private as possible will be the way going forward.",
            "score": 1,
            "created_utc": 1734892555.0
        },
        {
            "author": "Some_Preparation_650",
            "body": "Feral*",
            "score": 1,
            "created_utc": 1734892606.0
        },
        {
            "author": "Robin061270",
            "body": "Stop splitting hairs,You know what I mean.",
            "score": 1,
            "created_utc": 1734960463.0
        },
        {
            "author": "coffeewalnut05",
            "body": "I’m so sorry, that sounds awful. Hope you’re better now. \n\nIt’s for that reason I haven’t returned to places I’ve seen get repeatedly destroyed with litter. Once I got the sense it’s intentional, I figured I a) wouldn’t waste my time and b) don’t want to make myself too familiar in the area and turn into a target. \n\nI stick to cleaning places with high footfall and/or that are family-friendly these days.",
            "score": 11,
            "created_utc": 1734878969.0
        },
        {
            "author": "Solid_Agency8483",
            "body": "Very sorry to hear that. I'm a litter picker, too, in my area. Pleased to say I've only ever received thumbs up from passing motorists. Once a group of five swaggering lads in their early twenties passed me on a Sunday nothing while I was picking and one looked back over his shoulder to make a remark (which, I'm sorry to say, I expected to be derogatory); what he actually said was \"someone's heart is in the right place\".  It made me smile and kind of restored my faith in humanity (which the needlessly discarded fast food packaging hurled from cars overnight dies much to generally undermine). Hope your awful experience doesn't demoralise you.  There are more good folk than bad out there!",
            "score": 2,
            "created_utc": 1734907193.0
        },
        {
            "author": "Some_Preparation_650",
            "body": "You’re saying someone punched you in the stomach for zero reason? Forgive me if that sounds incredible.",
            "score": 1,
            "created_utc": 1734896240.0
        },
        {
            "author": "Tedious_Grind",
            "body": "I hope steroid guy’s testicles shrivel and his boobs sag. What a prick.",
            "score": 1,
            "created_utc": 1734908056.0
        },
        {
            "author": "Grouchy_Response_390",
            "body": "Unfortunately cameras are still being bought by people that are incapable of seeing a face. It’s a balance war between quality and storage capabilities. People on roids can be angry",
            "score": 1,
            "created_utc": 1734933258.0
        },
        {
            "author": "coffeewalnut05",
            "body": "I agree that a lot of it looks intentional, legitimately mentally unwell activities",
            "score": 3,
            "created_utc": 1734878426.0
        },
        {
            "author": "Solid_Agency8483",
            "body": "Agree! Infuriating!",
            "score": 2,
            "created_utc": 1734907241.0
        },
        {
            "author": "jaz-000",
            "body": "Japan says hello ...",
            "score": 6,
            "created_utc": 1734859608.0
        },
        {
            "author": "RochePso",
            "body": "That's bullshit\n\n1) the island of Great Britain is 9th largest of thousands of islands, so not tiny \n\n2) the UK population density isn't particularly high: Scotland, Wales and the north of England are mostly empty. So not crammed",
            "score": 0,
            "created_utc": 1734909265.0
        },
        {
            "author": "Altruistic_Ad_7061",
            "body": "I am no fan of Thatcher but routing everything back to her is just lazy. A lot do with today’s problem is, people are too quick to make excuses for others. “Oh maybe they have something going on in their lives that causes them to act this way.” “Maybe they have ADHD or some other illness.”  Why can’t we just accept some people are A-holes and stop making excuses.",
            "score": 12,
            "created_utc": 1734853360.0
        },
        {
            "author": "ProverbialOnionSand",
            "body": "I’m not defending Thatcher however, there’s an argument that if people own their homes they are invested in the area and will thus take care of it. I’ve lived amongst social housing and the behaviour of residents, litter and general disregard for the communal spaces was abysmal.",
            "score": 20,
            "created_utc": 1734819770.0
        },
        {
            "author": "Ok_Organization1117",
            "body": "No idea why you got downvoted this is spot on. Blame the disease not the symptom.",
            "score": 9,
            "created_utc": 1734801239.0
        },
        {
            "author": "PaganWillow01",
            "body": "Thatcher was the root of all evil … ashamed that her parents were grocers instead of being proud and staying working class she decided that grocers would become tories and along with private enterprise right to buy etc she really screwed us big time!",
            "score": 2,
            "created_utc": 1734841138.0
        },
        {
            "author": "Tha_Likely_Lad",
            "body": "I’m sorry but Thatcher has nothing to do with it.  I’m 40 years old and grew up in the early 90s.  My town was not a shithole then.  But 30 years later it’s absolutely awful now",
            "score": 1,
            "created_utc": 1734857891.0
        },
        {
            "author": "Vectis01983",
            "body": "Yes, let's blame Thatcher for someone allegedly cutting the cables on this guy's Christmas tree. It's obviously her fault, even though she walked out of Downing Street 34 years ago. She might as well have cut those cables herself.\n\nI mean, I know people are desperate, literally, to make political points here on Reddit, but, please, bring some common sense to the conversation, or at least think about what you're going to post before clicking the Comment button. 34 years on and you're seriously still blaming her?",
            "score": 1,
            "created_utc": 1734884062.0
        },
        {
            "author": "hatterSCFC",
            "body": "The reason Thatcher and the Tories never built any social housing was because Thatcher believed that council estates were/are Labour voters strongholds.",
            "score": 0,
            "created_utc": 1734867475.0
        },
        {
            "author": "coffeewalnut05",
            "body": "Yup, very sad. Certainly they need to be taught a lesson",
            "score": 1,
            "created_utc": 1734879331.0
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 2,
            "created_utc": 1734749838.0
        },
        {
            "author": "WeirdLight9452",
            "body": "Okay so I’m probably not a young adult anymore (27) but the people I encounter most dropping things are older than me. This may just be because I live in a village full\nOf old people but I don’t think it’s a generational thing.",
            "score": 1,
            "created_utc": 1734901240.0
        },
        {
            "author": "Acerhand",
            "body": "Where you doing it naked by any chance?\n\nJoke aside this is exactly what i think summarise this problem. Teenage kids littering and ruining shit etc is all the same as that story you told.\n\nCulturally the UK has a huge crab in a bucket mentality which is most strong in traditional working class cultures. I dont even think 2nd or 3rd generation immigrants in “working class” society Britain act that way or at least as commonly.\n\nThe perpetrators see anything they perceive as moving up and improving and launch the crab in a bucket attack. Litter pickers symbolise that, so even though its your own fucking home it must trigger them",
            "score": 1,
            "created_utc": 1734917786.0
        },
        {
            "author": "westwizz",
            "body": "Wow yes I was driving home on a particularly  windy day.\n\n \nWe live 4 miles out of our nearest village\n\n\nI was maybe a half  mile out when\nI saw a distinctive orange bag sat in the middle of the field by the road \n\nOh that's lovely....\n\n\n then as I pulled up to the house realised from the heavy winds our bin lids were blown off recycling everywhere and an orange bag I had left by the front door was gone\n (now in the field)",
            "score": 2,
            "created_utc": 1734864468.0
        },
        {
            "author": "coffeewalnut05",
            "body": "True",
            "score": 1,
            "created_utc": 1734864178.0
        },
        {
            "author": "coffeewalnut05",
            "body": "I don’t think small town Britain is too different tbh, in general cities attract the worst of a country in terms of crime. In the U.K. this also includes a lot of antisocial behaviour unfortunately",
            "score": 1,
            "created_utc": 1734949643.0
        },
        {
            "author": "coffeewalnut05",
            "body": "What is “nerdy” about acting like a normal adult? In many other European countries, this is the standard.",
            "score": 1,
            "created_utc": 1734956432.0
        },
        {
            "author": "coffeewalnut05",
            "body": "“We give people nothing” so how are these people able to afford to buy coffees, Big Macs, condoms, jackets, gloves and leave all their belongings behind in a public space?",
            "score": 1,
            "created_utc": 1734962904.0
        },
        {
            "author": "treemanos",
            "body": "Like the kids that smashed up that church and so many other examples, it's painfully common amoung all sections of society. There's a woman down the road that gets great pleasure from upsetting people and causing problems, she'll go round looking for anything people are enjoying so she can try and ruin it. Thankfully I've never had a run in with her but so many others have, it's genuinely scary that there are so many people like that out there now it makes me not want to do anything in case it attracts a lunatic. \n\nI think part of it is we've changed as a society to view everyone else as a problem and a burden, we need to spread the understanding that other people existing and being happy is a good thing. This isn't a game where others have to lose for you to win, if everyone is happy and doing well then we can all live better lives.",
            "score": 6,
            "created_utc": 1734890616.0
        },
        {
            "author": "Acerhand",
            "body": "Im always reminded by the people putting detergent in fountains. There was a new one in Birmingham or Manchester a few years ago and the weekend it opened someone did that immediately. Its expensive and difficult to fux them when it happens. I believe it was fixed then someone did it again straight away and the council decided to permanently turn it off…",
            "score": 3,
            "created_utc": 1734918030.0
        },
        {
            "author": "DreamOfAzathoth",
            "body": "It’s sad but I feel like it’s a human thing. A sad number of people are just cunts",
            "score": 1,
            "created_utc": 1734883395.0
        },
        {
            "author": "Portablefrdge",
            "body": "Looks like you are",
            "score": -8,
            "created_utc": 1734740756.0
        },
        {
            "author": "ambiuk21",
            "body": "And rabbits 🐇 \n\nThey’d chew live wires as happily as they’d chew through sweet potato leaves",
            "score": 3,
            "created_utc": 1734888623.0
        },
        {
            "author": "Hex-509",
            "body": "Mann I couldn't agree more, rat bites even if it's not on a person are horrifying, seen those little fuckers munch their way through basically anything they can fit their filthy little mouths around.",
            "score": 4,
            "created_utc": 1734895985.0
        },
        {
            "author": "OnceIWasStraight",
            "body": "I’ve been scrolling the comments far too long looking for one with this pov.\n\nMy rabbit has cost me so many pairs of wired headphones, animals love to chomp through wires for some reason.\nThe cut was always perfectly clean and diagonal like it had been done with a set of cutters.\n\nAlso, I’ve done a fair bit of decommissioning on electrical systems and if I were to cut a bunch of separate wires I would just grab as many as possible and bunch them up to cut through multiple wires in one cut, not snip each one individually or random ones.\nWire cutters are designed to cut parallel when held correctly too\n\nSeems like an animal did it to me",
            "score": 1,
            "created_utc": 1734896721.0
        },
        {
            "author": "BastardsCryinInnit",
            "body": "Kyle_Rittenhouse_69, meet squirrels. Squirrels, meet Kyle_Rittenhouse_69.\n\nThey've even been known to steal the bulbs.",
            "score": 61,
            "created_utc": 1734741033.0
        },
        {
            "author": "Macshlong",
            "body": "Sharks eat internet cables, mice eat speaker wire. They can probably sense or feel the energy or something.",
            "score": 9,
            "created_utc": 1734764803.0
        },
        {
            "author": "alexfarmer777",
            "body": "Squirrels have literally cause power cuts for towns before",
            "score": 13,
            "created_utc": 1734744917.0
        },
        {
            "author": "perpetualpossibility",
            "body": "Squirrels, rabbits and foxes all eat plants. They’ll eat whatever they can get their sharp little teeth around. The insulation material on some wires is made from plant-based materials (such as corn or soy-based materials). The critters just smell a potential snack and give it a little nibble. It’s actually very common. The forbidden liquorice.",
            "score": 4,
            "created_utc": 1734848375.0
        },
        {
            "author": "Quick-Low-3846",
            "body": "Maybe they’re fed up of being kept awake all night by all the outdoor Christmas lights.",
            "score": 3,
            "created_utc": 1734831650.0
        },
        {
            "author": "sas223",
            "body": "Rabbits. Why? No idea. Someone posted last Christmas or the Christmas before about actually catching the rabbit on camera doing it. They had been convinced it was a neighbor",
            "score": 4,
            "created_utc": 1734748415.0
        },
        {
            "author": "dunkerpup",
            "body": "You can talk to my cats if you like, one of them bit clean through the Christmas tree lights",
            "score": 4,
            "created_utc": 1734780737.0
        },
        {
            "author": "PrimalTripping",
            "body": "Most of the time probably just so they can get past. If it’s in their way and they can eat through it, why wouldn’t they?",
            "score": 2,
            "created_utc": 1734813297.0
        },
        {
            "author": "Big_Slime_187",
            "body": "My cat had entered the chat *",
            "score": 1,
            "created_utc": 1734741045.0
        },
        {
            "author": "UnusualSomewhere84",
            "body": "Why did mice chew through the wires to my cooker?  They just love to chew!",
            "score": 1,
            "created_utc": 1734765219.0
        },
        {
            "author": "CasualGlam87",
            "body": "Foxes love to chew through cables. I've had so many solar string lights destroyed by foxes. I have wildlife cameras in my garden so I've caught them in the act every time!",
            "score": 1,
            "created_utc": 1734808023.0
        },
        {
            "author": "shredditorburnit",
            "body": "When I moved into my house I found several cables in the attic that had been chewed to the point of exposing the core. \n\nHow the house didn't burn down before we fixed it and blocked off the entrances is beyond me.",
            "score": 1,
            "created_utc": 1734849324.0
        },
        {
            "author": "HerbTP",
            "body": "Rabbits adore chewing through wires. It's their favourite thing to do.",
            "score": 1,
            "created_utc": 1734855501.0
        },
        {
            "author": "RoundDew",
            "body": "What kind of person would see any purpose in randomly cutting three wires?",
            "score": 1,
            "created_utc": 1734874485.0
        },
        {
            "author": "Fickle_Penguin",
            "body": "Why is your username celebrating a terrorist?",
            "score": 1,
            "created_utc": 1734886422.0
        },
        {
            "author": "St0n3rJezus420",
            "body": "Have a pet rabbit and you can ask those fuckers the same thing. Might not answer though, sure as hell didn’t tell me why anyway.",
            "score": 1,
            "created_utc": 1734887282.0
        },
        {
            "author": "OnceIWasStraight",
            "body": "You seem to be greatly overestimating the thought processes of animals there",
            "score": 1,
            "created_utc": 1734897055.0
        },
        {
            "author": "enterthedragon1234",
            "body": "Look at the house behind. Pretty fair assumption.",
            "score": 1,
            "created_utc": 1734933483.0
        },
        {
            "author": "chrisxxviv",
            "body": "Crab mentality.",
            "score": 1,
            "created_utc": 1734890454.0
        },
        {
            "author": "ReadySaltedWR",
            "body": "She said it was because it would create smoke in the event of a fire. \n\nI'm tempted to get a little metal christmas tree next year just to see what happens.",
            "score": 5,
            "created_utc": 1734884708.0
        },
        {
            "author": "lateredditho",
            "body": "Could someone please explain why we shouldn’t have a Merry Christmas because someone might be offended?",
            "score": 1,
            "created_utc": 1734909498.0
        },
        {
            "author": "SlinkyWoo75",
            "body": "Seriously? What is wrong with people these days? It's horrendous. If it's not nailed down, it's free game!",
            "score": 2,
            "created_utc": 1734880804.0
        },
        {
            "author": "Golarion",
            "body": "What is the distinction between noise and smoke being distributed into the general environment, and light pollution? \n\n\nIf your argument is 'just close your curtains', you're essentially requiring people to shut themselves off from the outside world because someone else on their road wants to have an ego trip. \n\n\nAnd maybe I'm unhappy because, once again, everyone else's personality defects is apparently something I have to accommodate. As if I haven't bent over backwards all my life for other people's arsehole behaviour. ",
            "score": 1,
            "created_utc": 1734855387.0
        },
        {
            "author": "sawrek",
            "body": "I’m really sorry your decoration seems to have been vandalised. Please don’t let it spoil your enthusiasm.\n\nWe’ve always had a (hopefully tiny) amount of truly sour people among us. They only act in darkness, because they are aware most of us would find thier behaviors repellant. Humanity is a mixed bag!\n\nNext year maybe enjoy your lights in your back garden or taped to the inner window panes, so a vandal’s opportunity is limited.\n\nMore importantly, have a lovely holidays 🤗❤️",
            "score": 3,
            "created_utc": 1734868183.0
        },
        {
            "author": "Golarion",
            "body": "Who is more the jerk here? Me or the people who pollute their general area with strobe lighting? It's not a dance club. It's a public space. It's looks like shit. It's obnoxious. Nobody cares. These people only do it because they're absolutely starving for attention, even if it is negative attention, because they were never loved growing up and/or are desperate to feel like the main character. It's pathetic, is what it is.",
            "score": -2,
            "created_utc": 1734844128.0
        },
        {
            "author": "Golarion",
            "body": "Yeah, that's pretty much the attitude I've encountered as well. They like the act of \"I'm doing it for the community\" but at the end of the day it's just \"oooh look at me\" on a huge scale. \n\n\nI wouldn't even care so much if they actually looked nice, instead of some £5.99, pure white LEDs they got on Amazon that just look godawful. ",
            "score": 0,
            "created_utc": 1734855270.0
        },
        {
            "author": "the_ice_rasta",
            "body": "“Well now that’s not fair u/CookieAndLeather, have you met all of them?”",
            "score": 2,
            "created_utc": 1734916325.0
        },
        {
            "author": "stitchgor3",
            "body": "Is heaven is full of people then it will be the same as earth",
            "score": 1,
            "created_utc": 1734908873.0
        },
        {
            "author": "Wooden-Ad-8792",
            "body": "Yeah but Jean-Paul Sartre wrote that, so he actually meant 'Hell is other Frenchmen'",
            "score": 1,
            "created_utc": 1734941879.0
        },
        {
            "author": "Oxygene13",
            "body": "The one thing that always annoyed me the most is if you want something safe and peaceful your thought is to put up a wall but a wall is almost a guaranteed invitation to some people who see it as a challenge. There's literally no way to keep away from people which doesn't involve occupying some remote island somewhere covered in turrets.\n\nI always found it massively unfair as someone who can't stand living in hearing distance of noisy neighbours, how much money it would cost to be able to distance yourself from something which literally drives you insane. Noise cancelling headphones cant do enough. There were times when I considered significant violence just for some peace.",
            "score": 2,
            "created_utc": 1734949903.0
        },
        {
            "author": "Robin061270",
            "body": "It’s the influences they’ve been around at the influential stage if their lives growing up,Knowing the boundaries of right and wrong,This is what makes people peevish.That’s what makes people nice or cruel.",
            "score": 1,
            "created_utc": 1734894887.0
        },
        {
            "author": "williamshatnersbeast",
            "body": "I’m sure Will is as bad at littering as the rest of them but surely it’s not just him and his family causing all the mess?",
            "score": 0,
            "created_utc": 1734895923.0
        },
        {
            "author": "MrMunkeeMan",
            "body": "Good for you, I’d do the same.",
            "score": 1,
            "created_utc": 1734942476.0
        },
        {
            "author": "niamhxa",
            "body": "Absolutely. And the best bit is, they’ve successfully convinced half the population that ‘it all starts at home’, and that the real people to blame are the working class, or the immigrants, or those on benefits, or gen z, or anyone else they want to point the finger at before admitting that their beloved Great Britain isn’t so great thanks to the politicians they voted in for 14 years.",
            "score": 4,
            "created_utc": 1734869171.0
        },
        {
            "author": "Odd-Neighborhood8740",
            "body": "The young adults who do this crap barely know enough about the people at the top and the corruption they do. They're not exactly the most informed demographic.\nWe live in a narcissistic, self involved era. \n\nThe people who understand the corruption at the top are far more likely to not litter",
            "score": 1,
            "created_utc": 1734959249.0
        },
        {
            "author": "Some_Preparation_650",
            "body": "Lol",
            "score": 1,
            "created_utc": 1734892627.0
        },
        {
            "author": "Robin061270",
            "body": "Stop splitting hairs you know what I mean",
            "score": 1,
            "created_utc": 1734960501.0
        },
        {
            "author": "Lumpy_Benefit666",
            "body": "Thanks, im mostly better now but i can no longer box or workout at the gym properly because my ribs have healed badly and tensing my abs makes them grind together. \n\nIv not litterpicked since because i dont want to deal with the humiliation and random attacks from people. \n\nI should let go of it but i often think about the guy that caused me chronic pain and ruined sports for me, which was the main pleasure in my life.",
            "score": 12,
            "created_utc": 1734879289.0
        },
        {
            "author": "Lumpy_Benefit666",
            "body": "Yeah i was going down a hill and he saw me from a long distance and kept moving side to side to try and cut me off. I was turning as hard as i could to try and get away from him but practically leaped at me to smash me in my ribs. \n\nI cant think of any logical reason that he would do that either.",
            "score": 3,
            "created_utc": 1734900845.0
        },
        {
            "author": "Wonderful_Rain6499",
            "body": "I was once punched in the side of the head while sat on some steps chatting to my friend (about nothing remotely controversial) so I can definitely believe it ",
            "score": 2,
            "created_utc": 1734907945.0
        },
        {
            "author": "Acerhand",
            "body": "Someone with that behaviour definitely doesn’t have the mental capacity to take steroids responsibly so if he was on them and not just fat then probably a typical candidate to get fucked up for life by them",
            "score": 1,
            "created_utc": 1734916910.0
        },
        {
            "author": "Nicky2512",
            "body": "They still have a strong sense of shame apparently",
            "score": 2,
            "created_utc": 1734882713.0
        },
        {
            "author": "NotTukTukPirate",
            "body": "First of all, I said relatively. As a Canadian (second biggest country in the world) living in England, it's a tiny fucking island, dude. If you think otherwise you are ignorant or in denial. Sayings it's 9th biggest out  of thousands is a strawman argument and moot. \n\nSecond, again, I come from Canada originally, where the population density is a perfect example of not being \"particularly high.\" In comparison, Canadas population density is 4.2 people per square kilometer. England is 434 people per square kilometer. \n\nFuck out of here with \"that's bullshit\" \nYou have no clue what you're talking about.",
            "score": 1,
            "created_utc": 1734912510.0
        },
        {
            "author": "BeginningKindly8286",
            "body": "Everyone has something going on with their lives, at this point it’s just conversation filler.",
            "score": 2,
            "created_utc": 1734859495.0
        },
        {
            "author": "rainbow_rhythm",
            "body": "Coz you have to be somewhat thoughtful about the root of these things otherwise you might as well just give up on freedom and give in to Singapore style authoritarianism",
            "score": 2,
            "created_utc": 1734884519.0
        },
        {
            "author": "Edible-flowers",
            "body": "She lay the foundations, so it's perfectly legitimate to blame her & her party.",
            "score": 1,
            "created_utc": 1734891683.0
        },
        {
            "author": "Tasty_Ad_4548",
            "body": "Right to buy, get homes at discount rate and stay until clawback period ends, sell the house at a big profit thanks to property boom and buy to let mortgages, and move on. Or original purchaser dies and family sell to a \"property investor.\"\nI grew up in social housing, and it was usually nowhere near as bad as it is with housing associations running things. The council had housing officers dealing with bad tenants or those who were struggling to maintain things. Housing associations tend to be way more cost focused, though.",
            "score": 11,
            "created_utc": 1734820382.0
        },
        {
            "author": "UserCannotBeVerified",
            "body": "Aye and if it were feasible for regular people to buy a home for themselves we might see more community, but when the majority of ex council houses are on the rental market, and we have over a third of the population renting, it's increasingly harder for people to establish roots in a community where they're constantly being pushed out by increasing rent prices.",
            "score": 3,
            "created_utc": 1734866030.0
        },
        {
            "author": "rainbow_rhythm",
            "body": "Is that not because people who are like that are much less likely to get to a position to be able to afford a home?\n\nI'm sure if they were more accessible you'd see them full of normal conscientious people",
            "score": 2,
            "created_utc": 1734884654.0
        },
        {
            "author": "hatterSCFC",
            "body": "That's a good point, council tenants and renters can be really disgusting pigs. I have seen it, then again if the Council come and move their crap for free,when they dump it, instead of enforcing the rules in the tenancy agreement, then they are just going to carry on doing it",
            "score": 2,
            "created_utc": 1734867707.0
        },
        {
            "author": "theslootmary",
            "body": "This is true, and you’re helping criticise thatcher not defending her… because she got the ball rolling that meant the private rent sector exploded because the council had no homes to house people. Now we’re in a situation where people can barely afford rent but it’s still easier to accomplish than actually buying a home.",
            "score": 1,
            "created_utc": 1734874617.0
        },
        {
            "author": "rssurtees",
            "body": "I've never heard that idea before. A startling insight. Thank you.",
            "score": 1,
            "created_utc": 1734846758.0
        },
        {
            "author": "TwistyNeptune",
            "body": "All started with thatcher. Remember she considered New Labour her greatest political triumph, she'd manage to shift public opinion or progressive socialist policies and forced labour to adopt a more conservative position in politics. \n\nAs a result, the UK political sphere has remained centre-right since the late 80s, and after the recent 14 years of extreme government austerity, the natural progression of Thatchers policies, actual poverty levels have skyrocketed. Poverty creates crime because there is no prosperity or opportunity in poverty stricken communities. Every town and city in the country has higher levels of poverty since the 90s, which is why you don't see your home town as you remember it.",
            "score": 4,
            "created_utc": 1734865700.0
        },
        {
            "author": "hatterSCFC",
            "body": "Probably because your town doesn't have the necessary funding. Thatchers fault for selling off all of the family silver, as well as anything else that wasn't nailed down, using the police forces to beat the miners and break the Unions, creating crime waves and social unrest and upheaval. What you grew up with in the 90's my friend was the fallout from it, as we still do to this day.",
            "score": 2,
            "created_utc": 1734868160.0
        },
        {
            "author": "Tasty_Ad_4548",
            "body": "It's someone asking, \"Where this country went wrong,\" and I supplied an answer, there is the relevance.",
            "score": 1,
            "created_utc": 1734884159.0
        },
        {
            "author": "walmarttshirt",
            "body": "I dated a girl from a small town (a village really) in the UK. It was a really wealthy area. Even there the banks had strong security and the local corner shop would dream of leaving things out overnight.\n\nAlso in our town one Xmas somebody left their brand new bmw M5 running outside the store for around 20 minutes with nobody inside. \n\nEven in nice areas of the uk I wouldn’t dream of leaving my car unlocked, never mind running.",
            "score": 0,
            "created_utc": 1734952038.0
        },
        {
            "author": "TheSlamBradely",
            "body": "😂 \n\nWhat’s the contents of your rucksack, which you will take with you everywhere you go?\n\n“Just let me check. Thermos, sandwiches, corn plasters, telephone money, dandruff brush, animal footprint chart and... one triple thick condom. You never know”\n\nHow many pairs of bro-nylon trousers do you own?\n\nDo you wear hiking shoes just to walk round town in?",
            "score": 0,
            "created_utc": 1734957433.0
        },
        {
            "author": "PhiveStarA",
            "body": "If you think people having money to pay an outrageous price for unregulated capitalists to get rich is “giving people something” then you have a very sad reality that you live in, as one of the only residents, cause the rest of us are in the actual real world.",
            "score": 0,
            "created_utc": 1734962992.0
        },
        {
            "author": "coffeewalnut05",
            "body": "And then those same people probably whine that this country is a shithole where we can’t have nice things lol",
            "score": 1,
            "created_utc": 1734920186.0
        },
        {
            "author": "EricGeorge02",
            "body": "The buggers ate the lead flashing on my roof.",
            "score": 18,
            "created_utc": 1734754110.0
        },
        {
            "author": "Inevitable_Panic_133",
            "body": "Some cars switched the insulation over from oil based (as in refined crude) to vegetable or seed oil based (I can't remember, something organic anyway).\n\nMice where eating entire wiring harnesses lol",
            "score": 3,
            "created_utc": 1734850715.0
        },
        {
            "author": "Kyle_Rittenhouse_69",
            "body": "![gif](giphy|ghuvaCOI6GOoTX0RmH)",
            "score": 3,
            "created_utc": 1734769504.0
        },
        {
            "author": "The_Nude_Mocracy",
            "body": "Squirrels are the second most common cause of Internet outages",
            "score": 7,
            "created_utc": 1734767382.0
        },
        {
            "author": "bigturkey89",
            "body": "Used to have a rabbit with a thing for ethanet cables it's a clean cut.",
            "score": 5,
            "created_utc": 1734758911.0
        },
        {
            "author": "__fujiko",
            "body": "Rabbits love cables (owner of a rabbit.) It's the spicy grass equivalent.",
            "score": 5,
            "created_utc": 1734851617.0
        },
        {
            "author": "thoms689",
            "body": "Have a cat that did it when it was 1 - 3 years old, it broke a headset and the motion detector on my nintendo wii way back in 2011 ish, thankfully it has stopped.",
            "score": 1,
            "created_utc": 1734825291.0
        },
        {
            "author": "MyTimeIs-Now",
            "body": "Some of the Grey Squirrels would fuck up a medium / small cat.",
            "score": 0,
            "created_utc": 1734775047.0
        },
        {
            "author": "HelicopterOk4082",
            "body": "Newer wire insulation is made from a more biodegradable plastic product that is more  attractive to rodents apparently.",
            "score": 2,
            "created_utc": 1734771041.0
        },
        {
            "author": "Kyle_Rittenhouse_69",
            "body": "True. I usually just sneak into gardens to cut two .",
            "score": 1,
            "created_utc": 1734894576.0
        },
        {
            "author": "Kyle_Rittenhouse_69",
            "body": "Terrorist? Please explain",
            "score": 1,
            "created_utc": 1734891674.0
        },
        {
            "author": "velvet-overground2",
            "body": "It really isn’t, a lot of council housing (and ex-council housing) looks like that, also it’s not uncommon to have completely different houses across from one another",
            "score": 1,
            "created_utc": 1734952216.0
        },
        {
            "author": "Accomplished_Boss821",
            "body": "Health and safety incase it falls on someone",
            "score": 3,
            "created_utc": 1734884990.0
        },
        {
            "author": "CavalierCrusader",
            "body": ">you're essentially requiring people to shut themselves off from the outside world because someone else on their road wants to have an ego trip. \n\nYou sound so tiring, you poor thing 🥺",
            "score": 3,
            "created_utc": 1734876740.0
        },
        {
            "author": "LimpSong3440",
            "body": "Buddy, I didn’t think real life Grinches existed but here you are…",
            "score": 6,
            "created_utc": 1734865355.0
        },
        {
            "author": "Outrageous_Zombie945",
            "body": "Not a public space. It's a private garden. The individual who cut this was trespassing. You'd get shlt for that in America!",
            "score": 3,
            "created_utc": 1734867723.0
        },
        {
            "author": "AnxiousTerminator",
            "body": "Wild jump from \"Puts up Christmas lights\" to \"wasn't loved as a child.\" While I also am frustrated if they are flashing and not turned off at a reasonable hour for bed, some people just put them up because they look nice and bring people joy. I loved seeing Christmas lights as a kid and even now really enjoyed wandering through my city this year as the lights were really pretty. Sometimes people just want to look at nice things or share them with the world and it's not a deep plea for attention to fill the void. Do you think all decoration or aesthetic decisions are just born from a need for attention? That people would be equally happy living in an unadorned concrete cell containing only what is necessary to live?",
            "score": 3,
            "created_utc": 1734869103.0
        },
        {
            "author": "DreamOfAzathoth",
            "body": "I can’t tell if you’re roleplaying as Scrooge or if you’re serious but I really don’t understand you",
            "score": 3,
            "created_utc": 1734884069.0
        },
        {
            "author": "LadyLatrine",
            "body": "Still you 🤣",
            "score": 5,
            "created_utc": 1734844286.0
        },
        {
            "author": "Dixie_Normaz",
            "body": "You.",
            "score": 2,
            "created_utc": 1734891064.0
        },
        {
            "author": "dresdenthezomwhacker",
            "body": "It’s a Christmas tradition that 90% of people enjoy. You don’t even have to see it but for what, three weeks a year? \n\nSheesh, what a grinch 🙄",
            "score": 3,
            "created_utc": 1734851901.0
        },
        {
            "author": "Quesadillasaur",
            "body": "Definitely you.",
            "score": 2,
            "created_utc": 1734851808.0
        },
        {
            "author": "No_Patience_6801",
            "body": "That was a masterful projection I must say, Scrooge.  Only one here who sounds miserable and alone is you.",
            "score": 1,
            "created_utc": 1734902433.0
        },
        {
            "author": "intothedepthsofhell",
            "body": "It can be a nice thing. Probably 50% of the houses near my put up some sort of lights and it makes the whole area look great at Christmas. And there is a \"community\" feel to it when people join in. But, don't go mental and try to turn your house into Las Vegas, and turn them off at a reasonable time.\n\nLike most things, it can positive but there's always someone who takes it too far.",
            "score": 4,
            "created_utc": 1734856877.0
        },
        {
            "author": "CookieAndLeather",
            "body": "“I’ve met enough of them”",
            "score": 2,
            "created_utc": 1734916361.0
        },
        {
            "author": "ynes213",
            "body": "Is this from the it crowd?",
            "score": 1,
            "created_utc": 1734950255.0
        },
        {
            "author": "WeirdLight9452",
            "body": "I wouldn’t quite go that far, unless I open my windows I can hear very little going on outside. I’ve definitely felt like you at times but I do need company at times. I’d just like the option to choose when those times are.",
            "score": 1,
            "created_utc": 1734959102.0
        },
        {
            "author": "Car-Nivore",
            "body": "You can track our decline back further than the last 14 years. This shit show is not just due to the last tory shit rags.",
            "score": 3,
            "created_utc": 1734899861.0
        },
        {
            "author": "pharlax",
            "body": "I absolutely disagree. Not liking the government is no excuse to be a cunt.\n\nThrowing litter around, vandalism etc are down to people being cunts. Don't try to absolve the individuals of the blame.",
            "score": 5,
            "created_utc": 1734878416.0
        },
        {
            "author": "RuneClash007",
            "body": "How big was the guy and how big are you? \n\nIf you box, you should've had the medicine ball treatment at least once? One punch to your ribs shouldn't be fucking you up that badly",
            "score": 1,
            "created_utc": 1734910742.0
        },
        {
            "author": "Jamesy_baby",
            "body": "Maybe that guy who assaulted you just needs pity. Anyone who does that just does it to make themselves feel bigger. He is probably a pathetic weasel in real life, attacking someone because he can't handle himself within his own peer group.",
            "score": 1,
            "created_utc": 1734910208.0
        },
        {
            "author": "Acerhand",
            "body": "Brit living in japan for almost a decade. Disagree. Met lots of rude Japanese people over the years and scammers online etc.\n\nI also lived in some countries in Europe.\n\nImo there is something unique about british kids and hooliganism. I cant explain it. Its definitely cultural. \nIts not like “shame” is preventing japanese from acting the same lol. Not at all. There just isn’t that desire to be a shithead like that for most.\n\nIm not sure if its an anglo cultural quirk either because it could be happening in other Anglo places but i get the feeling the UK just has this problem.\nIts little to do with the population density.\n\nMaybe its british crab in a bucket culture amplified by the lower IQ and people with least perceived opportunities?",
            "score": 1,
            "created_utc": 1734917334.0
        },
        {
            "author": "WeirdLight9452",
            "body": "True, though I do think there should be more support for kids with additional needs or issues. My cousin had dyslexia and his school just said he was thick and wouldn’t help him, he’s actually got his GCSEs now but he was on drugs and in young offenders and stuff. Once he’d got his education he did really well for himself. I hope it’s better now than it was then but I don’t think it is. Maybe I’m biased though, I’m disabled and sorta went to uni out of spite because people said I couldn’t. 😂",
            "score": 3,
            "created_utc": 1734900828.0
        },
        {
            "author": "Cubeazoid",
            "body": "It’s way better to have low earners pay rent to the government for eternity and not make it easier for them to own their own home.\n\nThe property boom occurred due to immigration and inflation, why not blame that?",
            "score": 1,
            "created_utc": 1734865090.0
        },
        {
            "author": "TheSlamBradely",
            "body": "\nOh, come on, just admit it—you’re one of those types who rocks up everywhere with a rucksack, aren’t you? Probably stuffed full of opinions you’ve collected like they’re souvenirs from a gap year. The gap year you didn’t take a begrudge others/\n\nBut honestly, do you really reckon you’re qualified—intellectually, morally, or otherwise—to sit there judging an entire nation against your own highfalutin standards? Or is it just because you’ve picked up a crisp packet once and now fancy yourself the patron saint of smug environmentalism?",
            "score": 0,
            "created_utc": 1734962903.0
        },
        {
            "author": "coffeewalnut05",
            "body": "If these people had nothing, they wouldn’t be able to afford to buy tons of stuff and then litter it all in public spaces. So I’m not buying the victimhood narrative. Take your rubbish home. If you can produce nastiness, you need to clean it up. Basic adult duties.",
            "score": 1,
            "created_utc": 1734963217.0
        },
        {
            "author": "GeneralComposer5885",
            "body": "Told my insurance company they ate my minivan",
            "score": 14,
            "created_utc": 1734777966.0
        },
        {
            "author": "Macshlong",
            "body": "\nI know right.\n\n“Now it seems Google is biting back. According to Network World’s Brandon Butler, a Google product manager explained at a recent event that the company has taken to wrapping its trans-Pacific underwater cables in Kevlar to guard against shark bites.”",
            "score": 7,
            "created_utc": 1734770468.0
        },
        {
            "author": "Kyle_Rittenhouse_69",
            "body": "After beavers?",
            "score": 2,
            "created_utc": 1734769346.0
        },
        {
            "author": "Fickle_Penguin",
            "body": "Kyle Rittenhouse is a terrorist by because he used lethal force during a protest, intimidating others to suppress political dissent.",
            "score": 1,
            "created_utc": 1734892233.0
        },
        {
            "author": "ReadySaltedWR",
            "body": "Lol...I'll update in a years time",
            "score": 2,
            "created_utc": 1734885263.0
        },
        {
            "author": "Golarion",
            "body": "If that makes me a jerk, then I'm happily a jerk.",
            "score": 1,
            "created_utc": 1734844545.0
        },
        {
            "author": "Golarion",
            "body": "If 90% of the country enjoyed it, 90% of houses would partake in it. Rather than about 5% that pollute their entire street.\n\nIt's an American import. We didn't have it 20 years ago. It's absolute main character syndrome.",
            "score": 2,
            "created_utc": 1734852048.0
        },
        {
            "author": "Golarion",
            "body": "Yeah, that's fine. I'm starting to accept the fact that I'm out of step with a country of self-obsessed a-holes.",
            "score": 3,
            "created_utc": 1734851866.0
        },
        {
            "author": "Golarion",
            "body": "Yeah, it's perfectly possible for them to be done tastefully and aesthetically. \n\n\nI will also point out that, no offense, but OPs design is a basic, 9-foot tall geometric pyramid of exposed, dentist-office-white LEDs next to a traffic cone. It's not exactly the Mona Lisa, is it? But it's also representative of the standard of the vast majority of Christmas decorations in this country.\n\n\nThey're absolute bargain basement in terms of effort. Usually a bit of ugly plastic tat wrapped around a lightbulb. You see more sophistication and artistic merit at the Blackpool illuminations. ",
            "score": 0,
            "created_utc": 1734857385.0
        },
        {
            "author": "Beneficial_Judge1775",
            "body": "https://www.reddit.com/r/ITcrowd/s/1dd33Y4O2e",
            "score": 1,
            "created_utc": 1734961055.0
        },
        {
            "author": "niamhxa",
            "body": "You’ve not understood what I said at all. It’s about the socioeconomic impact on a population’s behaviour. Obviously, yes, individuals themselves are the ones behaving disorderly. But the initial suggestion was that ‘it starts at home’, as if people all of a sudden on a whim decided to act unsocially. What I’m saying is that there are wider influences at play here, and the ongoing decline of funding, public infrastructure, and government integrity is absolutely a well-studied and accepted indicator of crime rates, antisocial behaviour and so on. It’s interesting, I’d suggest looking into it.",
            "score": 2,
            "created_utc": 1734879079.0
        },
        {
            "author": "gigamac6",
            "body": "Why does there always have to be one person doubting whatever someone says online? What reason would the guy have to make up an injury/side effects?",
            "score": 3,
            "created_utc": 1734916578.0
        },
        {
            "author": "Acerhand",
            "body": "A punch in the gut when not expecting it from a seemingly bigger person will damage you even if you have trained a bit",
            "score": 3,
            "created_utc": 1734916760.0
        },
        {
            "author": "GloryBax",
            "body": "Cool motive, still caused life long damage to a stranger!",
            "score": 2,
            "created_utc": 1734930381.0
        },
        {
            "author": "coffeewalnut05",
            "body": "You’re probably one of those people who litter and therefore are getting aggressive and defensive at those who care about their communities, nature, and behaving with respect towards others. Look in the mirror. You are part of the problem.",
            "score": 1,
            "created_utc": 1734963496.0
        },
        {
            "author": "CommercialPug",
            "body": "Did the squirrels have to pay for a new minivan",
            "score": 5,
            "created_utc": 1734817611.0
        },
        {
            "author": "sas223",
            "body": "I thought Kevlar didn’t protect against knives? How would it protect against shark teeth?",
            "score": 1,
            "created_utc": 1734886273.0
        },
        {
            "author": "MyTimeIs-Now",
            "body": "Dolphins.",
            "score": 3,
            "created_utc": 1734775005.0
        },
        {
            "author": "Kyle_Rittenhouse_69",
            "body": "I didn't know that. What was the verdict in his trial*?\n\n*Presuming he had a trial",
            "score": 1,
            "created_utc": 1734892934.0
        },
        {
            "author": "Inside_Purpose300",
            "body": "How many years is he serving?",
            "score": 1,
            "created_utc": 1734893960.0
        },
        {
            "author": "Greggs-the-bakers",
            "body": "Considering I'm in my late 20s i can assure you we absolutely did have it 20 years ago as i vividly remember it from my childhood. You sound like an absolute fun vacuum.",
            "score": 5,
            "created_utc": 1734859668.0
        },
        {
            "author": "Outrageous_Zombie945",
            "body": "I'm 41. My parents took me out on Christmas light drives. You must have lived in a cave if you missed all that",
            "score": 6,
            "created_utc": 1734867812.0
        },
        {
            "author": "dresdenthezomwhacker",
            "body": "Plagiarism is the basis of all culture bud, just enjoy the light show",
            "score": 5,
            "created_utc": 1734852120.0
        },
        {
            "author": "Jemma_2",
            "body": "I love it, but I don’t partake in it because those things are pricey!! 😂",
            "score": 2,
            "created_utc": 1734857376.0
        },
        {
            "author": "intothedepthsofhell",
            "body": ">It's not exactly the Mona Lisa, is it?\n\nFair point lol",
            "score": 0,
            "created_utc": 1734857602.0
        },
        {
            "author": "Cold_Tune326",
            "body": "Sorry to bring up an old thing but the level of devisiveness we see now I think was all started by the Brexit vote. \n\nIts been downhill since then and yeah Politicians have a massive hand in that but good and bad are still things and no matter what, people who are not absolutely desperate have no excuses. I still try and do my best by people and I have had a tonne of shit through my 50 years!",
            "score": 3,
            "created_utc": 1734893370.0
        },
        {
            "author": "PomegranateWaste8233",
            "body": "I agree. The feeling of community has been wrecked, it’s all about ‘them and us’, divisive politics and media gorging on it.\n\nIf people have no compassion or connection to their peers, it’s every man for himself, then why should they care. This is the world we created.\n\nIt’s all the EU’s fault, got rid of them and everything is still shit, so then its all the immigrants fault, or the gays, or the Muslims, or the poor, the disabled, those on benefits….politics has become about blame and alienation and has dominated societies psyche.",
            "score": 2,
            "created_utc": 1734880455.0
        },
        {
            "author": "pharlax",
            "body": "I understand what you wrote. I just disagree. Personal responsibility is king.",
            "score": 3,
            "created_utc": 1734879137.0
        },
        {
            "author": "RuneClash007",
            "body": "Because I've boxed at a fairly decent level. If a single punch is breaking ribs and damaging your organs, you're made of paper mache. \n\nMost people after about 5 sessions will start to go through the medicine ball treatment. You lay on the floor in a crunch and have 5-10kg medicine balls dropped onto your abs to strengthen your core.",
            "score": 1,
            "created_utc": 1734919089.0
        },
        {
            "author": "RuneClash007",
            "body": "A singular punch is very unlikely to break 2 ribs and damage your liver. \n\nIt takes about 4-5 punches to drop somebody when hitting them in their liver, and even then the strong likelihood is they don't have a damaged liver and broken ribs",
            "score": 1,
            "created_utc": 1734919191.0
        },
        {
            "author": "Lumpy_Benefit666",
            "body": "Yeah id feel sorry for him if he was insecure but nice, but i cant forgive that behaviour",
            "score": 2,
            "created_utc": 1734949407.0
        },
        {
            "author": "TheSlamBradely",
            "body": "Nope, I’m totally against littering and adore animals and nature  \n\nAgain, just judging through your gortex jacket aren’t you?\n\nWhy not just let everyone know about the rucksack \n\nWas I right about the contents? \n\nDo you train spot?\n\nAre you a just stop oiler?!?! That’d make sense…",
            "score": 0,
            "created_utc": 1734963625.0
        },
        {
            "author": "hakshamalah",
            "body": "Only if it costs peanuts",
            "score": 1,
            "created_utc": 1734900355.0
        },
        {
            "author": "MakingShitAwkward",
            "body": "Axolotls",
            "score": 1,
            "created_utc": 1734868336.0
        },
        {
            "author": "Fickle_Penguin",
            "body": "Guilty while white, so acquitted",
            "score": 1,
            "created_utc": 1734893910.0
        },
        {
            "author": "Fickle_Penguin",
            "body": "None. He was acquired, he was guilty of what he did, he got away with it.",
            "score": 1,
            "created_utc": 1734897103.0
        },
        {
            "author": "Golarion",
            "body": "I'm curious. Is your thinking that everyone enjoys them? Or that people have the right to put them up regardless of whether others don't enjoy them?\n\n\nIf a neighbour objected to them being up and asked for them to be turned off, how would you react? Because I'm guessing most people on here, by the sounds of things, would default to a defensive 'I'm alright jack's approach. ",
            "score": 1,
            "created_utc": 1734859993.0
        },
        {
            "author": "Dixie_Normaz",
            "body": "Guy probably thinks 20 years ago was 1961.",
            "score": 3,
            "created_utc": 1734891164.0
        },
        {
            "author": "Golarion",
            "body": "I wouldn't object to cultural appropriation if it weren't for the fact we've narrowed in on  the most self-obsessed and shallow aspects of American culture",
            "score": 0,
            "created_utc": 1734853296.0
        },
        {
            "author": "murrayjosh117",
            "body": "I agree.\n\nA person might not be at fault for the things that happen to them in their life, but ultimately your actions are your responsibility.\n\nIf more people accepted this we would reject rage bait and victim cultures that are prevalent today.",
            "score": 4,
            "created_utc": 1734880967.0
        },
        {
            "author": "niamhxa",
            "body": "I say that you misunderstand me because my argument isn’t that personal responsibility isn’t relevant here. Of course it is. But my response was to the suggestion that the *reason* we see such behaviour is just because, at random, higher levels of the population decided they’d start acting differently, worse. My point is that, no, I think there are very real reasons as to why that change has occurred, and it’s not just because people felt like it ‘in the home’. It’s because of a multitude of socioeconomic factors. \n\nDoes that mean that personal responsibility should be forgone? No, of course not. Does it mean that perhaps, a lot of people acting the way they are now might not have made those choices if they lived in a different environment? Maybe, yes. There’s a difference between a reason and an excuse, and I was explaining reasons.",
            "score": 0,
            "created_utc": 1734909289.0
        },
        {
            "author": "Lumpy_Benefit666",
            "body": "I weigh 74kg and have very low bodyfat and the guy must have weighed 110kg minimum. I was going maybe 10mph and he stopped me absolutely dead with a hook to the ribs. It was more than 2x the hardest shot that he could throw since i was moving into the hit. \n\nIf you box then you absolutely should know that a hard shot to the ribs can break them, or youve never boxed a hard hitter. \n\nIm definitely not made of paper mache, iv had some insane mountain bike crashes and bounced up and continued riding. Im just not made of adamantium. \n\nWhen people are assaulted by someone who weighs a good 60% more than them, chances are theyll have an injury.\n\nA 5-10kg medicine ball dropped from 1.5 meters has waaaaayyyyyy less energy than a collision of 74kg moving at 10mph and a big bloke throwing a shot in the opposite direction.",
            "score": 1,
            "created_utc": 1734942382.0
        },
        {
            "author": "Acerhand",
            "body": "He said he was on rollerskates going down hill with the attacker actively trying to line up a punch while he was moving downwards.\nIts definitely enough with that situation.\nI get the feeling he was probably on the skinner side too",
            "score": 2,
            "created_utc": 1734919340.0
        },
        {
            "author": "SadTechnician96",
            "body": "Punch to the gut killed Houdini. You brace up when you expect an impact. If it's out of nowhere it can do real damage ",
            "score": 1,
            "created_utc": 1734955956.0
        },
        {
            "author": "GloryBax",
            "body": "Considering that behaviour has left you in permanent pain and unable to enjoy activities you used to enjoy, yeah I wouldn't forgive him either. No matter his own circumstances, he shouldn't have done that.",
            "score": 2,
            "created_utc": 1734949838.0
        },
        {
            "author": "coffeewalnut05",
            "body": "If you’re totally against littering and adore animals and nature, you’d be spending that time contributing to these causes and not behaving obnoxiously towards those who are contributing. \n\nPeople like yourself make it too easy to feel like I’m on the right side of history, so thank you.",
            "score": 1,
            "created_utc": 1734963826.0
        },
        {
            "author": "Big-Finding2976",
            "body": "Godzilla",
            "score": 2,
            "created_utc": 1734878137.0
        },
        {
            "author": "Kyle_Rittenhouse_69",
            "body": "I googled a Washington Post description of the incident and it said that he had shot a convicted child molester in self defence. The child molester had molested several boys. I can see why you are so upset about it now",
            "score": 1,
            "created_utc": 1734894489.0
        },
        {
            "author": "Inside_Purpose300",
            "body": "You mean acquitted? As in was found not guilty",
            "score": 1,
            "created_utc": 1734911732.0
        },
        {
            "author": "Greggs-the-bakers",
            "body": "My thinking is that it's a cultural thing that, if you don't like it, you only have to put up with for a small part of the year.\n\nIf I decided to put up lights and my neighbour for some reason decided to object, I'd probably tell them to get over themselves.",
            "score": 4,
            "created_utc": 1734860437.0
        },
        {
            "author": "Feign_Clips",
            "body": "There are a lot of reasons to decorate a home with lights for Christmas. A lot of those reasons are positive and not shallow, self-obsessed displays of main character syndrome. If you cannot accept the idea of anyone genuinely wanting to spread a positive message to their community or bring excitement to their kids by decorating with lights and going all out to maximise their positive message, then you really are a Grinch. The Grinch, known for projecting his own negative outlook onto everyone else.",
            "score": 7,
            "created_utc": 1734858043.0
        },
        {
            "author": "RuneClash007",
            "body": "Insane accuracy to throw a hook and land it to your liver when you're moving at 10 mph",
            "score": 1,
            "created_utc": 1734943880.0
        },
        {
            "author": "RuneClash007",
            "body": "Didn't see anything about a hill, but if somebody can land a strong punch on somebody roller skating to specifically their liver, that's fucking impressive and very accurate",
            "score": 1,
            "created_utc": 1734919478.0
        },
        {
            "author": "Lumpy_Benefit666",
            "body": "Thats exactly what happened, except i was on my skateboard not skates",
            "score": 1,
            "created_utc": 1734942438.0
        },
        {
            "author": "RuneClash007",
            "body": "The gut, yes\n\nNot where your liver is",
            "score": 1,
            "created_utc": 1734956821.0
        },
        {
            "author": "TheSlamBradely",
            "body": "What are you on about? One thing does not prohibit the other?\n\nAnd you don’t contribute, you just moan\n\nJust as your post about drug use in the U.K. demonstrates, you just dont get people do you? \n\n“Right side of history” 😂 \n\nShame. Bless you, silly sausage",
            "score": 1,
            "created_utc": 1734963959.0
        },
        {
            "author": "wizardeverybit",
            "body": "The doctor",
            "score": 1,
            "created_utc": 1734894411.0
        },
        {
            "author": "Fickle_Penguin",
            "body": "He just shot 3 black people, who may have had prior convictions. He put himself into a vigilant position and shot at people who confronted him for having a gun and were shot. He had no prior knowledge of any convictions these black people had. He just shot at them because they were black and he was looking for an excuse to kill. It looks like the Joseph did some very bad stuff early in his life and has served his time. That has no bearing on what Kyle did. If it wasn't Joseph trying to disarm a terrorist some other hero would have been his first victim.",
            "score": 1,
            "created_utc": 1734896898.0
        },
        {
            "author": "Fickle_Penguin",
            "body": "As innocent as OJ. It's not debated what he did.",
            "score": 1,
            "created_utc": 1734914825.0
        },
        {
            "author": "Golarion",
            "body": ">I'd probably tell them to get over themselves.\n\n\nYeah, which basically sums up my point. This thing looks like a piece of crap. But heaven forbid anyone voice an objection it, because they'd be met with refusal at best and outright hostility at worst.\n\n\nBecause people in this country don't give a shit about anyone but themselves. ",
            "score": 1,
            "created_utc": 1734860821.0
        },
        {
            "author": "Golarion",
            "body": "I'm sorry, but what is the positive message behind a triangle of white LEDs beside a traffic cone? If the council installed such a thing as a permanent feature, people would outraged. \n\n\nSo if I go set up a high powered spotlight to blast through someone's bedroom window every hour the clock, and call it a 'positive message', that's fine then, is it?",
            "score": 0,
            "created_utc": 1734858345.0
        },
        {
            "author": "Lumpy_Benefit666",
            "body": "Im assuming he was aiming for the general area, but thats where he hit. It also doesnt need that much accuracy, he cut the path off and forced me along the side, where he swung into the only space that i could pass through. \n\nAre you accusing me of lying? Because thats pretty insulting when iv had to give up everything i love and deal with daily pain because of a random attack. \n\nYou clearly have no imagination.",
            "score": 1,
            "created_utc": 1734946029.0
        },
        {
            "author": "Acerhand",
            "body": "Yeah lol probably was not the intention to hit the liver just hurt them but seems crazy",
            "score": 1,
            "created_utc": 1734919941.0
        },
        {
            "author": "Inside_Purpose300",
            "body": "the people he shot were all white.  \n[https://edition.cnn.com/2021/11/01/us/kyle-rittenhouse-shooting-victims-trial/index.html](https://edition.cnn.com/2021/11/01/us/kyle-rittenhouse-shooting-victims-trial/index.html)",
            "score": 1,
            "created_utc": 1734911389.0
        },
        {
            "author": "AnxiousTerminator",
            "body": "It is ironic that you are accusing people of not giving a shit about anyone but themselves while demanding the rest of the country give up something they enjoy and that brings people happiness purely because you don't like it and if you don't like it nobody is allowed to enjoy it.",
            "score": 5,
            "created_utc": 1734869278.0
        },
        {
            "author": "Greggs-the-bakers",
            "body": "You should probably get over yourself.",
            "score": 4,
            "created_utc": 1734861177.0
        },
        {
            "author": "Feign_Clips",
            "body": "Rejecting the concept of there being any sort of positive message behind >>>Christmas<<< Already brilliant, but then cleverly pivoting to an analogy that intentionally equates temporary, legally limited lux levels, and legally limited time of day application lights TO; a spotlight through your bedroom window while you sleep at night. Truly a genius the Grinch is.",
            "score": 5,
            "created_utc": 1734859311.0
        },
        {
            "author": "Fickle_Penguin",
            "body": "Huh, I'll have to check my assumptions. I assumed since it was at a riot where most of the people were rioting were black that they were too. Hmmm, either way he got away with murder.",
            "score": 1,
            "created_utc": 1734915097.0
        },
        {
            "author": "dresdenthezomwhacker",
            "body": "He’s an even grinchier grinch than the actual grinch, even the grinch had a dog.  This guy doesn’t even like them, he made a whole post about it",
            "score": 3,
            "created_utc": 1734869423.0
        },
        {
            "author": "Golarion",
            "body": "\"Temporary\"\n\n\nDon't worry, mate, I'm just going to blast this through your window for two months. That's not long, right? You can go without sleep that long, yeah?\n\n\nHaha, just kidding. As if these people ever ask for permission.",
            "score": 0,
            "created_utc": 1734859547.0
        }
    ]
}