{
    "post_title": "Visiting Prague? This is the monthly recommendations post (December 2024)",
    "post_author": "_invalidusername",
    "post_score": 52,
    "post_url": "https://www.reddit.com/r/Prague/comments/1h47hkt/visiting_prague_this_is_the_monthly/",
    "comments": [
        {
            "author": "meremulford",
            "body": "This is super cool -- thanks for posting this.  I've been reading back posts and combing through other travel blogs and info for our upcoming trip.  We are coming on 12/26 and leaving early 12/30.  I have a 9 year old with special needs who loves live music.  I've found a lot of classical live music options, but are there any other live music options that you would suggest for a child?  She honestly loves any type of music -- from rock to polka to hip hop to dance.  Our last Christmas trip was San Miguel de Allende and there was music every night in the town square and she was in heaven. TIA!",
            "score": 4,
            "created_utc": 1733098763.0
        },
        {
            "author": "claehr",
            "body": "Hi guys! Looking for a place to buy fun socks ... The all-time ideal easy to transport Christmas present. Thank you!",
            "score": 3,
            "created_utc": 1733162567.0
        },
        {
            "author": "erice2018",
            "body": "We are coming to Prague for a few days in January with our kids. Ages 24,21, and 19. \nThey want to go clothes shopping, I am not too sure what kind, but please send me a few ideas of places/ areas to go and look with them.",
            "score": 2,
            "created_utc": 1733105119.0
        },
        {
            "author": "TB98043",
            "body": "what are some food/drink \"essentials\" to have when visiting? More information is welcome, if you have a specific rec on a restaurant but I have no idea what is something you must have when visiting.",
            "score": 2,
            "created_utc": 1733105341.0
        },
        {
            "author": "Jazzlike_Fox4057",
            "body": "We will be in Prague from Dec. 20-22nd.  We are meeting up with friends coming from another country so we want to be flexible and not buy some tickets in advance so we can coordinate with their schedule.  Do you think we can wait and buy Castle tickets the day of our visit (most likely December 20th) without long lines or should we buy in advance?  Thank you!",
            "score": 2,
            "created_utc": 1733166631.0
        },
        {
            "author": "stefanaras02",
            "body": "Helloo, I was wondering if you guys know a good place to have Christmas dinner with 2 friends. Any favorite places with good food that fit the occasion? Ideally not super pricey hahah",
            "score": 2,
            "created_utc": 1733227531.0
        },
        {
            "author": "pamyoo56",
            "body": "Hi, \n\nWill be in Prague by new year eve’s, any recommendations on where to party/clubs? \n\nThank you in advance",
            "score": 2,
            "created_utc": 1734203665.0
        },
        {
            "author": "Due-Photograph-5091",
            "body": "Visiting in late December and wondering which chain property (Marriott or Hilton) is preferred and why?   \nSpecifically Hilton Prague Old Town (diamond status) vs the Prague Marriott (titanium)",
            "score": 2,
            "created_utc": 1734443402.0
        },
        {
            "author": "fayton_",
            "body": "Hey everyone, I am looking for a nice place to take my partner on a date, and i assume she would like to go to some cafe where they sell nice sweets. Does anyone have a good recommendation? It would be great if the place looked good & aesthetic, and wasn't SOOO expensive. \n\n(If anyone has a recommendation for other food places that has a nice interior (good for dates) like asian restaurants, fancy restaurants, italian restaurants , anything really, I am more than happy to hear them!  \n  \nThank you beforehand!",
            "score": 2,
            "created_utc": 1734469210.0
        },
        {
            "author": "Ok-Bread284",
            "body": "Visiting Prague for the first time in 20 years this week. Any recommendations for a bar serving Nakladany  Hermelin (Sp?)? \n\nI remember tasting this before, and it amazing! Also looking for advise on high-end food shopping. Want to get some sausages and cheese for our trin trip to Poland. \n\n#",
            "score": 2,
            "created_utc": 1734951593.0
        },
        {
            "author": "ThereCanBeOnly_1_",
            "body": "Why bother with this? It just gets ignored and everybody still asks about hidden gems that only locals eat in cosy cafe bar restaurants with views of everything where introverts can do a poo in a hat.",
            "score": 2,
            "created_utc": 1733090006.0
        },
        {
            "author": "mauriciod73",
            "body": "Are there any nice (not fancy, but festive) restaurant recommendations for Christmas eve diner? I’ll be in Prague for Christmas and would love to find a nice place to celebrate ",
            "score": 1,
            "created_utc": 1733251258.0
        },
        {
            "author": "AdWhich6663",
            "body": "Husband and I will be in Prague for four days this month. We know where to go for touristy things, including Christmas markets, but food and drink is always more important to us, especially in the evenings. We like good cocktails but enjoy dive bars as well. Any good spots for checking out the local live music scene?",
            "score": 1,
            "created_utc": 1733329884.0
        },
        {
            "author": "DwightisIgnorantSlut",
            "body": "Hii I am in Prague for 2 days (5th and 6th December) and was wondering if anyone would like to join me for a day trip and show me places around or even go to the clubs with me ?\n\nAnd if possible give me tips on what to do and what food to try as a vegetarian/vegan person",
            "score": 1,
            "created_utc": 1733368145.0
        },
        {
            "author": "PralineNational2636",
            "body": "Does anyone have afternoon tea recommendations? And also, does Prague have medicinal cannabis available?",
            "score": 1,
            "created_utc": 1733549110.0
        },
        {
            "author": "TommyExotic",
            "body": "Visiting in February. What is the best way to get from the airport to the city?",
            "score": 1,
            "created_utc": 1733726119.0
        },
        {
            "author": "Bitter-Profession-36",
            "body": "Me and my friends are going to Prague in 4 weeks for 1 week, we planned to shoot at a shooting range but nothing more. Any other ideas?",
            "score": 1,
            "created_utc": 1733860431.0
        },
        {
            "author": "InvestigatorShort603",
            "body": "Hey there planning to visit Prague with a friend. We are 2 people in their twenties so the main purpose in Prague for us is to see the cultural places, trying the best beer in the world and some partying. We are curious about where in Prague should we accomodate so we can enjoy our trip best. Also if you have any suggestions it would be amazing for us. Thanks in advance.",
            "score": 1,
            "created_utc": 1734124288.0
        },
        {
            "author": "lotustortoise_",
            "body": "Hello there! Anyone know any restaurant that serve Christmas menu? I learnt this year that the Czech Christmas food is kapr with some bramborový salát, and I'd love to have it! It doesn't have to be Christmas eve, I just want to try the food! (I live here)\n\n  \nI'd really prefer some local pubs/ restaurant without tourists and too many expats, for example my jams would be Restaurant Na Staré Faře, Lidová jídelna Těšnov, Restaurace U Pramene, or maybe U Sadu. Lokál is too expat-y for me. Although I'm not sure if local pubs serve Christmas menu. Thank you!!",
            "score": 1,
            "created_utc": 1734300376.0
        },
        {
            "author": "Weekly_Fault_9272",
            "body": "Is this too far away? Ill be there for the new years eve plus a few more days\n\n[location](https://imgur.com/a/5JCya1G)",
            "score": 1,
            "created_utc": 1734874721.0
        },
        {
            "author": "BigDuckEnergy2024",
            "body": "Cheap beer = pisswasser",
            "score": 1,
            "created_utc": 1733087059.0
        },
        {
            "author": "Puzzleheaded-Ask7558",
            "body": "Hi\n\n[GoOut.net](http://GoOut.net) has a lot of events listed.  \nNot sure if a direct link will work: [Here](https://goout.net/en/prague/concerts/leznyvlkkzf/?after=2024-12-26%2000%3A00&before=2024-12-30%2023%3A59) \\- but otherwise just filter by city, dates and \"music\". \n\nNot sure how much outdoor music there will be (I imagine the temperature isn't exactly as friendly as in San Miguel), but there's usually lots of options to choose from (even when disregarding those that aren't kid-friendly).",
            "score": 2,
            "created_utc": 1733132472.0
        },
        {
            "author": "Yellow_cupcake_",
            "body": "You can check jazz dock website, they have some concerts for kids. Although maybe they will not be on during the Christmas period, but worth checking!\n\nEdit - looks like there is one! I would contact the venue and make sure that language isn’t a big thing in the concert though, the venue staff speak English and are pretty responsive via email. https://www.jazzdock.cz/en/koncert/jazz-dock-to-kids-snehulaci-z-mrkvonos-divadlo-puls-1\n\nEdit 2- looks like it is more of a show sort thing, and only in Czech.",
            "score": 2,
            "created_utc": 1733153631.0
        },
        {
            "author": "_invalidusername",
            "body": "Most of the malls have pop up sock stalls this time of year (Palladium, Nový Smíchov etc).",
            "score": 2,
            "created_utc": 1733163384.0
        },
        {
            "author": "JohnnyAlphaCZ",
            "body": "There is nothing unusual or special about clothes in Prague... it's all the same brands and stores that you get anywhere in Europe. If money is no object you can hit Pařížská Street, the most expensive shopping street in Europe... but even that is just the usual luxury brands you can get in most large cities (just closer together).",
            "score": 6,
            "created_utc": 1733127575.0
        },
        {
            "author": "Puzzleheaded-Ask7558",
            "body": "Prague isn't exactly the most obvious choice to go clothes shopping. Many Czechs themselves often (claim to) go clothes shopping in other countries :-)\n\nThat said, there are of course lots and lots of clothing stores, both normal and silly pricey (as u/JohnnyAlphaCZ said: Pařížská Street right next to the Old Town Square is what you want, if you're looking for fancy brands.\n\nMy wife would tell them to go to Denimheads - or (if any of your kids are women, to) Twinset Prague.\n\nEnjoy the stay.",
            "score": 3,
            "created_utc": 1733132842.0
        },
        {
            "author": "praguelocals-com",
            "body": "* **💎 Luxurious**: **Pařížská Street** \\- High-end brands like Louis Vuitton and Chanel in a stunning setting.\n* **🛍️ Middle-Class**:\n   * **Prague Airport Outlet** *(Far from center)* \\- Great deals on branded items.\n   * **Na Příkopě Street & Wenceslas Square** \\- Boutiques galore, though a bit overwhelming.\n   * **Palladium Mall** *(Central)* \\- Popular mid-range shopping hub.\n   * **Chodov Mall** *(Largest in Prague)* \\- Over 300 stores for a full-day spree.\n* **💸 Budget-Friendly**: **Primark at Wenceslas Square** \\- Trendy and affordable.",
            "score": 2,
            "created_utc": 1733575889.0
        },
        {
            "author": "Zblunk10",
            "body": "Check Honest Guide videos - he's talking about what and where to eat",
            "score": 4,
            "created_utc": 1733127995.0
        },
        {
            "author": "praguelocals-com",
            "body": "For exploring Czech cuisine, here's my personal tip on what to order at restaurants, bakeries, and markets. \n\nSoups\n\n\\- Must-Have: Creamy dill soup (Kulajda), Clear broths (Vývary) with liver dumplings\n\n\\- Worth It: Goulash, Lentil soup, Potato soup (Bramboračka), and Sour cabbage soup (Kyselica)\n\nMain Dishes\n\n\\- Must-Have: Goulash with dumplings (Guláš), Marinated beef with dumplings (Svíčková), Fried cheese (Smažený sýr, only eat it at Lokál)\n\n\\- Worth It: Roasted duck (Pečená kachna), Schnitzel with potato salad (Řízek), Pork with dumplings and sauerkraut (vepřo knedlo zelo)\n\nDesserts\n\n\\- Must-Have: Apple strudel (Štrůdl)\n\n\\- Worth It: Czech bundt cakes (Bábovka), Yeast pastries (Kynuté buchty), Koláče, Honey cake (Marlenka), Gingerbread (Perníčky)\n\nDrinks\n\n\\- Must-Have: Czech beer (Pilsner Urquell)\n\n\\- Worth It: Slivovice (Plum brandy), Meruňkovice, Kofola (Czech cola)\n\nMarket Foods (ordered as I would like to eat it right now :) )\n\n\\- Roasted ham, Mulled wine, Sausage, Roasted chestnuts, Roasted almonds, Pancakes (Palačinky) and Trdelník (sweet pastry, not Czech one, but I personally like it at Old Town Square only)",
            "score": 2,
            "created_utc": 1733577269.0
        },
        {
            "author": "Tiny_European",
            "body": "You can buy them day of, no problem",
            "score": 3,
            "created_utc": 1733168403.0
        },
        {
            "author": "_invalidusername",
            "body": "For a cute cafe I recommend [Dolce Mente](https://maps.app.goo.gl/PTe7SYAKXPV2BCyG8?g_st=com.google.maps.preview.copy)\n\n\nNice Asian restaurant: [Hong Kong](https://maps.app.goo.gl/v3uAqYFuePWMJg4C6?g_st=com.google.maps.preview.copy)\n\nOtherwise good Mexican place with a nice interior: [La Patrona](https://maps.app.goo.gl/NLj7rKZKU2BFzeqG8?g_st=com.google.maps.preview.copy)",
            "score": 2,
            "created_utc": 1734515329.0
        },
        {
            "author": "_invalidusername",
            "body": "I remove around 100 recommendations posts a month",
            "score": 18,
            "created_utc": 1733090500.0
        },
        {
            "author": "AusCro",
            "body": "Love your description of these requests",
            "score": 2,
            "created_utc": 1733215739.0
        },
        {
            "author": "_invalidusername",
            "body": "Just a heads up, Czechs celebrate Christmas the evening of the 24th, so there is very little open that day",
            "score": 2,
            "created_utc": 1733251384.0
        },
        {
            "author": "Tiny_European",
            "body": "Trolleybus 59 + Metro A, or Bus 100 + Metro B depending on where you need to go.",
            "score": 3,
            "created_utc": 1733729557.0
        },
        {
            "author": "Muted-Mind2896",
            "body": "Hi my girlfriend & i are travelling for new years too! Interesting to head-out on new years together?",
            "score": 1,
            "created_utc": 1734540265.0
        },
        {
            "author": "_invalidusername",
            "body": "It’s a bit out of central Prague but not a big deal. There are metro and tram connections which will get you into the centre in like 10-15 minutes",
            "score": 1,
            "created_utc": 1734874956.0
        },
        {
            "author": "fayton_",
            "body": "thank you! I will make sure to give my feedback after we go there!",
            "score": 2,
            "created_utc": 1734516602.0
        },
        {
            "author": "Zblunk10",
            "body": "Thank you for that. I was just wondering if you could maybe add to the text link to the pinned post with recommendations?",
            "score": 3,
            "created_utc": 1733122499.0
        },
        {
            "author": "ThereCanBeOnly_1_",
            "body": "Thanks! If you ever get the chance to write \"do a poo in a hat\" somewhere, go for it. Think of it as self-care.",
            "score": 2,
            "created_utc": 1733235598.0
        },
        {
            "author": "InvestigatorShort603",
            "body": "We would love to but our trip is at the last week of January so it’s not possible for now. Maybe some other time in a different place. Have a great time in Prague!",
            "score": 1,
            "created_utc": 1734541386.0
        },
        {
            "author": "_invalidusername",
            "body": "Good idea! I’ll update the recommendations a bit and add it",
            "score": 3,
            "created_utc": 1733124301.0
        }
    ]
}