{
    "post_title": "[via Sky Sport] 🚨 Inter predicted XI to face Como. (And team news)",
    "post_author": "SalGentile6",
    "post_score": 46,
    "post_url": "https://i.redd.it/dp4k9cgy0f8e1.jpeg",
    "comments": [
        {
            "author": "pazzopazzini77",
            "body": "Missing Acerbi, Pavard, Darmian & De Vrij and were still able to field that superb back 3. superb squad building. Wouldn’t mind Palacios getting more minutes tomorrow.",
            "score": 30,
            "created_utc": 1734882637.0
        },
        {
            "author": "parcellsrealGOAT",
            "body": "Have a feeling this is gonna be tougher than anticipated",
            "score": 13,
            "created_utc": 1734884358.0
        },
        {
            "author": "Evelyn_pog",
            "body": "Palacios has to be subbed in later, right?",
            "score": 13,
            "created_utc": 1734883120.0
        },
        {
            "author": "Awake-sleeping",
            "body": "I read Lautaro’s statements in a website today where he said he is focusing on deep play and letting Thurman be more in the penalty area. But I feel Lauti is one of the best in the penalty area and comes more naturally to him.",
            "score": 11,
            "created_utc": 1734887227.0
        },
        {
            "author": "blasphemics",
            "body": "Halfway through the match Bastoni and Bisseck will have switched sides so many times that a small gust of wind will have formed around them. And then they'd have faster and faster swaps back and forth between them making the little wisp of air soon after turn into a strong wind and then a fucking tornado that runs amok through Como for us to win 11:0.\n\nThat's my prediction.",
            "score": 8,
            "created_utc": 1734883648.0
        },
        {
            "author": "Warblerburglar",
            "body": "Let Taremi get the start. Toro needs to come off the bench in the second half.",
            "score": 10,
            "created_utc": 1734882662.0
        },
        {
            "author": "loverulez0",
            "body": "Should not this situation be an indication for Inzaghi to start implementing primavera players?",
            "score": 1,
            "created_utc": 1734946173.0
        },
        {
            "author": "SalGentile6",
            "body": "He probably will get 30 min in the second half",
            "score": 6,
            "created_utc": 1734882752.0
        },
        {
            "author": "SalGentile6",
            "body": "I think he atleast deserves that for his performance midweek. He’ll probably have 30 mins in the second half hopefully giving bastoni a break",
            "score": 9,
            "created_utc": 1734883228.0
        },
        {
            "author": "mc802",
            "body": "It would be very weird if that didn't happen ",
            "score": 6,
            "created_utc": 1734884617.0
        },
        {
            "author": "callanimal",
            "body": "A small augusto",
            "score": 1,
            "created_utc": 1734898944.0
        },
        {
            "author": "redzinter",
            "body": "I see it other way around maybe he bags goal or two and his confidence boosts so he can start ~~destroying~~ scoring again.",
            "score": 8,
            "created_utc": 1734883911.0
        },
        {
            "author": "Warblerburglar",
            "body": "I don’t see him destroying anything this season. We need to try something different to get more goals from our strikers.",
            "score": 1,
            "created_utc": 1734884334.0
        },
        {
            "author": "redzinter",
            "body": "Welp it can only get better in the second part of the season",
            "score": 4,
            "created_utc": 1734884489.0
        }
    ]
}