{
    "post_title": "The blessing of Inzaghi",
    "post_author": "Big_Pick4100",
    "post_score": 92,
    "post_url": "https://i.redd.it/6rl28v5f9i8e1.jpeg",
    "comments": [
        {
            "author": "RoyalMobile3996",
            "body": "This man is the best thing ever happened to inter since mou came in 2008/09.\n\nhe has taken the squad to a level i would have never thought possible, seeing him so well regarded in europe makes me really happy. give him a life contract please.",
            "score": 28,
            "created_utc": 1734937306.0
        },
        {
            "author": "codenamederp",
            "body": "Please. Louder for those at the back.\n\nOne negative result and people want to replace him with tuchel or someone else.\n\nNew fans don't understand just how much of a pleasure it is to watch Inter play football and we are building a rep across Europe that we are a very difficult team to play no matter who you are.\n\nA whole lot is down to Inzaghi. We could replace 7 regular players and Inzaghi would still be pulling these results.. How do I know this? Because we did that 2 seasons ago.",
            "score": 16,
            "created_utc": 1734936236.0
        },
        {
            "author": "yesimforeign",
            "body": "No reason not to keep him for the next 5-10 years minimum. Football is fun when he's in charge.",
            "score": 6,
            "created_utc": 1734942556.0
        },
        {
            "author": "samgoody420",
            "body": "this man warrants a budget increase. hope Oaktree realizes the value",
            "score": 6,
            "created_utc": 1734942889.0
        },
        {
            "author": "dyur42555",
            "body": "The problem of Man City now are way deeper of Rodri injury to be fair. Motta Juve is a new team with young player and still not at the level of Inter, injuries or not injuries.\n\nI understand praising Inzaghi but this kind of comparation are pretty pointless.",
            "score": 2,
            "created_utc": 1734943219.0
        },
        {
            "author": "Outside_Economy_304",
            "body": "Would say Marotta was even more important at the time",
            "score": 1,
            "created_utc": 1734956225.0
        },
        {
            "author": "RoyalMobile3996",
            "body": "marotta is responsible for our recent renaissance but inzaghi is the one who took what he had a made the team evolve even more.\n\nRemember when Mhiki can as a free agent and he was regarded as a washed player? look at him 4 years later. Dzeko was the same, Thuram was (wrongly) not highly rated, Dimarco came back after conte didn't like him and became one if not the best LWB in the world.\n\nInzaghi is underrated for what he has done for this club, with him we can consider ourseleves one of the 3 best teams in europe, with conte we could barely play a UCL game without shitting in our pants.",
            "score": 1,
            "created_utc": 1734958141.0
        }
    ]
}