{
    "post_title": "Sipas jush është me vërtet merita e qeverisë Kurti a kishin me ardhë prap këto ndryshime? ",
    "post_author": "Prendush",
    "post_score": 32,
    "post_url": "https://i.redd.it/qmvw2zeegg8e1.png",
    "comments": [
        {
            "author": "Gertice",
            "body": "BE ka konstatuar qe me 2018 jan permbush kushtet per heqjen e vizave ne Kosov, mbas ratifikimit dhe zbatimit te demarkacionit te kufirit me Malin e Zi. Fakti qe eshte vonuar deri ne 2024 eshte per shkak te disa shteteve qe nuk kan desht me leju me ardh shum shqiptar tek to (Kryesisht Franca). Kurti gjat mandatit te tij nuk eshte qe fort ka bo najsend me per heqjen e vizave, jo qe ska dasht, ama kur jen permbush kushtet 2018 qka tjeter ki me bo veq me prit.\n\nEdit: Qe nje source po e japi [https://balkaninsight.com/2018/07/18/kosovo-fulfilled-all-the-criteria-for-visa-liberalisation-07-18-2018/](https://balkaninsight.com/2018/07/18/kosovo-fulfilled-all-the-criteria-for-visa-liberalisation-07-18-2018/)",
            "score": 48,
            "created_utc": 1734897555.0
        },
        {
            "author": "arberkryezinho",
            "body": "Ishalla jeni trritun ju qe postoni gjana te tilla.\n\nE nese jeni trritun ishalla po e merrni naj cent per ket budallaki qe po e boni, se edhe budall edhe pa pare boll keq.",
            "score": 35,
            "created_utc": 1734898727.0
        },
        {
            "author": "aquilae42",
            "body": "Pas permbushjes se kriterve n2018 ka pas bllokime prej Holandes edhe Frances qe si shkak e kan pa korrupsionin. Me ardhjen e qeverise Kurti se paku perceptimi i korrupsionit ne Kosove u zvoglu dukshem kshtu qe besoj e ka nje merite te vogel ne heqjen e vizave.",
            "score": 13,
            "created_utc": 1734899806.0
        },
        {
            "author": "Zhidezoe",
            "body": "Kushtet per heqjen e vizave jone bo para covidi, Qeveria Kurti ne politilen e jashtme ka qene deshtim, e vetmja qeveri pa asnje njohje te re",
            "score": 12,
            "created_utc": 1734898156.0
        },
        {
            "author": "ClassyMF18",
            "body": "Kqyre tashti ktu shumica kishin komplekse tmadhaja tintelegjences, nuk munesh ti me ardh mem thon mu krejt kushtet i kan kry ata para neve po e kan vonu se “ shtet e be e kan blloku perqef” thjesht smunesh se ka fakte. Korrupsioni u kon kushti i fundit edhe aj u realizu qe ka ardh Kurti npushtet tash a osht e vertet a jo un se di po kshtu ju ka dok Europianeve. Ju lutna mos e luni tmeqmin e me u munu me i gaslight njerzit veq per hir qe mos me u dok si “dick rider”.",
            "score": 4,
            "created_utc": 1734900716.0
        },
        {
            "author": "MataneMaleve",
            "body": "Patetike. Asnje njohje… per ta fshehur kete deshtim total fillojn me keto renditje absurde, te cilat askush ne bote nuk i merr seriozisht",
            "score": 9,
            "created_utc": 1734897571.0
        },
        {
            "author": "NikollKelmendi",
            "body": "Kjo asht kan e miratume moti, nuk asht merit e Kurtit.",
            "score": 1,
            "created_utc": 1734904325.0
        },
        {
            "author": "KiliMilii",
            "body": "Cka bre? Mujm me shku nTailand pa viza a?",
            "score": 1,
            "created_utc": 1734899424.0
        },
        {
            "author": "telelsinox25xx",
            "body": "Mendoj qe ka merite qeveria e Kurtit, sadoqe disa e kan permend qe kriteret jan mbush ne 2018, por prej pervojes e dim qe liberalizimi su bo deri me 2024.   \nKontributi i Kurtit ne ket situate eshte qe, qeveria e tij ka qen shum ma pak e koruptume se qeverite e kalume, dhe se me Kurtin ne shtet Kosova ka fillu mu faktorizu qofte ne Tavoline por edhe ne realitet. Ket ndaq e pranojm ndaq jo, qekjo eshte e verteta.  \nTkishin qen qeverite e kalume, ndoshta e kishim pas liberalizimin ne 2024, por gjendjen ne Teren si dhe faktorizimin e Kosoves ne Dialog nuk e kishim pas, e une mendoj se kto jon te nderlidhuna.  \nFundja duhet mia dhon meriten, qysh po rrehin gjyks kta te pydykys qe i kemi sjell 100 njohje Kosoves, edhe ky le te thot une ja kom bo liberalizimin",
            "score": 0,
            "created_utc": 1734905276.0
        },
        {
            "author": "e2g3",
            "body": "LVV W",
            "score": -1,
            "created_utc": 1734902706.0
        },
        {
            "author": "DoktorStephenStrange",
            "body": "Badihava si thojn Albin Baba, jau ka qi nonen do dove.",
            "score": -3,
            "created_utc": 1734911356.0
        },
        {
            "author": "Soft_Temperature5184",
            "body": "Normal qe merit e Kurtit 👑",
            "score": 0,
            "created_utc": 1734958257.0
        },
        {
            "author": "aliksavin",
            "body": "Propagande vari karin alla shqiptarshe",
            "score": -3,
            "created_utc": 1734911981.0
        },
        {
            "author": "Ukshin_Bana",
            "body": "Keto suksese jane pune kolektive e ketyre 25 viteve tfundit. Te gjithe kane merita - edhe Kurti.",
            "score": -3,
            "created_utc": 1734905073.0
        },
        {
            "author": "MicSokoli",
            "body": "OP, shih marrëveshjen e Ohrit, për t'cilën u pajtu Albin Kurti, zotriu ka ba kompromis për një hap përpara, njëjtë si qeveritarët e kaluar. Kushtet për liberalizim janë plotësu gjatë qeverisë së Isa Mustafës.",
            "score": -6,
            "created_utc": 1734912534.0
        },
        {
            "author": "liraking",
            "body": "Haha amo qudi qysh cdo vjet qe thojshin PDK-AAK-LDK qe qat vit ka me ndodh liberalizimi kurr nuk ndodhke :)",
            "score": 3,
            "created_utc": 1734910773.0
        },
        {
            "author": "dont_tread_on_M",
            "body": "Macron, qe ka qene pengesa kryesore e liberalizimiz, as ne takim nuk e ka pranu Kurtin :/\n\nE keta mendojne se keshtu munden me na shit pallavra para zgjedhjeve",
            "score": -3,
            "created_utc": 1734899674.0
        },
        {
            "author": "ClassyMF18",
            "body": "E pse jeni tu rrejt? Qekjo osht met gaslight.\nKrejt kushtet e vertet qe jon pas kry po u kon njo e fundit qe u kon korrupsioni, e qajo deri sa ka ardh kurti npushtet e e ka ul nuk eshte kry si kusht .",
            "score": -11,
            "created_utc": 1734900415.0
        },
        {
            "author": "Prendush",
            "body": "O vëlla, unë nga Fieri jam. Veç që ndjek Kurti në Facebook. Sot ai postoj këtë më lart duke thënë \"merita e qeverisë sonë\". Prandaj po pyes: a është e vërtetë a thjeshtë propagandë?",
            "score": 12,
            "created_utc": 1734902600.0
        },
        {
            "author": "Fiska18",
            "body": "Ishalla SJON trritum se nese jon ather qifti ktyne ka drejte vote.",
            "score": 4,
            "created_utc": 1734903244.0
        },
        {
            "author": "jeffery_bezeos",
            "body": "AHAHHAAHHAHAHAH manfund e tha dikush",
            "score": 8,
            "created_utc": 1734900204.0
        },
        {
            "author": "Untromendous",
            "body": "https://preview.redd.it/biuuz80wtg8e1.jpeg?width=1284&format=pjpg&auto=webp&s=1275e2e3196de6ec5153f8866a46ce38ae34e21f",
            "score": 4,
            "created_utc": 1734901840.0
        },
        {
            "author": "looneyi",
            "body": "Hahahah qajo bre",
            "score": 1,
            "created_utc": 1734957603.0
        },
        {
            "author": "ClassyMF18",
            "body": "Qe pergjigja e duhur, mu pernime ktu pom doken qe nmenyr qe mos me u dok si lepirsa po dalin budall e delusional deri nfund",
            "score": 7,
            "created_utc": 1734900539.0
        },
        {
            "author": "dont_tread_on_M",
            "body": "Nuk ka te beje me perceptim te korrupsionit, pse jane liberalizu vizat ne 2023.\n\nNe 2018, skepticizmi ndaj zgjerimit te BE dhe migracioni kane qene tema kryesore ne debate politike ne Evrope, sidomos ne Holande e France. Per mos me u dhene me shume argumente te djathtes ekstreme, Macron e ka pengu liberalizimin e vizave. Me fillimin e luftes ne Ukraine, debati eshte zhvendos tek lufta, dhe eshte kthy sadopak vullneti per zgjerim te BE. Macron thjeshte e ka shfrytezu ndryshimin e rrethanave per me na e aprovu liberalizimin\n\nAta tjeret kane faj qe nuk i kan plotesu me kohe kushtet, keshtu qe mos e merr qe po e mbroj naj parti tjeter",
            "score": -4,
            "created_utc": 1734907303.0
        },
        {
            "author": "nemophos",
            "body": "Ska ma njohje deri n UN kur t hijme.\n\nedit: ah po edhe naj shtet n afrike qe korruptohet me naj golden eagle",
            "score": 4,
            "created_utc": 1734898665.0
        },
        {
            "author": "ClassyMF18",
            "body": "Patetike 🤡, most me kon Kurti me sa don me bet qe hala skishe mujt me udhtu pa viza ?",
            "score": -2,
            "created_utc": 1734900473.0
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 0,
            "created_utc": 1734904138.0
        },
        {
            "author": "Chance-Ad-747",
            "body": "Edhe pavarsia o kan e bome tani thaci vec e ka nenshkru 😂 e i paten met meritat",
            "score": 1,
            "created_utc": 1734945626.0
        },
        {
            "author": "GjentiG4",
            "body": "a ikem?",
            "score": 4,
            "created_utc": 1734900972.0
        },
        {
            "author": "gjakovar",
            "body": "Para 5 muje mos t'ardht merzi: https://www.reddit.com/r/kosovo/s/3iG6I2zRdW",
            "score": 4,
            "created_utc": 1734906062.0
        },
        {
            "author": "katunar3000",
            "body": "Nuk eshte qudi fare. Kete vit i kemi plotesuar kushtet(Manastiri i Deçanit) per hyrjen ne keshillin e Evropes. Na kan votuar edhe disa shtete qe nuk na njohin, por Gjermania edhe Franca na bllokuan. \n\nE kuptova qe e don Al-binin, por nuk ke nevoje me i mohu krejt faktet..",
            "score": 7,
            "created_utc": 1734934981.0
        },
        {
            "author": "doingmyjobhere",
            "body": ">as ne takim nuk e ka pranu Kurtin\n\nNese nuk te kujtohet me 1 Google search e sheh qe i ka pase disa takime me Macron ne Paris.",
            "score": 3,
            "created_utc": 1734906136.0
        },
        {
            "author": "Gertice",
            "body": "I nderum, sdi a e ke lexu source qe e kom qu, ama ne 2018 komisioni evropian ka marr vendim edhe kan than qe jen permbush kushtet (ku perfshihet edhe korrupsioni). Ne 2018 Dimitris Avramopoulos ,qe eshte komisioneri evropian per migrim, ka thene “Kosovo has demonstrated full commitment in fighting corruption and organised crime,” edhe vet e ka rekomandu komisionit me i heq vizat. Punen e korrupsionit France edhe Holanda e ka perdor vetem per me bo stall procesin. Pse Gjermania e tjert e kan mbeshtet heqjen e vizave edhe pse ka pas korrupsion? Gaslight skem nevoj me bo kur faktet i kem para syve",
            "score": 12,
            "created_utc": 1734900780.0
        },
        {
            "author": "dont_tread_on_M",
            "body": "Korrupsioni nuk ka qene kusht gjeneral, se ashtu nuk ka si e mat BE a ke be perparim a jo. Kane qene rastet e shenjuara prej BE kunder korrupsionit per me u zgjidh prej gjykatave. Edhe ato jane zgjidh prej gjykatave, e jo prej qeverise, para se me ardh Kurti ne pushtet.\n\nThjesht Franca e ka shty liberalizimin sepse Macron nuk i ka pas rrethanat e brendshme politike per me shty BE drejt zgjerimit. Nuk ka desht te merret me kete teme. Macron mendjen me u merre me Evrope Lindore ja ka ndryshu vetem lufta ne Ukraine. Kurtin ai as nuk e ka pranu ne takim, per dallim prej Vucicit\n\nMos i thuaj tjereve qe po genjejne, kur ata po te japin link me deklarate te BE. A ke ti link qe BE ka thene se per shkak te korrupsionit nuk po i liberalizojne vizat?",
            "score": -2,
            "created_utc": 1734900950.0
        },
        {
            "author": "aquilae42",
            "body": "Nuk e di a e percjell politiken ne Europe po kurr ma keq se prej pas pandemise 2021 e tutje nuk ka qene (sa i perket euroskepticizmit edhe partive te ekstremit te djatht).\n\nNe 2018 partia e pare ne France u kon Ensemble (e Makronit) ne 2023-2024 RN (ekstremi i djatht)\n\nNe Gjermani 2018 CDU e dyta SPD 2023-2024 (CDU e para AfD e dyta).\n\n2017-2018 ne Holande VVD (center-right) u kon e para, 2023 sakt ka fitu PVV (ekstrem i djatht)\n\nAustri ne 2018 OVP u kon e para 2023-2024 ka fitu FPO (ekstremi i djatht)\n\nItali 2018 ka qene ne qeverisje center right ne 2022 ka fotu Meloni (far right)\n\nTe vetmet vende ku ska ps rritje ekstremi i djatht gjate ktyne viteve qe i permende ti osht Polonia edhe Danimarka. Tu u bazu nkrejt kta shembuj qe ti permena po besoj qe ka pas tbej me perceptimin e korrupsionit e jo zvoglimi i skepticizmit te zgjerimit te BE ne 2023 (i cili veq shkon tu rrit)",
            "score": 3,
            "created_utc": 1734909465.0
        },
        {
            "author": "Zhidezoe",
            "body": "Po na vyn edhe numra jo veq kualitet kur vjet pune te shtetet, se shume i perafert o numri i shteteve q ena njohin edhe atynve qe sna njohin, pos Afrikes edhe Amerika e Jugut e ka veq 1 a 2 shtete qe na njohin, mendoj qe ja kish vlejte me tentu me kriju mardhenie me do shtete atje",
            "score": 3,
            "created_utc": 1734898890.0
        },
        {
            "author": "Gertice",
            "body": "Qysh po shkon situata, Siria edhe Armenia munden me na njoft mbrenda 5 viteve te ardhshme. Ukraina gjithashtu eshte mundesi, por varet nga rezultati i luftes.",
            "score": 2,
            "created_utc": 1734898896.0
        },
        {
            "author": "MataneMaleve",
            "body": "Me udhetu pa vize ku? \n\nBro, keto vendet e reja nga Asia, etj po shtohen vetem si pasoj e liberalizimit me BE. Kurti nuk ka asnje merit ketu!",
            "score": 5,
            "created_utc": 1734903523.0
        },
        {
            "author": "kosovo-ModTeam",
            "body": "This post has been removed as it appears to be low effort or does not contribute to meaningful discussion on the subreddit. Please put more effort into your post or consider posting in a more appropriate subreddit",
            "score": 1,
            "created_utc": 1734905980.0
        },
        {
            "author": "KiliMilii",
            "body": "Ikem me kismet!",
            "score": 1,
            "created_utc": 1734901020.0
        },
        {
            "author": "dont_tread_on_M",
            "body": "Asnje takim nje me nje nuk e ka pas. Vetem ne trueza ku eshte taku me disa lidere pernjehere e ka taku. Vucic ka pas pritje te organizuar prej Macron",
            "score": 0,
            "created_utc": 1734906826.0
        },
        {
            "author": "dont_tread_on_M",
            "body": "M'fal po ky link nuk eshte i besueshem.\n\nBurime e vetme te sakta jane:  \n\\- Vudi  \n\\- Xhymshiti  \n\\- Deklaratat e Kurtit\n\nSi militant i VV, une nuk pranoj ta lexoj ose ta marr ne konsiderate nje link qe nuk eshte i besueshem /j",
            "score": 10,
            "created_utc": 1734901597.0
        },
        {
            "author": "ClassyMF18",
            "body": "Jo bre dost ti je tu ma fy inteligjencen 700% un pot kuptoj ku po don me dal po kjo qe ti e thu ska pik logjike e aq ma pak sens, tash a e ka stall franca e holanda per ato shkaqe qe pi permend ti ajo osht komplet supozim i yti, franca e holanda jon nder vendet qe ka mapak shqiptar prej shqiptarve qe jeojn jasht edhe pse prap ka sadush. Franca e holanda osht full arab e ti pom thu mu qe kokan “tut” prej 1.6 milion banorve tkosoves a ? Npresupozimin pat madh edhe ma jo realist 200.000 kan mi ik kosoves e me u shpernda nBE, e ti po thu qe 10 k prej ktyne me shku nfranc paskan mjau dhi shtetin a ? \nMo dosti jem lej prrallat me mbret.\nBE ja osht BE ni shtet mos me u pajtu ni pik aty nuk vendoset kurgjo, ndoshta franca e holanda pernime kan mendu qe ka korrupsion, nuk e ka gjithmon drejten shumica tpakten jo nket rast.",
            "score": -3,
            "created_utc": 1734901263.0
        },
        {
            "author": "ClassyMF18",
            "body": "Per qesi sene e kom shum kujtesen e mir Elhamduilah, e mbaj mend vite para liberalizimit korrupsioni qdo dit e nat ntv ka qen si kush kryesor, sot nuk e mbaj mend kush prej BE ka dal ntv me thon kto po ta tregoj me siguri tmadhe qe sigurt i kom pa me dhjetra eurodeputet tu e permend si kusht. E ti me ket dostin vendosni cili u kan problemi pse macroni ska dasht mu marr me neve a qe si ka pas punt mir nshtet a qe ska dasht shum shqiptar. \nKy debat osht i shkum perlesh nmomentin qe ju mkallxoni prralla pse qysh si, e kur osht ni qesi kushti qe so as kushti qysh po thu ti spo u merrka parasysh po prrallat.",
            "score": 2,
            "created_utc": 1734901619.0
        },
        {
            "author": "aquilae42",
            "body": "Burimet:\n\nFranca:\n\n2017: https://en.m.wikipedia.org/wiki/2017_French_legislative_election\n\n2024: https://en.m.wikipedia.org/wiki/2024_French_legislative_election\n\nGjermania:\n\n2017: https://en.m.wikipedia.org/wiki/2017_German_federal_election\n\n2025 (opinions polls): https://en.m.wikipedia.org/wiki/2017_German_federal_election\n\nHolanda:\n\n2017: https://en.m.wikipedia.org/wiki/2017_Dutch_general_election\n\n2023: https://en.m.wikipedia.org/wiki/2023_Dutch_general_election\n\nAustria:\n\n2017: https://en.m.wikipedia.org/wiki/2017_Austrian_legislative_election\n\n2024: https://en.m.wikipedia.org/wiki/2024_Austrian_legislative_election\n\nItalia:\n\n2018: https://en.m.wikipedia.org/wiki/2018_Italian_general_election\n\n2022: https://en.m.wikipedia.org/wiki/2022_Italian_general_election",
            "score": 2,
            "created_utc": 1734910208.0
        },
        {
            "author": "dont_tread_on_M",
            "body": "Po e percjelli. Ne 2023 pak debati u fokusu ne luftim te Rusise dhe ne krize energjetike. Kete momentum e ka shfrytezu politika e jashtme e BE.\n\nPerndryshe migracioni e di qe kulmin ne diskurs politik e ka mberri se fundmi. Tash prap ka fillu me ra pak, por shume besoj qe nese nuk na ish aprovu liberaliziminatehere, tash shanca nuk kish pas me na u aprovu, edhe nese shteti me i pakorriptuar ne bote jemi",
            "score": 0,
            "created_utc": 1734910034.0
        },
        {
            "author": "Zhidezoe",
            "body": "Kom pas shpresa qe Greqia ka me na njoft me Kurtin pasi nfillim te mandatit nonstop ka pas takimem me njerz te qeveris greke, ama po ma merr mendja qe e kane ndrru qeverin edhe ata",
            "score": 2,
            "created_utc": 1734932412.0
        },
        {
            "author": "doingmyjobhere",
            "body": "https://youtu.be/kouCOEVaVDg",
            "score": 1,
            "created_utc": 1734908202.0
        },
        {
            "author": "ClassyMF18",
            "body": "Pse duhet me besu makaroni qka ka thon greku i komisionit europian? Pse mos me vendos aj perveti si vend amtar qe osht nBE, nese nuk je tu jetu naj realitet tjeter perdit mundesh me pa qe shumicen e kohes shtet e Be nuk bin dakord me njoni tjetrin per shum pika.",
            "score": 1,
            "created_utc": 1734901840.0
        },
        {
            "author": "HeizGuderian",
            "body": "Jo ti merr direkt nga haleja e Surrelit.",
            "score": 1,
            "created_utc": 1734904037.0
        },
        {
            "author": "dont_tread_on_M",
            "body": "Qysh e mat komisioni evropian korrupsionin per me konstatu se a e ka be progresin e mjaftueshem nje shtet?",
            "score": 1,
            "created_utc": 1734906962.0
        },
        {
            "author": "dont_tread_on_M",
            "body": "2021. A atehere e bindi per liberalizim a",
            "score": 0,
            "created_utc": 1734910243.0
        },
        {
            "author": "doingmyjobhere",
            "body": "Hahahahaha njeherr ishte problemi qe nuk ka pranu me u taku, mandej doli qe e ka taku po jo nje me nje, tani qenka viti problem?\n\nMe te mira",
            "score": 6,
            "created_utc": 1734910543.0
        }
    ]
}