{
    "post_title": "La population ne cesse de baisser à Paris année après année : pour l'Insee, il y a trois causes principale",
    "post_author": "chou-coco",
    "post_score": 113,
    "post_url": "https://actu.fr/ile-de-france/paris_75056/la-population-ne-cesse-de-baisser-a-paris-annee-apres-annee-pour-l-insee-il-y-a-trois-causes-principales_62036621.html",
    "comments": [
        {
            "author": "Spartl",
            "body": "TLDR : Le prix de l’immobilier, l’arrivée d’un enfant et la recherche d’un autre cadre de vie depuis le COVID. \nLa population de Paris diminue mais celle des départements limitrophes augmentent.",
            "score": 214,
            "created_utc": 1734868992.0
        },
        {
            "author": "turlututou",
            "body": "Y’a quand même un truc que je capte pas. On dit que la population « quitte » Paris mais les logements restent saturés ? Y’a qu’à voir les files d’attentes pour un studio/2 pièces toujours aussi longues, donc la demande reste à peu près la meme.\n\nSoit il y a une part plus importante de logements vacants ou airbnb, soit l’exil des parisiens concernent des retraités / très riches qui pouvaient se permettre d’avoir des apparts gigantesques bien trop chers pour Le Parisien moyen.\n\nC’était mon analyse de comptoir PMU.",
            "score": 59,
            "created_utc": 1734869762.0
        },
        {
            "author": "nicol9",
            "body": "les riches sont de plus en plus riches et les gens normaux n’ont plus les moyens de vivre en ville",
            "score": 71,
            "created_utc": 1734868906.0
        },
        {
            "author": "ThierryParis",
            "body": "\"L’association « villes et villages où il fait bon vivre » classe la capitale 103e sur 34 808 communes de France métropolitaine, la boutant ainsi du Top 100. \n\nAu 91e rang en 2023, la Ville lumière se place désormais derrière Cergy (99e), Poissy (100e), Troyes (101e) et Sartrouville (102e), notamment. \"\n\nCertes, Paris n'a pas l'aura de Cergy ou Sartrouville, mais 103 sur 34 000, ce n'est pas si mal.",
            "score": 25,
            "created_utc": 1734869162.0
        },
        {
            "author": "EiffelPower76",
            "body": "Bon ben tant mieux si la population parisienne baisse, on va pas s'en plaindre vu la densite de cette ville\n\nEnsuite, est-ce qu'elle baisse vraiment si on compte tous les touristes ?\n\nEt puis c'est logique que la population Paris Intra-Muros baisse si la population de la proche banlieue augmente, du coup la population de la megalopole ile de france continue a augmenter",
            "score": 6,
            "created_utc": 1734901100.0
        },
        {
            "author": "ClarkSebat",
            "body": "Ces provinciaux qui retournent chez eux… Remettez-nous les murs autour de la ville que l'on taxe ces migrants qui exploitent la ville sans l'aimer.",
            "score": 19,
            "created_utc": 1734868645.0
        },
        {
            "author": "kqih",
            "body": "Sans blague ?",
            "score": 2,
            "created_utc": 1734877151.0
        },
        {
            "author": "LeRaminagrobis",
            "body": "En tant que parisien heureux d'être à Paris qui compte bien y rester, je sais pas comment me positionner là dessus.\n\nD'un côté si moins de gens on peut imaginer que l'immobilier baisse et que les transports soient moins remplis, une ville avec moins d'habitants c'est plus confortable. Mais ça signifie aussi moins de recettes fiscales pour la ville ce qui est embêtant et nuira à la qualité des services...",
            "score": 2,
            "created_utc": 1734887193.0
        },
        {
            "author": "RubberDuck404",
            "body": "Mais au moins les touristes sont bien au chaud, est-ce que c'est pas ça le plus important au fond ?",
            "score": 2,
            "created_utc": 1734891522.0
        },
        {
            "author": "Horrih",
            "body": "N'importe quoi comme analyse. Si la population chutait du fait d'un desamour les prix baisseraient sensiblement, ce n'est pas le cas. \n\nCela ne laisse que 2 explications :\n- le nombre de personnes par logement baisse (moins de familles, plus de célibataires) \n- le nombre de logements disponibles baisse : air bnb ou investissements immobiliers spéculatifs (sans locataire)",
            "score": 2,
            "created_utc": 1734899088.0
        },
        {
            "author": "carkin",
            "body": "Une bonne chose. C'est pet être le moment de faire la décentralisation, la vraie, celle des jobs.",
            "score": 2,
            "created_utc": 1734904106.0
        },
        {
            "author": "draum_bok",
            "body": "Les trois causes:  \n  \n1) attaques des pigeons vampires\n\n2) prix d'appart qui dépasse 50,000€ par metre carré\n\n3) pas assez de vin chaud ni marrons grillés l'hiver",
            "score": 2,
            "created_utc": 1734929363.0
        },
        {
            "author": "Dildo_Fagginns",
            "body": "Ya pas trois causes, c'est juste l'oseille \n\nA prix similaire personne s'infligerait d'aller s'exfiltrer a 1h30 du centre en transport 2x/jours",
            "score": 2,
            "created_utc": 1734874259.0
        },
        {
            "author": "Juract",
            "body": "Paris suit le chemin de toutes les grandes villes mondialisées : un entre soi de gens très riches. On ne parle même plus de classe moyenne supérieure quand il faut débourser 500 K € pour 50 m², c'est à dire un appartement à peine familial. Des très riches et des touristes. \n\nEn visite à Lyon en ce moment, je me suis rendu compte de la bulle speculative parisienne. J'ai trouvé des endroits, des bars et des restos au rapport qualité/prix impensable. Certes Lyon a une tradition gastronomique,  et c'est proche de l'Italie. \n\nMais n'empêche que je n'ai jamais senti à quel point je payais surtout le loyer chaque fois que j'allais manger au resto ou boire un coup à Paris.\n\nOn voit fleurir des endroits neufs, richement décorés, atypiques et hors de prix.",
            "score": 3,
            "created_utc": 1734872427.0
        },
        {
            "author": "Automatic_Singer_475",
            "body": "Quoi, à 1500 boule le T2 de 40m² rempli de cafard, les gens vont voir ailleurs ?\n\n  \nNAN ?",
            "score": 2,
            "created_utc": 1734889605.0
        },
        {
            "author": "maelblackout",
            "body": "L’avenir de Paris c’est les HLM et les ultra-riches ça fait rêver ! En attendant nos banlieues se tapent petit à petit la gentrification et tout les problèmes qui vont avec, les loyers dans ma ville sont quasiment au niveau de ceux de paris maintenant et bien supérieurs pour d’autres banlieues plus proches de la capitale…",
            "score": 1,
            "created_utc": 1734907787.0
        },
        {
            "author": "quentinvespero",
            "body": "je me demande si la qualité des logements ne peut pas être une raison aussi 🤷🏻‍♂️\n\nà Paris intramuros la grande majorité des biens immobiliers sont quand même vraiment vieux.. \n\nEn tout cas pour ma part, cherchant un appartement moderne, c'est une des raisons qui me pousse à chercher aussi en banlieue",
            "score": 1,
            "created_utc": 1734924622.0
        },
        {
            "author": "MadMass23",
            "body": "Il faut décentraliser les jobs et mieux réglementer l'accès immobilier vis-à-vis des investisseurs et des étrangers fortunés.\n\nSans oublier les salaires et les loyers...",
            "score": 1,
            "created_utc": 1734949111.0
        },
        {
            "author": "_Argol_",
            "body": "Laissez moi deviner : c’est sale, pas secu, et ça coûte un bras.",
            "score": -35,
            "created_utc": 1734868159.0
        },
        {
            "author": "averech",
            "body": "Ville \" froide\" , grise , faussement bienveillante, impersonnelle",
            "score": -3,
            "created_utc": 1734886223.0
        },
        {
            "author": "Erythromycine",
            "body": "50% d'HLM a Paris",
            "score": -8,
            "created_utc": 1734874071.0
        },
        {
            "author": "NoPsychology9771",
            "body": "Traduction : le prix de l'immobilier, le prix de l'immobilier et le prix de l'immobilier",
            "score": 146,
            "created_utc": 1734883666.0
        },
        {
            "author": "Meshuggah333",
            "body": "Je peu confirmer les raisons dans mon cas, lol",
            "score": 6,
            "created_utc": 1734895588.0
        },
        {
            "author": "Sea-Management-783",
            "body": "interessant a voir comment sa se developpera dans le futur et influencer les prix des logements",
            "score": 1,
            "created_utc": 1734916455.0
        },
        {
            "author": "Cold_War_II",
            "body": "Merci la gauche d'avoir transformé cette ville en RBNB.\n\nC'est pas rentable de louer dans cette ville. Tu tombes sur un crevards qui veut pas payer son loyer, tu prends le risque d'avoir des sommes énormes d'impayés car tu peux pas le virer. Avec Rbnb, tu n'as plus ce problème.\n\nEdit; Pour ceux qui sont un peu illettré, je parle de LA GAUCHE. LA GAUCHE POLITIQUE. Pas de la mairie. Merci d'apprendre à lire et faire la différence.",
            "score": -171,
            "created_utc": 1734874919.0
        },
        {
            "author": "Poopadour",
            "body": "Soit les files d'attente devant les logements ont juste diminué de quelques personnes. C'est pas non plus l'effondrement démographique.",
            "score": 49,
            "created_utc": 1734869943.0
        },
        {
            "author": "Vrulth",
            "body": "Les *familles* quittent Paris. Les couples sans enfants et les jeunes celib' y trouvent encore leur compte.\nDu coup les logements dimensionnés pour les personnes seules ou en couple continuent à être demandés.",
            "score": 47,
            "created_utc": 1734874583.0
        },
        {
            "author": "Capestian",
            "body": ">Soit il y a une part plus importante de logements vacants ou airbnb,\n\nDéjà oui, c'est le cas\n\nIl y a aussi 200 000 logements vide",
            "score": 47,
            "created_utc": 1734870056.0
        },
        {
            "author": "kpthvnt",
            "body": "Il a beaucoup de logements inoccupés en effet, un peu par air bnb mais beaucoup plus par des résidences secondaires et des purs produits spéculatifs. Par exemple une part non négligeable de ceux qui \"quittent Paris\" gardent un \"pied à terre\" quand ils vont s'installer en province pour le boulot, les études de leurs enfants, etc.",
            "score": 23,
            "created_utc": 1734871669.0
        },
        {
            "author": "GauthierPlus",
            "body": "Il y a aussi un problème de turnover sur la location, depuis la hausse des taux intérêts et la conjecture économique globale, moins de personnes achètent et davantage de personnes restent locataires. Ce qui inévitablement réduit l’offre de logements sur le marché de la location.",
            "score": 11,
            "created_utc": 1734870123.0
        },
        {
            "author": "Garsbriel",
            "body": "Les locations saisonnières sont une plaie et ne cessent d'occuper une part de plus en plus importante du parc locatif parisien...\n\nAirBNB se taille la part du lion partout où affluent les touristes.",
            "score": 9,
            "created_utc": 1734877049.0
        },
        {
            "author": "rosecoloredcat",
            "body": "Effectivenent, un logement sur cinq est inoccupé à Paris, soit presque 300 000 logements, ce qui contribue largement à la pénurie.",
            "score": 14,
            "created_utc": 1734870175.0
        },
        {
            "author": "Intrepid_Walk_5150",
            "body": "Une famille qui part en banlieue, c'est 3 ou 4 habitants de moins. Un jeune cadre qui arrive, c'est un de plus. Donc au net, c'est une diminution de la population, mais la pression sur les studios ne diminue pas.",
            "score": 4,
            "created_utc": 1734884121.0
        },
        {
            "author": "Odd_Snow_8179",
            "body": "C'est pas du tout une analyse de comptoir PMU. À l'achat comme à la location c'est la ville la plus chère de France. Et à la location, il suffit de laisser une heure ton annonce en ligne pour avoir 100 candidats malgré les prix. \n\nLes deux seules raisons pour lesquelles Paris perd en population c'est: \n- la hausse de la vie en solo \n- la hausse des résidences inhabitées (secondaires, à  location de tourisme voir purement et simplement vides à l'année).",
            "score": 4,
            "created_utc": 1734873421.0
        },
        {
            "author": "trollspirit",
            "body": "Quelques chiffres qui donnent un peu de perspective. \n\nAttention, pour l’INSEE, un logement dit inoccupé = ce n’est pas une résidence principale. Grosse différence avec inoccupé = on peut y loger qqn.\n\nJe comprends qu’une grande part des logements inoccupés sont en “vacance frictionnelle” c’est à dire entre deux habitants. Seuls 1,4% des 260 000 logement sont vides depuis plus de 2 ans.",
            "score": 2,
            "created_utc": 1734879768.0
        },
        {
            "author": "rapsca2",
            "body": "C'est un article écrit par la ville de Paris donc chacun est libre de le croire ou non, mais il semble qu'il s'agisse d'abord d'une belle augmentation du nombre de logements vacants : https://www.paris.fr/pages/le-boom-des-logements-vacants-accroit-la-baisse-de-la-population-a-paris-29748.\n\nÇa ne risque donc pas de désaturer la demande. À mon humble avis, s'il y avait (avec beaucoup d'imagination) soudainement un million de logements supplémentaires disponibles, ils trouveraient tous des occupants sans le moindre soucis contrairement à ce que certains pensent ici (que c'est par désamour).",
            "score": 2,
            "created_utc": 1734888112.0
        },
        {
            "author": "Capital_Adeptness856",
            "body": "Paris est la ville avec le plus de AIRBNB au monde …",
            "score": 2,
            "created_utc": 1734897069.0
        },
        {
            "author": "elmojorisin",
            "body": "Y'a des logements vides et qui veut investir à paris pour mettre en loc ? Tu paies 400k un appart pour le louer 1100€/mois, la rentabilité est nulle à chier",
            "score": 5,
            "created_utc": 1734872540.0
        },
        {
            "author": "fdesouche",
            "body": "C’est basiquement le phénomène de «de cohabitation ». La diminution progressive du nombre de personnes par foyer, qui entraîne mécaniquement une hausse du nombre de foyer et  donc de la demande de logements. Un couple marié sans enfants : 1 t1 , 1 cuisine 1 salle de bains. Le même couple qui divorce; 2 logements, 2 cuisines, 2 sdb. Mais la population est restée la même.",
            "score": 1,
            "created_utc": 1734905371.0
        },
        {
            "author": "MegaMB",
            "body": "Alors, je sais que c'est populaire, et relativement vrai quand on parle des ultra-centres-villes et éventuellement de la région parisienne.\n\nMaintenant, sur la plupart des métropoles du pays, c'est plus facile de vivre sur un smic en ville sans voiture que de vivre sur un smic avec une bagnole dans la banlieue éloignée. Lyon, Strasbourg, Lille, Nantes et de nombreuses villes plus petites sont vachement plus abordables que leurs banlieues en pratique.",
            "score": 21,
            "created_utc": 1734873965.0
        },
        {
            "author": "roguy_19",
            "body": "Qui veut vivre à Cergy sérieusement",
            "score": 36,
            "created_utc": 1734871121.0
        },
        {
            "author": "NuclearDawa",
            "body": "Punaise Sartrouville devant Paris, c'est vraiment du flan leur classement (j'habite Sartrouville, le point en sa faveur c'est le prix de l'immobilier)",
            "score": 6,
            "created_utc": 1734874903.0
        },
        {
            "author": "LelouchViMajesti",
            "body": "On ne reste pas car on ne peut pas financièrement, si tu n’as pas le patrimoine d’un parisien né, c’est impossible de s’établir pour de bon malgré l’amour qu’on peut porter a la ville :(",
            "score": 6,
            "created_utc": 1734871227.0
        },
        {
            "author": "The_Glitter_man",
            "body": "T'as vu la gueule du trou à rats aussi? Quand c'est pas inondé de poubelles, c'est les crottes de chien qui reprennent du terrain. Sans parler de la population, détesté par tous en France comme ailleurs.\n\nSi cette ville n'était pas obligatoire pour certains poste, elle serait sûrement supplanté par d'autres.",
            "score": 1,
            "created_utc": 1734944833.0
        },
        {
            "author": "yet_another_no_name",
            "body": ">Paris suit le chemin de toutes les grandes villes mondialisées : un entre soi de gens très riches. On ne parle même plus de classe moyenne supérieure quand il faut débourser 500 K € pour 50 m², c'est à dire un appartement à peine familial. Des très riches et des touristes. \n\nOu alors à l'opposé pauvre et chanceux ou connecté, avec un logement social. La classe moyenne par contre, clairement, n'a plus les moyens.",
            "score": 0,
            "created_utc": 1734875620.0
        },
        {
            "author": "GlimmerChord",
            "body": "Guess again, champ",
            "score": 18,
            "created_utc": 1734868371.0
        },
        {
            "author": "Garsbriel",
            "body": "Réponse de Qwant+\n\n> Proportion de logements HLM à Paris\n\n> Au 1er janvier 2021, 236 748 logements locatifs sociaux étaient recensés à Paris, représentant 20,8 % des résidences principales. En intégrant les logements financés non livrés, le taux de logements sociaux a atteint 24,2 % en 2021.\n\n> Ainsi, la proportion de logements HLM à Paris est de :\n\n>    20,8 % (au 1er janvier 2021)\n\n>    24,2 % (en tenant compte des logements en cours de construction ou en travaux)\n\n> Ces chiffres montrent une volonté d'atteindre l'objectif de 25 % de logements sociaux parmi les résidences principales d'ici 2025, conformément à la loi SRU.\n\nhttps://www.adil75.org/observatoire-du-logement/les-chiffres-cles-du-logement-a-paris/\n\nSans compter le délai d'attente pour obtenir un logement HLM.\n\n> Temps d'attente moyen pour un logement HLM à Paris\n\n> Le temps d'attente moyen pour obtenir un logement HLM à Paris est de 6 à 10 ans. Cette durée peut varier considérablement en fonction de plusieurs facteurs, notamment le type de logement demandé et la situation personnelle du demandeur.\n\n> Il est important de noter que la pénurie de logements sociaux dans la région parisienne contribue à ces délais d'attente particulièrement longs.",
            "score": 10,
            "created_utc": 1734876664.0
        },
        {
            "author": "Ythio",
            "body": "Lol. Tu veux juste maximiser ton blé, donc tu proposes 80€ la nuit au lieu de 900€ par mois. C'est aussi simple.\n\nLa recherche du profit et la propriété privée. Saloperie d'idees de gauche heh\n\n\nEdit : yo wtf Reddit. C'était une réponse à un commentaire qui a eu 160 downvotes ensuite.",
            "score": 49,
            "created_utc": 1734885800.0
        },
        {
            "author": "Misdow",
            "body": "Mais... ? Paris a des lois différentes du reste de la France en ce qui concerne l'expulsion des mauvais payeurs ?",
            "score": 18,
            "created_utc": 1734884198.0
        },
        {
            "author": "tiph12",
            "body": "Ouin ouin. La mairie a aussi fait beaucoup de boulot pour limiter les locations « saisonnières », et la hausse de l'immobilier est un phénomène qui se voit ces dernières années dans énormément de grandes villes indépendamment de l'orientation politique de la mairie, c'est un phénomène qui échappe en partie à la mairie.\n\nPar contre, les parisien·nes déclarent une qualité de vie de plus en plus satisfaisante.",
            "score": 49,
            "created_utc": 1734877101.0
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "created_utc": 1734944546.0
        },
        {
            "author": "turlututou",
            "body": "Même si la file d’attente est un peu moins longue, au final le logement sera occupé, je ne pense pas que l’offre ait autant baissé",
            "score": 12,
            "created_utc": 1734870949.0
        },
        {
            "author": "yet_another_no_name",
            "body": "Il y a aussi l'effet de tous les logements qui n'ont plus le droit d'être loués, travaux en cours pour améliorer le DPE ou non. Forcément, ça enlève de l'offre.",
            "score": 7,
            "created_utc": 1734874877.0
        },
        {
            "author": "EiffelPower76",
            "body": "Bon gateau\n\nDu coup, si les appartements sont occupes par des touristes, c'est aussi une population legitime, puisqu'elle apporte de l'argent a la ville",
            "score": 1,
            "created_utc": 1734901245.0
        },
        {
            "author": "potatoz11",
            "body": "C'est toujours mieux que 0€/mois donc c'est pas très logique comme explication.",
            "score": 3,
            "created_utc": 1734874627.0
        },
        {
            "author": "Unlikely_Ad5079",
            "body": "Intéressante réflexion.\n\nMais pas sûr parce qu’avec une automobile tu as plus d’opportunités de boulots.\n\nEt le loyer est quand même bien moins élevé dans les\nBleds pomes qu’en métropole, idem pour les charges (nourritures etc.)\n\nÇa se calcule",
            "score": 5,
            "created_utc": 1734874884.0
        },
        {
            "author": "Consul_Firmin",
            "body": "Je vois ce que tu veux dire mais tu oublies le fait qu'avec un SMIC les proprios regardent même pas ton dossier",
            "score": 2,
            "created_utc": 1734874891.0
        },
        {
            "author": "Dazzling_Location_11",
            "body": "Moi.\nJ'y suis très heureuse. Merci.",
            "score": 4,
            "created_utc": 1734885972.0
        },
        {
            "author": "International-Bet384",
            "body": "J’habite Pontoise, et entre les étangs, le port, les 3 fontaines et l’UGC je n’ai aucune raison d’aller sur Paris. Sauf pour les concerts à la limite. T’es à deux pas du 27 donc de quoi déconnecter en paix",
            "score": 4,
            "created_utc": 1734874159.0
        },
        {
            "author": "rapsca2",
            "body": "J'ai passé toute mon enfance dans le 78 sur le A et je peux confirmer que ça me paraît très surprenant que Paris soit moins bien classé que Sartrouville. Ou même Poissy d'ailleurs, même si c'est un poil mieux que Sartrouville (si on est assez riche pour habiter la partie bords de Seine).",
            "score": 2,
            "created_utc": 1734887400.0
        },
        {
            "author": "ClarkSebat",
            "body": "RSA ici.",
            "score": 2,
            "created_utc": 1734884580.0
        },
        {
            "author": "ClarkSebat",
            "body": "Bah change de poste. Preuve que ce n’est que de l’exploitation",
            "score": 1,
            "created_utc": 1734948421.0
        },
        {
            "author": "Garsbriel",
            "body": "Ouais...\n\nEssaye de te loger en HLM à Paris pour très vite changer d'avis. \n\nVoir mon commentaire :\n\nhttps://www.reddit.com/r/paris/s/sTEj0xzaEt\n\nPS : il faut avoir le bras long pour loger dans un appartement de la ville ou un HLM.",
            "score": 1,
            "created_utc": 1734876818.0
        },
        {
            "author": "turbines_chauffantes",
            "body": "Tu as lu l’article ? Ce qu’il dit fait littéralement partie des raisons évoquées directement ou indirectement.",
            "score": -6,
            "created_utc": 1734869003.0
        },
        {
            "author": "_IBlameYourMother_",
            "body": "Cherches pas, il pense que le RN est centré gauche, y'a rien a en tirer :)",
            "score": 2,
            "created_utc": 1734897575.0
        },
        {
            "author": "Cold_War_II",
            "body": "Le manque à gagner pour l'absence de paiement d'un appartement est relatif au cout de son loyer. Perdre un loyer à meudon de 800€/mois c'est pas la même chose que perdre un loyer à paris à 3500€/mois.\n\nLe rapport risque est énorme, surtout quand tu peux te servir de ton appartement à Paris pour le mettre en RBNB pour 8000€/mois sans risque, chose que tu peux pas faire avec ton appart à meudon.\n\nDans une France où tu peux virer un mauvais payeur immédiatement, tu n'aurais pas ces problèmes.",
            "score": -6,
            "created_utc": 1734906920.0
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": -1,
            "created_utc": 1734880763.0
        },
        {
            "author": "paris-ModTeam",
            "body": "🇫🇷 Votre commentaire a été modéré. Merci de garder les discussions le plus cordial possible. r/Paris est un lieu d'entraide et de discussions saines et non d'échanges interposés stériles.\n\n🇬🇧 Your comment has been removed. Please keep the discussion friendly. r/Paris is a place of gathering and helping each other while puerile exchanges are prescribed.\n\n\n\n----------------\n\n^If ^you ^wish ^the ^contact ^the ^moderators, ^you ^can ^do ^so ^via ^[modmail](https://www.reddit.com/message/compose?to=%2Fr%2Fparis).",
            "score": 1,
            "created_utc": 1734945405.0
        },
        {
            "author": "elmojorisin",
            "body": "Ben c'est juste pas rentable. Emprunter 400k ca te coutera pas moins de 1800-2000€/mois, la location te rapportera 1100 - (charges + foncier + agence + travaux), comment te dire que celui qui achète à Paris s'il ne fait pas une pluvalue colossale est en total déficit sur son activité de location. Ou bien les logements baissent de moitié, ou bien il faut louer 2 à 3 fois le prix actuel pour que ce soit un minima intéressant, voir seulement neutre... les prix des biens et des locations sont tellement décorrélés",
            "score": 1,
            "created_utc": 1734874757.0
        },
        {
            "author": "yet_another_no_name",
            "body": "Oui et non. Si t'as usage de l'appartement en pied à terre pour toi ou ta famille, ça peut être mieux de ne pas Le louer et l'utiliser comme ça, plutôt que le louer (via une agence qui prendra toute la rentabilité mais pas toutes les emmerdes, évidemment) et devoir gérer tous les problèmes, dont les locataires qui arrêtent de payer et/ou dégradent fortement le logement.",
            "score": 1,
            "created_utc": 1734875039.0
        },
        {
            "author": "MegaMB",
            "body": "Ouais. Mais dans un pays où le coût médian d'une bagnole est de 600e/mois (achat+garage+essance+assurance+parking etc...), bah si tu te débarasse de ta bagnole et transfère 300e/mois vers ton loyer/abonnement transport en communs, t'auras tendance à être sacrément gagnant en général. \n\nSurtout que quand tu vis pas en bled pommé, tu termines généralement par avoir une quantité importante d'avantages et de servuces publics comme privés qui te font faire tout un tas d'économies. Et sur des charges comme la nourriture, je suis très moyennement d'accord. En particulier à l'ère des too good to go ou des Lidl en ville.",
            "score": 5,
            "created_utc": 1734875474.0
        },
        {
            "author": "MegaMB",
            "body": "Ouais mais ça c'est le cas partout, urbain ou péri-urbain.",
            "score": 2,
            "created_utc": 1734875520.0
        },
        {
            "author": "roguy_19",
            "body": "Faut vraiment détester marcher.",
            "score": -1,
            "created_utc": 1734886488.0
        },
        {
            "author": "Sheikmat",
            "body": "Alors oui mais Cergy dans les immeubles ça n’a rien à voir à Pontoise proche des étangs.",
            "score": 4,
            "created_utc": 1734875123.0
        },
        {
            "author": "roguy_19",
            "body": "Pontoise ca n’a rien a voir. Cergy c’est hideux, c’est une ville conçue pour les bagnoles et faire du shopping.",
            "score": 6,
            "created_utc": 1734877061.0
        },
        {
            "author": "LelouchViMajesti",
            "body": "Tu fais comment pour vivre a Paris si c’est pas trop perso à partager ? Parce que de memoire le RSA ne doit même ps suffire a payer un 10m2 alors les courses et la vie à côté.",
            "score": 1,
            "created_utc": 1734887099.0
        },
        {
            "author": "The_Glitter_man",
            "body": "C'est pas une question de poste. Si tu travailles dans des hauts postes, soit tu bosses à paris, sois tu bosses dois déménager dans un autre pays. Ta solution c'est quoi? Changer de métier ? Changer de pays? Super.",
            "score": 1,
            "created_utc": 1734949715.0
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 17,
            "created_utc": 1734869411.0
        },
        {
            "author": "The_Glitter_man",
            "body": "Bien sûr que non il l'a pas lu. On est sur Reddit hein.\n\nÇa upvotes les mecs à côté de la plaque.",
            "score": 1,
            "created_utc": 1734944891.0
        },
        {
            "author": "_Argol_",
            "body": "Et je n’ai même pas eu besoin de lire l’article",
            "score": -9,
            "created_utc": 1734869361.0
        },
        {
            "author": "Garsbriel",
            "body": "Sur quoi est-ce que tu te bases pour dire ça ?",
            "score": 1,
            "created_utc": 1734942193.0
        },
        {
            "author": "paris-ModTeam",
            "body": "🇫🇷 Votre commentaire a été modéré. Merci de garder les discussions le plus cordial possible. r/Paris est un lieu d'entraide et de discussions saines et non d'échanges interposés stériles.\n\n🇬🇧 Your comment has been removed. Please keep the discussion friendly. r/Paris is a place of gathering and helping each other while puerile exchanges are prescribed.\n\n\n\n----------------\n\n^If ^you ^wish ^the ^contact ^the ^moderators, ^you ^can ^do ^so ^via ^[modmail](https://www.reddit.com/message/compose?to=%2Fr%2Fparis).",
            "score": 2,
            "created_utc": 1734880862.0
        },
        {
            "author": "potatoz11",
            "body": "Les logements vides ont bien des propriétaires, non ? Pourquoi eux ne mettent pas en location, d'après tes propres calculs ?",
            "score": 2,
            "created_utc": 1734879250.0
        },
        {
            "author": "Pale-Photograph-8367",
            "body": "Si tu as besoin d'emprunter oui",
            "score": 1,
            "created_utc": 1734947548.0
        },
        {
            "author": "TacosDuVercors",
            "body": "Exactement, d'où l'intérêt de faire monter en flèche les cotisations sur les résidences secondaires pour inciter / forcer les gens à vendre ou louer leurs logements qui ne servent que de pied à terre !",
            "score": 3,
            "created_utc": 1734877367.0
        },
        {
            "author": "elmojorisin",
            "body": "400k pour un pied à terre et y aller tous les x temps, c'est pas à la portée de tous mais effectivement pas mal de parisiens peuvent se le permettre grâce aux fortunes engrangées en ayant acheté il y a 20/30 ans, ils ont triplé le prix des appartements en les revendant.\nÇa n'empêche que le marché locatif est plombé par le plafonnement des loyers et du coup à part des biens dont les parisiens ont pas usage et savent pas trop quoi en faire... ben pas grand monde va s'y intéresser",
            "score": 1,
            "created_utc": 1734877069.0
        },
        {
            "author": "potatoz11",
            "body": "Mais dans ce cas là c'est une résidence secondaire, pas un logement vacant, non ?\n\nC'est aussi assez difficile à imaginer que ce n'est pas plus rentable de louer son appartement et de prendre un hotel les quelques semaines à Paris où on y réside.",
            "score": 1,
            "created_utc": 1734879739.0
        },
        {
            "author": "Dazzling_Location_11",
            "body": "Prends les transports comme tout le monde lol",
            "score": 2,
            "created_utc": 1734886958.0
        },
        {
            "author": "ClarkSebat",
            "body": "HLM évidemment. Auparavant, il est vrai que c'était chaud mais pas insurmontable (15m2 à 720€ mais 320€ d'aide au logement). Mais en allant voir l'aide sociale parisienne et en suivant les recommandations et demandes, j'ai eu le logement social en mode largement accéléré.  \nPour l'alimentation, TooGoodToGo et poubelles. Il faut voir tout ce que les boulangeries jettent quotidiennement, il y a de quoi nourrir 10 à 15 personnes chaque soir. Pour le chauffage, prévoir les pulls et manteaux même dans le lit.",
            "score": 1,
            "created_utc": 1734890050.0
        },
        {
            "author": "chou-coco",
            "body": "Il y a d'autres grandes villes en France que Paris, non ?",
            "score": 1,
            "created_utc": 1734962755.0
        },
        {
            "author": "paris-ModTeam",
            "body": "🇫🇷 Votre commentaire a été modéré. Merci de garder les discussions le plus cordial possible. r/Paris est un lieu d'entraide et de discussions saines et non d'échanges interposés stériles.\n\n🇬🇧 Your comment has been removed. Please keep the discussion friendly. r/Paris is a place of gathering and helping each other while puerile exchanges are prescribed.\n\n\n\n----------------\n\n^If ^you ^wish ^the ^contact ^the ^moderators, ^you ^can ^do ^so ^via ^[modmail](https://www.reddit.com/message/compose?to=%2Fr%2Fparis).",
            "score": 1,
            "created_utc": 1734884792.0
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": -10,
            "created_utc": 1734870321.0
        },
        {
            "author": "RichardHenri",
            "body": "https://www.apur.org/sites/default/files/logements_inoccupes_paris.pdf?token=gawNyquE\n\nChapitre 2 : Les caractéristiques des logements inoccupés à Paris",
            "score": 1,
            "created_utc": 1734880198.0
        },
        {
            "author": "elmojorisin",
            "body": "Parce que c'est pas rentable et qu'ils doivent y passer de temps en temps. La contrainte locative n'est pas assez intéressante pour faire pencher la balance ?",
            "score": 1,
            "created_utc": 1734879373.0
        },
        {
            "author": "MrLyttleG",
            "body": "Heureusement que les loyers sont plafonnés sinon on serait tous à la rue ! Ce qui est pas normal c'est qu'il n'y ait pas de plafonnement à la revente, ce qui explique le x3 à la revente d'un appart acheté il y a à peine 20 ans !",
            "score": 1,
            "created_utc": 1734890056.0
        },
        {
            "author": "roguy_19",
            "body": "Vous avez des jambes servez vous en",
            "score": 0,
            "created_utc": 1734896020.0
        },
        {
            "author": "Kunstfr",
            "body": "Ok mais du coup ton cas n'est absolument pas représentatif d'un truc abordable par tous. Tout le monde n'a pas envie de faire les poubelles ou de vivre dans un 15m2. Et tout le monde ne peut pas se loger en HLM - notamment parce qu'il y a jamais de place.\n\nPar contre pour loger dans un T2, il faut gagner 4500€ par mois - ça c'est la réalité.",
            "score": 2,
            "created_utc": 1734936142.0
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 13,
            "created_utc": 1734870502.0
        },
        {
            "author": "potatoz11",
            "body": "Tu peux m'expliquer un peu plus où tu veux en venir ? Le rapport de l'APUR m'a l'air très intéressant, avec des causes possibles crédibles. Mais aucune ne m'a l'air de dire \"c'est pas rentable\" de mettre un bien à 400k en location.",
            "score": 3,
            "created_utc": 1734884498.0
        },
        {
            "author": "elmojorisin",
            "body": "Non, si c'était pas plafonné la location ne fonctionnerait pas et la demande en achats immo impossible à satisfaire, ça s'équilibrerait",
            "score": 1,
            "created_utc": 1734895382.0
        },
        {
            "author": "Dazzling_Location_11",
            "body": "Ya de l'oxygène qui se perd",
            "score": 1,
            "created_utc": 1734897210.0
        },
        {
            "author": "ClarkSebat",
            "body": "Ah mais c'est qu'on  veut du luxe, évidemment. Il faut dire que T2 c'est du luxe au sens même des administrations. [https://teleservices.paris.fr/cotation/les-criteres.html](https://teleservices.paris.fr/cotation/les-criteres.html)\n\nDonc c'est peut-être à vous de revoir votre vue du monde et admettre que vous êtes façonné par des exigences spécifiques, loin de la réalité de la population mondiale en fait. Même au RSA, on rappelle qu'on est dans les 10% les personnes les plus riches au monde.\n\nPour ce qui est de la disponibilité HLM, il y en a pour répondre aux besoins urgents, comme vente bien, SDF, etc… Il faut en passer par les assistants sociaux de la Ville et des commissions spécifiques pas directement accessibles. Il faut jouer le jeu. J'ai eu mon logement social en 2 mois avec cette priorité, évidemment sans choisir le lieu, l'urgence c'est l'urgence.\n\nEt justment, c'est abordable par ceux qui n'ont pas les moyens de payer plus. Si vous payez plus, c'est que vous le pouvez et que vous le voulez. Donc vous êtes plus riche que vous ne voulez vous en rendre compte et avez du mal à concilier cette réalité et le train de vie auquel vous imaginez que vous devriez avoir le droit.",
            "score": 1,
            "created_utc": 1734937639.0
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": -8,
            "created_utc": 1734871182.0
        },
        {
            "author": "Kunstfr",
            "body": "Je m'imagine qu'avec un salaire dans les 25% plus élevés de France on puisse se payer mieux qu'un studio, ouais. Mais non, il faut être dans les 10%. Mais ça doit être moi avec ma mauvaise vision du monde, je m'imagine avoir droit à mieux qu'un 25m², quel idiot.\n\nEt le coût de la vie n'est pas le même partout. Avec ton RSA, tu pourrais vivre 30 fois plus confortablement dans plein de pays. Ici t'es obligé de faire les poubelles. Je sais pas comment tu peux dire ça et dire que la vie est belle.",
            "score": 1,
            "created_utc": 1734954200.0
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 7,
            "created_utc": 1734871572.0
        },
        {
            "author": "ClarkSebat",
            "body": "Je dirais même qu’il est plus facile de vivre à Paris avec un rsa qu’ailleurs en France compte tenu de l’accompagnement de la mairie, de la disponibilité et variété des TooGoodToGo / poubelles, mais aussi de l’offre culturelle et sportive gratuite sans compter les transports gratuits. Donc c’est chiche mais vivable.",
            "score": 1,
            "created_utc": 1734964115.0
        },
        {
            "author": "paris-ModTeam",
            "body": "🇫🇷 Votre commentaire a été modéré. Merci de garder les discussions le plus cordial possible. r/Paris est un lieu d'entraide et de discussions saines et non d'échanges interposés stériles.\n\n🇬🇧 Your comment has been removed. Please keep the discussion friendly. r/Paris is a place of gathering and helping each other while puerile exchanges are prescribed.\n\n\n\n----------------\n\n^If ^you ^wish ^the ^contact ^the ^moderators, ^you ^can ^do ^so ^via ^[modmail](https://www.reddit.com/message/compose?to=%2Fr%2Fparis).",
            "score": 1,
            "created_utc": 1734884716.0
        }
    ]
}