{
    "post_title": "A Milano arriveranno i 'cuscini berlinesi' per rallentare le auto",
    "post_author": "Benzinazero",
    "post_score": 54,
    "post_url": "https://milano.repubblica.it/cronaca/2024/12/14/news/milano_cuscini_berlinesi_auto-423885349/",
    "comments": [
        {
            "author": "enrilo86",
            "body": "Ho avuto modo di \"provare\" questi dossi e devo dire che, rispetto ai tradizionali, sono molto più dolci e non mi sembra che l'auto decolli o perda le ruote a ogni passaggio.",
            "score": 52,
            "created_utc": 1734517827.0
        },
        {
            "author": "acetaldeide",
            "body": "Inducono gli autisti a rallentare di auto con interasse largo, furgoni e camioncini?\n\nDalle mie parti ci sono dossi davvero \"tosti\", che devo dire funzionano bene: se non deceleri fino ai 20 ti saltano le otturazioni dai denti.",
            "score": 26,
            "created_utc": 1734520457.0
        },
        {
            "author": "BrodoDeluxe",
            "body": "Bene, si possono schivare con la bici. Spero ne mettano il più possibile.",
            "score": 28,
            "created_utc": 1734522089.0
        },
        {
            "author": "Alessioproietti",
            "body": "Li mettessero ovunque. Ho appena rischiato per la centesima volta di essere investito sulle strisce a un incrocio dove tutti arrivato ad alta velocità, senza minimamente considerare che potrebbero ritrovarsi un pedone sulla traiettoria.",
            "score": 26,
            "created_utc": 1734526584.0
        },
        {
            "author": "dodgeunhappiness",
            "body": "Devono tappezzare la città ci sono i vialoni come M.G. dove le auto sfrecciano da pazzi impunite.",
            "score": 19,
            "created_utc": 1734518579.0
        },
        {
            "author": "iMattist",
            "body": "Non ho capito come funzionano, a vedere l’immagine sembra che l’auto andrebbe a toccare a prescindere dalla velocità, specie le auto basse andando a favorire i SUV che penso non sia l’intenzione alla base di questo progetto.",
            "score": 3,
            "created_utc": 1734522370.0
        },
        {
            "author": "PatientNumber1343",
            "body": "Speriamo. Milano unico luogo del mondo senza dossi",
            "score": 13,
            "created_utc": 1734519161.0
        },
        {
            "author": "adea84",
            "body": "Ogni giorno per attraversare piazza Napoli mindaccio il segno della croce… vedo ogni giorno moto che passano con il rosso senza ritegno. Devono metterli prima di ogni attraversamento e devono anche restringere le carreggiate altrimenti le moto si infilano…",
            "score": 2,
            "created_utc": 1734595200.0
        },
        {
            "author": "matteventu",
            "body": "Di questi cosi (ho appreso si chiamassero \"cuscini berlinesi\" solo qualche mese fa grazie ad un articolo su HDblog) l'Inghilterra ne è piena (dove vivo e guido).\n\nLi **amo**, ma sono assolutamente **inutili**.\n\nLi amo, perché (non so con le altre auto) con la stragrande la maggior parte di essi si può tranquillamente e semplicemente passarci sopra *come se non ci fossero* (e non guido un Toyota Land Cruiser, ma una piccola segmento B), anche senza rallentare.\n\nSono inutili, per lo stesso motivo per cui li amo.\n\nOnestamente, per la maggior parte, non me capisco il senso.",
            "score": 1,
            "created_utc": 1734652679.0
        },
        {
            "author": "__Sim1__",
            "body": "Sono pericolosissimi e in altre città in Europa li stanno ritirando. Poco visibili e tremendi per le moto ad esempio.",
            "score": 1,
            "created_utc": 1734727629.0
        },
        {
            "author": "DysphoriaGML",
            "body": "Massi più li fanno illegalmente 30 cm più alti del necessario e li chiamano attraversamenti pedonali",
            "score": -24,
            "created_utc": 1734519430.0
        },
        {
            "author": "Atanamir",
            "body": "Non mi sembrano nulla di che, dovrebbero solo \"migliorare\" quelli normali e magari metterli in coppia, tipo 2 belle rampette alte 30cm a un metro e mezzo di distanza, così con la bici le salti e con la macvhina ti schianti.",
            "score": -3,
            "created_utc": 1734549279.0
        },
        {
            "author": "Street-Inspectors",
            "body": "Tanto le auto a Milano si ribaltano comunque spesso, dossi sì o dossi no.",
            "score": 1,
            "created_utc": 1734570320.0
        },
        {
            "author": "guidocarosella",
            "body": "Se è così non sono per niente legali, visto che ci devono passare anche i mezzi di soccorso.",
            "score": 2,
            "created_utc": 1734593067.0
        },
        {
            "author": "Fullo98",
            "body": "Vero, schivabili con la bici, ma se non c'è abbastanza spazio tra il dosso e il marciapiede rischi di prenderli di striscio e volare per terra (parlo per esperienza personale).",
            "score": 2,
            "created_utc": 1734538766.0
        },
        {
            "author": "Ruvido_Design",
            "body": "Hehehe non capisco se scherzi o fai la parte del ciclista anarchico per farsi odiare",
            "score": -24,
            "created_utc": 1734527251.0
        },
        {
            "author": "Benzinazero",
            "body": "Le bici e le moto li possono schivare. Autoambulanze e autobus ci passano sopra ma sono più stretti della luce fra le ruote. Le auto sono costrette a passarci sopra o con le ruote destre o con le ruote sinistre.",
            "score": 5,
            "created_utc": 1734522707.0
        },
        {
            "author": "taxig",
            "body": "Questa è una cazzata. In zona mia ce ne sono eccome.",
            "score": 4,
            "created_utc": 1734555274.0
        },
        {
            "author": "bravotipo",
            "body": "Ma se é pieno?",
            "score": 2,
            "created_utc": 1734561313.0
        },
        {
            "author": "Benzinazero",
            "body": "Hai della documentazione in proposito? Senza polemica",
            "score": 2,
            "created_utc": 1734761660.0
        },
        {
            "author": "acetaldeide",
            "body": "Non so che dire, IMHO **i dossi sono la materializzazione dell'incapacità a rispettare i limiti**.\n\nLa strada in questione (https://maps.app.goo.gl/YTQAN7Js3p7saDgYA) ha una doppia curva e nel mezzo ospita un attraversamento ciclopedonale di un parco. Le auto usavano arrivare al suddetto attraversamento belli sparati, ignorando la precedenza di pedoni e ciclisti, nonostante i cartelli.\n\nAdesso tutti transitano in sicurezza. L'eventuale ambulanza dovrebbe rallentare, ma credo che la presenza dei dossi migliori le condizioni che determinano la sua chiamata per l'ennesimo investimento...",
            "score": 4,
            "created_utc": 1734602793.0
        },
        {
            "author": "Simgiov",
            "body": "Sono abbastanza stretti da consentire il transito ad autobus e vigili del fuoco senza andarci sopra, non sono un problema per le bici.",
            "score": 1,
            "created_utc": 1734623200.0
        },
        {
            "author": "BrodoDeluxe",
            "body": "Faccio la parte del ciclista che non vuole farsi mettere sotto da un coglione che non rispetta i limiti di velocità come succede ogni mese a Milano.",
            "score": 28,
            "created_utc": 1734527975.0
        },
        {
            "author": "iMattist",
            "body": "La mia paura è che le auto basse, meno pericolose ed efficienti, saranno costrette a rallentare di più mentre auto alte, più pesanti e pericolose ci passeranno sopra tranquillamente. \n\nInoltre, il fatto di dover passare l’ostacolo spostandosi a destra o sinistra non rischia di creare manovre pericolose?",
            "score": 1,
            "created_utc": 1734524924.0
        },
        {
            "author": "PatientNumber1343",
            "body": "Risposta sbagliata. Dovevi dire che in africa non ci sono e quindi Milano non è l’unico posto",
            "score": 1,
            "created_utc": 1734555562.0
        },
        {
            "author": "PatientNumber1343",
            "body": "Non escludo ci siano zono coperte che io non frequento, ma dire sia pieno mi pare un'esagerazione. Frequento tutto l'est e gli unici dossi che incontro sono quelli in via cadute di marcinelle (confine con segrate) tranquillamente percorribili a 100 km/h +",
            "score": 2,
            "created_utc": 1734561940.0
        },
        {
            "author": "__Sim1__",
            "body": "A parte esperienza personale che dovrebbe essere più che sufficiente, anch’io lo dico senza polemica ovvio.\n\nhttps://metropoliabierta.elespanol.com/movilidad/20240217/barcelona-mantiene-mas-de-cojines-berlineses-pese-su-peligrosidad-para-los-motoristas/832416878_0.amp.html\n\n\nhttps://amp.elperiodico.com/es/barcelona/20240408/sirera-pide-carta-collboni-retirada-cojines-berlineses-barcelona-100761162",
            "score": 1,
            "created_utc": 1734767177.0
        },
        {
            "author": "__Sim1__",
            "body": "E aggiungo, che mi ero scordato, costruiti tutti con materiali non omologati in caso di pioggia",
            "score": 1,
            "created_utc": 1734767388.0
        },
        {
            "author": "Leopardodellenevi",
            "body": "La gente continua a chiamare le ambulanze per minchiate in ogni caso, e si continua a fare avanti e indietro per strade di paese con 80mila dossi. Certo, senza investimenti si hanno meno codici rossi, ma i volontari e dipendenti nel soccorso bestemmiano lo stesso, anche perché i comuni esagerano, sia in dossi, che in rotonde del cazzo. E ci mettiamo anche di più a raggiungere la destinazione, perché le ambulanze non sono esattamente agili nella ripresa.\n\nFirmato, un soccorritore che soffre il mal d'auto.",
            "score": 4,
            "created_utc": 1734613177.0
        },
        {
            "author": "Askan_27",
            "body": "o che non deve bestemmiare ogni giorno ripetutamente perché ci sono dei furbi che fanno delle ciclabili il loro parcheggio",
            "score": 14,
            "created_utc": 1734528568.0
        },
        {
            "author": "Ruvido_Design",
            "body": "I dossi ci stanno, il termine schivare no, sembri uno di quelli che per non prendere il dosso fa le virate improvvise, con questi non ci sarebbe biogno si schivare niente, magari son fatti anche per quel motivo...magari",
            "score": 0,
            "created_utc": 1734528819.0
        },
        {
            "author": "ObviousResource5702",
            "body": "vedo gia la fila fuori dal comune per la richiesta risarcimento danni a coppe dell'olio, alberi di trasmissione e vari",
            "score": 1,
            "created_utc": 1734615494.0
        },
        {
            "author": "Onyx_Sensei",
            "body": "Esatto!",
            "score": 0,
            "created_utc": 1734538749.0
        },
        {
            "author": "Benzinazero",
            "body": "Per ora non mi sembra documentazione conclusiva. Gli articoli parlano di un incidente a un motociclista, una petizione e una polemica politica. \n\nNon è uno studio che dimostri che i cuscini berlinesi siano particolarmente pericolosi, o più pericolosi rispetto ai dossi normali o niente dossi.",
            "score": 1,
            "created_utc": 1734768530.0
        },
        {
            "author": "BrodoDeluxe",
            "body": "Aah ok, no intendevo semplicemente che stando sulla destra con la bici lì eviti senza dover fare alcuna manovra improvvisa",
            "score": 3,
            "created_utc": 1734529243.0
        },
        {
            "author": "__Sim1__",
            "body": "Allora: come ho già detto, è esperienza personale tanto alla guida e come ho spiegato in primo luogo in particolare pericoloso per le moto e per le bici. In secondo luogo, ne ho uno installato nell’incrocio di fianco casa e di media viene un’ambulanza ogni due settimane e non é una strada trafficata. Me han già tolti molti. \n\nPoi se ci si dovesse basare solo sugli studi… comunque omologazione per pioggia non l’hanno. Non sono omologati i materiali. \n\nChiaramente un giornalista deve vendere e ti parla di un incidente però ripeto: molti incidenti e no stanno rimuovendo molti. Poca visibilità, scivolosissimi in caso di pioggia. \n\nMeglio altri tipi di barriere IMHO",
            "score": 1,
            "created_utc": 1734777186.0
        }
    ]
}