{
    "post_title": "You are from Bratislava, around 20, you like music and would love to make a new friend? You might've found your candidate!",
    "post_author": "Rock-Punk-Metal_Fan",
    "post_score": 15,
    "post_url": "https://www.reddit.com/r/Bratislava/comments/1hh0tg3/you_are_from_bratislava_around_20_you_like_music/",
    "comments": [
        {
            "author": "jachcemmatnickspace",
            "body": "We are a rave crew going to 95 % of drum and bass raves in the city. This Friday next.\n\nI can see from your username, this might not be your cup of tea.\n\nBut if you like skanking in a warehouse up to 4 am to dnb, dm me. Our moshpits are better;))))",
            "score": 6,
            "created_utc": 1734534440.0
        },
        {
            "author": "Palo_FishfaceGames",
            "body": "Hey, how old are you exactly?",
            "score": 2,
            "created_utc": 1734553970.0
        },
        {
            "author": "ninjapotato94",
            "body": "Down for clubbing this weekend? I’m solo travelling, from Norway and 30M. My ex gf dumped me but i already booked flight tickets. So yeah, i’ll be alone in Bratislava from 19th-23rd. I’m down for anything, we can bars hopping first, meet new people and then go clubbing or something.",
            "score": 2,
            "created_utc": 1734584294.0
        },
        {
            "author": "vladi_22_",
            "body": "Caves, hej? R u going also to Vienna? I'd like to join someday if possible. Diky vlado",
            "score": 1,
            "created_utc": 1734534830.0
        },
        {
            "author": "Dismal_Key_638",
            "body": "Can you recommend sth? Or where to look for?",
            "score": 1,
            "created_utc": 1734541155.0
        },
        {
            "author": "Rock-Punk-Metal_Fan",
            "body": "20",
            "score": 3,
            "created_utc": 1734557628.0
        },
        {
            "author": "Perfect_Emu255",
            "body": "jeg er så lei meg 🙁 hopper du kommer ha det godt i BA! 🫶",
            "score": 1,
            "created_utc": 1734621049.0
        },
        {
            "author": "jachcemmatnickspace",
            "body": "naah BA dnb raves are perfect for us, small events or big events, there is everything here\n\nand nothing beats just getting out of the club / hall and being in bed in 20 minutes",
            "score": 3,
            "created_utc": 1734538126.0
        },
        {
            "author": "jachcemmatnickspace",
            "body": "recommend what?",
            "score": 1,
            "created_utc": 1734541328.0
        },
        {
            "author": "ninjapotato94",
            "body": "Første kjærlighetssorg er grusomt 😔..\nJeg skal prøve å bli kjent med folk og har det gøy alene. Jeg ble invitert av henne julemiddag, skal feirer jul med familien hennes. Så det er noe jeg ser frem til ellers jeg har ikke noe planer. \n\nGleder meg til nye minner, men samtidig gruer meg til dårlige minner. Jeg anner ikke hva jeg gjør lenger, jeg er helt borte.",
            "score": 2,
            "created_utc": 1734631120.0
        },
        {
            "author": "thisisdrome",
            "body": "well then, see you in utopia :D",
            "score": 1,
            "created_utc": 1734567239.0
        },
        {
            "author": "Dismal_Key_638",
            "body": "which rave, or where to look for raves?",
            "score": 1,
            "created_utc": 1734541455.0
        },
        {
            "author": "Perfect_Emu255",
            "body": "fy faen… jeg vet eksakt hvordan du føler deg nå. Min kjæreste gjorde noe lignende, vi skulle ta kräftskivan med hans familie i år og han dumpet meg dagen før.\nMen! Slovakere er hjertelige mennesker, og når du kommer til dem og spør om du kan ta en øl med dem, kommer dere til å bli bestevenner! Dessverre kommer jeg den 23. og drar tilbake til Sverige den 28., ellers kunne vi møttes 😥",
            "score": 1,
            "created_utc": 1734632274.0
        },
        {
            "author": "jachcemmatnickspace",
            "body": "ahh. You can follow either labels or clubs, but I only know DNB scene, not others\n\nfor example we are going here on Friday [https://www.instagram.com/p/DAoQY04tYqv/](https://www.instagram.com/p/DAoQY04tYqv/)\n\napart from Pulsation, also Masokombinat, Bassizm, Rezzonate, Bass Factory, Trident are very active labels in Bratislava. They either throw club nights, festivals or big 2000 people hall events.\n\nfor rave venues / clubs, check Wax2, Subdeck, Sundeck, Fuga, Šafko, Radosť and other clubs, they post events in advance for example on Instagram\n\nthere are other clubs in the city like Trafo, Channels, The Club and others but play generic pop / edm music",
            "score": 1,
            "created_utc": 1734541941.0
        },
        {
            "author": "ninjapotato94",
            "body": "Eksen min er bekymrer for meg og stresser fordi slovakere kan være rasistisk mot asiater. Hun vet at jeg stoler på folk lett 😭\n \nOppholde på hostel så det blir sikkert spennende å treffe turister.",
            "score": 1,
            "created_utc": 1734632900.0
        },
        {
            "author": "Dismal_Key_638",
            "body": "thank you very much",
            "score": 1,
            "created_utc": 1734542512.0
        },
        {
            "author": "Perfect_Emu255",
            "body": "noen jævlar er rasistiske, men vanligvis ikke mot asiater. jeg tror du kommer til å bli helt okei :)",
            "score": 2,
            "created_utc": 1734635840.0
        }
    ]
}