{
    "post_title": "Visiting on Xmas Eve",
    "post_author": "ShadowMLSL",
    "post_score": 0,
    "post_url": "https://www.reddit.com/r/helsinki/comments/1hki972/visiting_on_xmas_eve/",
    "comments": [
        {
            "author": "VernerofMooseriver",
            "body": "I’m sorry but you really couldn’t have picked any worse moment to visit Helsinki. Literally everything is closed in Christmas Eve and day.",
            "score": 38,
            "created_utc": 1734938019.0
        },
        {
            "author": "DoubleSaltedd",
            "body": "It is very easy to spend christmas eve and day in Helsinki on a budget because likely everyting is closed so you really can’t spend money during your stay.\n\nYou picked the worst days of the year to be a tourist in Helsinki.",
            "score": 25,
            "created_utc": 1734942266.0
        },
        {
            "author": "Relzu13",
            "body": "https://www.myhelsinki.fi/en/your-local-guide-to-christmas",
            "score": 7,
            "created_utc": 1734937492.0
        },
        {
            "author": "PeaDelicious9786",
            "body": "Walk around in the Hietalahti Cemetary. That's absolutely beautiful as a part of the tradition is to light candles.",
            "score": 4,
            "created_utc": 1734945129.0
        },
        {
            "author": "WolfOfVaasankatu",
            "body": "Nothing is open and there aint even snow so everything looks like shit.",
            "score": 2,
            "created_utc": 1734953225.0
        },
        {
            "author": "baked_potato_",
            "body": "You could go to Tallinn and visit their Christmas market if you really want a Christmas market. And theirs has won awards in the past.",
            "score": 3,
            "created_utc": 1734937624.0
        },
        {
            "author": "LievePoro",
            "body": "As someone else suggested I'd consider a day trip to Tallinn, the city is pretty and some stuff including the Christmas market should be open. \n\nYou could go to Suomenlinna with a short super cheap (same ticket as usual public transport) ferry ride for some nice history, architecture and good views, just make sure to dress warm. \n\nYou might be able to make your way to Nuuksio or Sipoonkorpi national park, but given its a bit icy it's probably not the most comfortable experience and a bit risky, especially solo. \n\nThe Merisatama/Eira area and Kallio are reasonably pretty to walk around, although perhaps not as much with the current weather and conditions.\n\nI can't think of much more than that...",
            "score": 1,
            "created_utc": 1734946805.0
        },
        {
            "author": "JHMK",
            "body": "Juhannus would be second candidate, but at least nature is at its best at that time 🤔",
            "score": 7,
            "created_utc": 1734950980.0
        },
        {
            "author": "WolfOfVaasankatu",
            "body": "You know things are bad when even Prisma closes at 18.",
            "score": 4,
            "created_utc": 1734953155.0
        },
        {
            "author": "leela_martell",
            "body": "This is a pretty good idea. OP could take the ferry that leaves in the morning from Helsinki, then have a few hours in Tallinn and come back.\n\nIt's really odd that the Christmas market in Helsinki closes before Christmas, would be nice to visit on Christmas Eve morning I think. Or maybe that's cause I'm from Turku originally and am used to leaving the house before midday to go to the Christmas Peace declaration and then to have glögi somewhere downtown.\n\nI'm not religious but I like the Christmas Carol events they have at churches. There's this in English in the main cathedral on Christmas Day at 4pm if you're interested OP. [https://www.helsinginseurakunnat.fi/tuomiokirkkoseurakunta/tapahtumat/kauneimmatjoululaulutjohanneksenkirkossa/20241226](https://www.helsinginseurakunnat.fi/tuomiokirkkoseurakunta/tapahtumat/kauneimmatjoululaulutjohanneksenkirkossa/20241226) (weirdly the url has a completely different church listed than the page...)\n\nAllas Sea Pool is popular among both tourists and locals, and it is open on Christmas. It's really nice on winter/Christmas times cause you can swim and look at the lights everywhere and then have a sauna. [https://allasseapool.fi/?lang=en](https://allasseapool.fi/?lang=en)",
            "score": 3,
            "created_utc": 1734946089.0
        },
        {
            "author": "Seeteuf3l",
            "body": "It's not very great weather for national parks. Also while public is running, other question is how frequently",
            "score": 1,
            "created_utc": 1734950093.0
        }
    ]
}