{
    "post_title": "Que faire/où aller quand on est seul à Noël ?",
    "post_author": "Soft_Device8499",
    "post_score": 9,
    "post_url": "https://www.reddit.com/r/paris/comments/1hk41l0/que_faireoù_aller_quand_on_est_seul_à_noël/",
    "comments": [
        {
            "author": "devesquererdevs",
            "body": "I'm in the same situation. I arrived in Paris a couple weeks ago, have nobody to spend the Christmas with and an looking to meet people / make friends. \n\nHit me up if you wanna go to a restaurant or do something together. I speak a little bit of French but it's terrible by the way.",
            "score": 6,
            "created_utc": 1734896140.0
        },
        {
            "author": "Relative-Tune85",
            "body": "A Paris, tu dois pouvoir trouver un resto ouvert à Noël. Si tu peux te le permettre, il y a aussi les restos des palaces.",
            "score": 5,
            "created_utc": 1734893920.0
        },
        {
            "author": "Snoo48605",
            "body": "Question supplémentaire: que faire lorsqu'on est seul ET fauché (asking for a friend haha)",
            "score": 4,
            "created_utc": 1734903265.0
        },
        {
            "author": "z6400",
            "body": "Aller à la messe de minuit à la cathédrale.",
            "score": 3,
            "created_utc": 1734905881.0
        },
        {
            "author": "Tigrou93",
            "body": "Il doit sûrement avoir des associations qui luttent contre l'isolement des seniors qui organisent des événements pour le réveillon.",
            "score": 2,
            "created_utc": 1734894403.0
        },
        {
            "author": "Silskinrius",
            "body": "Salut ! Ca vaut peut-être le coup de regarder ce poteau (des fois que quelque chose soit organisé à Paris) : [https://www.reddit.com/r/france/comments/1hjaoja/seul\\_pour\\_noël/?utm\\_source=share&utm\\_medium=web3x&utm\\_name=web3xcss&utm\\_term=1&utm\\_content=share\\_button](https://www.reddit.com/r/france/comments/1hjaoja/seul_pour_noël/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)",
            "score": 1,
            "created_utc": 1734894867.0
        },
        {
            "author": "Lovecr4ft",
            "body": "Tu parles du 24 ou du 25? Moi je bosse jusqu'à 20h le 24 et peut être 21... Et derrière je vais rentrer chez moi et dormir.\nAprès le 25 peut être j'irai au ciné si c'est ouvert ou je me materai un film sur pc",
            "score": 1,
            "created_utc": 1734904471.0
        },
        {
            "author": "rikspoutnik78",
            "body": "Je sais qu'un pote qui ne fête pas noël en famille (pas dans leur culture) est bénévole d'un super dîner de Noël organisé pour des sans abris. C'est dans un lieu assez sympa (j'ai plus le nom) et il y a l'air d'avoir une belle ambiance. Si ça t'intéresse je peux lui demander plus de détails.",
            "score": 1,
            "created_utc": 1734911270.0
        },
        {
            "author": "sylvaiw",
            "body": "Trouver un truc à faire et proposer de partager l'expérience avec des rediteurs esseulés ?",
            "score": 1,
            "created_utc": 1734955774.0
        },
        {
            "author": "Garsbriel",
            "body": "J'ai posé la question à Qwant + : que faire quand on est une femme seule pour Noël ?\n\n> Être seule pour Noël peut susciter des sentiments de tristesse ou d'isolement, mais cela peut également être une occasion de se recentrer sur soi-même et d'apprécier sa propre compagnie. Voici quelques suggestions pour passer un moment agréable et enrichissant pendant cette période :\n\n> 1. Accepter ses sentiments\n\n>    Reconnaître que ressentir de la tristesse est normal. Écrire vos pensées peut aider à libérer des émotions.\n\n> 2. Bannir les réseaux sociaux\n\n>    Évitez de consulter les réseaux sociaux pour ne pas être influencé par les publications des autres sur leurs célébrations.\n\n> 3. Se préparer un bon repas\n\n>    Profitez de cette occasion pour cuisiner un plat que vous aimez. Cela peut être un moment de plaisir et de créativité.\n\n> 4. Se chouchouter\n\n>    Prenez soin de vous : un bon bain, un bon livre, ou un film que vous aimez peuvent faire toute la différence.\n\n> 5. Être créatif\n\n>    Engagez-vous dans une activité artistique ou manuelle que vous aimez, comme le dessin, l'écriture ou la musique.\n\n> 6. Passer du temps dans la nature\n\n>    Une promenade dans un parc ou en forêt peut être revigorante et apaisante.\n\n> 7. Rester connectée avec ses proches\n\n>   Utilisez des applications de messagerie ou de vidéo pour discuter avec des amis ou de la famille, même à distance.\n\n> 8. Faire du bénévolat\n\n>    Si vous le pouvez, consacrez du temps à aider ceux qui en ont besoin. Cela peut apporter un sentiment de satisfaction et de connexion.\n\n> 9. Planifier la nouvelle année\n\n>    Profitez de ce temps pour réfléchir à vos objectifs pour l'année à venir.\n\n> 10. Regarder des films ou des séries\n\n>    Faites un marathon de films ou de séries que vous avez toujours voulu voir.\n\n> 11. Créer une playlist annuelle\n\n>    Compilez vos chansons préférées de l'année pour célébrer vos souvenirs musicaux.\n\n> 12. Commencer une nouvelle tradition\n\n>    Établissez une nouvelle tradition qui vous plaît, que ce soit un plat spécial ou une activité que vous aimez.\n\n> 13. Participer à des événements sociaux\n\n>    Si vous le souhaitez, envisagez de rejoindre une soirée organisée pour les personnes seules, comme celles proposées par le site \"Seul pour Noël\".\n\n> 14. Lire un bon livre\n\n>    Plongez-vous dans un livre que vous avez toujours voulu lire.\n\n> 15. Faire du sport\n\n>    Une activité physique, même légère, peut améliorer votre humeur et votre bien-être.\n\n> 16. Finir des projets en cours\n\n>    Profitez de ce temps pour terminer des projets que vous avez commencés.\n\n> 17. Ne rien faire\n\n>    Parfois, il est tout à fait acceptable de ne rien faire et de simplement profiter du moment.\n\n> En somme, être seule pour Noël peut être une expérience enrichissante si vous choisissez d'en faire un moment de bien-être personnel. N'oubliez pas que vous n'êtes pas vraiment seule, car de nombreuses personnes partagent cette expérience.\n\nPS : il y a déjà une autre jeune femme qui s'est posé à peu près la même question. Parmi les réponses qu'elle a obtenues, tu trouveras peut-être, OP, quelque chose qui t'intéressera...\n\nhttps://www.reddit.com/r/AskMeuf/s/TDUMxgaZ1t",
            "score": 1,
            "created_utc": 1734898635.0
        },
        {
            "author": "Exact_Deal1348",
            "body": "Noel est plutôt familial   difficile de trouver des soirées organisées",
            "score": -3,
            "created_utc": 1734893664.0
        },
        {
            "author": "Dycoth",
            "body": "L'enjeu maintenant sera de trouver un resto abordable ET avec encore de la place. Les restaurants ouverts à cette période et a fortiori le soir du Réveillon ont généralement un menu spécial Noël et sont prisés, j'ai l'impression.",
            "score": 2,
            "created_utc": 1734950988.0
        },
        {
            "author": "draum_bok",
            "body": "Restos du Coeur",
            "score": 1,
            "created_utc": 1734941696.0
        },
        {
            "author": "Suspicious_Door_6517",
            "body": "Carrément. Je crois que les restos du cœur proposent des trucs les soirs de Noël. Et ils cherchent généralement des volontaires. De façon générale pour les personnes isolées, âgées ou non.",
            "score": 3,
            "created_utc": 1734894571.0
        }
    ]
}