{
    "post_title": "Un policia desenfunda la seva pistola en el desnonament de Verdum",
    "post_author": "aniol",
    "post_score": 41,
    "post_url": "https://noubarris.info/verdum/2024/12/un-policia-desenfunda-la-seva-pistola-en-el-desnonament-de-verdum/",
    "comments": [
        {
            "author": "beatlz",
            "body": "Ok me leí el artículo, vamos a digerirlo:\n\nEl policía desenfundó su pistola para desalojar a las dos chicas que estaban ahí ilegalmente. Ellas ni siquiera estaban en la propiedad, así que habrá que ver por qué don policía estaba en tal pánico que decidió desenfundar. Falta de experiencia, sería mi apuesta.\n\nAhora, las chicas fueron estafadas por una persona que se hizo pasar por el propietario. El verdadero dueño es nuestro muy querido Blackstone, un amigable conglomerado que tiene como objetivo convertir el mundo en feudalismo versión 2024. Por si no notaron mi sarcasmo, no aportan nada y quitan mucho. \n\nCon qué mensaje nos vamos a quedar los ciudadanos? Con que los polis están dispuestos a abatir a tiros a los que afecten a los billonarios. Sea cierto o no, va a ser el mensaje político con el que tendrán que lidiar las autoridades. Y con esta coyuntura del caso de Luigi, se pondrá todo color de hormiga.",
            "score": 78,
            "created_utc": 1734690731.0
        },
        {
            "author": "ark4nos",
            "body": "*el que la saca pa enseñar, es un parguela*",
            "score": 29,
            "created_utc": 1734693842.0
        },
        {
            "author": "Mushgal",
            "body": "Poques coses radicalitzen avui dia com el tema dels desnonaments.\n\nI d'aquí a uns dies és Nadal, eh. Ni tan sols això es respecta.",
            "score": 7,
            "created_utc": 1734720228.0
        },
        {
            "author": "LTKerr",
            "body": "ACAB",
            "score": 17,
            "created_utc": 1734689954.0
        },
        {
            "author": "rkifo",
            "body": "Jo tinc clar qui son els meus enemics.",
            "score": 19,
            "created_utc": 1734687470.0
        },
        {
            "author": "djzener",
            "body": "Fills de la gran puta",
            "score": 6,
            "created_utc": 1734694310.0
        },
        {
            "author": "twolinebadadvice",
            "body": "pues yo trabajo en una inmobiliaria y nos han ocupado pisos (de propietarios que no son una empresa) para convertirlos en narcopisos y la policía nos ha dicho que estamos a la buena de dios",
            "score": 7,
            "created_utc": 1734693539.0
        },
        {
            "author": "navajorpez",
            "body": "Clar, es que ea mes cristia passar nadal al carrer, buscant un portal i calor dels animals.",
            "score": 6,
            "created_utc": 1734736841.0
        },
        {
            "author": "SableSnail",
            "body": "Dices eso, pero cuando te roben el móvil, no llamas a los okupas...",
            "score": -5,
            "created_utc": 1734779630.0
        },
        {
            "author": "8jaumeco8",
            "body": "Cuanto es el porcentaje de ocupación? Porque estoy mirando pisos por menos de 120.000 estas todos okupados… tambien hay hasta 200.000€ okupados…",
            "score": 4,
            "created_utc": 1734693757.0
        },
        {
            "author": "Mushgal",
            "body": "¿Y cuántos pisos vacíos tiene la inmobiliaria?",
            "score": 5,
            "created_utc": 1734720175.0
        },
        {
            "author": "Ryukhoe",
            "body": "Ni a la policía porque tampoco hacen nada.",
            "score": 6,
            "created_utc": 1734873175.0
        },
        {
            "author": "Appropriate-Age1260",
            "body": "La ultima vez que mire aprox un1,5% de los pisos de Barcelona están okupados. Más o menos los mismos que turísticos.",
            "score": -6,
            "created_utc": 1734732871.0
        },
        {
            "author": "twolinebadadvice",
            "body": "cero. la inmobiliaria administra las viviendas de propietarios particulares.",
            "score": -2,
            "created_utc": 1734721127.0
        },
        {
            "author": "8jaumeco8",
            "body": "Donde los miraste?",
            "score": 2,
            "created_utc": 1734746454.0
        }
    ]
}