{
    "post_title": "Title: Help Needed: Girlfriend’s Visa Situation in Czech Republic",
    "post_author": "ElegantBreath6062",
    "post_score": 2,
    "post_url": "https://www.reddit.com/r/Prague/comments/1hkcrea/title_help_needed_girlfriends_visa_situation_in/",
    "comments": [
        {
            "author": "manbuff",
            "body": "There is a language school in Prague , near Vaclavske Namesti called PLI. Prague Language Institute , they teach Czech and give you a visa , they take 30k crownes per semester but getting a visa is easy from them . You can try that ",
            "score": 22,
            "created_utc": 1734917648.0
        },
        {
            "author": "xxpetulkaxx",
            "body": "You can book an appointment in Integration centre Prague (icpraha.com) - they offer legal counselling for foreigners free of charge (both in person and online) :) ",
            "score": 3,
            "created_utc": 1734936576.0
        },
        {
            "author": "Inevitable_Ad574",
            "body": "It’s in Czech but you have free access to the job market, probably what your girlfriend should have done whilst living here was going to the foreign police and ask for a visa for the purposes to apply for a job. https://www.mpsv.cz/volny-pristup-na-trh-prace-pro-obcany-vybranych-statu-a-podminky-pobytu-novinky-od-1.-7.-2024#:~:text=Ob%C4%8Dan%C3%A9%20vybran%C3%BDch%20st%C3%A1t%C5%AF%20nemohou%20vykon%C3%A1vat,%C3%BA%C4%8Delem%20zam%C4%9Bstn%C3%A1n%C3%AD%20na%20zastupitelsk%C3%A9m%20%C3%BA%C5%99ad%C4%9B.",
            "score": 7,
            "created_utc": 1734925780.0
        },
        {
            "author": "8under10",
            "body": "She can reach out to a Czech consulate in the US and they’ll be able to advise her. I called the Czech Consulate in LA many times and they were great. I’d do it first thing in the morning tomorrow. Christmas is three days in the Czech Republic and consulates will observe it",
            "score": 3,
            "created_utc": 1734926415.0
        },
        {
            "author": "LarryLerry",
            "body": "Not helping, but good luck, other comments are helpful",
            "score": 1,
            "created_utc": 1734937282.0
        },
        {
            "author": "Traditional-Day-2411",
            "body": "How much time did she have left on the 90-day tourist visa? \n\nI would contact an agency about the “Zivno” because there are options there, especially since she is presumably a native English speaker and could apply to teach English as a freelancer. This is not really difficult to sort out and you already have the hardest part done (a lease). She should be able to come back and apply right away. But how much time is left? Did she leave right at 90 days?",
            "score": 0,
            "created_utc": 1734917573.0
        },
        {
            "author": "Outrageous_Goose_477",
            "body": "Not sure if this help or applies, but there is an option to apply for an invitation request at the local police department, which usually takes 3-7 days to process and afterwards you can send it to your gf via post or through someone who goes to the US and she can use that to apply and return based on your invitation.\n\nFYI - In this case you would need to provide all the necessary documentation and proof of funds that you can sustain her for the requested time period (max 90 days).",
            "score": 0,
            "created_utc": 1734920037.0
        },
        {
            "author": "ElegantBreath6062",
            "body": "Amazing thank you so much! That is extremely helpful and we will look into that!",
            "score": 5,
            "created_utc": 1734917805.0
        },
        {
            "author": "OstrichNo8519",
            "body": "[Here is related information in English.](https://www.brnoexpatcentre.eu/practical-tips/2024-6-czechia-removes-the-need-for-work-permit-for-9-countries/#:~:text=As%20of%201%20July%202024,USA%2C%20Singapore%20and%20South%20Korea)\n\n[And here…](https://ipc.gov.cz/en/free-access-to-the-czech-labour-market-for-citizens-of-selected-countries/)",
            "score": 2,
            "created_utc": 1734946608.0
        },
        {
            "author": "ElegantBreath6062",
            "body": "Amazing thank you so much. I will have her call first thing tomorrow",
            "score": 2,
            "created_utc": 1734928116.0
        },
        {
            "author": "ElegantBreath6062",
            "body": "She left with 4 or 5 days left on her visa. Would she have to come back to the Czech Republic and then apply while she is already there? Or would she apply in the states?\n\nAlso thank you so much this is already extremely helpful!",
            "score": 2,
            "created_utc": 1734917746.0
        },
        {
            "author": "Illustrious-Pack3495",
            "body": "I can vouch for them too, they will provide you with all the documents you need for the VISA. I think it’s a bit late now to enrol but you can try. If you want an Immigration Services consultant then I would strongly recommend Move to Prague. Good luck!\n\nP.S. - If you do go to MTP, it might be worth asking them what legal action you can take against the company. Rescinding offer letters without good reason is not very common in CZ.",
            "score": 3,
            "created_utc": 1734938775.0
        },
        {
            "author": "Gardium90",
            "body": "Here is relevant info: https://ipc.gov.cz/en/visa-and-residence-permit-types/third-country-nationals/long-term-visa/long-term-visa-for-the-purpose-of-doing-business/\n\nNot sure, but try to call the foreign ministry or police, they can give you answers to those questions. \n\nBut in my understanding (not legal advice), once an application is submitted it freezes any existing exit date, but she can't leave the country until processed as she wouldn't be able to enter again until some other visa or rule allows her to enter again. And the application given in person, might require a in person pick up once approved. But this is just what I recall from many years ago, please contact the authorities and ask. Good luck",
            "score": 1,
            "created_utc": 1734944667.0
        },
        {
            "author": "Gardium90",
            "body": "Not common, but not illegal if there is a probation period on the contract. If there was no probation period (highly unlikely), she could be entitled 2 months pay, but that would be it.",
            "score": 1,
            "created_utc": 1734943730.0
        },
        {
            "author": "Illustrious-Pack3495",
            "body": "That’s interesting, I was under the impression that if you get an offer letter and submit your resignation based on the offer letter - then you can take legal action against the company if they rescind it. I don’t know if you have heard of any cases like this.",
            "score": 1,
            "created_utc": 1734953066.0
        },
        {
            "author": "Gardium90",
            "body": "Many think this, because then they're in a bad situation. However, legally speaking, you could show up to the new work on day one and either be let go or resign yourself.\n\nYou'd be in an equally bad situation, but no laws were broken.\n\nEdit: this assumes the standard probation period clause. If there is no clause about this, then normal rules apply for notice of termination, and 2 months pay are due to the employee of the contract",
            "score": 1,
            "created_utc": 1734960711.0
        }
    ]
}