{
    "post_title": "Why are there always so many people? paying taxes? ",
    "post_author": "AlbatrossHummingbird",
    "post_score": 71,
    "post_url": "https://i.redd.it/rjdksg78f08e1.jpeg",
    "comments": [
        {
            "author": "ay0d",
            "body": "That’s currency exchange, guess people need to get currency if they’re traveling for the holidays somewhere abroad. You can also buy gold from there. There are taxes of course 😅",
            "score": 76,
            "created_utc": 1734703509.0
        },
        {
            "author": "Ragecommie",
            "body": "If people lined up like this to pay their taxes, Bulgaria would've surpassed Wakanda by now.\n\nBalkanda Forever",
            "score": 232,
            "created_utc": 1734704377.0
        },
        {
            "author": "Stormbringer1992",
            "body": "Exchanging currency for the upcoming vacation. Happens every Friday before a long break.",
            "score": 41,
            "created_utc": 1734703389.0
        },
        {
            "author": "Impressive-Hunt-154",
            "body": "Hope they don’t first go trough the place on the right of tavex :D",
            "score": 6,
            "created_utc": 1734704725.0
        },
        {
            "author": "BlueTwist3r",
            "body": "Bro thinks in bulgaria we pay taxes through the exchange bureau",
            "score": 7,
            "created_utc": 1734774382.0
        },
        {
            "author": "dwartbg9",
            "body": "Usually there aren't exchange offices in these areas or they have worse rates, hence many people decide to use Tavex in the malls, just out of convenience.  Instead of travelling to the centre, they just go to the nearby mall.   This is my logic.  Another option is that most of these people are foreigners, I personally wouldn't exchange at Tavex and never used them for that.",
            "score": 10,
            "created_utc": 1734706256.0
        },
        {
            "author": "SeventeenFifty",
            "body": "The irony that at least half of them are against Bulgaria entering the euro zone.",
            "score": 9,
            "created_utc": 1734720846.0
        },
        {
            "author": "fairadvantage0",
            "body": "Buying/selling gold or currency - you can't pay your taxes there. Most are probably buying gold. Tavex is the most popular option for buying investment gold. Have a look for yourself: [https://tavex.bg/en/](https://tavex.bg/en/)",
            "score": 12,
            "created_utc": 1734703447.0
        },
        {
            "author": "Think_Impossible",
            "body": "This is not a taxes/bills office, it is a currency exchange, and they appear less sketchy than most. I also used their services to buy some yen for a trip to Japan, as banks normally have only eur, usd and chf (occasionally some others too). People are probably getting some pocket money for their vacation trips during the holidays.",
            "score": 3,
            "created_utc": 1734713083.0
        },
        {
            "author": "Gar33b",
            "body": "That’s for currency exchange. Holidays are coming, people will travel outside the country so they exchange some cash for their vacation.",
            "score": 2,
            "created_utc": 1734719444.0
        },
        {
            "author": "FlatTwo52",
            "body": "Tavex has the best exchange rates, so people prefer to go there rather than their local change.",
            "score": 2,
            "created_utc": 1734734581.0
        },
        {
            "author": "ugewhatudeserve",
            "body": "As a bulgarian i dont know how to pay taxes and what is taxes",
            "score": 2,
            "created_utc": 1734788942.0
        },
        {
            "author": "badgirlmonkey",
            "body": "Which mall is this again?",
            "score": 1,
            "created_utc": 1734764014.0
        },
        {
            "author": "Kras_08",
            "body": "Once waited in such a line just to be told that I had to \"be 18\". Like what? Why? Luckily all the smaller less fancy currency exchange don't give a fuck.",
            "score": 1,
            "created_utc": 1734767759.0
        },
        {
            "author": "Key-Handle-2938",
            "body": "They buy gold.",
            "score": 1,
            "created_utc": 1734792758.0
        },
        {
            "author": "Pretend_Pomelo_6893",
            "body": "It is money gold exchange to for taxes",
            "score": 1,
            "created_utc": 1734887267.0
        },
        {
            "author": "UpperSir7032",
            "body": "Some of them are there to buy gold for investment.",
            "score": 1,
            "created_utc": 1734937919.0
        },
        {
            "author": "Ok-Toe1010",
            "body": "Ah yes, that's mall sofia. I was there yesterday and saw the line at tavex lol.",
            "score": 1,
            "created_utc": 1734938512.0
        },
        {
            "author": "IvayloDoctorov",
            "body": "aren't You?",
            "score": 0,
            "created_utc": 1734726607.0
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 0,
            "created_utc": 1734757028.0
        },
        {
            "author": "dwartbg9",
            "body": "Except it's the same situation at the EasyPay offices where people line up to pay their bills and taxes. \nThe thing is nowadays you can easily pay everything online and younger people don't bother to go to these physical locations.   If we didn't have such options, queques for taxes would be even bigger.",
            "score": 16,
            "created_utc": 1734706409.0
        },
        {
            "author": "Odd-Membership-1521",
            "body": "Are you implying Bulgarians don't pay taxes? \n\nNot attacking you I'm just curious as to what you mean.",
            "score": 6,
            "created_utc": 1734709266.0
        },
        {
            "author": "Mundane-Shelter-9348",
            "body": "It is always like that, not only at the holidays.",
            "score": 3,
            "created_utc": 1734710175.0
        },
        {
            "author": "JakoMyto",
            "body": "I may miss something but isn't it cheaper and faster to exchange directly at bank?",
            "score": 0,
            "created_utc": 1734852052.0
        },
        {
            "author": "veselin465",
            "body": "What's the problem to pay your phone bill? /s",
            "score": 2,
            "created_utc": 1734705965.0
        },
        {
            "author": "av-f",
            "body": "Switzerland of the Balkans",
            "score": 2,
            "created_utc": 1734790026.0
        },
        {
            "author": "7_11_Nation_Army",
            "body": "Why do you think most are buying gold?",
            "score": 1,
            "created_utc": 1734710864.0
        },
        {
            "author": "gymbaggered",
            "body": "В теорията и българската практика се счита, че не е налице нарушение в следните случаи на заснемане в случай на:\n\n1. извършване на обществена дейност;\n2. ***присъствие на обществено място***;\n3. наличие на изображение на лице, което е част от снимка, показваща събрание, шествие или пейзаж;\n4. редакционни цели при представяне на кадри от събития, представляващи обществен интерес;\n5. предварително получено възнаграждение за заснемане.\n\n![gif](giphy|elncH1cg97ChHBwx8Q)",
            "score": 2,
            "created_utc": 1734772748.0
        },
        {
            "author": "IcuckYourFather69",
            "body": "They queue to get money into online casinos not to pay taxes",
            "score": 31,
            "created_utc": 1734707536.0
        },
        {
            "author": "Mundane-Shelter-9348",
            "body": "Yep, and also when your salary is below the table and you must pay your taxes without proving your income - this is the way!",
            "score": 8,
            "created_utc": 1734710137.0
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 3,
            "created_utc": 1734713761.0
        },
        {
            "author": "Easy_Society4425",
            "body": "Guys, I have been living and being an employer  in Singapore, Bulgaria and the USA.  I can say Bulgarian employers and employees are the only ones who are paying their shares of the tax burden. Singapore had a flat 17% on \"chargeable\" income, gross - exemptions, but good accountants can do magic with the exemptions. In the USA it is even crazier you can pay easily zero tax otherwise federal is 21% and state can be from 0 in Wyoming to 11.5 in New Jersey.",
            "score": 3,
            "created_utc": 1734792478.0
        },
        {
            "author": "Ragecommie",
            "body": "Of course they don't. The general attitude is that taxes should best be avoided. Doesn't work for everyone though... Especially not for the government lol",
            "score": 3,
            "created_utc": 1734709434.0
        },
        {
            "author": "Impressive-Hunt-154",
            "body": "I’m talking about Money+",
            "score": 1,
            "created_utc": 1734709521.0
        },
        {
            "author": "Finolla666",
            "body": "https://preview.redd.it/hy0uqr1f918e1.png?width=762&format=png&auto=webp&s=a4958ba2a3836b79968e3998866e6a781d6681ab",
            "score": 3,
            "created_utc": 1734713354.0
        },
        {
            "author": "HucHuc",
            "body": "I am pretty sure your employer would be happy to pay out the exact same total sum of money, taxes included, if you agree to take the difference out of your salary. But you'd rather have a few leva more, don't you? So don't pretend you're on the moral high ground on this one, both employers and employees are equally to blame.",
            "score": 4,
            "created_utc": 1734726539.0
        },
        {
            "author": "veselin465",
            "body": "I know (look at the /S part)",
            "score": 1,
            "created_utc": 1734712791.0
        }
    ]
}