{
    "post_title": "Antisemitischer Angriff im laufenden Betrieb: Scheibe von Neuköllner Kneipe „Bajszel“ mit Pflasterstein attackiert",
    "post_author": "PassionNo9822",
    "post_score": 20,
    "post_url": "https://www.tagesspiegel.de/berlin/antisemitischer-angriff-im-laufenden-betrieb-scheibe-von-neukollner-kneipe-bajszel-mit-pflasterstein-attackiert-12921922.html",
    "comments": [
        {
            "author": "BlackCaesarNT",
            "body": "Again? Damn...\n\nhttps://old.reddit.com/r/antisemitism/comments/1fs24dj/arson_attack_on_the_bar_bajszel_in_berlin/",
            "score": 6,
            "created_utc": 1734959139.0
        },
        {
            "author": "schtzn_grmm",
            "body": "Es nimmt einfach kein Ende. :(",
            "score": 10,
            "created_utc": 1734956251.0
        },
        {
            "author": "user9ec19",
            "body": "Ich kenne diese Kneipe gar nicht, werde aber ab jetzt aus Solidarität vermehrt dort hingehen. Das sollten wir alle tun.",
            "score": 5,
            "created_utc": 1734959269.0
        },
        {
            "author": "burnerburner030",
            "body": "Ah yes, another anti-Semitic attack against a - *checks notes* - German establishment. \n\nLove how German politicians, media and a good chunk of society have collectively redefined what anti-semitism is. This is a very good way to not fight anti-semitism and empty the term of all its meaning in the same go. \n\n*You’re doing great sweetie!*",
            "score": -22,
            "created_utc": 1734956871.0
        },
        {
            "author": "Competitive-Code1455",
            "body": "So in your eyes the bar was attacked because it was German? No other reason, just a normal German bar that gets regularly attacked. I don’t know, I feel like this doesn’t really paint the whole picture.",
            "score": 14,
            "created_utc": 1734957461.0
        },
        {
            "author": "user9ec19",
            "body": "Fuck off! Did you know that you can be Jewish and German at the same time?",
            "score": 9,
            "created_utc": 1734959603.0
        },
        {
            "author": "itmustbeluv_luv_luv",
            "body": "Ah yes, and helping Palestine means attacking some random antideutschen-Bar with no influence anywhere.",
            "score": 1,
            "created_utc": 1734960625.0
        },
        {
            "author": "burnerburner030",
            "body": "Na ja - these people opened a bar in a predominantly migrant neighbourhood to cosplay being leftists while simultaneously, and aggressively, excluding people, including Jewish people, with an actual leftist world view and analysis. In the end, this is a space solely for anti-deutsch kartoffeln who wanted to be provocative and they're getting served accordingly. They are not the victim.",
            "score": 1,
            "created_utc": 1734961474.0
        },
        {
            "author": "burnerburner030",
            "body": "The reasons you're looking for can be found in the bar owners' ideology, the type of lives they value and don't value, the opinions they do and don't listen to, the morals they pretend to have, the type of space they claim to be, and work up from there :)",
            "score": -13,
            "created_utc": 1734958103.0
        },
        {
            "author": "schtzn_grmm",
            "body": ">They are not the victim.\n\nAh, I see. Another supporter of violence under the guise of anti-Israel activism. At least it’s clear now that there’s no pretense of standing for peace, as the support for violence is openly displayed. Noted. Nice victim-blaming btw.",
            "score": 1,
            "created_utc": 1734962200.0
        },
        {
            "author": "QueerEcho",
            "body": "Antideutsche ideology may be questionable, but yes, of course they are victims in this act. It's ridiculous to claim otherwise. \nWho is being helped by this attack? I can't think of anyone.",
            "score": 1,
            "created_utc": 1734962009.0
        },
        {
            "author": "Competitive-Code1455",
            "body": "Well, just spit it out, why do the people in that bar deserve to get stones thrown at them, or the doors glued shut after lighting a fire? Sounds like a bunch of lovely opinions.",
            "score": 11,
            "created_utc": 1734958584.0
        },
        {
            "author": "LOUDPACK_MASTERCHEF",
            "body": "Come on. It's obvious their issue was with calling this an antisemitic attack when the targets were German, not Jewish. You are putting words in their mouth.",
            "score": -3,
            "created_utc": 1734959729.0
        }
    ]
}